{
    "id": "-2FesPR4WEQ",
    "title": "Abs Workout (SORE IN 6 MINUTES!)",
    "description": "Sculpt a ripped six pack here - http://athleanx.com/x/sculpted Subscribe to this channel here - http://bit.ly/2b0coMW If you are the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The Sore in Six Minutes series continues today\nand today we're hitting the abs. you're probably thinking \"Sore abs? I haven't had sore abs in like, shit – never?!\" That's probably because you're not training\nyour abs the same way that you are your other muscle groups. Meaning, you're not applying eccentric overload\nto your ab exercises. We do a lot of short, abbreviated, concentric\nonly reps and we never really focus on that whole other half of the rep. Especially when it comes to ab training. But no more! Today we're going to address that. In the Sore in Six Minutes Ab series you have\nfour exercises that you're going to do. The first three you're going to do for 45\nseconds. The fourth you're going to do for 30 seconds,\nthen you're going to get a 15 second rest. This whole circuit you're going to repeat\ntwice for a total of six minutes. Now let's look at those exercises. First up, as always; we're targeting the bottom\nup. So we're going to get in this drag and thrust\nposition. What you're going to do here I shoot your\nlegs out, and then try to eccentrically control, and lower them slowly toward the ground. When you get down, pull your legs in, and\nthen shoot them out again, and lower down. You continue to do this for 45 seconds. If you're more of a beginner you don't have\nto shoot them out at this angle here. The lower you are to the ground when you do\nthat, the harder the exercise is. So you might want to shoot them up, almost\nto a vertical here, and then try to lower them down from there. Next up, after 45 seconds of that, now we're\ngoing to try to hit the obliques. You're going to try to hit the rotational\ncomponent of ab training. We do that with a thread the needle. So for here, you get on your side, get into\na side plank, and try to resist as you reach under as far as you possibly can without allowing\nyourself to over rotate, or even just fall down to the ground. From there you're going to come back out of\nthat, come up to the top, and then repeat and go all the way through. When we do this exercise you're going to work\nall the way through on one side, and then the next time through we're going to come\nwork all the way through on the other side. So if you work the left side on the first\nround through, you'll work the right side on the second round through. From here we move into our top down eccentric\noverload. You get in position here on a bench. You can anchor your feet if it makes it a\nlittle bit easier for you. Now what you do is you take a plate. It could be, again, beginners, you can start\nwith a 5lb plate if you have to. You don't have to use a 45lb plate. But you're going to get into position here,\nraise the plate up, overhead, and then allow yourself to start lowering backward. Allow your torso to now start becoming subject\nto the force of gravity, and making it that much more difficult for your abs to hold. When you get down to about 45 degrees from\nhere, pull the plate down to your chest, sit back all the way, and then start over again. Raise the plate up. Continue to repeat this for 45 seconds. We're almost done now. We've got one more exercise. Here you're going to get down to the ground\n– this is the fourth exercise, this is the one you do for 30 seconds. It's a cliff hanger mountain climber. Getting in this cliff hanger position alone\nis a challenge because you have more of a resistance to extension here. Your body wants to fold up into extension,\nand you have to hold on for dear life. So we have this eccentric overload, now we\nadd some movement from the lower body, not to mention a little bit of conditioning work,\nand it becomes a hell of a challenge. Do that, you've earned 15 seconds of rest. I know, doesn’t sound like a lot. But this is not Sore in Six Minutes for no\nreason. It's Sore in Six Minutes because this is damn\nhard. Get back in and go for round two. I'm going to show you what it looks like here,\nnow, in action. So there you have it, guys. Sore in Six Minutes in the books. If you haven't seen all the other ones that\nwe've done so far in this series make sure you check them out in our channel. All of them. We've covered back, we've covered triceps,\nwe've covered biceps, and we've covered legs. Everything is there. However, it's not a good idea to think that\nyou're going to put all these in together, into one workout. That is not what these are designed for. These are really, really intense. These are designed to spark, and more so prove\nto yourself that yes, you can make any muscle sore if you train it the right way. If you're looking for a program that lays\nit all out for you, manipulates the volumes as you should follow them, make sure that\nyou're not overtraining, but at the same time make sure you're training hard enough; head\nto ATHLEANX.com and get our ATHLEANX training system. Again, let me know what other things you want\nme to cover. Maybe not in this series, but another series\nas well. I'll do my best to do that for you in the\ndays and weeks ahead. All right, guys. See you soon!"
}