{
    "id": "-5T82eXSYvY",
    "title": "The BEST Triceps Supersets (SLEEVE BUSTERS!)",
    "description": "Not all triceps exercises are created equal. In this video, I'm going to show you the best triceps supersets and why I chose the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to talk to you about how to pick\nsupersets for triceps that are going to be maximally effective. There are a lot of different tricep exercises\nthat you can use but doing the wrong ones won’t provide the effect that I’m trying\nto convey to you here, today. That is, the exercises you choose matter. They matter a lot. That’s because if you look at the anatomy\nof the triceps you have three heads here. You have the lateral head, the medial head,\nand then the longhead, which is the big, beefy area back here on the inside of your arm. Now, the difference in the three heads is\nthat the two – medial and lateral heads – originate on the upper arm and they cross\nthe elbow. So, their only function is to straighten the\nelbow out. Whereas the longhead doesn’t just cross\nhere in the elbow, it also crosses the shoulder to attach to the scapula. What that means is, you can influence that\nlonghead, depending on the position of the arm. Whereas the other ones only matter what’s\nhappening here at the elbow. Whether it’s flexed or extended. We can take advantage of that. We know when we’re picking straight set\nexercises for the development of the triceps we can rely on those that hit more of the\nlateral, and medial heads. Like, a close grip bench-press, or like a\ntricep pushdown because our only focus is to have to get those elbows straightened out,\nand that’s the end of it for full range of motion. But when we talk about the longhead we have\na lot of exercises that will do one of two things. One: either it will put our arm up over our\nbody, which will now put that longhead on stretch, or we know that in its complete,\ncontracted state it’s going to be tucked into your side, and back here behind the body. We can choose exercises that do that. So, if you want to get the best exercises\nfor your triceps, in terms of super setting them, you want to take two longhead exercises. One that puts it on stretch, and one that\nputs it at peak contracted position, and pair those up together. Now let’s take a look at some of them. The first one here is an incline dumbbell\nextension. With the incline extension here, we’re actually\ngetting a little bit of an additional stretch because the bench is on that incline angle. So, our arms can get a little further back\nbehind our body. You can see here, right in that position,\nthat sweet spot that we need to be in to put that longhead on stretch. We want to focus here. Now, you’re going to go through a complete\nrange of motion on this exercise. However, if you’re going to cut it short\na little bit, what people tend to do is, they’ll cut the stretch, and they’ll go more through\nthe contracted position. Here, I would recommend if you’re going\nto do anything, focus more on the stretch because that’s what we’re trying to take\nadvantage of here in this exercise. We immediately go, when we drop it down into\nthe exercise that I always say we need to bring back; it’s the kickback. The kickback is one of those rare exercises\nthat gives us the chance to actually put that longhead in its fully contracted position\nwith our arm tucked really close to our body, and back behind our body to extension. You can feel the contraction here. I like the fact that all we need to do is\ndo one, simple dumbbell switch. The weight that we used before, we just drop\nit in half, and we can face ourselves down on the bench, and go right into this without\nhaving to rest. The second one is now one we can do on the\npushdown machine. Again, very little rest in between because\nwe don’t have to do much to transition between exercises. Which is another benefit of selecting the\nright exercises for a superset. Here we have a drop push away to start it\nall off. It’s not just concentrating on getting the\nrope away from our body. Again, we’re trying to take advantage of\nthe fact that if I just let my upper arms drift on every rep just a little bit more\nback, behind my body, I can get a better stretch on the longhead of the triceps with every,\nsingle rep. We’ll immediately turn around, change, and\nalter the stack of the weight – whichever way you have to – and perform what I’ve\nnow covered many times on this channel before; the rocking pushdown. The advantage to the rocking pushdown is,\nwe can take advantage of the strength curve on a push down, and make sure that we’re\napplying peak tension to the triceps both in the beginning of the exercise, and also\nat the end. That’s one of the limitations on the exercise\nif you don’t perform it in this way. By getting in nice and close I can have the\ncable perpendicular to my forearms. That applies peak force to my triceps in the\nbeginning range of motion, but by then rocking backward I can get that force to be applied\nstill to the triceps in that peak contracted state. More importantly, look what’s going on. I can get those arms back behind my body. So, once again tucked, and once again into\nextension back, behind the body. Meaning, the longhead gets that peak contraction,\nonce again in this exercise. By pairing these two up and having minimal\ntransition time between them I’ve got another winner, in terms of supersets. Finally, if you’re looking for a bodyweight\noption here all you need is a bench. What we can do here is start with this bodyweight\ntricep extension. Again, look what’s going on here. By getting in this position here, as soon\nas my arms and elbows get up in front of my body, and over my head, we’re putting that\ntricep on stretch. All you have to do to reinforce that is, if\nI were to ask you to stretch your tricep, most of you instinctively go like this, and\ngrab, and hold on, and pull. We know that we’ve got to get that arm up,\nand away. That’s what we’re doing here with the\nbodyweight tricep extension, but all we have to do to finish this off is get into it’s\ncompletely contracted position and turn around and do a bench dip. Now, a few things to note here, guys, I’ve\ncovered this before on this channel…to minimize the impact this might have in a negative way\non your shoulders, get your hands to face out rather than forward. Then when you go down, make sure you’re\nsticking your chest out, and keeping your shoulders back. You don’t want your shoulders rounded out,\nforward, which could put a lot of stress on the inside of your shoulder joint. Keep them rolled back. You can see perfect position here for having\nour arm back in extension behind our body. Then when we go down and fully contract our\ntriceps here, we get that really nice, solid contraction. So, it’s another perfect combination with\nan easy transition time, nice and quick, and efficient utilization of the equipment with\na single bench, and your own bodyweight. Now let’s say you’re looking for that\none combo, that bonus combo because you’re very, very short on time, and you want to\nhit these things hard. We have one combo here. It’s probably the ultimate tricep superset. We’re going to take that longhead though\na stretch position and a contracted position on the same exercise and do it twice in back\nto back exercises. We can do that with this kneeling tricep pushdown. When we get down to the ground by virtue of\nbeing lower, that means we can allow our arms to get higher in the starting position. Immediately you should be able to see that\nthose triceps – that longhead specifically – are now put on stretch. With every, single rep when we return to this\nposition, we’re allowing ourselves to get that stretch, which we don’t do when we’re\njust doing a static, regular tricep pushdown. But when we come down and come out of that\nkneel and push down, we can now get those arms back toward the sides of our body, and\nif we can, even a little bit behind the body to now take that into the fully contracted\nposition. The one thing you want to be careful of here\nis that you’re actually initiating all this movement with the extension of the elbow,\nand not just pulling down with your lats, allowing that to take over. If you just have that focus on the triceps\ndoing the extension, you’ll be able to eliminate that common flaw. And you’ll feel the benefits of this exercise\nby being able to take it through both its stretch, and its contracted state. But we’re not done because this is supersets,\nright? So, we now take this and go right over to\na barbell we have setup here to do our barbell tricep rollouts. It’s going to look a little like that bodyweight\ntricep extension that I just showed you, but it’s allowing us to roll the barbell out,\nwhich takes the arms up, and away from the body, putting that longhead on stretch. Again, when we come back we’re going from\nan elbow bent position to now, as we come back, and over the top of it, we have a straight\nelbow – a prerequisite here for training the triceps – and getting the lateral, and\nmedial heads as well. But now because our body is up, and past the\narms, and the elbows are traveling tight, and behind the body we can hit that longhead\nonce again. These two exercises are very rare in the fact\nthat they allow us to take that longhead through its full range of motion, and by virtue of\npairing them back-to-back with each other, we get that ultimate superset. Guys, the point is this: you don’t want\nto overlook the big exercises and their importance when it comes to building the strength, and\nthe mass in the triceps. But when you are looking at the complete development\nof the triceps you have to appreciate the fact that the longhead has two opportunities\nto hit it and hit it in much different ways. One: in a stretch position up, over your head. And two: down at your sides. So, for me, when we’re looking for pairing\ntogether supersets, those are the ones you want to hit back-to-back to hit both functions\nbecause you’re going to have to do them with different exercises. One final point. You might say to yourself “Well, I’ve\ndone exercises where I’ve gone from a close grip bench-press into a tricep pushup and\nI’ve felt that they’re really, really effective.” But what that is to me is a drop set because\nyou’re doing the same action. You’re working the same mid-range of the\ntricep, neither taking your arms up here, or back behind the body. So, it’s more of a mid-range exercise. They’re both capable of building, but again,\nit becomes more of a mechanical drop set. You burn out on the tricep close grip bench-press,\nso you go to the floor, and you continue that same range of motion, but with lighter weight\nbecause you’re using your bodyweight instead of the barbell. And it acts more to continue the set. Not as a superset with two different exercises. I hope you guys found this video helpful. Again, start incorporating some of these in\nthis way and I promise you, you’re going to see better results from your tricep training. If you’re looking for more step-by-step\nplans on how to put the science into what you’d do because it matters, guys. It’s not just about the exercise selection. It’s about the sequencing of how you do\nthese things as you just saw. We put it all together for you in our ATHLEANX\ntraining programs, over at ATHLEANX.com. In the meantime, if you’ve found this video\nhelpful leave your comments and thumbs up below. Let me know what else I can cover for you\nin the days and weeks ahead and I’ll do that for you. All right, guys. See you soon."
}