{
    "id": "-hYld_0TT_4",
    "title": "How to Get Big and Strong (JUST DO THIS!)",
    "description": "If you want to get big and strong you must do one thing in your workouts. You have to remember to make progressive overload the ...",
    "transcript": "What's up, guys? Jeff Cavaliere. Athleanx.com. \nSo you want to get bigger and stronger. It's   actually really, really simple. There's only \nway to do it, and I suggest you go talk to   this guy. Listen, dude, I got some goodies in here \nright here for you. This is what I use. I got some   farm school grade HDH low dose. And dude, best of \nall, low grade beaver tranquilizer. You want any?   I'm good, man. What do you mean you're good? I'm \ngood. Bro, these are gains! Do you want gains? You   don't want gains?! This is where your gains are! \nIn this bag! Actually, he might make you think   that that's the only way for you to get bigger \nand stronger. But there's a hell of a lot more   ways to do this, especially if you apply a science \nto what it is that you're doing. And, guys, that's   what I want to make sure I do here for you today. \nBecause it's as simple as two words-- progressive   overload-- but how we define that and the ways \nwe get there is what matters. And a lot of   people will make you believe that the only way to \nprogressively overload and get stronger and bigger   is to just simply add weight to the bar. That is \nnot all the options you have here. I'm going to   show you guys so many more ways to do this that \nwill help you to have a better understanding,   and therefore have a better game plan for getting \nthere faster. All right, so the first thing you   need to do is you need to be willing to define \nyour specific goals. Right, don't just lump them   together-- strength and size-- because we know \nthat they are different. Creating muscle growth   can take us down different paths. We can introduce \nlight weights and do them for much higher reps   and still get muscle growth whereas it wouldn't \nreally affect our strength levels. And likewise,   we can pursue strength, which might limit the \nnumber of progressive overload options we have,   but it doesn't necessarily mean that we're going \nto get size increases, especially if we're past   the stage of newbie gains. So be willing to define \nwhat it is you're trying to chase. And it's okay   if we're trying to chase both. Just understand \nthat there might be different ways to get to   each of them more efficiently. And on that note, \nguys, step two here is to realize that not all   the techniques that I'm going to show you here \nare going to work optimally for every exercise.   And for that reason, I'm going to pit two entirely \ndifferent exercises against each other to showcase   the strengths and weaknesses. We'll take a \nsimple exercise here like the dumbbell curl,   and we'll put it head-to-head up with, let's say, \na heavy compound movement like the dead lift.   And realize that each of those is going to \nprovide us with a lot of similarities in how   we can create progressive overload, but \nalso some important unique differences.   All right, so with lots to cover here, guys, let's \nget started right off with the most obvious way to   create progressive overload, and that is simply \nadding more weight to the exercise that you're   performing. So if it's the curl, increasing the \nweight of the dumbbells that you're curling is   going to increase the strength of your biceps on \nthat exercise. Ad we know, again, that it doesn't   just apply to this variation of the curl, a lot \nof times strength is generalized. It will occur   through other variations. Even if we broke \nout a bar bell we would see some increases   in strength that carry over. But the principle \nitself also applies here to our compound lift.   Right, simply adding more weight to the end of \nthis bar bell, and performing a dead lift is   going to increase my strength. As I am able to \ndo heavier and heavier weights, my strength is   increasing. It's important to note here, guys, \nthat it's not just relative to your one-rep max.   Matter of fact, a lot of guys won't even ever \ntouch their one-rep max unless they're competing.   It can apply to a three-rep, a four-rep, \na five-rep, even higher rep levels.   As you're able to do more weight at those levels \nyou are getting stronger. The important point   is that you're progressively adding more \nweight to the bar at any given rep range,   therefore increasing your strength. All right, so \nthe next one here is actually a bit controversial   because I feel like people throw this word \naround as if it's the holy grail of training,   and that's volume. Simply increasing volume \ndoesn't necessarily need progressive overload.   Because I could just increase a bunch of junk \nvolume, low effort, low intensity volume and not   necessarily see any increase in gains in strength \nor muscle mass. That being said, if we're going to   take an example like this where we have five sets \nof three done with a sufficient intensity of 85%,   you would see that I will have lifted a certain \namount of weight by the time that workout is over.   And if instead we increased the number of sets we \ndid with the same exercise, and the same weight,   at the same intensity level, here we look at it \nincrease in the number of pounds that we lift by   the time the workout's over. That is a form of \nprogressive overload. But again, it's dependent   upon the intensity at which we're training. With \nthat being said, guys, I got more to say on that   in point number three. And that point is in the \nrealm of strength training prescription. When   we're talking about intensity we're talking about \na percentage of the lift that we're performing.   That being said, I also like to make sure \nthat we point out simply effort level. How   hard are you trying? If you're looking to \ncreate a progressive overload, take whatever   effort you provided last time, and do more the \nnext time. In other words, look at this curl.   If you look like this when you're curling, I'm \nsorry, but there is no opportunity here for you   to really push yourself and create any substantial \ngrowth. Certainly not in any significant way when   it comes to progressive overload. What you need \nto do is you need to start pushing more. You need   to start putting more effort to what you do. This \nis an example of what it would look like. There's   more effort being performed here. I think if you \ndid nothing else but simply up the effort level   of the exercises you're performing, you would find \nan amazing opportunity to add both more strength,   because you'd be more focused on the thing \nyou're doing, and more size because you'll   be putting more into what you're doing, and in \nboth cases, see gains. All right, so the next one   here actually doesn't have anything to do with \nthe weight that you're lifting, but more so the   time that you're resting in between sets. You see, \nyour inter-set rest period can actually be a great   opportunity for you to create overload by simply \ndecreasing it. See, if you took protocol one here,   you just did a five by three, at a certain level \nof intensity, that is going to remain consistent   between protocols. And you added four minutes of \nrest between sets. This total workout would take   you 18 and a half minutes. If, on the other hand, \nin protocol two here you decrease that inter-set   rest period by just one minute to three minutes, \nyou see that that total time of the workout would   be just 14 and a half minutes. You save four \nminutes. However, your output was the same.   For you create that same output in a shorter \nperiod of time is going to be a heightened demand   on the muscles that created that output. There is \nmore stress being applied to you and your body,   and therefore a progressive overload, and we \ndidn't even have to touch the weights that were   on the bar. We just had to manipulate how long \nwe were resting in between those sets. All right,   method number five we're creating more \nprogressive overload in your workouts.   It's simply to increase the range in motion of \nthe exercises that you're doing. Now how does that   work? It's not always a given that that's going \nto actually create any increase overload. Why?   If I were to do a tricep kickback, I've talked \nabout it before, bringing your arm up closer to   your chin on a tricep kickback before you kick \nit back is doing nothing to increase the demand   on the triceps. If anything, it's actually just \nincreasing the demand on the biceps. So that means   nothing is actually being achieved here. But \nif the exercise itself is being preserved,   then more range of motion means that the weight \nhas to travel a longer distance, meaning that more   work is done and you're creating an opportunity \nfor overload. If we took the curl for example,   what we would do here is something called a one \nand a half rep curl. So if I take the weight from   point A to point B from the bottom to the top, \ninstead of just stopping there, if I go back   down halfway to point C, and then I come back up \nto the top, every single repetition has now become   one and a half. There is more work being done on \nevery rep than there was in a single up and down.   If we would apply this to a deadlift, the best \nway to do it would be with a deficit deadlift.   Simply standing on top of something to create a \nlonger range in motion for that bar. You can see   here on a standard deadlift that the bar sits \nabout eight and a half inches off the floor.   For me, when I get it to the top, it's traveled a \ntotal of 28 inches. That gives us a displacement   of that bar. If I simply stand on top of a \ntwo-inch plate, and perform the same lift,   that displacement has increased. Right, I have to \novercome the additional two inches. What that does   is I've had to move this bar an additional \n10% or more to perform the same exercise.   That is a form of increased overload. Even though \nthe weights stay the same, the travel was longer,   the work perform was more, that's a way that you \ncan actually progressively overload this exercise,   again, without having to change the weight at \nall. All right, with method number six we actually   now can impact the range of motion without \nchanging or adding any range in motion at all.   All we have to do is increase the effectiveness \nof the range in motion we're training in.   And that's where accommodating resistance and \nstrength curves matters. So if you look at this   dumbbell curl, we realize that the dumbbell \nitself provides a level of resistance that's   toughest in the middle of the exercise. Whereas \nif we use the band we know that the bands get   most difficult at the top of the exercise. Well, \nif we actually combine the two like you see here,   we're actually now increasing the effectiveness \nthroughout more of the range of motion. Right,   we're loading it in the middle, and still loading \nit at the end because we're overlapping the two.   That is going to create an opportunity here for \nprogressive overload. We can also do the same   thing here with a deadlift. If I took chains and I \nadded them to the end of the bar, we're not having   to lift the weight of the chains until we get \ntowards the top. As the deadlift gets easier,   the amount of the weight of chains becomes \nmore of a factor. As they become unraveled   and hang more we have more weight of the chains \nto lift, that is helping to, again, build a   complimentary strength curve. Use accommodating \nresistance to take the same exercise with   additional implement incorporated into it and make \nit more difficult with more progressive overload.   Method number seven has to do with the pace \nat which you perform your lift. Pacing can   be something incredibly effective for creating \noverload. Look, if I told you to do an air squat,   you'd probably say, That's not really hard at all. \nBut if I told you to do a wall sit and stay there,   how long could you actually sit there? It's going \nto become more difficult because you're accruing   time under tension. Well, I can incorporate a \npause into any lift I do, but we can apply it   to the two that we're focusing on in this video. \nAnd that is firstly with a dumbbell curl. If I   simply paused in the middle, the hardest portion \nof the range of motion, we can make this curl more   difficult. Simply bring it up, pause, then come \nto the top, come all the way down, and repeat.   That is going to increase the time that we are \nfeeling that tension on every single repetition,   make it more difficult, and create more overload \nthan had we just done it in a standard up-down   fashion. With a deadlift we have the same \nopportunity here. We could do a pause deadlift.   You rip that thing off the floor, but you stop \nbelow knee level, and you hold the bar to be   able to reinitiate without momentum-- we're going \nto get into that next-- and pull that bar all the   way up to the top. Again, more overload than \nhad you just ripped the bar from the floor   without stopping. So I mentioned momentum, let's \ntalk about it with our eighth technique here,   and that is we want to reduce the momentum in \nthe lift. We can create progressive overload   if we take out the urge to let momentum \ntake over. If I took that dumbbell curl,   and instead of doing it one arm at a time where \nI have the benefits of getting into a rhythm and   generating some good momentum as I lean into that \nworking arm, we could do them two arms at a time.   This actually eliminates a lot of that momentum, \nforces us to move more weight and control more   of that weight with our core, which makes this a \nmore difficult exercise. If you haven't tried it,   just try it, and you'll feel that right away. We \ncan apply the same thing here to the deadlift as   well. I'm sure you've seen people do touch \nand go deadlifts, which will look this,   or a regular deadlift. Now, the touch and go \ndeadlift is not something that should be avoided   altogether. It depends on what you're training \nfor. If you're looking for more of a metabolic   effect from the deadlift, you can use a touch \nand go form. If you're looking to create overall   strength from the exercise, then you're going \nto want to stop on every single repetition.   Pull from the floor from a dead stop, hence \nwhere the name comes from. Either way,   if you were used to doing touch and go deadlifts, \nand you switch to a regular traditional deadlift,   you are going to have effectively an \nincreased overload. So there you have it,   guys. Getting bigger and stronger can actually be \nboiled down to two words, progressive overload,   and it also relies, again, on the goal that you \nhave set for your own training. It's possible to   do both, but it's always more easily achieved if \nyou have a game plan for getting there. And when   you realized it's not just about adding weight to \nthe bar, there's a lot of other things we can do   to speed that up and give us more options in \nour training to actually make it more fun.   If you're looking for ways to train, guys, and do \nit a step-by-step way, all of our programs provide   that over at Athleanx.com. If you found the \nvideo helpful, make sure you leave your comments   and thumbs up below. Let me know what else you \nwant me to cover. I'll do my best to do that for   you. And if you haven't done so, guys, please \nclick subscribe and turn on your notifications   so you never miss a new video when we put \none out. All right, guys, see you soon."
}