{
    "id": "-T64FLsJnAU",
    "title": "Stop Doing 100 Pushups a Day - I’m Begging You!!",
    "description": "There are lots of 100 Pushups a Day Workouts available, but should you be doing them. That is the question that gets answered in ...",
    "transcript": "What s up guys, Jeff Cavaliere, athlenex.com. \nSo 100 pushups a day, maybe you've been enticed   by the minimalistic, simplified approach to just \ngetting down on the floor and banging out a single   exercise for 100 repetitions every single day. \nMaybe you've been enticed by the results that   people have talked about getting in as little as \n30 days doing just this single exercise? Well,   guess what, guys, I've got a problem with this. \nBut more importantly, I've got a better solution   for you. You see, today I'm going to show you \na better thing that you can do than 100 pushups   a day. Now I get it, you might be thinking that \nJeff doesn't like the pushup. I actually love the   push up, I put it in my most recent video for the \ntwelve exercises that everyone should be doing.   My issue with the pushups is that when \nyou can do 30, 40 or 50 of them in a set   that you're not choosing a hard enough variation \nof the pushup in order to keep the gains coming,   you're going to want to try to do something with \nthat to something more difficult. We'll get to   that in a second. But when we're talking \nabout this type of approach, we're really   talking about a volume approach accruing a volume \nover the course of a week that's going to add up   over the course of multiple weeks that's going \nto take you to a new level of development.\n  So I understand that we're going \nto approach this a different way,   but I still have a better way to do this. What \nI want you to do is think of it differently.   Instead of thinking of it as doing a hundred \nreps of a pushup over the course of a day,   think of it is doing five sets of pushups to \nyour ability level. What that means is, five   sets taking five reps short of failure. You see, \nwhen you start to do a lot of volume like this,   you have to also be careful that \nyou're not introducing some other   side effects the unwanted side effects, maybe some \nirritation and inflammation in your shoulders or   your elbows or your wrists. So what we have to \ndo is stop a bit short again. Five sets, five   reps short of failure. And it all starts with what \nthat looks like because some people actually just   don't have a real appreciation for what it looks \nlike to be stopping five reps short of failure. So   here I'm demonstrating a set of pushups and you \ncan see that I start to get fatigued and we all   know that common burn that we start to feel, \nthroughout our arms up to our chest and we start   to want to stop the exercise. But I can guarantee \nyou the exercise is simple enough that you can   actually crank out a lot more than you might be \nthinking you could at this point in the game.\n  So here I'm continuing to grind out some reps. But \nthis right here is about five reps short for me.   This would be about three reps short for \nme if I had continued a little bit further.   And this right here is taking the set to absolute \nfailure where I can really not even get myself   up off the floor at the end. So you need to make \nsure that you're stopping at that first point here   to really feel as if you're leaving some of \nthe tank. Then you could do this one of two   ways you can either do all of your pushups in \none session or you can break them up over the   course of the day and there's one plus and minus \nto each approach. If I were to break these up over   the course of the day, I better have pretty good \ndiscipline to be able to get back down there five   separate times. That being said, I'm going \nto likely have the benefit of having fresher   pushups every time I do them and likely going to \nbe able to produce more pushups at every single   given attempt. So over the course of the week, my \nvolume is going to be higher and again, it's going   to be more productive volume because they're going \nto be closer to that point of fatigue for me,   but of course, not reaching full fatigue.\nBut it doesn't stop there because I always,   as a physical therapist, have that eye towards \nthe other side of it, right? The repercussions.   We can avoid those by simply sticking to 100 \nof something else. You see, you can do 100,   but I want you doing 100 of these. This is a \nSuperman Press Out easily done after every single   one of the five sessions that you're going to do \nin the day 20 repetitions. That's going to add up   to one hundred total reps. And what this exercise \ndoes here is it puts you in the same position you   are doing your pushups, so you don't have to \nreally worry about changing positions at all.   And what it does is it works all those oftentimes \noverlooked muscles of the back. Look, even the   most ardent gym goer will train their lats and \nmaybe their traps, but they're not really focusing   enough on the rhomboids or, more importantly, \ntheir rotator cuff. And what that does is it leads   to the postural imbalances that you oftentimes \nsee from those that adopt these 100 pushups a   day routines. We're not going to let that happen. \nSo with 20 repetitions done immediately following   the single session of pushups that you do or \nevery single set within that session that you do,   we're going to do our part to counteract \nthose imbalances before they ever start.\n  So again, how is this so much \nbetter than simply doing 100 reps   seven times a week? Well, guys, this is the \nproblem. If you look at the number alone,   you might be deceived as to the effectiveness of \nthat simplified 100 a day approach. Number one,   it's an arbitrary number. It's not going to match \nthe ability levels of maybe more than 3% of the   people that are watching this video, some being \nable to do far less than that and some being able   to do far more. And in the case of the people that \ncould do far more, let's say you're able to do 300   reps of a push up in a given workout session. \nLet's say you're following a push/pull legs   workout and you're push day twice a week, you do \n300 repetitions. That's 600 accrued pushups over   the course of the week. If you did 100 a day here, \nthose that advocate for this approach might say,   Well, that's 700 that's an increase in volume. \nBut again, at such a sub maximal level,   at one third of your ability to perform \nthis exercise in a given session,   you're not going to accrue a lot of effective \nvolume. You just accrued more volume. With this   approach here, you're going to be able to more \nclosely match your ability levels, allowing you   to get to the point where you want to be rather \nthan being lumped in with everybody else. \n  Now if you have an infatuation with 100 pushups, \nwhat I would suggest is you do the following find   a more difficult version of the pushup one that \nallows you to do maybe 20 max in a single session.   If you're looking for more challenging variations, \nmake sure you check out this video here. While I   go through 33 different variations, one is sure \nto match your ability level and put you in that   sweet spot. The bottom line, guys, because of \nits simplified approach and the fact that you   can do the exercise anywhere, 100 pushups a day is \ndefinitely an intriguing option for many. However,   this five-set approach that more closely matches \nyour ability level is one that I highly recommend.   If you're looking for a step-by-step plan, \nguys, when we put the science back in strength,   you can find them all over at athlenex.com. \nIf you found the video helpful, leave your   comments and thumbs up below. Let me know how you \ndo if you decide to adopt one of these routines.   In the meantime, guys, if you haven't done so, \nclick subscribe and turn on your notifications   so you never miss a new video when we put \none out. All right guys see you soon."
}