{
    "id": "-wyTit9bKEQ",
    "title": "Back Exercise to build a V TAPER &quot;Bulletproof&quot; Back!",
    "description": "Get More Back Exercises Here: http://athleanx.com/x/bulletproofback Back exercise workouts are hit and miss in my opinion.",
    "transcript": "What’s up guys. Jeff Cavaliere, athleanx.com. Part 4 here of the bulletproof series, a part\nthat you guys have been requesting, and i really appreciate the comments guys, please\nleave your comments bellow and actually I’ll put a question to you today:\nI wanna know; on one of the statistics that I hear is that people have up to 85-90% of\nthe people have back pain at some point in their life. It’s a very common thing, it’s something\nthat you guys probably have dealt with, but I’m gonna show you how to try and attack\nit and cut it off of the past. But tell me, have you had a back problem? Let’s do our own little pole here and see\nwhat the statistics are. Who’s had a back problem, how long has I\nbothering you, and it will be interesting to know. But we’re gonna knock it out right now,\nbulletproof low back with two bands, alright? All we gonna do is … again I was talking\nabout something called muscles integration. You wanna be able to tie in areas in muscles\nthat will work together naturally and stop isolating them so much. If they wanna work together let them and you\nactually develop stronger muscles, because 1+1=10 in this case, and not just 2. So we’ve got two bands, if I’ll allow\nmyself to lean forward it’s just gonna pull me like that, alright? Now, the first thing to notice is what the\nposition of my low back is. I would say it’s kind of a shitty position\nof my lower back right now to be honest with you, because this is not good, this is gonna\ncause an injury . What you wanna do is get your but out, and sometimes the hand strings\nwon’t allow you to have that kind of flexibility. If that’s your problem you gotta work on\nyour hand strings guys, you gotta stretch them out, so get yourselves, you can get your\nback in that position and get that slight arching a little back. Even if you just doing bend over rose at this\npoint, you have to establish that position. So, when I’m here I wanna roll back and\nthen from here … so I’ve got the upper portion of my back working…. Now I wanna do a low back extension. I’m not pulling anymore; I’m using all\nmy low back to do it. So….here…I’m not gonna pull anymore,\nI’m locked in….now it’s a low back extension…straighten out. Alright, so let it come forward, straight\nthrough….stretch …here ….and extent. Enable to get a little of a rhythm. [Exercises]\nYou can see that low back doing a lot of the work to get me to the top .\n[Exercises] But the key here is integration guys. You gotta integrate more than one muscle group\nif there is more just one muscle group that does the action. So, your low back works nicely with your mid\nback, works nicely with the upper back, get them all working together and your body will\nhave some support . Everybody needs friends; the low back needs\nfriends too. It’s got them in the upper back if you just\nallow it to work for you. Guys again, leave your comments .. interested\nto know … let’s go for the team Athlean community here, what’s the back pain incidents,\nany recups we had. We’re gonna try to get those numbers way\ndown , now we’ve got something like this under our bell. Next week, back again. WE might take a quick break from the bulletproof\nseries, but you’re gonna like what we’ll do if I decide to do that. But keep your requests coming, we’re gonna\ndo more and more like this series to help you guys out. We’re gonna keep them rolling! If you haven’t already guys, grab the AtheanX\ntraining system. It’s all about building a bulletproof body,\nit’s about getting yourself to be more and more resilient, resistant to injuries, but\nat the same time build athlean muscles, get in ripped being the best that you can be. I’ll see you guys on athleax.com, and I’ll\nsee you guys again next week for another video."
}