{
    "id": "02W0832OQos",
    "title": "Which Press is Best for Bigger Shoulders? (IRON FACE/OFF)",
    "description": "If you want to get big shoulders you have likely used shoulder presses as a staple exercise in your workout. That said, there are ...",
    "transcript": "If you can only choose one – those are the\nrules of the Iron Face/Off – today, we're pitting three shoulder exercises against each\nother. We have the seated dumbbell press, the standing\ndumbbell press, and the standing barbell press. Which is the best for you? Today, we're going to determine that in another\nIron Face/Off. What's up, guys? Jeff Cavaliere, ATHLEANX.com. It's another Iron Face/Off. We're talking about the shoulders. You don’t want to wind up in this guy's\nposition because this guy isn't lifting any weights anymore, and we're going to pit three\nshoulder exercises against each other because it matters. They all might seem like presses – the seated\ndumbbell press, the standing dumbbell press, and the standing barbell press – but doing\nthe wrong ones can actually wind up costing you your shoulders in the long run. I'm big on keeping your shoulders healthy\nbecause you kind of need them. The first thing we aren't going to cover,\nthat's not in here, is behind the neck press. That's because we've talked about it in other\nvideo before. The scapular plane here, the angle of the\njoint that the shoulder, the upper arm bone here, rests in. The glenoid is actually angled forward at\nabout 45 degrees here. So you don’t want to press with your arm\nway out to the side so you can get your arm behind your head. That's actually fighting your anatomy. So we've wiped that one right out of consideration. But we do start over here with the seated\ndumbbell press. What we want to know is \"Is this a good option?\" All of these are probably options that you've\nused. I've used all of these options, but I've got\nto be very specific here. I have to get down to the one recommendation;\nthe one winner. I can do that for you. We start here, in reverse order. We're going to eliminate this one. We eliminated it for a couple of key reasons. When we do the press a lot of people will\nsay they like it because they're more specifically targeting their shoulder because they're taking\ntheir legs out of the equation. They're pushing, mostly, right here, from\nthe shoulders, and directing the work there. I'm going to argue that's actually not happening\nbecause what you're going to do, as you start to fatigue especially, is dig in with your\nfeet. You're going to start pushing because we need\nto have that counterforce. We've got to drive up, then we have to push\ndown. That's just how the muscles work. Our body wants to push away as we drive up. So as we fatigue we start to do that. The next thing we do is try to start to recruit\nsome help. The natural way the body will recruit help\nis leaning back a bit. Meaning, we're going to arch a little bit,\nlean back to create this slight angle, a slight incline, to do what? Recruit the upper chest. So now we not only have the upper delts working,\nbut the upper chest is now helping – as you can see – to do this press. But when I do this, and I dig my head back,\ninto the bench I wind up with two things. Number one: neck problems. You've probably felt it before if you've ever\npushed too hard on a press. More importantly, I'm digging my upper back,\nand scapula into the bench, which interrupts the normal upward rotation that's necessary\nto press upward, in this normal pattern here. We call it the scapula humeral rhythm. Meaning, you need to have your scapula and\nyou humerus move in sync with each other in combination of a 2/3 – 1/3 contribution\nto get smoothly up, overhead. But if I'm pushing into the bench, and interrupting\nthe smoothness of the rotation of the scapula up while I raise my arm up, then I've screwed\nup the whole press here. That's not what we want. We've got to X that one out. But now we can come up to standing dumbbell\npress, and a standing barbell press. Now, when we do the standing dumbbell press,\na couple of things that we've just done are, we're ground based – our feet are on the\nground, which is athletic, which I like. And the second thing we've done is demanded\na stronger core. I have to be strong here to be able to stabilize,\nand press up. We also know that it's sometimes easier – always\neasier – to press one arm up at a time, versus two for that very reason. My core has to be able to say \"Okay, you're\nstable. Now press the combined weight here\", or \"You're\nstable, now press half of that weight.\" It's always going to be easier to do half. But when we press them together – because\nwe have to compare it to a barbell press – we have to have that strong core. When we do, we can do some more things here. The dumbbells can actually move up in an arc. So we can hit the shoulders in more of an\narc, and get more of a contraction here at the top – you can feel it instantly – than\nI could if I had a barbell, since the barbell can't bend. We have that. We also have the opportunity, if needed, to\nget a little assistance from our legs as we fatigue, to turn this into more of a bit of\nan assisted push press toward the end. So when we reach failure here, we can keep\nit going a few extra reps with that extra push. We've got that for consideration. But we come over here to the barbell press. If you're going to do the barbell press how\nsome people do the barbell press, then it instantly becomes the second loser in line\nhere, behind the seated dumbbell press. That is, when people go wide. They go out here. Even if they're going with their ring fingers\non the smooth portion of the bar they come up – look at what that does in terms of\nthe position of your elbows. The position of your elbows is then starting\nto push them back to the side. Again, like this. Even if you're leaning back you had that path\nupward where the elbows are starting to creep toward that 'behind the neck' position. The ideal position, as the dumbbells will\nallow you to, is to have your elbows in front of your body, more in line with that scapular\nplane that Raymond demonstrated at the beginning of this video. But we can change that. We can do the barbell press with a narrower\ngrip. So right here, on the edge of the knurling. Right where it starts, put your fingers there. That's going to put you at about shoulder\nwidth apart from here. Now, look at the angle of your elbows in front\nof your body. Much safer. Arms are in the scapular plane. When we go to push from here, you get that\nextra lat activation down, and back behind you which helps you to stabilize beyond just\nyour core. So there's an advantage there. I press up, and come down again. Follow that same path. Up, and down. Up, and down. Now, they're kind of similar when done that\nway, in regards to the position of the elbow, but we have to choose a winner. If I had to pick one, because of the extra\nversatility of the path of those dumbbells, because I can arc them, because they can be\nindependent of each other, because I can't hide an imbalance right side, versus left\nside that I can't with the barbell; I'm going to have to – if I had to – I'm going to\nhave to pick the standing dumbbell press. Guys, the Iron Face/Off, we try to cover all\nthe reasons why. We cover the pros and the cons, but to try\nto help you come up with the best exercise because I know you're going to be tempted\nto use all of these in different variations. We use them all, but we program them specifically\nfor specific reasons. If you're looking for a program that lays\nit all out, step by step; head to ATHLEANX.com right now and get our ATHLEANX training program. In the meantime, if you like the Iron Face/Offs,\nif you want to see more exercises compete head to head, let me know what you want me\nto cover and I'll do my best to do that for you in the days, and weeks ahead. All right, guys. See you soon."
}