{
    "id": "07AXhucRMbE",
    "title": "Chest “Non Responder” Solution (PECS WON’T GROW!)",
    "description": "Get a bigger chest with one program http://athleanx.com/x/no-more-stubborn-pecs Having chest muscles that don't respond to ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. A chest non-responder. What is that? It's somebody that tends to not get the chest\ndevelopment that they want because they're letting other muscles do the job that the\nchest is trying to do in the first place. And when we talk about the chest we're really\ntalking about the delts wanting to take over and do everything for you. Today I'm going to show you the number one\nthing you want to do to try to get those delts to shut the hell up and let the chest do its\njob. Of course, we're breaking out the muscle markers\nto help explain how this all works. So let's draw some muscle marker action here. What we have is the front delt. Okay, the front delt is going to come off\nthe end of our shoulder here and it's going to come down through here, insert in there,\nand it's going to come up and around here, and head down that direction. That's the front delt. Now really close by is the upper chest. Really, the pecs in general are going to suffer\nfrom this. I'm going to show you here today. But the upper chest is the one that fits right\nin there, and that's coming off the clavicle, coming down, and heads down toward the arm\nthat way, and of course, right up underneath here, and heads down toward the arm that way. So what we basically have are these two muscles\nthat are really close in proximity. So what does that mean? It means everything when we're trying to determine\nhow to get the chest to actually respond and get the shoulders to shut up. What we do is we look right here, right off\nthe bat with a bench press. So with the bench we come down into position\nhere, the first thing we want to do is make sure the microphone doesn’t choke me. The second thing we want to do is look at\nthe pressing, how we do it. When we press up the major mistake you're\ngoing to make is allowing the shoulder to become the first line of defense and take\nover. So if the shoulder gets in front of the pec\nitself then it's going to take on the brunt of the press. So what we want to do is make sure that the\ndelt stays behind and the chest leads. We can do that two different ways. One of them is sort of a \"Cam Newton drill\"\nthat I say. You take this, you open your chest up. The Superman. Reveal the \"S\", right? By doing this we're actually taking our shoulders\nand putting them down and back – as you've probably heard many times – is a proper\nposition. It's also lifting the sternum up, but more\nimportantly it's letting the chest lead the way. You see what happened to the delt? It shifted backward and let the blue pec come\nup in front. As opposed to this where now the delt is dominating,\ncoming in front of the pec. You can even see the pec give way and let\nit take over. We don’t want that. So what we do is get up and press here. Let the arms come down, but the chest doesn’t\nsink on the way. The chest stays up, the arms come down, and\nthen when we press we don’t let the shoulder take over. We keep it back as the arms come up. Down, keep it back, as the arms come up. You'll feel, immediately, your chest do a\nhell of a lot more of the work. Now this would work on an incline press as\nwell. But we can do more than that. We can do pushups. If I come over here and I get down on the\nground and do a pushup, I'm actually doing the same thing. We know that we need the chest to be able\nto lead the way and be the first line of defense. Let it do the press when my arms are pressing,\nand don't let the arms start doing this. There is something called a pushup plus which\nwe do want the arms to protract when we're working on our serratus, but that's a different\ndeal. That's not for those that are struggling to\nbuild their chest. So we want to do the same thing. We don’t want the front delt to come in\nfront and then let that all cave in. you can feel this. You can feel the delt take over if it goes\nin front. You'll feel your chest – look – just give\nin and give way. You don’t want that. You want to be able to do this. So in action it's going to look like this. We come down, we're right here, we lower ourselves\ndown to the ground – again, we want to open ourselves up. Boom. Down to the ground, here, come all the way\ndown. As we press up, lead the way with the chest,\nkeep the shoulders back. Down, boom. Here. Now your pushup count is probably going to\ntake a significant hit, but who cares? It's about directing the work where you're\ntrying to get it in the first place. If your delt is dominating it's not going\nto where you want it. Okay? Like that. Now, finally another chest exercise. Nothing changes. Everything's the same. It can carry over to dips. We get up in the dip station here. Again, talking about opening it up. Here, drag, brings your shoulder blades down,\nback, lift your sternum up when we're in this position, grab on here. Now we come up, and again we don’t allow\nthe delts to jump forward and allow the chest to quiet down. Instead, what we do is keep them back, up,\ndive down, and press up with the chest. Combining the fact that I've always told you\nguys \"Don't let your shoulders shrug up either, to take away the work from the chest.\" Keep them down, and depressed. Down, and back to get them to work the most. So something you can take to virtually any\nof the big exercises on your chest. The fact of the matter is, forget this non-responder. What you need to do is you need to figure\nout ways to force it to respond. There's always a way. A lot of times it might take a little bit\nless weight – just a little bit – until you learn the technique and you're able to\nlet the chest start taking over and then start bringing back the weights that you were working\nwith. Either way, these will work or I think you're\ngoing to find them helpful. If you liked this, guys, make sure you leave\na comment and thumbs up below. If you're looking for a program that puts\nthe science back in strength – we draw on ourselves here. We do whatever it takes to help you to understand\nwhat it is we're trying to teach you better. We do that in our ATHLEANX training program. It's over at ATHLEANX.com. Again, tell me what you want to see here and\nI'll do my best to make it for you in a future video. All right, guys. See you soon."
}