{
    "id": "0FIu_06FmsY",
    "title": "BIG Shoulders | LIGHT Dumbbells (6 Minute Workout!)",
    "description": "If you are trying to build big shoulders and have shied away from using light dumbbells, you may want to rethink your shoulder ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. We’re doing the Size in Six Minutes series\nagain. This time we’re hitting the deltoids. What we’re talking about are those shoulders\nthat don’t seem to grow. The irony behind all this “Six Minute Size”\ntechnique is, we’re using very, very light weights. The idea is, you need to be able to activate\nthe muscle if you want it to grow. Guys, we’ve covered this before. We started this entire series with our biceps. If you haven’t seen that video, of course\nyou’ve got to subscribe to the channel, but make sure you also turn on notifications,\nso you don’t miss all the other ones we’re going to start bringing this series. Back to the deltoids. There are some guys that don’t have good\nshoulders. They can’t develop them. Despite all the overhead pressing they’re\nnot responding. Sometimes, guys, that’s a fact of life. We all have our different muscle groups that\ndon’t respond and what happens a lot of times with the big exercises is, we tend to\ndominate with the upper chest and the triceps. For example, on an overhead press and the\ndelts just don’t get that much attention. So, what do we do to address this? How do we get our attention there? I’ll tell you this: with the biceps, it\nwas about being able to contract and feel that squeeze. When it comes to the delts, the biggest secret\nis the speed of movement. Let me show you. I want you to try this and feel this for yourself. We’re going to grab some very light dumbbells. You need to in order to execute what I’m\nshowing you here. You start with the front delt, middle delt,\nand rear delt. You start with the front delts. What you want to do is – people can do front\ndelt raises all day long. Whether they have thumbs up here, or whether\nthey have thumbs parallel to each other and the dumbbells parallel to the ground, it doesn’t\nnecessarily matter. What’s happening most of all is the speed\nof movement. People just move the weights fast. It’s not necessarily that they’re swinging\nthem up, it’s just moving them fast and relying on the momentum of the moving dumbbell. When you want to make it more difficult to\nmove these weights up against gravity. So, what you do is ground yourself and run\na running clock for one minute. This is the first minute of the six-minute\nseries you’re going to do here. As you’re grounding and pushing down, you\nwant to drive the dumbbells up at a slow pace. Like this. Everything is being contracted from the front\ndelt. Straight up, straight down. So, I’m feeling as if I’m pushing everything\ndown, but the dumbbells are coming up. Just like that. When you go slow you realize that it’s the\ndelts that are primarily driving this movement. You want to feel it and concentrate on them\ndoing the work, as I do one side at a time, so you can see it. I’m literaly flexing as hard as I can and\nmaking it do the work on the way up. So right away I feel that. Now, we don’t slow things down when we’re\ntraining athletically. What you want to do is speed things up. As soon as you’re done with a minute of\nthat we come down and do an explosive exercise. Just a push press. I’m not going to grab a super heavy weight,\nbut let’s say, a pair of 45s. I come up here, drive them, and we’ll push\npress. One, two, three, four, five, six, seven. So, I explosively drive the bells up. Rest pause, as many as you can, rest pausing\nfor 30 seconds. 30 second rest. Now, move right into the middle delt. Again, I’m grabbing a light weight. Here, we move slow. I’m going to start with the dumbbells right\nhere. A little bit of a bend in my elbow. The key is, don’t just swing them up and\nmove them at a fast rate because you’re going to shift all that tension away from\nthe middle delt. Instead, drive here, and squeeze them, all\nthe way up with that middle delt, and down. Hand positioning, guys, always have that pinky\nunder the thumb. I lead with the thumb, get into external rotation\nat the top. I can spin around a little bit. You can see, as I come up to the top, by leading\nwith the thumb and letting the pinky trail I’ve got external rotation here on the shoulders. And down. Everything is slow. I’m trying to stay grounded and down, but\nthe arms are raising while everything else is being depressed. Just like that. And down. I’m telling you, I don’t care if you’ve\nnever gotten a pump in your shoulders, if you’ve never known how to activate your\ndelts before. The key is, you’ve probably never slowed\nit down. So, you do that for a minute. Now, fatigue is setting in. I come back down again. I grab a slightly lighter pair of dumbbells\nfor my push-press to accommodate for that fatigue, but we’ve got to speed it up. Ass out. One, two, three, four, five, six, seven, eight,\nnine. Keep going all the way through. Hit the front, hit the middle, you’ve got\nto hit the rear. So, for the rear you can go a little bit heavier,\nbelieve it or not. But it’s how you do this. I told you that one of the best ways to hit\nthat rear delt is, you need to get extension of the arm back behind the body. It’s not just raising your arm up by being\nbent over, where it’s just going straight up to the side. You need to get your arm back behind your\nbody. It also helps to be able to externally rotate\nthe shoulder. So, we have – I’ll do one side first,\nand then I’ll grab the other dumbbell. You’re leaning over this way here, and then\nyou’re twisting up. Here, and squeezing up. Now, I’ll give you a secret on the rear\ndelt. The rear delt is maintaining tension in that\npeak position. It’s not just slow, but it’s maintaining\na hold at the top. You’ll feel the building contraction in\nthe rear delt, only after about two or three seconds. I’m holding. So when I get up here I’m going to come\nup here, row, extension, hold. Right about now is when I’m starting to\nfeel it really tense up. And down. Keep them moving. Up, rotate it, go high, squeeze, squeeze,\nsqueeze, and down. Up. And up. So, it’s all that mounting contraction at\nthe top. Of course, one more time, drop it one more\ntime, you speed them up at the very end. Last 30 seconds. And here. One, two, three, four, five, six, seven, eight,\nnine, ten. Rest pause for 30, if need be, or just crank\nthem all out. So, guys, here’s that sequence one more\ntime. Slow on the front delts. While everything is down you’re forcing\nthe arms up only. Do that for one minute. 30 seconds on the push-press. A 30 second rest. Come back here, grab those light dumbbells\nagain. Same thing. Ground yourself. Let the arms come up on their own. Squeeze all from the delt. Let this – this is the delt. Right here, guys. I don’t have a muscle marker on me today. From here to here. Let that squeeze up and drive the motion. After that, lighten the weights a little more. Push-press. Come back one more time a little bit heavier\non those. Focus on that pacing still, but at the top\nhold, hold, hold, hold, hold. Mount that contraction, the intensity of it. If you’ve never felt your delts before,\nthis is what you’re going to do. I promise you guys, it’s this little routine\ndone a few times for mind-muscle activation that’s going to help you be better able\nto recruit your delts. So now when you go back to the big lifts like\nyour overhead press, guess what’s going to happen? You’ll probably start to press more. Why? Because in addition to the upper chest, and\nin addition to the triceps you now have the ability to recruit your shoulders a bit more\neffectively, and that will help you in the overall performance of that lift, too. Guys, I hope you’re finding this series\nhelpful. Every muscle has its own way to activate it\nand get a better control over it. That’s why I want to devote myself to being\nable to do an entire series on this. Again, remember to see them all you’ve got\nto not just be subscribed, but turn on your notifications as well to make sure you never\nmiss a video. If you’re looking for a step by step plan,\nas always, all of our programs are available over at ATHLEANX.com. We put the science behind the strength, much\nlike what we’re trying to do here, because guess what? All these little things matter. Especially when you’re having issues in\nthe first place with building the muscles that you want to. If you’ve found the video helpful leave\nyour comments and thumbs up below. Let me know what else you want me to cover\nand what you want to see next and I’ll do my best to do that for you in the days and\nweeks ahead. See you soon."
}