{
    "id": "1i3bU5zV8sI",
    "title": "8 Best Exercises for the Zombie Apocalypse (BE READY!)",
    "description": "Build a body ready for anything - http://athleanx.com/x/zombie-proof Subscribe to this channel here - http://bit.ly/2b0coMW If the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. It's Halloween and we're talking zombies. Well, kind of. You see, if a zombie apocalypse came would\nyou be able to survive it, or would you wind up looking like him? I'm going to show you today the eight best\nexercises that you need to know, you need to be able to do if you're going to avoid\nthis fate, and instead survive it by training like and athlete. Let's go over them top to bottom. Okay, so first off, if you want to avoid being\nzombie bait you're going to have to learn how to run. There's no way around that, but I don’t\nwant you to just be able to run for long distances. I want you to be able to run with some athleticism\nas well. So we do S-runs. An S-run is exactly what it sounds like. You have to be able to run fast, but at the\nsame time, move your body in space. Be a little bit more athletic. Make an S back and forth as you run. You do these 10 times as fast as you can and\nyou're off and running on this zombie apocalypse workout. Next up, we can't just be able to run, but\nwe have to be able to out-quick the zombies, right? Our feet have to be fast. We have to have agility. We can actually do this in a small area of\nspace with our agility line drill. We're going to go up and back along the same\nline changing the maneuver that we do each time down the path, or each time down the\nline. You can see we'll start off it shuffles down,\nand then it shuffles back in the opposite direction. Then we'll sprint down, and we can backpedal\nback the same line. Of course, we can drop our hips, get low,\nnice and athletic and swivel those suckers so we can do a karaka right, and a karaka\nleft back down. Change up the combination you're doing. Aim for 20 line drills up and down. Again, you're working on some good, quick\nfoot agility work to be able to outrun these guys, and out quick them. Next up, we're all a team here on Team ATHLEAN,\nright? So if you're with your buddy and he falls\ndown, don’t be a selfish bastard. Pick him up and help him. We need to have the ability to do a shoulder\ncarry if we're going to be able to help. So what we do is, we take a heavy dumbbell,\nwe're going to clean it up to our shoulder, and we're going to carry it. You carry it as far as you can. You carry it 30 steps if you have the ability\nto do so. Even if you can't get a large access to space,\nthen just walk in place. Then when you get there drop it down, clean\nit back up to the opposite shoulder, and do it again for 30 steps. Try to do this three, or four rounds without\nhaving to put the dumbbell down, and you'll be prepared to protect your friends against\nbeing eaten alive by those zombies. So you've got to be able to run, and you've\ngot to be able to be a good friend, but you also better be able to jump. You're not just talking about being able to\njump on something, but sometimes you have to be able to jump over something. So do this incredible box jump and over combination. Start by jumping up onto the box, land on\nthe opposite side, turn right around, and then jump over the box. If you're doing this on a bench, obviously,\nit's a lot easier than having to clear a whole box. But whatever it is, find a surface you can\njump on, and then jump over, and you've got yourself a good drill for being able to teach\nyour body the ability to be explosive when you need it the most. Next up, part of being able to stay alive\nis being able to not be heard in the first place. Try to keep yourself under the radar. And I mean literally, \"under the radar\" by\ndoing the creeping lunge I'm showing you here. This variation of a lunge is going to put\nyour legs under more time under tension requiring you to stay low. Try not to elevate your head very much as\nyou perform each alternate step. You see, the idea here is to stay low, stay\nquiet, don’t be heard. If you accomplish that you're well on your\nway to avoiding this fate here in the zombie apocalypse. Okay, let's face it. There's a lot of these suckers running around\nand you may not be able to outrun all of them. So you'd better have some weapons in your\narsenal to be able to deal with them if they're this close from you. The first: you'd better be able to climb. I'm talking about climbing up and over something\nout of sight. We need to be able to do pullups, and not\njust regular pullups, but pullups with any single grip, because you don’t know what\ngrip is going to be awaiting you at the top of that ledge. So I want you to do mixed grip pullup medleys\nhere. So start with both hands overhand and do a\nregular pullup. Switch one hand underhand. Now you've got a mixed grip on one side. Do another pullup. Now switch the other hand underhand. Now you're looking at an underhand. Now a chin-up. Now switch that hand over. Now you're looking at that opposite mixed\ngrip. Continue to rotate through these as many times\nas you can until you reach failure, so you can build up the strength to be able to climb,\nand scale away for whatever is waiting you down below. Oh, shit! Okay, so now they grabbed your leg because\nyou couldn't climb fast enough and they've pulled you down. Now you're down on the ground face to face. What do you do? You'd better start swinging, my friend. You'd better be able to do so with some power. So we have our wood chopper swings. This is a great core exercise – rotational\ncore exercise – for developing the strength from your toes, all the way to your fingertips,\nand being able to be worth a damn when it counts. So start here, rotate to one side explosively. If you anchor this band, or this cable higher\nup you're going to be aiming to not just come across your body, but to come across and down. Thus, the wood chopper. If you don’t have access to that and you\ncan only swing across; hell! Do what you can! Just start working on your ability to develop\npowerful rotational strength. Okay, so the climbing away from them didn't\nwork, you weren't able to swing fast enough, and they injured you. Now you're down on the ground and you've got\none last shot, my friend! You'd better be able to drag your body away\nfrom them, or it's curtains. So what we've got here I sour dead man pushups. With the Deadman pushups you're going to crawl\nyour body away. Every time you crawl those feet will stay\nclose together and not active. They're not part of this drill. You can't push through them anymore. You're going to crawl forward one step at\na time and do a pushup. Crawl another step, do a pushup. Drag your legs all the way behind you and\ntry to keep going as far as you can until you reach failure. If you fail, I don’t have good news for\nyou, but the fact of the matter is you gave it your best try and that's what we're all\nabout here, guys. If you noticed the similarities here, what\nI've got you doing here – all kidding aside, Halloween aside – you're training like and\nathlete. You're using functional skills and getting\nstronger at them. You've got to be able to run. You've got to be able to jump. You've got to have strength. You've got to be able to maneuver out of any\nposition. You've got to be able to move in three dimensions. This is what training like an athlete's all\nabout. Preparing you for anything. Maybe the zombie apocalypse. Who the hell knows?! But we're preparing you for the game of life,\nat the very least. If you're looking for a program that does\nthat, head to ATHLEANX.com right and start training like an athlete. Start seeing the differences and start seeing\nwhat it looks like when you start training like an athlete. All right, guys. I'll be back here again in just a few days. In the meantime, if you liked this video leave\nyour comments and thumbs up below and let me know what else it is that you'd like to\nsee here on this channel, and I'll do my best to cover it in the days and weeks ahead. All right, guys. Don’t let this happen to you. Please come back next week. See ya!"
}