{
    "id": "1iODncOLJnk",
    "title": "PERMANENT Fix for IT Band Pain!!",
    "description": "If you have IT Band Syndrome or pain on the outside of your knee or thigh, then you know how debilitating it can be to your ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to help you get rid of IT band\nproblems and pain forever. Not just for a short period of time. I’m talking about for the rest of your life. It’s possible. If we go at the real root cause of what the\nproblem is. So, I really don’t need an introduction\nto IT band syndrome because if you have it, you know it. You’ve been Googling it; you’ve been finding\nout. It’s when you get that pain on the outside\nof the knee. That can run all the way up the side of your\nleg. I conveniently wear these pants just for this\nvideo. I never wear these pants, ever before. You get a chance to see the IT band in action. Following those stripes. You guys know that was sarcastic, right? The following the stripes here of the knee,\nall the way up to the hip. If you get any kind of pain, especially when\nyou press out there, or when you’re foam rolling – you’re not foam rolling, right? Because for this problem, foam rolling is\nbanned. You’re not allowed to foam roll this because\nall you’re going to do – I made a whole video about this before. You can see some of it here. Foam rolling is just making this worse. You’re enflaming an already enflamed tissue. You’re picking on a tissue that had nothing\nto do with this in the first place. You need to get to the root cause. What I did in that video, if you haven’t\nseen it, I showed you how to attack a muscle called the TFL. Which is right here. You can see this TFL feeds down into that\nIT band. The IT band itself is just a tendinous structure. It’s just being impacted by the muscles\nthat we can have an influence over, that attach into it. And it’s not just the TFL, but this one\nover here, too. That is the glute medias. You can see how they feed into the white portion\nhere – the tendon structure, which is the IT band. We know if we can go after this, we can start\nto relieve some of the tension that’s being placed here, down at the knee, and along the\nwhole band itself. We know if this muscle up here is tight and\npulling, if it’s attached somewhere else, we’re going to get tension down there, too. Up here we’re pulling, and down here where\nit’s attached. So, we can influence that. That whole video is a must watch, if you haven’t\nwatched it, on the right way to change the composition of the muscle that’s up here\nand overactive. But we want to get to the root cause of what’s\nhappening here, to permanently make sure this goes away forever. You have to understand, this other muscle\nis really what’s happening. This is the problem. Both of them feed down, in. One feeds down here vertically, if you follow\nthe fibers. That’s what we always talk about. Then the glute medias is feeding into it this\nway at a different orientation. If you look at the combined effect of these\nmuscles and the tension that they can apply to this common band, we need to have contributions\nfrom both. We need to stop this from being so overactive\nand get this to stop being so underactive because that will guarantee your glute medias\nis incredibly weak. I made a whole video about it being the weakest\nmuscle in every person’s body. I’m going to give you a couple tests in\nthis video to show you that you can determine your own strength there – mostly weakness\n– and then a couple of things to do to really fix it very quickly. For the sake of why we’re doing this, when\nthis is weak and unopposed, you allow this downward force to dominate. So, all this force from this muscle here that\ntightens, is pulling straight up on here, which is going to cause the most pain and\ndiscomfort down here along the whole band. If we can offset some of that by having more\nof this counterbalance from behind, we’re going to disperse those forces, taking all\nthe strain off the IT band itself, and get this thing going forever. I’m going to bring Jesse in at this point\nto test those weak-ass – I guess ‘ass’, really – glute medias of his and show you\nguys how to test yours, and then give you those exact drills, and a couple of maintenance\nstretches to do to make sure it never comes back again. Now we’re- JESSE: Whoa. Aren’t you going to introduce me? JEFF: You need an introduction after all this\ntime? JESSE: I mean, I think it would be nice if\nyou introduced me anytime I come on this whole deal. JEFF: How about, I let you do it when we edit\nthe video? JESSE: All right. That’s fair. JEFF: All right. Can I proceed? JESSE: Please. JEFF: Thanks. All right, guys. Back to what I was saying. Now, with Jesse on the ground here, I want\nto show you a test that you can do for yourself that will likely reveal a humongous weakness\nin this glute medias. This is what’s causing – remember, the\nroot cause of your TFL problems are not anywhere here and down here. They’re way up here in the hip, and on the\nback side because we’re not getting that counterbalance. Here’s what you do. Jesse, lie on your side. So, what I want you guys to do is stack your\nhips. Make sure you’re not rolled back one over\nhere, or one too far forward. You stack one, right on top of each other. The legs are stacked on top of each other. Now, you’re going to lift this leg up into\nadduction, which is toward the sky. You’re going to do so with the hip backward\nfrom that midline. So, you’re not just lifting straight up\noff that other knee. It’s up, and then back, and you’re leaving\nit right here. Do you feel that right here? JESSE: Yeah. JEFF: You should be able to feel it right\nhere, in this spot. Right on the back side in that glute medias. Hold it there. I let go and he already started dropping because\nhe doesn’t really have that strength. But there are two tests to do here. If you have somebody nearby, the first thing\nthey can do is stabilize right here and just push to see how much resistance you can take,\nif you really can’t take much. Or you just try to hold it there. I want to see if you can hold it for 60 seconds. How you doin’? JESSE: It hurts. JEFF: It hurts? Do you think you’re going to make it? JESSE: No. JEFF: So, this is a very easy drill here. You’re just lifting and holding, but a lot\nof you won’t be able to do that and hold it for 60 seconds. Or you certainly won’t have the strength\nto be able to withstand any kind of downward force. JESSE: Right. JEFF: The next thing we want to do is try\nto strengthen that. So, how do we do it? JESSE: You tell them. JEFF: The same way we just did it. The same thing becomes an exercise. It’s so simple. It’s not remedial. I’ve mentioned it before, the “Jane Fonda”\nexercise, side leg lift. This is incredibly helpful here. This helps with low back pain as well, to\nprevent that from coming back. So, get back into position, stack everything,\nand now you have to go slow and deliberate. So, make sure you go straight down to the\nground. Flat down. All right. There you go. Now what you want to do is lift straight up,\nslow, control it, squeeze through here, bring it back at the same time. That’s where you’re going to start and\nend, okay? You’re going straight down, and then up,\nand back. Right there. Squeeze it. Is that – right. Okay, go down. And up. Right there. And squeeze it. So, every one deliberate, every one squeezed,\nevery one with a purpose. I’m telling you; you’ll be lucky if you\nget 10 or 12 good repetitions here. But it showcases just how weak this muscle\nis. Once you start to finally address it, you’re\ngoing to be amazed at how much more effective it is for getting rid of this pain. A couple of other things. Number one: things to watch out for. As you lift it up, don’t lift up and start\nbringing it in front of the body. That’s a substitution. Instead of being back here at extension, you’re\nshifting the focus off the glute medias to more of the hip flexor to do this work for\nyou. You don’t want to do that. The next things that’s likely going to happen\nis, as you start to bring the leg up, you’re going to turn your body. Your pelvis is going to drop back in this\ndirection. That’s no good either because what’s happening\nthere is this weak glute medias is begging for help and trying to get help from the hip\nflexor on the front side, or maybe even the TFL, to lift up for you. We don’t want that either because all you’re\ngoing to do is feed more into the problem you’ve already caused. This imbalance between the two. The second exercise I want you to do to strengthen\nup these weak glute medias’ is to sit on a bench. Again, a lot of cyclists, a lot of runners\nwill get this problem because they’re going through this continued cycle of a straight\nleg, and then a bent leg. A straight leg, and a bent leg. What happens, as you can imagine, this band\n– this tendinous attachment down here at the knee – when the leg straightens out\nthere’s the most lax that there’s going to be on it. Then when I bend, I start to bend that structure\nthat’s already tight. Then it tends to snap over the outside structures\nof the knee. Then when I go straight again it’s lax and\ncan move. Then when I start to bend it builds that tension,\nand it snaps. That leads to a lot of the irritation, repetitive\nirritation, of the outside here. So, you want to make sure you’re strengthening\nthis under load, in all scenarios of extension, or flexion of the hip. So, what we can do is take a band like this. You step through it, like that. So, you just step your feet through. Now you wrap it around here, you cross over\nonce, like Jesse’s doing there. Now you take this band, you’re going to\nwrap it around the knees one more time. So, over the thighs and under the foot. Over the thigh and under the foot. Now you’ve got this resisted structure here\nfor your hips. Now however far apart you keep your feet is\ngoing to determine how much more tension you have on that band. But about hip width apart is a good place\nto be. Now we move from here. You’re going to go and spread the legs apart. Go out into adduction and then you come back\nin. Again, deliberate, good repetitions. Out, squeeze, hold. You can feel it right in that spot, right? JESSE: Yep. JEFF: Right through the glute med. You’d do a set of 10 good, well-intentioned\nrepetitions here. This is with a pretty upright torso. We have about 90 degrees of relative hip flexion. If you want to make more hip flexion, just\nbring your torso forward. Now the hips are flexed a lot more toward\nthe trunk, relatively. Instead of having to move the hip up, we move\nthe torso down. Now we do the same thing. Sound effects included here. Right? JESSE: Yeah. JEFF: Harder here? JESSE: Yeah. Way harder. JEFF: Okay. Again, probably weak in this range. Same thing. 10 good repetitions there. Then the last thing, you can put your hands\non the bench, you allow yourself to lean back. Your feet can come out a little bit this way,\ntoward me. Scoot your butt forward. Now you’re into more of an extended range\nof motion at the hip. Not fully extended, but you’re less flexed. Now you do the same thing. Out and in the same way. Into adduction. Hold, squeeze, and then come in. You’re not speeding through these reps. You’re doing each one with quality. So again, something really simple you can\ndo. 10, 10, and 10. You do these a few times a week and I promise\nas that gets better, you’re going to start to feel this pain on the outside of your knee,\nor even up your leg is going to be gone forever. And you never had to foam roll in the first\nplace. One last thing I want to show you are two\nmaintenance stretches you can do, just to make sure you’re keeping it loose and feeling\ngood all the time. All right, Superstar. You’re going solo on this one. You got it? JESSE: Yeah, I got you. JEFF: All right. So now, the stretch. What you do is find something you can lean\nup against. In this case it’s a box. Go ahead and put your elbow on it. Make sure your elbow is underneath your shoulder\nlike Jesse’s doing there for support. Then what you’re going to do is, if you’re\ngoing to stretch your right leg out – the right IT band – then it goes out to the\nside and it’s straight like that. You’re trying to keep your knee as straight\nas possible. With your left leg now, step across and down. Now, all he’s going to do is allow himself\nto sink straight down. Just like that. He’s just getting that stretch all the way\naround the outside. Hip all the way down to the knee. If you bend your knee, you’re going to lose\nsome of that. The other thing that you’re looking at is,\nup here at his torso he’s trying to create some extra flexion. Lateral flexion. So, you can see he’s leaning in that direction\nto open it up. That would be a nice, additional stretch. You’ll feel it from the lat attachment up\nhere at your armpit, all the way down to the outside. So obviously, do both sides. Hold this for about 45 seconds or so, per\nstretch and you’re good. So, this one, you don’t need to rest on\nanything. You do it freestanding in space. So, here’s Jesse, again, standing. What he’s going to do is, against the right\nside, he’s going to step in front of that right side with his left foot, and now turn\nhis body in that direction, and then start to lean his whole body while he shoots his\nhips – his right hip – all the way out to the side, as far as he can. I can hear him groaning from here. So, the left leg there that’s in front is\ntrying to hold his right leg straight to keep his knee from bending in the back. Is that what you’re doing there, Jess? JESSE: Yes, sir. JEFF: All right. So, then you basically reach out, you kick\nthat right hip out to the side. Come back up again. Relax. Do it one more time. Again, step there, across, now you’re leaning\nthat way, kick the right hip all the way out to the side. Straight out to the side. Like that. Now lean down and try to touch the outside\nof your foot over here, in this direction. Again, you’d hold this for about 45 seconds\nand that’s just a quick, easy thing you can do. The most important thing is, working on the\nstrength is going to be the long-term key to your success. So, there you have it! Finally, a permanent fix to your IT band problems,\nand it had nothing to do with your IT band. At least, not directly. As we remember, it’s these two areas right\nhere that need your attention. Mostly, this one right here is going to need\nyour strengthening attention. That’s what I’ve shown you here. By the way, I have a whole other video that\nI didn’t mention in the beginning about the weakness and the weakest muscle in your\nbody being this glute medias. I will link that as well at the end of this\nvideo to show you another exercise option that requires no bands at all. The fact is, guys; start paying attention\nto this, to counteract this, and I promise this is going to start to feel a whole hell\nof a lot better. If you’re looking for programs that put\nthe science back in strength – because as you see, all this matters. There’s a reason why our bodies are put\ntogether the way they are. We’ve built them into all of our programs. They’re all over at ATHLEANX.com. If you’ve found this video helpful, leave\nyour comments and thumbs up below. Let me know what else you want me to cover. And if you haven’t already done so, make\nsure you click ‘subscribe’ and turn on your notifications, so you never miss a video\nwhen we put one out. All right, guys. See you soon."
}