{
    "id": "1vsWC6ao_To",
    "title": "16 Crazy Pullup Variations (YOU VS. THE BAR!!)",
    "description": "Build your pullup strength and an athletic body in 90 days here… http://athleanx.com/x/do-more-pullups-and-get-jacked-here ...",
    "transcript": "What's up, guys? Jeff Cavaliere, Athlean-X.com. The pull up is no doubt one of the best upper\nbody exercises you can do, regardless of whether you have access to a bunch of bars and dumbbells. The thing is, some people find it very, very\nchallenging. Don't give up on the exercise. You see, there's a lot of ways that you can\nactually make this thing easier. You take one of these resistance bands – this\nis one that we have, our Extreme Band – and this will help weight your bodyweight by about\n60lbs to 80lbs. The black one here; about 30lbs to 40lbs. So you can start doing them assisted and build\nup your tolerance to be able to do more. That being said, one of the hallmarks of our\nAthlean-X training system is, guys that do it could really start cranking out pull ups. Even if they couldn’t do one when they started,\nby the end of it they're not just doing pull ups. They're in need of more complicated, more\ncomplex, and more challenging versions. Today I've put together an arsenal of pull\nup variations for you to challenge you no matter what level you're at. I want you to see them all right now. Remember, beginner, advanced; we've got a\npull up here for you. Find the one that challenges you the most\nand start banging them out. So there you have it. There are plenty of pull up variations there\nto keep you not only busy, but challenged. If you want to change yourself you're going\nto want to have to challenge yourself at every opportunity. This will surely get the job done. Like I said, even if you can't do one start\nwhere you can and use your assisted band, build up your tolerance, and if you follow\nour Athlean-X training systems I promise you, you will not only get good at pull ups, you'll\nbe able to start cranking out much more difficult variations and keep that muscle growth coming\nand keep that exercise challenging for you ever step of the way. I'll see you guys over at AthleanX.com. You can get our program over there. In the meantime, leave your comments and thumbs\nup below and let me know what you want to see and I'll do my best here to bring it to\nyou in the days and weeks ahead. See you later."
}