{
    "id": "2AdC21CNuBI",
    "title": "“My Biceps Aren’t Growing” (HERE’S WHY!)",
    "description": "Have you ever felt that no matter how hard you trained your biceps they just won't grow. In this video, I'm going to show you the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So, you’re having trouble building your\nbiceps? You’ve come to me, and my video. I think I can help you. I’m not really sure, but I think I can help\nyou. Guys, I’ve got to be honest with you here. That’s a joke because honestly, when I was\nyounger my biceps were my biggest trouble spot. I didn’t have big arms. It was through my perseverance and wanting\nto build bigger biceps that I made a whole hell of a lot of mistakes, but I ultimately\nwound up being able to build decent sized arms because of that. So, what I want to do is help you today. I know why yours aren’t growing and I’m\ngoing to help you fix that. First, when we get into the different aspects\nof training your biceps I like to think there are mechanical things you’re doing wrong. Literally, how you’re lifting the dumbbell,\nand when you’re twisting, and if you’re raising your arm up or not to get complete\nbicep contraction. I made a video on that, and I’m going to\nlink that right here to show you what it looks like. I’m going to link it again at the end of\nthe video because I want you to see that. I cover five mechanical flaws that you’re\nmaking. You’re going to want to see that. Today I’m going to tell you the two things\nyou’re probably doing wrong that are definitely holding you back – beside your arms, again,\nI know because I’ve witnessed this myself, first hand – is your training frequency. Secondly, your lack of variation of bicep\ntraining techniques. First of all, as far as training frequency\ngoes, you have to understand that the biceps are pretty limited in terms of their function. They supinate the forearm like this. You can see the bicep will activate just by\ndoing that. Most importantly they flex the elbow. That’s their biggest driver and function,\nis to flex the elbow like this because of their attachment from here, down. They pull, they pull the elbow up. They also have the ability to get a little\nbit of shoulder flexion because of the longhead’s attachment up in the top here of the glenohumeral\njoint. So, we can get a little bit of that, too. Because of that, you have to realize that\nany time you’re bending your elbow in any exercise you do, on your pull day, any back\nexercise, chin-ups, rows, inverted rows, one-armed rows; anything you’re doing, you’re working\nyour biceps. Your biceps are an incredibly small muscle,\nbelieve it or not, only occupying a very small portion of the anterior side of your arm. Too much volume here, and too many times hitting\nthem in a week is going to be too much. A lot of times, guys, if you’re training\na push-pull leg system, and you’re training each function twice a week, if you throw any\ndirect bicep work in on top of that you’re truly hitting your biceps three times in that\nweek and not giving them enough time to recuperate. It’s not about protein synthesis every 48\nhours. It’s literally about giving that muscle\ngroup a chance to recover and get back to being able to be stimulated again in a meaningful\nway. Not just to coast through another half-assed\nworkout, but in a meaningful way that leads to progressive overload. That is where we jump off into the second\npoint. When we’re talking about progressive overload,\nagain, go back to the function of the biceps. Their limitation in what they do. We’re talking about a hinge joint here. If we were talking about the shoulders, that’s\na ball and socket joint. Meaning, my exercise variety for shoulders\nis a lot more than what we have for biceps. In terms of the fact that they look completely\ndifferent. A press looks different than a side-lateral\nraise, looks different from a front raise, looks different from rear delt raises. We have lots of different angles and planes\nthat we work in because of the variety of the movement that the three-dimensional ball\nand socket joint provides. The hinge joint of the elbow dramatically\nlimits our options to a lot of different curls. Period. You’re curling with dumbbells, you’re\ncurling with a barbell, you’re curling with a concentration curl, you’re curling with\na spider curl; you’re freaking curling no matter what you’re doing, guys. You’re curling. The thought that you could simply change bicep\nexercises to create new overload, realizing once again that they’re all basically formed\naround the same movement here at the elbow is not going to work. Not mention the fact that most of our bicep\nexercises are pretty limited, in terms of the ability we have to continue to add weight\nto them. Ask yourself the last time you actually increased\nthe amount of weight you’ve used on dumbbell curls. If you have, how much have you really increased? Progressive overload, and overload in, and\nof itself is pretty difficult to achieve. You need to do something dramatically different. And that is, vary the way in which you’re\ndoing your curls. So, let me show you a few different ways you\ncould do that. The first thing I like to cover here is one\nI called “Sliced Reps”. I take a weight I can normally use for 15\nreps and perform a curl all the way to the top. When I come down I drop down 1/9 of the way. You don’t have to get out your compass or\ngoing out and figuring out what that is. Literally, just drop it an estimated 1/9 of\nthe way, and come back up to the top, and contract. Then drop down a little more, then come back\nto the top. Then a little bit more and come back to the\ntop. So, through nine levels here it takes you\nto get all the way to the bottom of the curl. Then you come all the way back up to the top,\nthen you divide it, and slice it into 8 pieces. Then you come back down, then you drop it,\nand you now slice it into 7 pieces. Ultimately, until you get down to your last\ntwo where you’re going down halfway, then come back up to the top, all the way down,\nand your last rep is one, full rep. Now, what is happening here? We’re increasing our volume within a set. We’re increasing the number of contractions\nwe get here. We’re spending a lot more time in the contracted\nposition of the curl because we keep coming back to it on every slice. We’re increasing the time under tension\nthroughout the course of this set. Again, although the range of motion is abbreviated\nin a single rep, you’re still getting full range of motion as you go from top to bottom\nthroughout the course of this dropping ladder here. The fact is, this is a way to intensify the\ncurl. That is going to be how you’ll increase\nyour muscle mass, by doing your biceps workouts again. You’re adding a way to progressively overload\nthrough some stimulus that you haven’t felt before, as opposed to just saying “I’m\ngoing to do a different form of a curl today.” It’s not enough to just go exercise to exercise. We don’t have to just use that technique\nthough. We have other things here, like our arc variation. With an arc variation we know that the moment\narm can be changed. If we stand here like I am, using a long movement,\nwe keep our forearms straight as long as possible, and our elbows are just a little bit at the\nfront side of our ribcage, we know we have a big, long arc. A long moment arm for the biceps that make\nthat weight feel extremely heavy and put a great challenge on the biceps. But we don’t have to stop at that point. As we get fatigued and tired we can bring\nour elbows in to the sides now, instead of in front of our ribcage. Now, tucked in toward our sides and we continue\nto curl. We’ve shortened that moment arm, effectively\nlightening that weight in our hands to allow us to keep going. Then we can drop our arms back even more,\neven into this drag curl variation that really shortens the moment arm on the biceps. Not only that, it changes the strength curve\nof the exercise, so the hard part isn’t in the middle of the exercise, but actually\nhere, at the peak contraction of the exercise. So, we’re able to take failure and extend\nit further, and further, and further, intensifying the curl. Again, it’s all curls. But we’ve intensified that, and that’s\ngoing to lead to bigger biceps in the long run because you’ve gotten too stale with\nthe fact that you haven’t utilized enough of these techniques. I’ll give you one more here. It’s actually one we use called intensity. The intensity style here is, you’re actually\ntrying to increase the amount of productive reps you’re doing with a bit of a heavier\nweight now. What we do is take an exercise and go to failure\nin about five, to six rep range. Then we rest pause for 10 seconds. We don’t put the weight down. We just rest pause. You’ll see that, guess what? After about 10, or 15 seconds you can crank\nout another three reps. That’s enough time to rest and get out another\nthree reps. Then you rest again 10 to 15 seconds, and\nthen you go for another three reps. Then you’re maybe going for two reps. Then ultimately, you’re going down in singles. But if you do this for a five minute period\nof time, when you accumulate the number of high intensity reps that you did in this one\nfive minute set, and the number of reps you did with this heavier weight; it’s going\nto be more than you likely did when you broke your sets up into the tradition three sets\nof 12 style. Again, using a heavier weight anyway to get\ninto this five to six rep range, and you’re accumulating more of those heavy reps. So, no matter what style you’re looking\nfor, heavier or lighter weights, 15 rep maxes, or five to six rep maxes, the key is this:\nit’s not the exercise variation, guys. It’s the variation of the intensity techniques\nyou’re using on those exercises that will matter the most. As far as frequency goes, if anything, dial\nit back and see how you do. I promise you, you’ll probably see a better\nresult from doing that than you are adding more, and more workouts. Guys, I hope this was helpful to you. If you’re looking for a program where we\nput it all in one complete step by step system, I actually created something called our Ultimate\nArms program. That’s available over at ATHLEANX. Guys, it’s not just arm training. We train athletes here. It’s a whole entire program, but it has\na specialization for arms that helps you overcome all the mistakes I made. Not just the ones I point out here. Everything I think that will help you get\nbetter arms in the long run. Guys, that’s over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up. Let me know what you want me to cover and\nI’ll do my best to do that for you in the days and weeks ahead. See you."
}