{
    "id": "2GG4Qi5whnA",
    "title": "Quick Shoulder Mobility Drill (STRONGER BENCH PRESS!)",
    "description": "Strengthen all your lifts by training like an athlete here… http://athleanx.com/x/complete-athletic-training-system Shoulder mobility ...",
    "transcript": "What's up, guys? Jeff Cavaliere, AthleanX.com. I want to show you today a quick shoulder\nmobility drill that you can do in a slightly different way than you're already doing it\nto find out a lot more information about the stability of your shoulders. Mobility and stability are always going to\ninterchangeably work together. How much you have of each and how much they\nwork together is very, very important. Especially when we're talking about the big\nlifts. You see, when some people do bench presses\nthey'll get shoulder pain as they press out, or on their way down. It may not always be about the strength of\nthe structures that are hurting – say like the bicep tendon – but maybe about the mobility\nor stability of the structures that are supporting that. This is a perfect example of how we can actually\nstart to assess that. If we do this normal drill, which we probably\ndo this instinctively, we want to get our shoulders to feel better so we do shoulder\ncircles. We go back to work on the external rotation,\nhere, of our shoulders; that way. Then we come forward, or obviously we'll do\nboth. Internal and external rotation is a great\nway to feel loose and give us a good way to warm up our shoulders before we hit the bench\npress or upper body movement. But if we take a band and incorporate it with\nit, we get a lot more information from the move. What we do is take a band, now you hold it\nout at arm's length. You put tension on the band by doing a bit\nof a band pull apart. So you can see that my arms are out in front\nof me, they're not bent, they're not closed; they're out in front of me because I'm actually\ntrying to protract and get my cerates to have to fire and stabilize. Now as my cerates are engaged here – the\ncerates is going to help to keep our shoulder blade tight to our rib cage, where we want\nit to be, for more stability. Now we're here, now we try to perform the\nover and back. So what we do is, we take the band, we move\nit up, and I'll turn around this way so you can see what I'm doing. You pull the band apart as your arms are traveling\nback behind your body. The key here, above all, is to go slow because\nif I lack stability in my shoulder blades, the one thing that you're going to probably\nfind will happen to you is the band will snap down. As soon as you get to a point where you can't\ncontrol the band, or you don't have the stabilization through the muscles here in your shoulder\nblades, you're going to find that it snaps. So you want to go so slow, as you go all the\nway back, that you control every single centimeter of the travel. All the way back, and at the bottom it doesn’t\ntouch your back. It stays away from your body, and you're able\nto reverse the direction, come back in front of you, back to this original position. Again, from the front to here, arms are outstretched,\nband is coming up; this is a hard exercise. Again, it's just working on those small stabilizers\nthat we often overlook. Of course, look at all the mobility I need\nin my shoulders to be able to do it. Again, at the bottom I don’t let it hit\nme, I'm going nice and slow, it stays away from me and I'm able to reverse the direction\nand come back to the front. Okay. Just like that, try if you can get even six\nto ten reps of that without letting it hit. You're going to see where your weaknesses\nare if you have them. The idea here is: is this a small movement? Yeah. Is it unimportant? Absolutely not. You can't overlook the small things because\nthey have big implications on the big things. Like I said, bench pressing might be undercut. Your bench pressing and how much you can bench\npress is being undercut by the stability of the muscles that wrap around and stabilize\nyour whole body as you perform the bench press. So if you want to lift big to get big, that's\nfine; but you'd better be able to have the supporting muscles there to be able to allow\nyou to lift big in the first place. I hope you guys found this helpful. Again, if you want a program where we don’t\noverlook the little things because we realize how important they are, head to AthleanX.com\nright now and get our complete Athlean-X training system. If you've found this video helpful let me\nknow below. Try it out, let me know how you do. I'd be curious to know how many of you can\ngo over and back 10 times. Going really slow, though. Really slow; that's the key, without letting\nthis band snap around and control you. All right guys, we'll be back here again soon. See you!"
}