{
    "id": "2huvkWzPRps",
    "title": "Muscle Memory Explained (WITH STICK FIGURES!)",
    "description": "See your fastest gains ever with this - http://athleanx.com/x/fastgains Subscribe to this channel here - http://bit.ly/2b0coMW You ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Have you ever noticed that you can bounce\nback from a lay-off, whether it be from being sick, maybe injured, maybe just taking some\ntime away from the gym, maybe you got demotivated and lazy. The fact of the matter is you're able to bounce\nback because of something called muscle memory and see your gains come back a lot faster\nthan when you built them up in the first place. That has everything to do with my four dots. Let me explain what I'm talking about. So I have a yard here, and I have four dogs. I talked about them before. Four black labs, and they like to run, and\nI've got to make sure that I keep my eyes on them because if I don’t, one can get\naway from me, as I've had happen to me yesterday. Now, here's the fact of the matter: if they\nstay over here – one dog, two dogs, three dogs, four dogs – and I stay over here,\nI can watch them really easily. I can keep my eye on all of them. No one's getting away from me. So I have two options now to make sure that\nI can do that. I can either fence off the yard now and just\nmake sure that I never have to worry about that, and they don’t get a chance to cover\nany more ground, or I cannot worry about putting a fence up and I can get another me. I can get somebody that can come and help\nme to watch this half and they can now expand the amount of ground that these guys could\ncover. So, I can get someone like Jessie to do this,\nright? Jessie's not editing videos, he's working\non this. The fact of the matter is: our muscles operate\nthe same way. Come on, sweat for me baby. There we go. So the muscles operate in the same way. We have a muscle fiber. The muscle fiber covers a certain amount of\nground. Attached to the muscle fibers are satellite\ncells, okay? These aren't dogs. They're satellite cells and they donate something\ncalled a myonuclei, which is going to allow this cell to become larger. It's brought upon by stress. So you're rally just bringing in this myonuclei,\nwhich is brought upon by stress. So training hard, changing up your workouts,\nmaking sur that all those stressors that create muscle growth and damage in the first place\nare there. So now we have this. Ultimately, though as the muscle fiber gets\nbigger, as the yard gets bigger, these four myonuclei cannot regulate that size of that\nmuscle fiber anymore. They reach a maximum limit. It gets to the maximum limit. It's called the myonuclei domain. At that point you have only one option: to\nget bigger. The muscles won't grow any bigger than that. The only option is to bring in more. So if I had two more, well now all of a sudden\nthe fiber can get bigger so that now those six can oversee that entire size of that muscle\nfiber. All right, now here's the cool part about\nwhat happens here. When we talk about muscle memory, when we\nlose muscle size – because we do. You've seen it. You've experienced it. you get sick, you get smaller. I lost, like, 12lbs the last time I had the\nflu. Your muscle fibers might get smaller because\nmetabolically it's sort of a waste to have them be really big and demanding if you're\nnot using them. But you won't lose the myonuclei that you\nhad added and accrued from your hard training and stress. So now, this has the capacity to be this,\nbut they're just not being used at the moment. So it's gotten smaller, but as soon as you\nstart training again, this can bounce back to this size much, much quicker. The same way that if I had Jessie, and it\nrained for five days in a row, I wouldn't fire his ass. I'd keep him around and have him to edit the\nvideos. Right? Because Jessie's a good kid. So what we do is, we have Jessie to be able\nto do that, and as soon as it stops raining, the dogs want to go back outside and run again,\nhe's there and he's able to do that and they don’t have any restrictions on the amount\nof ground that they can cover, or the amount of ground that your muscles can cover. Okay, so now what does this mean? Especially as New Year's comes around the\ncorner here, it means everything. Number one: we have a lot of different categories\nof people. If you're somebody that's never trained at\nall before, you don't have the accumulation of these sitting around. However, it's pretty damned easy to get them\nbecause everything is a stress. Everything you do. Lifting, bending over to tie your shoes is\nlike a squat, for crying out loud. You start seeing size gains in your legs because\nyou're doing something you've never done before. So your ability to start building up the myonuclei\nis actually really easy for you. You don't have something that the guys that\nare more experienced deal with. That is that we continually overcome that\nrepeated balance of exercise phenomenon. The fact that we keep doing the same thing\nover and over again, and it gets harder and harder to stretch the muscle out. So that's the first thing. So if you've never done anything before you\nshould be excited about New Year's, getting ready to head out there and start training. The next category is the guy who maybe trained\nin the past, but hasn't trained in a long time. Life got in the way. Something got in the way of him actually training,\nand now he needs to get back into it. Well, good! Maybe your muscles have gotten smaller because\nyou haven't used them, but you still have the results of your hard work. Likely, the myonuclei are still there in place\nso that you're going to be able to bounce back and see results a lot faster than you\nmaybe thought. So you should be encouraged by that. And for the other guys, the guys that have\nbeen banging away at it time, and time again. Year after year. Never miss an off day. Never doing – guys, understand that you're\nnot going to lose your gains, okay? It takes a long time to lose these guys, right? They all stay in place here. It's a long time. So if you're feeling a little bit burned out\ntake a little time off to recharge yourself so you can get ready and excited about the\nNew Year so you can start attacking your workouts with a new amount of energy. All right, guys. So that's it. Hopefully this little refresher on muscle\nmemory is encouraging above all else. Why? Because you've got no excuses. It's time to hit the gym, not matter what\nstage of the game you're in, and get yourself in line for some new gains. If you've found the video helpful make sure\nto leave your comments and thumbs up below. Whatever else you want to see, make sure you\nleave me that below so I can see that and try to do my best to make a video on it in\nthe coming weeks. If you're looking for a program to change\nit up – remember, you've got to always find ways to stretch your body. Don’t keep doing the same things over, and\nover, and over, and over again expecting your results to get changed up. Head over to ATHLEANX.com. We have plenty of programs to address your\nspecific concerns, and your goals. All right, guys. I'll be back here again soon. See ya!"
}