{
    "id": "2J5Fz9GkgTQ",
    "title": "How to Get Ripped on the Road (CNN EXPOSÉ!)",
    "description": "Build muscle fast without equipment - http://athleanx.com/x/bodyweight Subscribe to this channel here - http://bit.ly/2b0coMW ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So I've spent a great deal of my adult life\ntraveling on the road. In major league baseball I find myself on\nthe road for many, many weeks out of the year. So I learned a thing or two about how to stay\nin shape when you don't have all the weapons in your arsenal. Recently CNN Business Traveler Richard Quest\nbrought me in to share the secrets that I have for how to stay in shape on the road. That piece I actually have right here. I wanted to share it with you. Stay tuned, because in here, I'm actually\ngiving out a tip that I've never shared before. It's my secret weapon for staying in shape\non the road. Think \"pulling exercises\". You probably had no options before. After this video, no more excuses. RICHARD: Arriving. JEFF: Thank you very much. RICHARD: Departing. Jet lag. Fast food. Loooong days. It's enough to wear you out. Hello, and welcome to CNN business traveler. I'm Richard Quest. This month reporting from the CNN Center. A life on the road is inherently unhealthy. Now, it's not our fault. It's just brain and body can't cope with always\nbeing on the go. But there are things we can do to mitigate\nthe effects. That's what we're going to show you this month. The cards are stacked against the traveling\nelite. Proper nutrition, exercise, and well-being,\nwell, it flies out the window when we're on the go. The evidence is there to back it up. A 2011 Columbia University study show those\nof that spend at least 2 weeks a month on the road aren't the healthiest. We have a higher rate of obesity, blood pressure,\ncholesterol. We've brought in the experts to regain control\nof our lives. We've got the nutritionist. FEMALE: Play it smart. Pick protein. RICHARD: The trainer. JEFF: Decrease your base of support by having\nyou lift this leg up. RICHARD: And the man who's inside our minds. MALE: Will power is like a muscle. It can get tired throughout the day. RICHARD: Fueling properly is only part of\nthe equation. Working out is just as important. It keeps the body moving. JEFF: People call sitting the new smoking. There have been people that believe it's that\ndetrimental to your body over time if you don’t do something to address it. RICHARD: Jeff Cavaliere is a physical therapist,\na former strength coach with the NY Mets, and creator of the ATHLEANX training system. He knows what's ailing us. JEFF: I don’t care how long a flight you're\non. Even if you get a chance to lay back a little\nbit you're still going to develop some level of tightness in your hip flexors, first and\nforemost. So now you get tightness in the low back,\nyou get weakness in the hamstrings and glutes. RICHARD: Is all this coming just from our-? JEFF: It is. It's cascading right from there. RICHARD: All right, let's start giving me\nsome ideas of things I should be doing. JEFF: Try to pull your butt underneath you. Hip flexors. RICHARD: Hip flexors? JEFF: Too tight. RICHARD: Yep. JEFF: Glutes, too weak. RICHARD: I was feeling fine until I arrived. JEFF: Just like that. By leaning forward you can see the weakness\nin the glutes is more prominent for you than it is your quads. Take this arm, you want to reach through and\ntry to touch somewhere behind you. See, it's called 'thread the needle', all\nright? RICHARD: What?! And before you come up with the old excuse\n\"no gym\"; no problem. JEFF: We're going to use this. RICHARD: In the hotel, he has some 'on the\nroad' exercises. This, I have to see. Jeff, what are we going to do with all of\nthis? This is an ordinary hotel room. JEFF: No. it's actually a beautiful gym if\nyou look at it closely enough. RICHARD: A little bit of rearranging and gone\nare my excuses for skipping working out. JEFF: So the big secret is the hotel luggage\nrack. Now we've actually got a pull up bar. You could do a step up here and actually really\ndeliver a good workout for your entire lower body. RICHARD: Right. JEFF: Come down to the ground. Up, just like that. There. Perfect. There you go. Watch your head. Bend your head backward, all the way. There we go. When we're talking about \"could we still maintain\nour fitness on the road, could we still have a challenging exercise without having to have\naccess to a gym\", I think the answer is clearly \"yes\". RICHARD: Where's the breakfast buffet. Wellness amenities are wonderful, but they\nwon't make you fit. I have to exercise to do that. Before I left, trainer Jeff Cavaliere showed\nme how to work up a sweat using the standard furniture found in most hotel rooms. Time to put it to the test. All right, Jeff. So this is my gym. There's step-ups using the ottoman. Good. Now triceps. Pushups, on the floor. Onto the desk. The pull ups. All right, now for Jeff's. Piece de resistance. All right, it's a little bit on the wobbly\nside. Probably, you shouldn't try this until you're\nentirely certain, but here we go. My heart rate is definitely up. Who needs a fancy gym when you have a hotel\nroom? Now, we've shown you what to do. There's no excuse for not getting it right. Well, that is unless you don’t want to. And that's CNN business traveler for this\nmonth. I'm Richard Quest, at the CNN Center. Wherever your travels may take you, I hope\nthey're profitable and I'll see you next month. JEFF: So there you have it, guys. I hope you like the piece. The fact of the matter is this: there are\nno excises when it comes to traveling on the road and staying in shape. As a matter of fact, you're not going to get\nany sympathy form me either, because I know the struggles, and I know how to overcome\nthem. If you're looking to see the entire piece,\nI included the link in the description below. You know, I also created an entire bodyweight\nonly training program that actually uses less than what I even showed Richard in that hotel\nroom. It's the ATHLEAN0 program. It uses nothing at all. It's over at ATHLEANX.com. If you liked this video, let me know below. We'll make sure we do more of them in the\nfuture. In the meantime, if you're looking for more\ninformation head to ATHELANX.com. All right, guys. I'll be back here again in just a couple days. See you!"
}