{
    "id": "2N5P_iWkluQ",
    "title": "Do This EVERY Time You Overhead Press (MORE STRENGTH!)",
    "description": "If you perform the overhead press for your shoulders and are looking to build more strength on the exercise, then you are going to ...",
    "transcript": "So, when you re pressing our head, \ndo you think you look like this?   But you actually look like this? \nWith the help of him and this--\n  And me.\n--I'm going to show   you exactly how to make sure that you always \nlook the right way every time you press. \n  What s up guys, Jeff Cavaliere, Athleanx.com. \nAnd Jesse Laico, Athleanx.com.\n  So, when you re pressing over, do you have a hard \ntime getting the bar actually up overhead. I mean,   not out in front of your body, as \nyou see here. Because if you do,   you might be costing yourself some strength gains \nat the very least. Because we know that we are   seeking strength on the overhead press, which \nis predominantly what this exercise is used for,   you want to have an efficient movement pattern, \nmeaning a bar path straight up. That becomes   challenging for some people because they \ndon't have the mobility to press that bar   straight up overhead, as opposed to straight \nbut angled outward in front of the body. \n  Meanwhile, this press really only requires two \nthings to execute it properly: thoracic extension   through your mid back and external rotation at \nyour shoulder. You guys can play along at home,   just turn to the side. And this is now flexed \nout, okay, rounded back. A lot of us have that   position. Go ahead and raise your arms up as \nhigh as you can come on higher, Jesse. \n  That's as far as it goes. \nSo, what happens is you guys actually get a   bony block here, and I use Raymond to show you why \nthat happens in a second. The next thing is stand   up nice and tall. Okay, now give me our rotation, \nthough, because if you're not externally rotated,   this is going to happen. What happened? \nI can't get any further. \n  So, again, you've introduced a bony block. And the \nreason for that anatomical stalemate is that on   the humerus, we have something called the greater \ntuberosity. And as I raise this up, if I'm at all   internally rotated, you're going to see that \nactually blocks inside that joint. Right?   It starts to hit the acromion there. If I can \nget externally rotated now, you can see I have   relatively move that to a more outside position \nthat allows the humerus to be elevated without   stopping. The same thing here when we talk about \nflexion, if the whole spine is rounded forward,   what's more importantly happening is that \nthe shoulder blade is coming with it.   And as it starts to hover forward and down, you're \ncreating a blockade with the acromion once again,   that doesn't allow the humerus to go up. \nSo, what do we do? Well, we have one move that   actually addresses both of these requirements, \nand it's something that we can do right before   we press that will take literally just a minute \nor less. Take one of the plates instead of putting   them on the end of the bar, just yet you're going \nto grab it. You're going to perform one drill.   You grab the plate at the four o'clock \nin the eight o'clock position here.   You make sure that on the back side \nhere you've got good thumb support   up the plate. Okay, now what you do is you stand \nhere and you're going to raise it up, basically   press it up overhead and go back as far as you \ncan. Two things happening. Number one, you've   got good thoracic extension that we're talking \nabout. And secondly, with the positioning of   the hands on the plate, you're getting into more \nexternal rotation or at least more neutral. \n  If we would just grab a bar and try \nto press overhead that way to warm up,   you are in a more pronated position, obviously \nof your hands to grab the bar, but a more   internally rotated position. This is going to \ndo something really important. Do it again.   Up overhead about three or four repetitions. \nWhat this does is three things: number one,   you're providing a loaded mobility drill. A lot \nof times, just working on mobility without a load   falls apart when you step under a load. By having \neven a moderate load in your hands here, you're   able to activate muscles in a different way. \nNumber two, you're getting both at the same time,   the external rotation at the shoulder and the \nthoracic extension, which is a great thing. Number   three, what that does is it allows the muscles of \nthe rotator cuff that are responsible for external   rotation to actually do their job, waking them up \na bit so that they know that when you raise your   arm overhead, their main job is to centralize \nthe humerus inside the glenohumeral joint.\n  In other words, as you raise it up, \ndon't let the arm slide up as it goes,   keep it centralized so that as it goes up, \nit stays in the middle. What that does is   it continues to create room in this joint so you \ncan press overhead and get to that fully extended   position. So, one more repetition nice and up \noverhead each time you'll feel it, start to open   up more and more and more. Great. Now after that, \nput it down, now let's go see on the bar. And what   you'll find, guys, is that not only can you press \nthe bar straight up overhead more easily, but you   can actually do so with more strength because \nof the efficiency of the movement. Straight up,   overhead and back. And again, now you can \nclearly see the ear properly in front and more   importantly, the bar path going straight up and \nstraight down. When we're talking about building   strength and the exercise guys, the efficiency \nof that bar path is going to matter. \n  The next thing I was saying, the last thing I'll \nsay is it's really important, as always, when you   press to maintain shoulder health, to press out of \nwhat we call the scapular plane. Meaning angled a   little bit forward here. \nYeah. \n  And we can see that even by finishing with your \narm appears to be back behind your head, you've   actually never left the scapula plane. If we start \nhere and Jesse starts in that scapular plane,   which is again not out here, but angled forward \njust a little bit. As he slowly presses that bar   up overhead and even when he reaches fully up \noverhead into that full extended position there,   you can see that as we were lower down, nothing \nchanges. He's still in that scapular plane,   so the bar actually has travel straight. It's the \nhead that winds up peeking through that. It makes   it appear as if the body has moved forward or the \nbar has moved backwards when in actuality the bar   path has stayed the same in the shoulders \nhave stayed in that nice position. \n  So, guys, I hope you find that helpful. Make \nsure you institute this again three, four,   five reps with a 25, 35 pound plate right \nbefore you're ready to step onto the bar and   I promise you, it will have an impact. \nIf you're looking for programs, guys,   where we put the science back in strength because \nthe details of how we do what we do matters. You   can find them all over at athleanx.com. In the \nmeantime, if you haven't done so, make sure you   leave your comments below and let me know what \nit is you want to see in the future videos,   I'll do my best to do that. And also, you've got \nto click Subscribe and turn those Notifications,   so you never miss a new video when we put \none out. All right guys, see you soon. "
}