{
    "id": "2OD1gjN5BWg",
    "title": "How to Get Stronger in 30 Days (JUST DO THIS!)",
    "description": "If you want to learn how to get stronger in just 30 days then you're in the right place. In this video I'm going to show you how to ...",
    "transcript": "Pay very close attention. Look at these \ntwo clips, which one of these lifters   is building more muscle and strength on \nthis bench press right now. Do you think   you know? You're about to find out today. \nWhat s up guys, Jeff Cavaliere, Athleanx.com.   So how d you do, good news or bad news? Well, \nlisten, there is no such thing as either, because   even if you got it wrong here, I got great news \nfor you. In this video, I'm going to show you   how you can apply exactly what I'm showing you \nin those clips to get stronger and bigger in the   next 30 days. Because if you understand the \nanswer to the question whether it was right   or wrong, you're going to be able to unlock those \ncapabilities. So let me give you another crack at   it. Take a look again here and see which one A or \nB do you think is gaining more strength and size   on this particular bench press?\nNow, if you prefer dumbbell pressing,   I'm going to give you an option for that too. Here \nyou go again, side by side. Which one of these two   is building more strength and size on this \nparticular exercise right here? The fact is guys,   as always, it's putting the science back and \nstrength that s what we do at Athlean-X. But   more than that, we put a specific kind of \nscience back in strength, it's physics,   bitch. Actually, this is a t-shirt we have on our \nwebsite if you're looking to get one yourself.\n  But guys, physics is undefeated, it never \nloses. Because we know that physics helps   us to understand a lot of things that we do in the \nweight room. Force equals mass times acceleration.   So if you looked at those two clips and you \ndetermined that the one that was moving faster was   the one that was building more muscle and strength \nthan you'd be right? And all too often our focus   is on M and increasing the mass and the weight \nthat's on the bar that we're lifting without   ever really paying too much attention to this \nright here and that's A. And that would be the   acceleration of that mass that we're lifting. \nAnd if we look at what's happening here,   F is the overall force output that our muscles \nare feeling that can drive the overload that we're   looking for to drive new muscle growth, then we \nknow that either one of these increasing this or   increasing this is going to have an overall impact \non that and increasing that. So why are we always   so focused on this? Well, not after today's \nvideo. Because if you take those clips again,   you realize the main difference between them was \nthat in one of them, I was moving more explosively   faster on every single repetition. And by doing \nso, by increasing the acceleration of that mass,   even though it was the same in both \nclips, having an overall increase   on the force generation and output here.\nAnd this goes right back into science again,   guys. Because when we do this, we're getting \na better recruitment and a better efficiency   of recruitment of the type two fibers, which are \nthe most capable of driving new size and strength   gains. Not to mention again showing you how to at \nleast start to train more explosively. And what   we call this type of training is compensatory \nacceleration training. And it's not new guys,   it goes way back, guys like Louie Simmons and Fred \nHatfield and Mel Siff we're using this technique   with their athletes. And again, a very great \ntechnique for athletes because you can't always   put your foot on the gas when you're trying to \nincrease performance, especially in season. So   you have to have other ways to have an impact \non their force generation capabilities without   always trying to add more weight to the bar. \nAnd I've talked about in this channel before   methods for just hypertrophy again building bigger \nmuscles. You can go the eccentric muscle damage   route, but that oftentimes leaves you really sore \nand can impair other elements of your training.   Or you could try the metabolic stress method, \nhowever, again, that's not for everybody, and they   don't have the mental willpower to push themselves \nto the point that they need to, to actually see   benefits from that type of training.\nSo it always comes back to progressive overload   and if we progressively overload by always \nfocusing here without looking at this, we're   kind of leaving a lot on the table. And it applies \nto you right here, right now because it doesn't   matter what you're doing right now. Even if you \ntook the same lifts you're doing exactly right   now, whatever training split you're following. And \nall you did was focus on becoming more explosive,   adding to the acceleration component of every one \nof those lifts you're going to add to the overload   you're creating and lead to new size and strength \ngains. And there are studies that show that we can   see these gains and literally just 30 days.\nThat being said, we have our own   lab rat here and his name is Jesse, and he's \nbeen doing this himself on his own deadlift.   You've seen his deadlift increasingly grow, \nbut you may not know is using some maximal   loads like he has here and accelerating them at \na much faster pace has also allowed him to build   this top number up. Not always having to push the \npedal to the metal, as I said, but finding other   ways to achieve higher totals through alternative \nmethods. We oftentimes fall into that trap of just   letting the bar sort of move through space because \nof the natural strength curve of the exercise.\n  Look even on a squat, it s most difficult to come \nout of the bottom of the hole. And then as we get   past sort of that midway point, we might coast \nthe rest of the way because the strength curve   allows us to move that weight a lot easier. I'm \nsaying you continue to accelerate through every   single inch of that movement, and that's what \nthe real benefits lie. Now listen, maybe you were   feeling bad because you got the first two tests \nwrong and to give you one more test here. But   I'm going to warn you, only 1% of those that take \nthis test are actually going to pass it. They also   remember 70% of all statistics are bullshit, so \nyou actually might have a chance. Here you go. \n  Take a look at this clip here. Now, look very \nclosely. Do you see it? Which one of these is   building more strength in size by doing the \nexercise? Okay, good because guess what? It's   a trick. And Jesse, I can't believe you put me \nup to this. So, guys, it's the same clip. All   right. All I do is replay it twice, but there's a \nvery important point about this. When we come to   this compensatory acceleration training, you are \nbenefiting even if the weight is not perceptibly   moving very fast to somebody else that's looking \nat it. But to you as long as you are pushing that   weight as hard as fast as you possibly can, you're \nseeing the benefits. So it's not perception, but   it is the intention. And as long as your intention \nis to accelerate that bar as fast as you possibly   can against the external resistance, you're \ngoing to see the benefits of this technique. \n  Guys, remember when you're looking for ways \nof how to build your strength and size,   especially over a shorter period of time, you have \nto be willing to tap into different things that   you haven't tried before. Continuing to do the \nsame things you've been doing is going to give you   the same results you've been getting. Sometimes \nyou got to look at other methods here, and just   simply increasing the acceleration to increase \nthe effect of the overall force output is the   way that's going to get you there the quickest.\nGuys, if you find the video helpful, make sure you   leave your comments and thumbs up below. What else \ndo you want me to cover? I'll do my best to do   that for you. If you're looking for programs where \nwe put the science back and strengthen everything   we do, you can find them over at Athleanx.com. In \nthe meantime, if you want that shirt, by the way,   you can find that over at Athleanx.com too. \nGuys, remember to click Subscribe, turn on your   notifications so you never miss a new video when \nwe put one out. All right guys see you soon."
}