{
    "id": "2xJIw_zE46I",
    "title": "Leg Workout (ATHLETIC GAINS!)",
    "description": "Build explosive, powerful legs with APEX leg workouts http://athleanx.com/x/ultimate-leg-training Are you ready for a leg workout ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. Yes, it's still ULTIMATE ARM week here but\nwe're going to start switching the focus of our attention to our Legs. You see in our brand new ULTIMATE ARM Workout\nthat's available at ATHLEANX.COM, we don't skip Leg days. As a matter of fact we made them even harder\nthan usual. We've included a brand new style of training\nhere called Apex Leg Training and I wanted to give you guys a sneak peek of exactly what\nit is. You see Apex Leg Training will maximize not\nonly your strength in your lower body functionality but it will also stress athleticism and being\nxplosive. And we're going to do that guys as we always\ntry to here, on our feet. We try to get you into ground based training\nwhen we do our Legs. I don't like Leg extensions, I don't like\nopen chain exercises, not if we're trying to be Athletes. So what you're going to see here is a sneak\npeek of an actual Apex Leg Workout. And again focus on the types of drills that\nwe do here. Focus on how we're involving our Core in what\nwe're doing, while at the same time we're really trying to work on building our strength\nfrom the ground up. So there you have it guys. There is a sneak peek into our Apex Leg Training\nright from the ULTIMATE ARMS Program. And like I said, ULTIMATE ARMS is a lot more\nthan just your Arms. You see. this workout program, this 6 week workout\nis geared at helping you guys to add significant size to your arms, but at the same time, we are never going to\nabandon Training like an Athlete here at ATHLEANX. We're going to train your whole body. The Leg training is part of it and of course\nwe even have a complete 6 week Ab Workout Program that goes along with it, ULTIMATE\nABS. But that is not going to be available for\nmuch longer. As a matter of fact just a couple days after\nthis video is published, that will no longer be offered with the ULTIMATE ARM Program. So if you want to train your entire body,\nif you want to build your Arms bigger, if everything I've got here, all of my techniques\nto help you do that guys, is the ULTIMATE ARM Program. I hope you guys found this whole week to be\nenlightening. I gave you a lot of free workouts, I hope you'll like the workouts. And of course whatever else you want to see\nhere on this channel, make sure you let me know below. It's your channel guys, I make the videos\nyou want to see. Let me know and I'll be sure I do my best\nto try to do that. Leave a thumbs up too if you like this video\nand I will do more like them. Alright guys, I'll be back here again very\nsoon."
}