{
    "id": "34zG7LFdwq0",
    "title": "The Official “Love Handle” Solution (LOSE STUBBORN FAT)",
    "description": "If you have love handles and want to officially get rid of them once and for all, you are going to want to sit down and watch this step ...",
    "transcript": "What's up, guys, Jeff Cavaliere, athleanx.com. \nLove handles basically the epitome of stubborn   body fat, particularly in men. What is it \nabout this area that just tends to sort of   take so long to go away? Even at leaner \nlevels of body, fat guys will still have   areas of fat around their waist and their \nlow back that just won't go away. Well,   today I'm going to help you, I'm going to give \nyou the action plan. A series of things that you   can do that are going to help you to finally get \nrid of these love handles once and for all. \n  So, look, whenever we talk about love \nhandles, can we at least define them   all the same way - as body fat. Right? Body \nfat is body fat. Where we store it is what   determines maybe whether it's more stubborn \nor not. When it comes to the love handles,   though, what you do about it is always \ngoing to come down to the same solution,   and that is your diet and what you eat \nand what you put in your body. Now,   let's face it, if you look like this right \nnow, though, there's love handles present.   There's a whole lot of other body fat present, too \nand this person is not getting the nutrition right   at all. More often than not, they're choosing \nthe wrong foods. If you want to get to the   bottom of your problem, you're going to have to \nchoose the right foods more often than not.\n  And even just the clean eater or the \nguy who eats clean most of the time,   it's not going to cut it when it comes to the \nlove handles. Because again, it tends to be that   stubborn fat that holds on to the very last drop. \nYou got to get it right more often than not, even   sometimes 80/20 won't cut it, you might just have \nto be better if it means that much to you. \n  You're still with me? Good. Because I'm going \nto cheer you up now. Because what I just said   is actually a lot simpler than you might think. \nNow maybe not easy for everybody, but definitely   worthwhile. And what I'm talking about is that \nlet's say 90/10 approaching nutrition. And that   means for every nine meals that you eat, that \nwe all would agree are healthy and in line with   somebody who's attempting to become hyper caloric \nand lose body fat, the 10th meal is on me. You can   indulge in something that maybe you do right now, \nbut at a lesser frequency. Now, when it comes to   alcohol, I would suggest this is an area that's a \nlittle bit easier to clean up, too. Because we can   just simply cut down either the number of times \nper week that we drink or the number of drinks   we have each time we do drink. And because \nwe know that they're pretty empty calories   and they start to stack up and add up quite \nquickly, it might be an area that's a lot easier   for you to fix than you might have thought.\nAnd then when it comes to the actual foods we eat,   I am going to suggest that you don't attempt to do \nthis by becoming a carbphobic. What I'm saying is   don't try to avoid carbs altogether. Not only is \nit going to set you up for a long-term failure   because you just can't deprive yourself \nforever of these delicious nutrients,   but you're going to find that it also \ninterferes with the process in another way. \n  And that is, though initial restriction of \ncarbohydrates might actually cause you to   lose some weight and even some water weight. \nOver time, you're actually going to increase   your cortisol levels. And your circulating \ncortisol levels have a lot to say about body fat,   particularly stubborn body fat. If we can decrease \nour cortisol levels by actually still having some   carbohydrates in our body, not only are we \ngoing to help to not have this effect happen,   but more importantly, as I said, we're going \nto maintain our sanity. Guys, carbohydrates do   tend to be foods that we crave, however, we can \ncertainly approach them more responsibly. Here's   why I always recommend to have a 2 to 1 ratio \nfrom the fibrous carbohydrates to the starchy   carbohydrates. If you're not sure what those \nare, you can always head to athleanx.com/carbs   to see a complete list of these two categories.\nFor example, rice or pasta or baked potatoes or   sweet potatoes, I m not asking you to take them \noff your plate entirely, just have less of them.   And the easiest way to do that is to first fill \nyour plate with more of the green stuff. Right?   The spinach, broccoli, asparagus put twice as much \nof that on your plate as you would the starchy   carbohydrate and not only can you enjoy them, \nbut you're not going to have the caloric impact,   the density of those carbohydrates in particular, \nthat will tend to keep you in that hyper caloric   state that's going to keep the body fat \non. You get to keep them on your plate,   you get to keep your sanity and you get to get \nrid of those love handles once and for all. \n  And so, again, we're not talking about something \nthat's really complex, but it does require some   consistency and that's what might be challenging. \nBut I will tell you this, it will work every   single time if you follow what I'm saying here. \nSo, as you start to see those early results, even   maybe you're starting at a 70/30 split, that's \ngood. As long as you're going down 70/30, 80/20   towards 90/10, you're going to start to see those \nresults that will keep you inspired and going.\n  Now, that being said, there's another side of \nthis equation here and that's what you're doing   with your body, right? What are you doing in terms \nof the output? The inputs, taking care of what you   eat, but what are you doing in terms of your \nexercise? And there's three different things   I like to focus on here. The first one is, what's \nthe style of your training? Now, if your main goal   is to lose body fat and you're doing bro splits \nor you're doing even push pull legs, which I love,   I might argue that you're following the \nwrong training approach right now. \n  Now there is something you can do that would \nactually give you more bang for your buck and it's   called Peripheral Heart Action Training or PHAT. \nAnd it's actually something that Bruce Lee used   and even Vince Gironda has used also. Now, what \nwe're talking about is a combination of compound   exercises done in sequence but rotating around \nyour body. So, you do an upper body exercise,   they do a lower body exercise. You go back \nto an upper body, but maybe this time it's   a pull exercise rather than a push. And you keep \ngoing in sequence with no rest in between. Now,   the weight that can be used is one that could \nactually be challenging to your muscles. So,   you can start building muscle via the metabolic \nstress route. That's a good thing because the   more muscle and lean muscle tissue you put on at \nrest, the more calories you burn, the easier time   you have getting into that hypercaloric state. \nThe number of rounds that you do here is something   you can build up to, starting with even one or two \nand going up to maybe even six or seven. But the   fact is some training approaches are better \nthan others when caloric burn is your focus   and when you're looking to lose those love \nhandles, especially that stubborn last bit of fat,   this one might be the best one for you. But \nit's not just the type of training you do,   but also the exercises that you select. Because \nyou might say that, hey, it sounds pretty familiar   to hit training what you just described, a \nseries of exercises done in sequence with very   little rest in order to burn more calories. \nHowever, the difference between, let's say,   peripheral heart action training and hit \ntraining is the exercise selection.\n  Choosing more of the compound-based exercises \nthat allow you to build muscle. Because we   know that even though the exercise is performed \nduring a typical hit workout might be calorically   slightly more expensive. Maybe they allow \nyou to burn 15 calories versus the 10 and   some of the more compound lifts you are still \ngoing to have the benefit of the added muscle   mass that you can build through the \nfat training that's going to help you   at rest long after that hit training workouts \nover. So, calorically you're going to wind up   burning more calories anyway.\nAnd as an example of this,   you can look at exercises like an Overhead Press, \na Front Squat and then maybe into a Barbell Row,   right, and into a Curl. And you don't have to keep \nthe weight the same here during this training,   this is not a complex. You can switch out the \nweight so that's always something that's going to   challenge you because we do want to rely on \nthat metabolic overload to help you to build   more muscle tissue. Just remember, though, that \nthe exercises themselves are what's key here,   and making sure you choose the right ones is \ndefinitely going to be important when you re   looking for that bigger impact to help you to \nget down to those lower body fat levels. \n  And even though these workouts will \nallow you to hit the big muscles,   we still have one we haven't talked about, but \nwe have to, if love handles are your problem   and it's the obliques. And some might misguide \nyou by telling you that training the obliques   is just going to thicken up your waistline. \nI've said this before, guys, the only thing   thickening your waistline is the body fat that's \nlaying over the top right now. When revealed,   because you can get those body fat levels down, \nthe obliques look amazing. They actually do   the best job of all the muscles in creating that \nthinning and tapering effect to the waistline.\n  So, we have to train them. But how will I \nrecommend a few different things? Number one,   you have to learn how to rotate your torso in \nspace. See if you do an exercise like the Russian   Twist and you're just tapping your hands left or \nright, you're not really rotating your torso. You   have to row your arms and elbows back side to \nside to make sure you're turning your shoulders   in space in order to train that muscle more \neffectively. Might be the first time you ever do   it if you've been tapping your hands all along. \nOr you do an exercise like the bicycle crunch,   another standard exercise, but oftentimes done \nincorrectly too. And it's because you're just   flipping your elbows back-to-back, but not \nrotating your shoulders through space. \n  But it also wants you to get up on your feet, \nbecause I know that there's benefits to be had   there, too. And any of the resisted rotation \nexercises are going to be really effective   for not just hitting the external obliques on one \nside, but also the internal obliques when you turn   to the opposite side. And of course, I want to get \nyou up on the bar or beginners down on the floor,   but with the intention focus of contracting first \nwith the obliques. A lot of times we let the abs   take over because we rush through the reps. \nInstead, go really slow and focus on getting   that rotation of the pelvis. And if you do that, \nguys, you're going to get better activation of the   obliques and ultimately as that body fat level \ncomes down a way better looking waistline. \n  So how much of this oblique work we talking about? \nWell, ideally, if you could do a little bit every   day, it will go a long way. That being said, even \njust one or two oblique exercises is enough to get   the job done. If we can, however, figure out other \nways to incorporate it into the other training   we're already doing. Then we're ahead of the game \nand these are where things like the carry or even   a suitcase lunge, right? Other exercises that will \nchallenge that lateral core stability, will allow   us to get more of that volume that's going to pay \noff the big dividends as you drop that body fat   and almost sort of sneak it into the work you're \nalready doing. So not a lot of extra work to do,   just making sure you're getting your work in. \nAnd then the cardio part of this and a lot of   people will put this first, but as I said before, \nit's not where you want to start. But it doesn't   mean that it doesn't play a part and help you \nto get rid of the love handles and particularly   the stubborn fat. Because a lot of us have \nactually probably heard about fasted cardio   and how important it can be in terms of dropping \nbody fat. And the truth of the matter is, it may   not be all it's cracked up to be. While some may \nswear by it, others have actually pointed to the   research that shows that it's kind of a net-net \nwhen it comes to losing body fat. Because though   you might be burning more fat during the session \nwhen fasted, you burn less fat afterwards.\n  If you're going to do it in a fed state, you'll \nburn more carbohydrates, but you'll have more   fat burning after the fact. However, when it comes \nto that stubborn body fat, those last few pounds   that you can't get off, and again, when that fat \nis around the waist for guys that lasts to come   off area, this is where fasted cardio might play \na bigger benefit. So, if you want to explore the   option guys, make sure you do, but not exclusively \nand don't put your hopes too much on it being the   big difference maker. Remember what you put in \nyour mouth is always going to be the biggest   difference maker, this is just going to add to \nthat and make things a little bit easier. \n  And speaking of easy, the easiest thing \nto do when you're not seeing features else   is to quit. But when it comes to these stubborn \nareas of body fat that sort of hang around,   you've got to be willing to persevere. And here's \na perfect example of that, and that is somebody   that followed our Athlean-X program. You can \nsee that after the first phase, he dropped   the significant amount of fat in the face and the \nneck, even in the upper abs area, but not around   his waistline, not in the love handle area. And if \nhe had quit at this point saying, you know what,   I'm lean, but it seems like I'm always going to \ncarry this area around my waist, he never would   have saw these results. And this is what happened \nwhen he continued. And this is finally where those   love handles went away. But again, they don't \nget the name stubborn for a reason. They're   there because they do take that consistency of \neffort. But if you put in the work and you do   what I'm showing you here, I promise you those \nresults are going to be there for you. \n  If you're looking for a step-by-step planning \nguys, you can find them over at Amazon.com. If you   found the video helpful, make sure you leave your \ncomments below. What else can I help you with?   I'll do my best to do that in a future video. \nAlso, guys, make sure you click Subscribe, turn   you re your Notifications so you never miss the \nnew video when we put one out. See you soon."
}