{
    "id": "3aaHRjbkWlA",
    "title": "Sneaky PULL UP Trick - A Legit Way To Build A Bigger Back FAST",
    "description": "Increase Pullup Strength - http://athleanx.com/x/sneakypullups Do you struggle with the PULL UP exercise? Do you feel as if your ...",
    "transcript": "Hey guys, what's up? It's Jeff Cavaliere here back from athleanx.com. One thing you probably realize or maybe you\ndon't is that the best piece of equipment that you can use to get stronger, to build\nbigger muscles and to stay ripped is your own body. Now one thing that I think people are forgetting\nis that some of the bodyweight movements that you do are difficult. Sometimes people have a difficult time doing\npushups, pull-ups seem to be the hardest thing to do... but does that mean that you can't\ndo pull-ups? Absolutely not. You don't wanna shortchange yourself and say\nthat you're gonna leave pull-ups out of your program, because you will be shortchanging\nyourself in the results department. I'm gonna show you today ATHLEAN-X never leaves\nanybody behind. I'm gonna show you anybody can do a pull-up\nwith something real simple, it plays off on the last video that we did...the one-arm pushup. These bands, which I love, the jump stretch\nband, I hang them over at the top of the squat rack. I pull it down, so I have a loop. Now I can just use one, but I'm gonna actually\npull this all the way down, put my foot right in the center and then straighten out my leg. Now, if you see what it is from the front,\nI've got myself an assisted pull-up. I'm gonna lower myself down, come on up. The resistance on this band is outweighing\nme probably about 50%. So do you need to go to the gym and get on\none of those assisting machines or do you need to go buy one of those assisting pull-up\nmachines? No, absolutely not. You just need one little, simple band and\nany bar you can hang in your doorway. It will allow you the strength to do a full\npull-up, so you can start to get the results that you want that that great exercise can\ngive you. Now you can go so far as a one-arm pull-up,\nwhen you have the assistance of the band. This is hard... I mean, I would never be able to do a dead\nhang one-arm pull-up without this. I can try, but I can't. I can do it, if I hold on to my other arm,\n'cause I have a little bit of extra support. The concept is...if I were to do a bunch of\nsets of these assisted one-arm dead hang pull-ups, eventually I would be able to get myself to\ndo that one-arm dead hang pull-up. So don't get stuck, don't get left behind. Get on the ATHLEAN-X program today, let all\nthese tactics I use help you get the best body you can get in the next 90 days. And don't be confused about all these other\nprograms that sort of have a tendency to forget about you out there, that can't make you do\nevery single exercise. Guys, stay tuned...I've got some really great\nnews coming up in the next week or so about the ATHLEAN-X program. You're gonna want to be on board when you\nhear all this, but until then get in shape, have a great weekend. I'll see you soon!"
}