{
    "id": "3h1TVVwXabc",
    "title": "How To Fix Your Deadlift (5 RED FLAGS!)",
    "description": "If your deadlift form just doesn't look the way it should, you need to watch this important video. There are 5 red flags that can ...",
    "transcript": "What s up guys, Jeff Cavaliere, athleanx.com. \nJesse Lacio, athleanx.com.\n  You could stay down here, I'm a little bit more \ncomfortable down here with you down here. \n  Oh, the shorts? \nYeah. So today we're going to talk about   the deadlift and maybe your deadlift doesn't look \nthis bad, but when you do it, you've recognized   the fact that there's something wrong here, right? \nEither it doesn't look the way it's supposed to,   or you're getting stuck at some point in the lift. \nSo what I've done for you today as I put together   five red flags that are going to define for you \nthe muscle weakness that is causing the problem   that you're having right now. You see, only two \nthings cause problems in the deadlift either you   learn the wrong form and simply ingrained that \nover time by adding more and more weight to the   bar on a foundation that was weak in the first \nplace. Or you just don't have the muscle strength   to do the deadlift right. So for that, guys, we \nneed to start where we always do, and that is \n  With a Jesse intro. Run it. \nNo, no, no, no. \n  In a world where people pick things up and put \nthem down. There's one man who picks things up   and puts them down better than the \nrest and still has an eight pack. \n  Listen, two things, number one, \nyou're insufferable. And number two,   I got to give you props, that was \nactually a really good lift. \n  Thank you, I appreciate it. I \nowe a lot to your coaching. \n  Well, thank you. Can we get \nback to the video now? \n  I guess.\nSo, we have to start with guys   the ability to actually hold on to the bar and \nthat means what is your grip strength like? \n  A good grip is imperative to having a good \ndeadlift because if you don't have a good   control of the bar, well, things like that \nare going to happen. So we need to fix that.   In order to strengthen our grip there are a \nfew exercises that I really rely on the most.   The first is the Weighted Pullup and not only \nis this a great back strengthening exercise,   but it does require that you have grip strength \nto be able to hold on to that bar when you have   additional weight strapped around your waist. But \nif you don't have, let's say, the back strength   to perform the exercise but still want to see \nthe benefits of the extra added grip strength,   you can simply do a Weighted Hang. Here, you're \nnot having to pull up, but you do have to have   good shoulder stability, which is another benefit \nthat's going to carry over into the deadlift.   The last exercise you could do is certainly the \nCarry, which is one of my favorite exercises for   a lot of different purposes. But you can easily \nmix it in to either the strength training portion   of your workout or into the conditioning \naspect of any workout program you're on. \n  So let's say the grip is good, but now you \nstruggle because you can't break these plates   off the ground, and to do that, you're going \nto want to have strong quads. That's right,   when you do the deadlift, pulling from the ground \nreally means you need to have strong quads to get   it off the ground to break the bar off the ground. \nI talk about it all the time, the deadlift is a   leg exercise to start, at least to the level of \nthe knee. Think of it as a Standing Leg Press   and to do that, what we need to do is be able to \nstrengthen those quads. So the best way to do that   is to make sure you're doing the right exercises \nand your other parts of your workout. \n  And for that, we're talking about a Front Squat. \nWe know the Front Squat gives us that preferential   ability to hit the quads a little bit more so than \nthe glutes in the traditional squat. We also have   a Bulgarian Split Squat, which does not only a \ngreat job of giving you a chance to target the   quads better, but to do so in a unilateral way \nto expose any imbalances that might exist right   or left. And we also have a Reverse Lunge, which \ncan be done with either dumbbells or a barbell,   as seen here. Being able to maintain that \nupright torso shifts that load once again,   just like in the Front Squat to have that \nstrength to be better able to pull that   bar off the ground. But it doesn't stop there \nbecause in order to break the bar off the ground,   you have to be stable in the first place.\nAnd that all comes from up here. And that is   by having strong lats and a strong core. Because \nyou need to create the tightness through the body,   through the body to be able to perform the \nlift efficiently. So the first thing is these   lats over here, can you pin your arms down to \nyour side? While we have an exercise for that,   the Straight Arm Push Down and the best way to do \nthis is either as a traditional sternum push down,   we were really trying to get your elbows tight \nto your sides and down as far as you can.   Or you can mimic more the requirements of the \ndeadlift and perform asymmetrically like this,   which becomes more challenging as you \nstand up. That bar wants to drift away,   and you have to have that isometric strength in \nplace. But whatever you do, make sure you're doing   some version of the Straight Arm Push Down.\nThe second thing is the abs the core,   and that also needs to be tight and what \nwe do. There is some version of a Carry,   preferentially a Unilateral Carry. When you \nhold that one heavy dumbbell on your side,   you're challenging your pillar strength and your \ntorso to be able to maintain an upright posture.   And though you're doing a bilateral balanced \nmovement here on the deadlift, you still want   to have the ability to keep a rigid, tight \ntorso throughout the entire lift. If you want,   you can do it overhead variation as well.\nWith the arms up overhead, you're introducing   a bigger challenge because of the momentum arm \nincrease. Either way, incorporating them is going   to help you to build more of that strength \nthat's necessary for your core to help and   assist you to maintain the tightness, to get that \nbar going off the ground in the first place.\n  So let's say you can get the bar off the \nfloor, but then you struggle at that point   when I'm talking about is from here to here \nto and through the knee, not lockout out, but   just in that area from here to here. Well, that \nbrings up red flag number three because again,   we have to look at the weaknesses that are putting \nyou in this position in the first place. And the   muscles that are responsible for this are going \nto be the hamstrings here and more importantly,   the low back. But we have to choose the right \nexercises to do this because we don't want to   necessarily train the hamstrings from a \nflexed knee position, but more so from   a flexed hip straight knee position. Allowing the \nhamstrings to focus on that secondary role of hip   extension. So we're looking at exercises like the \nRDL, and not only does it share deadlift in its   name with the deadlift itself, but also shares a \nlot of the same muscle responsibilities in terms   of the hamstring activation. We could also take \nthe deadlift again and perform it with lighter   weights and a deficit deadlift fashion, increasing \nthe range of motion of the exercise, which is   going to increase the activation of the hamstrings \nin their participation in the movement.\n  And of course, we have to dynamically work the \nlow back here too, and my choice exercise is the   Weighted Hyperextension. And what this is doing \nis allowing you to put a weight across your chest   and allow the hamstrings to operate again out \nof this elongated state. We're focused on the   hamstrings as hip extensors because that is what \ntheir role is during the deadlift. And of course,   the deadlift is a compound exercise, \nso it's not just to muscle groups,   the hamstrings and lower back contributing in this \npart of the lift. We have those stabilizers that   have to be addressed to and for that, once \nagain, the lats and now the traps from lower   to middle and upper stability is incredibly \nimportant, especially important in this part   of the lift. To and through the knees is going \nto demand that you have good thoracic extension,   ability and strength. Think about it. You've \nseen people cave in through that thoracic spine   because they're succumbing to the \nweight of the bar in this position.   They don't have full glute participation here \nyet. That's going to kick in next. So they're   succumbing to that extra weight and load. You \nhave to strengthen this as much as you can, and   that Strait Arm Push Down will do just that. \nBut when it comes to the traps, we can work our   way from top to bottom. The heavy shrug is a \ngreat exercise for building up the strength of   your upper traps and for supporting that bar and \nthe weight of that load as you start to lift it.   The middle traps are going to respond best to \nsomething like a row done at a better position.   In other words, don't allow your thoracic spine \nto round at all when you're doing a row. Make   sure that even if you have to use slightly \nlighter weights, you're performing them with   really good thoracic strength, meaning either \nneutral or slightly extended if possible. \n  And of course, we can work those lower traps with \nsomething as simple as the Face Pull with the   overhead element added at the end. All of these \nare going to provide more stability and rigidity   here so that you don't succumb to the weight of \nthat bar. Because again, you'll see it even as   people start to approach those really extreme ends \nof their one rep max. They just can't offload that   because this area will never be stronger than the \nway that bar that you have there. But the better   you can fortify yourself by strengthening it, the \nmore efficient this lift will become, and you'll   be performing correctly and properly through \nthat to and through portion of the deadlift. \n  And that brings us to red flag number four, \nthe inability to lock out the lift. And it's   the most frustrating part of a deadlift because \nyou've done all the hard work, you've just got   to get those hips all the way through. And this \nis the part that we're talking about from here   to here. We're only talking about a matter of a \ncouple inches. And again, it seems like all the   hard work is done, but some people will really, \nreally struggle here. And your problem is glute   weakness and once again, low back contributing to \nthat final portion of the lift. But what can you   do? Well we've got to make sure that we're working \nthe glutes this way. If you can choose exercises   that train the glutes in this anterior posterior \nmotion, you're going to have a better opportunity   to nail this lockout. And the exercise I love \nhere is the Pull Through, and this is going to   isolate that hinge element of the deadlift, \nallowing us to use the glutes as the main driver   through that final stage of hip extension. \nAnd we can maintain those hinge mechanics,   but make the exercise a lot more explosive with \nsomething like The Swing. You're just going to   want to make sure that you use heavy enough weight \nhere. So you're not making this a conditioning   focus exercise, but one that's going to have \nbetter carry over to the deadlift itself through   the heavier loads. If you want to go really heavy \nand really work on getting through that final   portion of hip extension, then the Barbell Hip \nThrust is another great exercise to do. And again,   don't shortchange your range of motion here \njust so you can look good on Instagram with   a lot of plates on the end of the bar, you want \nto make sure that you're finishing fully through   hip extension to get the best benefits. And we \nmentioned the Weighted Hyperextension before   being a good way to recruit the hamstrings into \nthe deadlift at that lower portion of the lift.\n  But if we simply allow that to carry up an extra \nphase here to knee flexion and most importantly,   full glute extension, the Glute Hand \nRaise now becomes an amazing way to   train all these functions and to tie in \nall the functions with the low back. \n  Well, that looks comfortable. \nWell, it certainly is. \n  All right. So let's say that you have everything \nin place. You've got a strong grip. You can rip   that bar off the floor. You've got the strength to \nnot just take that bar to, but through your knees,   and you can lock out that bar like a champion at \nthe top. But you have red flag number five and   that is bad form. If you want to fix that, guys, \nI put together an official deadlift checklist   everything you need to know about how to perform \nthe exercise right every single time, you're   going to want to watch that video over here. \nAnd of course, as always guys if you re looking   for a step-by-step plan to build your best body \nwhile putting the science back in strength,   you can find them all over at athleanx.com. \nMake sure you click Subscribe and turn   on your notifications, so you never miss a new \nvideo when we put one out. See you soon!"
}