{
    "id": "4EkKhkSNjWY",
    "title": "The PERFECT Forearm Workout (Sets and Reps Included)",
    "description": "The perfect forearm workout should consist of exercises for not just wrist extension and flexion but other important forearm actions ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re talking about the forearms and\nwe’re going to construct the perfect forearm workout. As always, we’re using science and anatomy\nto backup what we do. If you want to put the science back into strength\nit takes one look at the forearms to realize there’s a lot going on here. There are a lot of muscles interplaying to\ncreate the different actions of the forearm. It’s not just about wrist curls and wrist\nextensions. As a matter of fact, if you’re doing your\nwrist curls like this, and your wrist extension like this, you’re leaving some gains on\nthe table. I’m going to show you what you can do to\nimprove those actions. Then, of course, you’ve got to add to them. Why? Because there are different functions here\nof the forearm. You could see that just by creating different\nmovements of the wrist I could activate different areas of the forearm itself. If I did this – this is called owner deviation\n– you can see there are different areas of the forearm that work to create that. Same thing here. If I were to go in the opposite direction,\nradial deviation, you can see a distinct area of the forearm that creates that action. We can also see if I involve just my wrist,\nI get a certain level of activation in the forearm, but if I start to involve the finger\nflexors there is a whole other level of activity that goes on. If we go here, into pronation, we can see\nthat we get a response on a certain area of the forearm. Why are we focusing on a couple of motions\nwhen we have to include all of them? I’m going to make it simple for you, guys. I’m going to include all the things we need\nto do in the right amount, and we’re going to walk you through it step by step. So, let me take you through each of the exercises. And as always, in our perfect workouts I’m\ngoing to give you the sets and reps to do the entire workout at the end. Let’s start to construct this perfect forearm\nworkout. we’re going to start with these wrist curls\nand what to do instead because I know I’ve probably raised some eyebrows when I said\nthat this wasn’t necessarily optimal. Doing your curls like this. There’s a reason for that. There are actually two. The first is that we know when we start to\nfatigue that our bodies are masters of compensation. They’re going to find a way to perform the\nmovement, even if it’s not necessarily the way you want to perform it. So, if you start to fatigue and lose the ability\nto curl your wrist up, guess what happens? Your biceps are in a perfect position to take\nover. It’s not what we’re looking for when we’re\ntrying to build bigger forearms. The biceps are just trying to raise the bar\nup to do the job the forearms can’t do. You might say to yourself “Well, I’ve\nheard that if I go behind my back, I could take the biceps out of it and we can curl\nand perform these the right way.” Not necessarily, guys. You might even say if I go down to the bench\n– and I’ve done tons of these – that this is better, too. You can see the biceps are taken out of it\nhere as well. So, I’m on the right track. Guys, you might be on the right track, but\nyou’re on the right train because this is not necessarily fixing the bigger issue here. The bigger issue is: what happens in all of\nthese gravity loaded exercises and variations of the forearm curl? We’re allowing, as we start to fatigue,\nthe bar – maybe even purposely – allowing the bar to sink down into these distal fingers\nof ours. All the way down to the distal metacarpals. That is a lot of load and I put an entire\nvideo on how that is the number one cause of medial elbow pain that we deal with. It’s how we grip the bar, it’s how we\ngrip bars during rows. But when we do forearm work it gets magnified\nbecause we tend to train our forearms more regularly throughout the week. Especially if they’re a weak point of ours. We’ve been told we could train them three\nto four times a week. What we have in all of those variations is\nthe sinking of the bar into these distal fingers here. That’s going to overload an stress that\nmedial elbow, causing medial elbow pain. Even if I do the reverse barbell curl you\ncan see that I still have the same effect. That bar starts to roll deeper into the fingers\nas I start to fatigue. So, in order to counteract that, there’s\na better way to do this. And I do this right here with a cable machine. You can immediately see I’ve bent my elbow. I’ve taken the biceps out of this. I’m now pushing away. The other thing that’s happening here is,\nas I’m pushing away, not only am I getting a more intense contraction of the forearm\nmuscles that you’ll feel the second you try this – you don’t have to use a cable\neither. You can use a band. The fact is, you’ll get a more intense contraction\nand as I push down with my wrist I’m allowing the handle to sink deeper into the palm, as\nopposed to into the fingers. This will take all the stress off the medial\nelbow. If you were to do these three to four times\na week it will allow you to train the forearm curling function without having those detriments\nand those negative side effects that can go right to your elbow, preventing you from wanting\nto train your forearms at all. The perfect forearm workout would not be complete\nwithout carries. You’re going to be doing a lot of them and\nthere’s a reason for it. The forearms also very much require to have\nendurance capabilities and have the capacity to be able to grip and hold for a long period\nof time. Not just because we use them constantly throughout\nthe day, but we also know if, God forbid, we were in a survival situation we’d want\nto be able to hang on and hold on for the duration. So, we’re going to train them with a set\nof carries in between every, single exercise we do in this workout today. Walk one lap around, come back around, do\nanother set, and repeat. When we come back to the carries, we’re\ngoing to end with the ultimate test of muscle endurance in our forearms, the arm hang. But for now, work your carries in between\nevery set, on every exercise you do in this workout. Let’s move onto the opposite side of the\nforearm: wrist extension. We know it’s critical. We talked about, in the beginning, I said\nthis isn’t necessarily the best way to do it. There’s a reason for that. We should know by now, when we look at the\nphysics of the performance of this exercise we know when the hand gets up to the top into\nfull extension gravity is acting down through the wrist, and there’s less force here than\nthere is when gravity is acting perpendicular to the wrist. So, we’re taking tension off the forearm\nas we get closer to the top. We could fix that by performing this standing. If we do this standing – the other way we\nwould want to do it is with this opposite roll. So, what I’ve done before, I’ve shown\nyou guys, I’m extending this wrist back on the right side to come up. You can see that even at its peak into full\nextension I’m still completely perpendicular to the force of gravity. Meaning, my forearm is doing a lot of work\nto hold this. Then I rotate the opposite side. So, I start to go left, right, left, right. What I do is, I want to work this in a ladder\nstyle because I have another opportunity here. If I’m in this standing position I could\nwork another muscle of the forearm, the brachial radialis, that comes in here, into our forearm. So, all I have to do to do that is a reverse\ncurl. So, I can go in a ladder format. I can go one second here of roll, and then\none rep of a reverse curl. Two seconds of rolls, and then two reverse\ncurls. Three seconds of rolls, and then three curls. I try to work my way up to a ladder as high\nas I can until I reach failure. What do we do next? Pick up those dumbbells, we do our carry all\nthe way around, back to the spot, and we do one more set. Next up we have radial deviation and ulnar\ndeviation. For some of you guys, you’ve never even\nheard those terms. I’m telling you, for a complete and perfect\nforearm workout you need to work on these things because there’s a reason for them. What we’re talking about – radial deviation\nand ulnar deviation – is how the wrist bends in this frontal plane. It’s not just about flexion and extension\nlike we talked about. It’s also being able to bend this way. So, when we come toward the radius, the top\nside bone in our forearm here, that’s radial deviation. Then we go down toward the ulna here, the\nunderside bone of our forearm, that’s ulnar deviation. You can see when I do radial deviation here,\nyou see the activity of the muscles of the forearm. So why are we not trying to train in that\nmotion? Even though it’s small, we need to work\non it. And you’ve probably seen people recommend\nthings you can do for this before. Like, using a sledgehammer. And they hold the sledgehammer down at their\nside to work on radial deviation. They lift the weighted part up in this way. Now what we do is work on the way back. For ulnar deviation we flip the sledgehammer\naround and we lift back that way. Now, the problem is we don’t all have sledgehammers. So, what do we do? We can do something in the gym with a rope. All you’ve got to do is take the rope from\nhere, down to here. Take one handle and stand up nice, and close. Put your hand down at your side. Now, because you can torque your hand off\nfrom the bottom here with a rope, we’re going to go down like that. So, we go from neutral, or a little bit of\nradial deviation, down into ulnar deviation. Just like that. Nice, and slow, and controlled. You do a set of these, you walk around the\ngym with your carries, you come back, do another set. Obviously, each arm. Then we come back and rotate around this way. Now when we’re here, we take the grip on\ntop from here. Now, we’re going to work radial deviations. From here we’re going to push with the pinky\nside of our hand, down into that rope to push the weight down and go into radial deviation. You can see each time. Push down through the pinky, there, and you\nget into radial deviation, and come back down. So basically, this end is facing down toward\nthe ground and then you want to end with it facing out in front of you. Again, guys, we work both sides. We’re going to walk around the gym, as always,\nwith another carry, come back, and move onto the next exercise. Now, supination and pronation. Guys, this is not the way to do it. You see people do this all the time. You’re actually falling into pronation here\nand falling into supination because the weight is spinning in your hand. You’re not resisting that motion. But we can do that. once again, you go back to the rope to do\nthis. So now, if I wanted to get into pronation\nhere what I do is hold the rope this way, and now I’m going to use it again this way. I’m pushing my fingers here into the rope\nto pronate my forearm. Just like this. From here, from a supinated position, turn\nthe forearm over, push out with this finger into the rope, and I’m getting that resisted\npronation on every, single rep. You can see that here on the underside of\nthe forearm as it works, as I go down into pronation from here, every rep. What you want to do is work this to failure,\nand then of course, walk around the gym with your carry. Now you come back and go the other way. If I want to do supination here, what I do\nis take my hand out to the side and now I’m going to go and try to turn this into the\nposition facing out, back toward the machine. You can see all the forearm supination here\nthat takes place to get that there. Now, we know that the bicep is obviously a\nsupinator. But it’s not the only one. We’ve got a supinator muscle in our forearm\nthat you can see working to accomplish this. That’s what we’re trying to do. I’ll tell you guys, these muscles aren’t\never trained in a way with resistance. Especially if you were doing that dumbbell\ntwirling exercise. So, they’ll respond pretty quickly to this\nextra resistance to add size to your forearms. So, we want to make sure we do that. All right, guys. Almost done, but we now want to work those\nintrinsic hand muscles that I talked about, then we’re going to finish with that final\ntest – that grueling hanging test – to put those finishing touches on this workout. Now we move onto intrinsic hand strength. You’re probably wondering “Why does that\nreally matter? We’re talking about my forearm, Jeff.” You saw in the very beginning here, the activation\nof our fingers dramatically influences what goes on in our forearms because all of those\ntendons and muscle bellies run down through the forearms into our fingers. So, we want to work that. The cool thing is, you can do it with a collar. You probably think “Well, I don’t have\nthose old rippers anymore.” Yeah, you do. You can take one of those collars from the\ngym and you can do your hand squeezes here. What is that doing? Well, it’s obviously taking these fingers\nand moving them from this straight position here, into this flexed position. So, we know we’re getting activation of\nthe forearm. But to integrate that, what I like to do is,\nI like to do sets to failure here, and then once I’m done, back off. Back off the tension because you’re not\ngoing to be able to do this if you hold full tension. You take it just a little bit of tension now,\nand then I go and move my wrist into extension, and down into flexion. Into extension, and flexion. Extension, and flexion. Flexion, being able to still hold some tension\nthrough here, gets very difficult because of active insufficiency. Once I shorten these flexors in my forearm\nit gets hard to maintain force through here. But that’s what I’m trying to work on. I’m trying to maintain the ability to contract\nand generate force, even in a shortened stated. So, I have a little bit of tension. I go back and forth into extension at the\nwrist and flexion until I can’t do it anymore. So, it’s basically a drop set burnout. Go failure on the squeezes, and then failure\non the back and forth until you can’t control it anymore. You’re going to do that on each side, again,\nwith your carry in between each one. One last final, grueling test to put the finishing\nnail in this coffin, guys. We’re doing the arm hang. You guys know how much of a fan I am of the\ndead arm hang. What we’re doing here is trying to hold\non for as long as we can. Now, in a good situation, fresh, 1:40 is a\ngood time. It’s a good, average time. What I’m looking for here is, can you hold\nfor one more minute? Obviously, you’re going to want to start\nsliding out. The bar is going to start to slide into your\nfingers. Try not to let that happen for all the reasons\nwe talked about in the very beginning about not wanting that bar to slide into those distal\nfingers because of the stress it puts on the elbow. Really squeeze. Really hold. Activate the forearms. Try to gut it out for one, final minute at\nthe end. So, guys, there you have. There is the perfect forearm workout. As you can see here, all the sets, all the\nreps, all the techniques. It’s not meant to be a five-minute forearm\nworkout. If you have problematic forearms, if you are\nsuffering because you don’t have adequate strength there, if you don’t have adequate\nsize; you’re going to need to train them, just like any other muscle. That means you’re going to have to take\nownership of this program and start incorporating it into what you’re doing right now. If you’re looking for a complete program\nthat overlooks nothing in our training and lays all these out step by step, so we make\nsure we’re hitting everything when you’re supposed to; all our programs do that. They’re over at ATHLEANX.com. In the meantime, if you liked this series\nmake sure you subscribe to our channel here and turn on your notifications, so you never\nmiss one of the videos in this series. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the days and weeks ahead. All right, guys. See you soon."
}