{
    "id": "4iXRhYlivdI",
    "title": "6 Forearm Exercises You Can Do Anywhere!",
    "description": "If you want to build big forearms and want forearm exercises that you can do anywhere, you are going to want to pay attention.",
    "transcript": "So the secret to getting bigger forearms anywhere,   it's going to require that you focus your \nattention in one spot and that's right there. \n  What s up guys, Jeff Cavaliere, athleanx.com. If \nyou want complete arm development, you're going   to have to train your forearms. And I've shown \nyou many ways that you could do this before,   whether you have access to a pull up bar, some \ndumbbells, a barbell or even a plate. But what   if you have access to none of those things \nand still want to work your forearms? \n  Oh, I know what I do, but I guess if that \nworked, I'd have massive forearms by now. \n  No, actually Jesse, that would just give you a \nbunch of muscle imbalances. What I'm going to   show them instead is three exercises they could \ndo with just their own body weight and three   they could do with just a single backpack. \nSo if you want to build bigger forearms than   anywhere, you're going to need one of these. \nIt's a muscle marker. Well, actually, you're   not going to need it. But what it's going to do is \ngoing to help me to illustrate what you should be   focused on because this is a bodyweight exercise \nthat's going to help you to build bigger forms.   What we do is we take that muscle marker, and we \ndraw a line right there across our knuckles. And   this is something that was actually shown to me \nby Team USA Olympic gymnast Jonathan Horton. \n  All right, so how do you do this? Well, with \nmy hands here, what I have to do is focus on   getting a bend through that portion of my hand, so \nI'm going to push down through my hand that way.   But what you can see is what's happening at the \nwrist, it's going from an extended position here   to a neutral position when I do that just \nby pushing through that line on my hand.   And of course, I want to have my \nbodyweight over the top of my hands,   so as I do this, I'm having to push through and \nagainst the resistance of my body weight to get   up in that position. Again, resisted flexion here \nas a resisted flexion here for the forearm. \n  What we can do, though, if this is \ntoo much for you, it's just sort of   sit back a little bit more. So don't be right \nup over the top but sit back. When I sit back,   I take some of the weight off, but again \nI keep my fingers down and I push through   the wrist right at that point and we work \nthe flexors on the side of the forearm. \n  Now that's the only work in this side of \nthe forearm, but what about this side? Well,   we've got an exercise we could do there too, \nand it's another one that was shown to me by   Jonathan, the gymnast. So what we do is we \ntake the muscle marker instead of keeping   the line here. Now our focus is right here. And \nwe're going to do is just basically put a dot   on the four knuckles right at the top there.\nNow we know in order to get into this side of   the forearm here, we need to extend the \nwrist, so we have to start from a flex   position. Now what we would do is get down this \nposition here. Now, if you don't have this much   range of motion at your wrist, I'm going to \nshow you something you can do that's not as   dramatic in terms of the requirements for range of \nmotion, but it shouldn't hurt, and you certainly   need to take this very slow. So what you do is you \nget in this position here, and all I'm going to do   is come up, extend and try to lift up through \nmy fingers. Basically, I'm trying to spread   my fingers into the floor, all right? But of \ncourse, with some of my downward body weight here,   it's going to be resisted, so I won't be able to \nget that far. But once I get up to there, you can   see I can see the dots on the back of my fingers \nhere, which means I've gotten where I need to go.   I go down nice and slow eccentrically. Every rep \nhere is controlled. I have the ability to actually   offload some of this weight that I am applying \nhere because I can either sit up higher or I could   sit down more into it. But again, if it feels \na little bit more challenging to me, I can just   simply sit up a little bit off of my butt, which \nis going to take some of that tension away. \n  But again, I go nice and slow down into this \nflexed wrist position, push down into the floor.   I'm extending, you can see the wrist extending \nhere work in the back side of the forearm.   Extend push through the fingers, try to spread \nthem through the floor. I can see the dots that   I made on the back of my hands there, meaning \nI've gone through the full range of motion,   and it will light up those extensions \nin the back side of your forearm. \n  Now these exercises have you excited to try \nthem out, or if you've already paused the   video and tried them out already, make sure \nyou leave your comment below and let me know   how you like them. Also, if you haven't done \nso, guys, make sure you click, subscribe and   turn on your notifications. That being said, \nI've still got a few more to show you. \n  So if you're looking for more forearm exercises \nthat you could do anywhere, I'm going to ask that   you broaden your horizons a little bit and get \none of these. You've now got something you could   do anywhere. All we have to do is zip it up. And \nthen, of course, grab the handle from the back.   And the first thing I like to do is just a simple \nreverse curl. So keeping my arm here at the side,   I'm going to lift up and come down.\nThis works the brachioradialis,   the muscles that kind of pops out right in here. \nAnd again, with the forearm pronated here in a the   thumb and thumbless grip, I'm really focusing on \ngetting my arm into this flex position, which is   going hit the brachioradialis. But also keeping \nthis extended position or slightly extended   position here to make sure I'm working all the \nmuscles there on the back of the wrist. \n  And of course, I don't have to stop there \nbecause I could do my classic wrist curls to   both underhand and overhand. And what \nwe do is we simply rest our forearm   up on our thigh like this. I put my heel up in \nthe air to give me a little bit more height,   which clears the bag off of the ground. And \nnow I do my wrist curls up just like this,   like you typically would do with a dumbbell. \nAgain, no dumbbell required here. Nothing   stopping me from flipping it over this way now and \nalso working the other side of my forearm here,   the extensors. Once again, keeping that heel \nup in the air to give me just a little bit of   extra added height to make sure that \nthat bag clears nice and freely. \n  And if you really want to expand your repertoire \nor forearm exercises, just jump up on one of   these. We know that the Dead Arm Hang is one \nof the best forearm exercises you could do   for building up the endurance and also \na little bit of that mental toughness,   because this could be a ball buster depending upon \nhow long you hold it here for. That being said,   I did commit to exercises you could do anywhere. \nWell, it's almost anywhere because we know that   you can grab a tree limb and do the exact same \nthing for the same benefits. The bottom line is,   if you're looking for complete arm development \nforum training, better be part of the plan.   As you can see here, a lack of equipment \nis never going to be a reason not to.\n  So remember, guys, there's a lot \nof ways to train your forearms--\n  Yes, there sure are. \n--real ways to train your forearms. Whether   you're using equipment or you're not, the bottom \nline is if you want complete arm development,   like I said, you're going to have to train your \nforearms one way or another. If you're looking   for a complete step by step training program, \nyou can get them over at athleanx.com. If you   found the video helpful, if you're going to \ntry these out, let me know how you like them,   you can leave your comments below. And also \nif you haven't done so. Make sure you click,   subscribe and turn on your notifications so you're \nnever miss a new video when we put one out. \n  Hey, I figured we d hang out together.\nOh God.\n  Get it? Hang out?\nThat's my cue to leave. That's my cue. See ya.\n  Come on, hang out together. \nI thought that was fun.  "
}