{
    "id": "4Nm0y_NfrE4",
    "title": "Xtreme Fat Burning Circuit - &quot;The Horrible Hundred!&quot;",
    "description": "http://athleanx.com/x/xtremefatloss The best fat burning circuit you can do will never be performed on a treadmill, elliptical, ...",
    "transcript": "[music intro] Hey guys,Jeff Cavaliere, AthleanX .com! Outside taken it out to the park for another\none of the Athlean Burst Conditioning Workouts. Now, I might have been a little ambitious\nhere, hoping for the warm weather. It has got a lot colder since I decided to\ndo this video out here, but we’re gonna give it a go. I call this “ The Horrible 100”. And what it consists off is travel in 100\nyards. So, I know you’re saying already, hey I\ndon’t have 100 yards to do this on, and what I show you can easily be applied to like\na 20 yards distance. So, I’ll tell you how to do that when we’re\ndone, but right now, all I wanna do is five exercises, 20 yards a piece, no rest and get\nto the end of the line, turn and swept back, that’s our circuit. We’re gonna do it three or four times, you’re\ngonna do it three or four times, I’m gonna demonstrate it once, ok? So the first one is bear cross. We just get down into a hands and knees position,\nthis right here, I draw force and we take off, doing bear crawl out, 20 yards…. Keep it and going… Keep it and going ….ok, we hit 20. Once we get to our 20 mark, we get down to\nalligator walk. Down low to the ground , one arm, one side\nat the time … walk it up…. [Alligator walk] I’m dodging the goose crap while I’m going\nthrough this  . Ok? We hit 20. We come up. Next, dear hops: out and to the side, out\nand to the side, out and to the side …. Ok. We have our 20. Back to the ground. This one I call walk the plank. Down in plank position, walking straight out,\n20 yards for your abs. Feel like a military crawl. Ok, last one, rotating squats. Step out, spin.. down…. Spin…. Down …. Hit the line, turn and  sprint back 100 yards. I’ll say that one for one second, again\nif you don’t have 100 yards to cover , go 20 on your first exercise, turn right around,\n20 to the other one back, 20 on the third exercise , 20 back for four , 20 yards back\nat five. Turn and instead of doing the straight 100\nyards sprint, do a 20 yards shuttle, back to back to back to back. Alright? So, I’m gonna take you guys out of here,\nwith one final sprint. You will repeat that two or three times. If you haven’t already guys, as you can\nsee that has just kicked my ass in a very short period of time. This is what Athlene burst conditioning is\nall about. This is what makes AthleanX training, what\nmakes the AthleanX training system, far more unique than any other choices out there. Is that you get result, a great workout series,\nand you don’t have to spend the whole day in a gym. I’ll see you guys next week, from another\nworkout. I’m out of here."
}