{
    "id": "4pET4k_vtI4",
    "title": "Home Dumbbell Workout to Get Jacked! (DUMBBELLS ONLY)",
    "description": "If you are looking for a home dumbbell workout to get jacked, then this is the video for you. It doesn't matter if you have a full rack ...",
    "transcript": "What s up guys, Jeff Cavaliere, Athleanx.com. \nToday, I'm going to show you a home dumbbell   workout to get jacked. That's right, you can \nactually build muscle with just dumbbells if   you know how to train properly with them. Now you \ncan also do this workout not just with a pair of   dumbbells, but with a single dumbbell. Because I \nrealized that not all of us have access to a full   rack of dumbbells. So what I m going to do is, \nI m going to show you the exact exercises to do.   I'll tell you the sets and reps to do \nand also the rest times, which will vary   depending upon how you're going to go about \ntraining in this workout. That being said,   it's time to just start breaking it down \nexercise by exercise. So let's get started. \n  So not only can this workout be done by anybody \nthat has access to even a single pair of   dumbbells, it's also going to hit your entire \nbody. The first four exercises here are going   to hit your shoulders, your arms, your chest, \nyour back and your legs, all in just these four   movements. From there, I'll give you some optional \nadditional direct arm work, and we put it all   together you've got one killer workout. So let's \nstart at the top. All of these exercises are the   first four are going to be done in sets of \nthree and about the six to eight rep range.\n  Now the dumbbells that you have allow you to \nfail within that range, that you've got the right   dumbbells. But what happens if you don't? If your \ndumbbell weight is too heavy, then you're going to   perform the single dumbbell exercise variation \nI'm going to show you. If your dumbbells are   too light, I would advise you to simply do the set \nuntil you reach failure and dramatically decrease   your rest time to increase the metabolic effect \nof the exercise instead. So let's start breaking   down the workout. I'm going to show you both \nthe single dumbbell variation here and also the   version that you would do with two dumbbells. \nWell, let's start with the single dumbbell.   Here we have the dumbbell clean up and over. \nAnd obviously, this is an explosive exercise   that's working our shoulders, our back, biceps, \nbrachialis, our legs, everything together, working   together. Clean the dumbbell up to one shoulder, \npress it up and overhead to the other side,   bring it back down to the floor and explosively \nrepeat. A helpful tip for those that might have   difficulty with the timing of this exercise, \nyou want to time the catch of the dumbbell   on your shoulder with the stomping of your feet. \nWhy? Because you need your feet to be in contact   with the ground to be prepared to already start to \nabsorb the weight of that dumbbell eccentrically,   to get you to be able to go back in \nthe opposite direction explosively.\n  So if your feet aren't on the ground already to \ndo that, you're not going to have the force in the   power that you need to drive that dumbbell up and \noverhead to the opposite shoulder. And you can see   if you had access to the appropriate weight let's \nsay, for a pair of dumbbells you could do here,   basically the clean and press one to each \nshoulder, dip down, press up and continue to   go. Again, working the same muscles, but different \noptions, depending upon what access you have. \n  Remember three sets of six to eight of these \nchoosing a weight that would help you to fail   within that range? Rest time in between sets would \nbe ninety seconds to two minutes if you had access   to a weight that was only capable of being done \nfor much higher reps. Perform them until failure   and simply drop your rest time down to 45 to \n60 seconds to really turn this into a metabolic   burnout. Again, those with limited weight \nwould choose the single dumbbell option. \n  The second exercise here is actually going to \nbrutalize your legs, it's our goblet leg sequence,   so you put the single dumbbell here again up into \nthe goblet squat position, you're going to do a   reverse lunge into a reverse lunge. Come back \nto center here and perform a goblet squat.   And if two dumbbells are at your disposal here, \nyou would choose the appropriate weight and once   again perform six to eight repetitions on each leg \nfor three total sets. One key way to perform this   exercise is to maintain a slightly wider stance. \nBasically, start from your goblet squat stance   because you want to have a wider base of support \nwhen you go back into your reverse lunge. \n  All too often, people lunge directly backwards, \nwhich provides too narrow of a base of support,   and you wind up losing your balance left or \nright. When the goal is to get jacked and   build muscle here balance should not be your \nfocus. Keeping your legs a little bit wider   will provide you with the stability that you \nneed to focus only on the effort level that's   going to drive that new muscle growth. \nThe next exercise up here is a classic old   school back exercise the T-Bar Row that we, of \ncourse, could do with a single dumbbell. And   let's start right there with that single dumbbell \nhere, you're able to use a single weight with a   crush grip to mimic the mechanics of the T-Bar \nRow that will help us to build a bigger back.   If you have access to two dumbbells, of \ncourse you can do this variation here,   but we're going to add a little bit of extra to \nit. This is a dumbbell row, but we call it a dead   row. You're utilizing your legs for the first \nquarter of the motion to help you to move bigger   weights and to move them more explosively. \nOf course, in the T-Bar Row, one thing I want you   to focus on is the manipulation of the dumbbell \nin space as you perform the exercise, you're   going to want to tilt the heels of your hands \ndownward in order to create a little bit of extra   range of motion because that dumbbell is less \nlikely to hit your chest at the top. Make sure   you're bent over enough at the waist to create \na higher load on your lats but do so without   compromising your low back and rounding it. Three \nsets of six to eight once again is the goal. \n  And finally, we're going to hit a great pushing \nexercise here that's going to hit your chest,   shoulders and triceps, it's the crush grip floor \npress. So you take that heavy dumbbell if you're   only using one and you squeeze both hands on the \nhandle. And this is not just a passive squeeze,   this is actually squeezing as hard as you can \nwith an inward force to create that isometric   abduction to really light up the chest, you \nextend that dumbbell up and over your body,   and of course, you're hitting your shoulders and \ntriceps like you would with any other bench press.   Of course, if you had two dumbbells here, \nthe traditional floor press is going to be   the option you're going to go for.\nIn either instance, again, choosing a weight   that's going to cause failure in the six to eight \nrep range for three sets is the goal. As always,   if you had to light of a weight, you're going \nto keep those reps higher and just decrease that   rest time to no more than 45 to 60 seconds. And \nfor those looking to add a little bit jack-ness   to those arms as well, let's talk about the \nextra fifth and sixth exercise options here   are accessory work for this workout, \nand we're talking about a direct tricep   and a direct bicep exercise. \nThe direct tricep exercise of choice here   actually brings back nightmares for me of a tricep \nextension done on the floor that I did back with   C.T. Fletcher that I'm still, again, thinking \nabout negatively. The fact is, this can easily be   converted into a single dumbbell option by simply \ntaking that palms up diamond grip on the dumbbell   and then again extending it down to the floor. \nMake sure that you don't drive too much with   your lats on the exercise. Try to isolate this to \na tricep exercise by limiting the range of motion,   mostly to the elbows bending and not \ndriving forward and backward. \n  Here we're going to increase the repetition count \njust a little bit 10 to 12 reps to failure, but   still for three sets. And then finally, we wrap \nup the entire workout with our bicep exercise,   and this is tailor made for a single dumbbell \noption. This is the dumbbell waiter curl. And   again, you can go pretty heavy here, and it \nallows you to really build up your biceps.   If you haven't done it, this is one of my \nfavorite ways to do so. Again, three sets of   10 to 12 repetitions is the goal here. \nIf you had two dumbbells and didn't want   to utilize this option, of course, the \nstanding dumbbell curl is another great   way to target your biceps. I like to perform \nit as always in alternating fashion so I can   make sure the biceps are doing all the \nwork here, and I'm not limiting myself   by either strength or weakness of my core. \nNo matter how many dumbbells you have access to   guys, if you know how to train with them, there's \nalways something you can do. As you saw right here   one dumbbell, a pair of dumbbells, a whole rack \nof dumbbells, this exercise sequence is going to   take you where you want to be. Speaking of \ntaking you, where you want to be, I have a   brand-new program that's designed to do exactly \nthat. I don't care how many dumbbells you have.   It's called Jacked, ironically. It's going to get \nyou where you want to be. Check it out."
}