{
    "id": "5PsCMjseTZA",
    "title": "The Triceps Workout “Master Tip” (EVERY EXERCISE!)",
    "description": "If you want to get more out of every triceps exercise you do in your triceps workout then you are going to want to do what I'm ...",
    "transcript": "JESSE: Jeff is like a walking anatomy chart. It’s great to have him around. And the muscle markers? They make it really, really easy to understand. I’ll tell you this: I’ve learned a lot\nabout anatomy just from filming the videos. JEFF: Okay, so now the obliques, they come,\nand they run all the way down, right- JESSE: No, no, no, no. Cut! Cut! Cut! No! Bad! JEFF: You have the linea alba that runs down\nhere, and then it divides it into all these quadrants. Now the lower abs would be right here. The upper abs would be up in this area, and\nsometimes you can get a hernia right in the middle. So now the occularus muscle that runs right\nhere, under the- JESSE: No, no, no, no. Not necessary. Not in the eye. JEFF: But they’re muscle too, man. So now the supraspinatus is a really important\nmuscle. Jesse, I can’t reach it. If you could just draw that in. That really is important now for the health\nof your shoulder. The thing is, while it may not be a big muscle,\nit really is important to keeping the stability here. You can see the stability of that muscle. So, you want to make sure you- What's up, guys? Jeff Cavaliere, ATHLEANX.com. I’ve got some artwork on my back today and\nit’s actually a muscle. Don’t worry. I got back at Jesse, and you’re going to\nsee that at the end of this video. But today I want to actually share with you\nsomething even better. It’s the master tip. This time we’re applying it to the triceps. If you follow along with any of our Master\nTip series you understand that I’m giving you one tip that applies to every, single\ntricep exercise you do. It does not require any extra equipment, and\nit’s something you could do instantly, and feel the difference. When we’re talking about feeling the difference,\nlook at the difference here on this dip. It is very subtle, but I promise you, subtle\nthings can actually have huge differences in terms of, not just how it feels to you,\nbut more importantly, to the results you see from doing the exercise. Here we’re talking about the matter of an\ninch. Can you see the difference between these two\ndips? Here’s the difference, guys. When you do your tricep exercises we need\nto start exploring full extension at the elbow. You might think that you’re extending fully\nat the elbow because your arms is getting relatively straight. But I’m talking about full extension. Provided you don’t have any kind of blockage,\nor chips in your elbow that prevent that. It starts with a little bit of anatomy because,\nobviously, we broke out the muscle marker. We have to look at what’s going on here. This is the longhead of the tricep. The longhead of the tricep attaches – unlike\nthe other two heads of the tricep – to our scapula. To our back. You can see that over here. It’s attaching way up here and because of\nthat, in order to fully contract that muscle your arm has to get back, behind your body. Well, if we’re not getting the full extension\nof the elbow that makes it even more difficult and challenging to actually get behind your\nbody. I realize that not every arm exercise, and\ntricep exercise requires that your arm get back there, but more on that in a second. The second thing is, you’ve probably been\ntold something really important. That is: don’t ever lock out your joints\nbecause locking out is a bad thing. Guys, that’s a big myth. That’s not true. What you want to do is – our bodies were\nbuilt to lock out. This elbow joint, to go to full extension,\nis meant to be in full extension. It’s not a dangerous thing to be in full\nextension. The problem is when we add velocity to that. So, you don’t want to add velocity to that\nbecause that starts to get his pounding into extension. But guess what? You don’t do that. You don’t add velocity to your hinge joints. The hinge joints being here in your elbow,\nand down at your knee. You want to have a controlled contraction. But because we’ve learned that you don’t\nwant to do that we usually cut that short. That’s a problem. So, here’s how you apply it and get more\nfrom all of these exercises. If we take a tricep pushdown here, what we’re\ndoing is making sure that we don’t just get the full extension, but because we have\nthe opportunity to et the arms a little bit back, behind our body, we can get in an enhanced\ncontraction on the longhead of the tricep. For the reasons I just told you. So, you want to do that. If you’re doing a dip, like we’ve covered\nhere before, you have the opportunity, by the placement of your upper body, to shift\nit forward a little bit, get more upright, so you do take advantage of the fact that\nthe arm can get back, behind the body. But once again, it’s about making sure you\nextend through that final one inch. That final one-inch matters. It will make a difference when you accumulate\nrep, after rep, after rep of every, single tricep exercise you do. I promise you. You can go here to a tricep extension and\nthe same thing. This is a great tricep exercise. It stretches the longhead, and then we go,\nand reach full extension. Again, full extension. Those extra couple of inches, in this case,\nmatter a lot. Even if you have an exercise like the close\ngrip bench-press that doesn’t have an opportunity for you to get your arm behind your body at\nfull extension, you still want those extra few inches of full extension. So, don’t stop here. Consciously push forward. Here’s one other thing you can do to make\nsure you’re doing this right. When you get to full extension, or where you\nthink it’s full extension, back off one inch. Back off just a little bit. I’m showing you here on the tricep pushdown\nagain. Back off just one inch, and then reestablish\nthe contraction again. You’ll find that you’ll probably get further\nthan you did the last time if you did short the extension. If you were able to get full extension the\nfirst time then you’re just reestablishing that again, and your time under tension in\nthis position will be elongated. But the fact of the matter is this, guys:\nyou want to make sure that you’re not shortchanging your reps. Especially when it comes here. The same thing is going to apply when it comes\nto your other hinge joint down at your legs. We can talk about that in another video. In the meantime, guys, if you’ve found this\nvideo helpful make sure to leave your comments and thumbs up below. If you’re looking for other programs that\nput the science back in strength – that’s what we do in all of them. The muscle marker is a key component of what\nwe do here. You want to head over to ATHLEANX.com and\ndo that. In the meantime, I’m going to turn this\nvideo over to Jesse because he earned his right to be on this camera after what he did\nwith his artwork on my shoulder. All right, guys. I’ll see you again soon. Go ahead Jesse. JESSE: Yeah, this is punishment for drawing\nthe dick. Not a good idea. Go check out the video, subscribe, check out\nhis website, too. Jeff, do I have to keep doing this?"
}