{
    "id": "5qVd7_O5ifY",
    "title": "6 Minute Ab Workout (THE ONLY ONE YOU&#39;LL NEED!)",
    "description": "Get unlimited ab workouts and see your six pack faster here… http://athleanx.com/x/get-unlimited-ab-workouts-here Most ab ...",
    "transcript": "What's up, guys? Jeff Cavaliere, Athlean-X.com. Are you ready for the only ab workout you'll\nprobably ever need? I have a good reason to call it that, but first I want to get you\nright to the action. Don’t worry. Beginner, or advanced; I've\ngot you covered right here. Six minutes is all you need.  So there you have it. Six minutes later. Beginner\nor advanced, you just fried your abs. Guess what else you did? You hit every single\nmajor core requirement in this one workout. I told you in the beginning you had good reason\nhere. I had good reason here to call this the only ab workout you'll ever need. If you watch back and look at the exercises,\nyou hit all the responsibilities of the abs in one workout. You hit top down motion, you\nhit bottom up motion, you hit rotation from the top and from the bottom, and you hit standing\nab work, anti-rotation, anti-extension, anti-lateral flexion; all the key responsibilities of the\nabs and obliques you got here in this workout. Guess what? If you wanted to make this the\nonly workout you ever did, you could probably do just that. If you're a beginner you'll\nwork your way up to advanced. If you're advanced you work your way to more circuits of this.\nWhy limit yourself? If you want to really tap into the true potential of your abs don’t\nlimit yourself to just a handful of exercises here. You could do thousands of exercises. As a\nmatter of fact, that's one of my key specialties; figuring out ways to continue to make you\nfeel the burn, feel the pain every single time you train. We've got over a million ab\ncombinations. That's right, a million because we have an\nab shuffle feature built right into our Athlean-X training systems that you can get at AthleanX.com\nthat allows you to shuffle up your workouts creating unlimited combinations of workouts. Fresh new ab workouts every single time you\ndo them, utilizing over 500 different ab exercises. You can get that over at AthleanX.com. In\nthe meantime, good luck with whatever level of ability you're at right now. Use that as the benchmark to push yourself\nfurther and further. I'll be back here again, guys, in just a couple days. Make sure you\nlet me know what you want to see here for Washboard Wednesday. I'm happy to bring it\nto you. See you soon."
}