{
    "id": "64cXpMTv6CE",
    "title": "Standing Ab Workout (TORCH YOUR ABS - STANDING!)",
    "description": "Train your abs on every exercise you do with this workout… http://athleanx.com/x/get-insane-abs-while-building-muscle Ab ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.COM. Are 95 percent of your ab workouts occurring\nwith you either laying on the ground or hanging from a bar? Probably because that's the same case for\nmost people, but I can tell you this, unless you start getting on your feet and training\nyour abs that way, then you're never really training them to\ntheir maximum potential because we know as athletes, if you get your feet on your ground, you start incorporating ground-based training,\nnot just into your overall workouts but your abs specifically, you will see much better\nresults because your abs are key in stabilizing your body\nin a standing position. So, I put together an entire standing ab workout\nfor you that I want you to try here. It's Washboard Wednesday. Can you get through this workout? Let's see. Let's give it a shot. STANDING RUSSIAN TWISTS REVERSE WOODCHOPPERS STANDING TUBING TWISTS OAK TREE STEP OUTS LEANING TOWERS (STANDING SIDE PLANKS) SLINGSHOT KNEE DRIVES So there you have it guys, a standing ab workout. Give it a try and not only here. If you want to start incorporating more ground-based\ntraining into all of your workouts so that you can not only become more athletic, but as I say, start incorporating muscles\nthe way they prefer to be trained. Just by doing these exercises, I'm sure you're going to feel your abs working\ndifferently than they do when you're doing a normal Crunch or even a normal Hanging Leg\nRaise. It's that important. And guys, we incorporate it into everything\nwe do in ATHLEANX. I say, we put the core at the core of every\nexercise. This is just another example. And it doesn't mean always having to lay down. We can get you on your feet, train you like\nan athlete, and in the process get you better results. If you guys found this video helpful, make\nsure you leave your comments and a thumb's up below. Whatever else it is that you want to see,\nyou tell me down below, we'll make it here in the coming weeks. Alright, guys, I'll be back here again soon."
}