{
    "id": "6CZPFulZl-g",
    "title": "4 Reasons Your Chest Won’t Grow (FIX THIS!)",
    "description": "You've tried everything to grow a big, ripped muscular chest but nothing seems to be working. In this video, I'm going to show you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going over four reasons why your\nchest may not be growing. Now, I get it. Some people say \"Chest? Chest is the easiest thing in the world to\ngrow.\" There are a lot of people that cannot grow\ntheir chest, and I'm going to cover four of the reasons why, and what you can start bringing\ninto your training right away. First up we have to attack the setup. I don’t care what chest exercise you're\ndoing, it's always going to matter. There are two things you can do to make sure\nthat you're setting the stage properly, before you even do the exercise. One good reminder that you can do during every,\nsingle rep that will reinforce the fact that you're doing it right. I say \"chest out, and traps down\". What I mean by that is, you've got to at least\nput the chest in a position to initiate the push. That happens by making sure that it is out\nin front of the shoulder. No matter what exercise you're doing, if the\nshoulders are in front of the chest you're going to cost yourself an opportunity to allow\nthe chest to initiate the contraction. At this point, the shoulder wants to try to\ndo the work for you. We know that's a tendency of chest exercises\nbecause the shoulders, the triceps, and the chest all like to work together. You're going to initiate that contraction\nnow, right here, from the chest, as opposed to letting the shoulders dominate. Now I said \"traps down\", too. Traps down is just a postural thing that we\ndo, just because of how much sitting we do, and all the time we spend this way that allow\nour traps to overcompensate and lift as we elevate our arms. You can notice this yourself. If you just raise your arm up, look in the\nmirror. You likely have some sort of a shrug going\non here when it should really look like that. It should be depressed. So if you can actively depress that, what\nyou've done is allowed yourself to get more adduction of the arm here, down at your side,\nwhich allows for a stronger chest contraction. We're going to talk about adduction in a moment,\nbut you want that chest out, you want the traps down, and then during every, single\nrep you can reinforce this by actively pulling down on the weights that you're using. Even if you're doing a pushup you can actively\nattack the ground. Not just passively fall down toward it, or\ndon't allow the dumbbells to passively fall down toward you on the bench. You can see me pulling the dumbbells down,\nwhich forces the chest out again, puts it in that position on every, single rep to initiate\nthe next contraction. The combination of these preset rituals, and\nthese interest rituals will do wonders for you when it comes to getting more results\nfrom every chest exercise you do. Next, as the saying goes \"It doesn’t matter\nhow good you start. If you finish like crap, you did a crap set.\" Well, we're going to finish right. The way you do it on a chest exercise is changing\nyour mindset on what you're doing. Forget the word 'push', or 'press' and replace\nit with the word 'squeeze'. So instead of doing pushups here, think about\ndoing squeeze ups. And instead of doing bench-presses, think\nabout doing bench-squeezes, if that helps you to visualize what's actually going on\nhere. That is, you're not just pushing the weights\naway from you. You should be squeezing the weights together. If you have to visualize your biceps moving\ntoward each other, then that's what you should do. Again, the fixed exercises don’t make an\nexcuse for not doing this. I could do this on a dip as well. I don’t just push out of a dip. I'm actually squeezing out of a dip. As I push down, I'm trying to get my biceps,\nagain, to approximate and come closer together at the top to ensure that I'm getting a strong\ncontraction. That one change in mindset will get you much\nmore out of every, single rep of every exercise you're doing for your chest. The third thing you must do is take it beyond\nwhat I just told you to do, and learn to adduct, adduct, adduct. We talk about it. Yes, you want to approximate, and come closer\ntogether, but at some point this adduction that the chest will assist in is going to\nbe limited by the fact that you can't cross over midline. Horizontal adduction is where our chest is\nbest worked. If we can get ourselves to go across our body,\ntake that arm, bring it across midline, now we're really doing something, and now we're\nreally activating those muscles. We can do it only with very specific exercises. Here's the problem: if you don’t have the\nbiggest chest in the world, and people see you doing these things in the gym they might\ntell you \"What are you doing?! Why don’t you concentrate on bench-presses,\nand some of the bigger lifts?\" I'm telling you guys, you don’t want to\nlisten to that advice because you're missing out on the opportunity to create the adduction\nthat only comes from these exercises. So don’t worry about what they're saying. Instead, focus more time doing the exercises\nlike this – the UCV raise – that allows me to work on that upper chest, along the\nfibers in the same direction that they flow, and I'm bringing it up, and across my body\nusing a single dumbbell, or even better, with a cable. Or I could do the Cavaliere crossover here,\nas some would call it. We take the dumbbell, we bring it up, and\nacross our chest. We're trying to drive that dumbbell up, and\nacross, and over midline, and squeeze as hard as we possibly can. You'll feel the heightened contraction because\nthe chest is literally contracting harder by exploring all ranges of motion here, and\noperating in all of its functions. We can also do a cable crossover. Again, this is not just a definition exercise. I can't stand when people say that. It does much more than that. It's taking the chest through its full function. So why not utilize it? Bring your arm all the way across the chest,\ngo for that heightened contraction, and use it. Of course, even if you're doing pushups here,\nyou can do the same thing. You don’t have to just push straight up\nand down. You can actually cause little bit of a rotation\nin there with our twisting pushup, which gives you more of that relative adduction of the\narm across the chest. Last, but not least, the one thing I think\nyou might not be doing enough of is drop sets. Drop sets, when it comes to chest training,\nis one of the most valuable tools in your arsenal to get more out of it. Why? Because, as I said in the very, very beginning,\nyour shoulders, your triceps; they all want to help, and assist, and dominate chest movements. Well, it's okay only if they come after the\nchest has already been fatigued. So if you've been doing everything I just\nshowed you – you initiated the contraction, you finished the contraction, you were adding\nadduction exercises – well, when you're done with those pushing exercises, don’t\nstop there. Immediately drop to the floor. Let's say, on the bench-press. Start cranking out pushups. Why? Because at this point, even though your chest\nis fatigued, it's got the help of the shoulders and triceps that will allow you to push even\nfurther. This is where the fact that these muscles\nlike to work together start to work in your favor. If you're not allowing yourself to do these\nyou're costing yourself a great opportunity to get more out of your chest exercises. Here's one word of caution, though. A lot of people will approach a drop set,\nstart to fatigue on that secondary portion of it in the pushup, and then hold back because\nthey'll say \"Well, there's no way. If I push myself any further here I'm not\ngoing to be able to go back and use the same dumbbells I just did on the last set, and\ncomplete it with any effort because I'm going to be too fatigued.\" Screw that mentality, guys. That 'save it' mentality is probably what's\nholding you back even more than anything else. Go for everything. Do as much as you can on the drop set. Go to failure and if you have it adjust your\nweights, do so because your muscles will only ever recognize the amount of tension that\nthey're being subjected to at the end of the day. They're not necessarily worried about the\nnumber on that side of the dumbbell. Aim for more tension every step of the way\nand you're going to get more out of every, single chest workout you do. So there you have it, guys. There are four things you can start doing\nright now to start getting more out of your chest workouts. Don’t tell me the chest is so easy to grow\nbecause if it was there wouldn't be so many damn people looking for chest workouts. It's one of the most requested things we get\nhere, on this channel. I feel your pain. I get it. It's not my best thing either, but I've worked\nhard to try to bring mine up, and you can do the same thing, employing these same techniques. As a matter of fact guys, we go the extra\nmile with every one of our programs. We put all the extra tips in because these\nare the things that make the difference. When all else has failed, it's these next\nlevel tips that make the difference in helping you to finally bust through. All of our programs are available over at\nATHLEANX.com. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover in a\nfuture video and I'll do my best to do that for you. All right, guys. See you soon."
}