{
    "id": "6HKMTQgLC9k",
    "title": "Do This BEFORE Every Ab Workout (GET BETTER ABS!)",
    "description": "One of the biggest problems people have with ab training is that they rarely feels it in their abs. One of the main contributors to that ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to show you one thing to do before\nevery one of your ab workouts. Especially if you're someone who has a hard\ntime either A) feeling your abs work when you are doing your ab exercises; or B) you\ntend to feel it more in your low back because you're relying too much on your hip flexors\nto do your exercises. That's something we have to fix right now. We do that with reciprocal inhibition. Now this little, fancy word is just something\nthat really means, if we can activate, or contract a muscle that acts on the opposite\nside of a joint than the one that we don’t want to work, then we can reciprocate it,\nor at least turn it down a little bit so the other muscles can do the job. That's what we're trying to do. If your hip flexors are initiating too much\nof the movement when you're trying to crunch, or do any other ab exercises that we'll show\nhere, then what you want to do is try to get them out of the equation so the abs could\ndo more of the work. The hamstrings are able to do that because\nof their function as hip extenders. What we can do though, is also rely on the\nglutes, too because we know that they can also extend the hip. So what you do is take this foam roller, put\nit behind your ankles, and up against your butt. Then you squeeze your glutes together, and\nyour hamstrings at the same time. Everything should be squeezed up, and under. When we do that now the hip flexors have to\nshut down a little bit. When we have that done, now when we initiate\nan ab contraction it's happening more from the abs instead of the hip flexors over dominating. So you want to do a levitation crunch. You squeeze here, keep that in place, and\nwe just lift the shoulders up, off the ground. Just like that. Immediately you should feel a much stronger\ncontraction in your abs because they're being demanded to work harder. We do 10 reps of that, then we come across\nour body, and same things. Squeeze, come up, and twist just a little\nbit. Up, and twist a little bit. Here you go five on each direction. So now you're up to 20 reps. Finally, we do some kind of bottom-up movement\nhere. So we squeeze with the foam roller back, and\nthen we initiate the lift. Just like that. Again, with the hamstrings actively engaged\nin the glutes, squeezing from underneath, the hip flexors can't contribute as much to\nthese lower ab movements as they tend to. And this is where a lot of the low back pain\ncomes from. So we go 10 reps here. So now, when it carries over to the full ab\nworkout the one thing I want you to realize is anytime you're going to do a lower ab movement\nwhere the bottom comes up here, then what you want to do is make sure that the hip flexors\nare not doing that work. You could do that by actually limiting the\nrange of motion. A lot of times what people will do is, they\nthink that going all the way down is a great idea because you're increasing the weight\nof the legs, increasing the moment arm, making the exercise more difficult. But what that's promoting is, that's making\nyou move your hip flexors to get back up to the point where your pelvis moves. I have to go all hip flexor here to be able\nto get to the point where my pelvis can then lift, and go through the movement. What I'm saying is, 'don’t go down that\nlow'. Go down so the pelvis and legs move together,\nall the time. When it gets down to the point where the pelvis\nno longer moves, then you're done with that rep, and go back up again. Here. So I'm never in a position where the pelvis\nis stable, and that you're moving on it. That would be hip flexor. But if I can get the pelvis and the legs to\nmove together then I'm doing it right. You'll be able to do that a lot more likely\nnow because you've allowed the hip flexors to butt out, and get out of the equation. I'm going to give you a bonus here, too. What's the one thing you should do after every\nab workout? You really need to stretch them, guys. People don’t stretch their abs nearly enough. They are muscles. They need to be stretched and again, if this\nis going to be a static stretch you do it when you're done with your work. Preferably, I like to do this at night, but\ncertainly not before we do our training. But a nice ab stretch is literally keeping\nthe lower pelvis in contact with the ground, and then just coming up for a stretch, and\nhanging out here, like that. So there you go, guys! One thing to do to start getting those abs\nto feel more of every ab workout you do by activating them more properly, and getting\nthose muscles that we don’t want to be contributing out of it. If you're looking for a program that puts\nthe science back in strength – not just on ab training, but in everything we do – head\nto ATHLEANX.com right now and get our ATHLEANX training program. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover in a\nfuture video and I'll do my best to do that for you in the days, and weeks ahead. All right, guys. See you soon."
}