{
    "id": "6pKKnVg1hzE",
    "title": "How to WAKE UP Your Glutes (DO THIS EVERY DAY!)",
    "description": "If you want to wake up your glutes because they are weak, underdeveloped or just not looking the way you want them to, then this ...",
    "transcript": "So, if I can show you something super \nsimple that you could do every single   day to build not just stronger glutes \nbut better-looking ones, and also,   we could correct a lot of disfunction from \nthe inside out, that leads to a lot of hip,   a little back pain. Would you be \ninterested? You bet your ass I would.\n  What's up guys, Jeff Cavaliere, Altheanx.com. \nI want to help you with your glutes today   because I know how important it is to \ndevelop them, not just for how they look,   but how they function. And what I'm going to talk \nabout here is actually not the glute max, because   this is the muscle that you might be focusing \non or you might have paid a lot of attention to   and for good reason, because when it's developed, \nit has a certain look, let's just put it that way.   But I'm talking about the muscle underneath. It's \nthe Glute Medius. It's the one that doesn't really   get lumped in too much when we talk about the \nglutes. And if you're doing that, you're making   a big mistake. So, I'm going to show you this for \nsimple moves. You're all going to have to do two   of them, either two, on the ground or two here and \nstanding that everyone is going to be able to do   no matter what your ability level is, and you're \nnot going to need any equipment at all to do them.   So that being said, let's meet me on the \nground, I'll show you exactly what to do.\n  So, as I said, the Glute Medius is where \nwe're going to put all of our focus, because   if you're lunging, squatting, dead lifting or leg \npressing right now, you're hitting your glute max,   I promise you, you are. But what we are \nmissing is the frontal plane abduction that   we get from the glute medius and the rotary \ncomponent that we get from the glute medius,   that we just don't get from the glute max, or \nas well as we get from the glute medius. So,   what we do is we get down here on the floor \nand all I'm going to have to do is get in   your side like this. These are really simple. And \nagain, you could do these every single day. \n  You get down here and the first thing we do is we \nrealize that when the leg is in front of the body,   here, that we want to have internal rotation if we \nwant to get the glute medius. So that means take   your toe and try to stab it into the ground, \nokay. Get it about 30 or so degrees in front   of your body and try to point your toe straight \ndown into the ground. From here, all you're doing   is keeping a nice, stable upper body and you're \ngoing to lift your leg up as high as you can into   abduction at the hip. You should feel it light up \nright here in this area of your leg, that's when   you know you're getting the glute medius. And all \nI'm going to do is come up and create every single   contraction as a very purposeful, meaningful one. \nI don't care--I'm not looking for this, it's not   a race. I'm looking for good quality contractions, \nas many as you can until you can't stand the burn   anymore. And if you've ever heard the term \n\"light your ass up\" this is actually where   it started right here. So, you do that now. \nNow, once you're done with that, we've got to   get the back side here in a different angle. \nAnd that's when we put our hip into extension   behind the body. When it's back here, now, what we \nwant is extra rotation at the hip. So instead of   pointing the toe down, we point it up towards \nthe ceiling. But because I'm falling this way   when that happens, if I lift my leg up and \nprobably get more hip flexor instead of the   abduction I'm looking for. So, what I want you to \ndo is just lay a little bit more like this, okay?   Lay flatter to the ground, leg goes \nback behind midline of the body here,   turn the toe up and now lift up. Oh my God, right \nup to the sky. See, I can't do a lot of these   and neither will you. But it doesn't matter, \nit's the good quality contractions that count.   So we do as many as we can, once a day is fine for \nme. You're going to accumulate better activation   of these muscles just by doing these routinely \nand regularly, and that's going to pay big   dividends in the long run. I'm going to show you \nnow what you can do in standing as an alternative   if you don't want to do these laying down.\nLet's say you're at work and you don't want to   lay on the floor, do your exercises. It doesn't \ngive you a reason to get out of doing them for the   day. Again, you can do this really, really simply. \nThe standing version is an alternative. I will   tell you this, the standing version is actually \nmaybe a slightly better alternative. Because   any time you can get in a weight bearing situation \nin a closed chain feet on the ground situation,   I like the activation better that you get through \nthe muscles of the hip and low back and glutes   by doing it this way. So, what we \ndo is we try to create the same   idea as what we had down there on the ground. But \nthe benefit is we get two legs working at once.   So, we get in this position and I square off \nin front of the bar and all I'm going to do is   take my leg, keep it in front of my body, this is \nmidline right here. Keep it in front of my body,   turn the toe in. And then I'm going to do is going \nto bring it out to the side into that abduction   again, like a leg swing. But what happens is, as \nI swing this up, this hip on this side comes over.   So, I let it drop and then I let it come over, I \nlet it drop and I let it come over. So, what you   see is a leg coming towards you, but I've dropped \nthe hip out and now I swing it in front and over,   out and over. So, this leg thing in front \ntoes pointing down as much as I can.\n  And what it does is, it works this side through \nthat flexion, abduction, internal rotation,   and it works this side through that sliding \nhip over. You'll feel it both ways. Now   I will hit that backside to where we bring our \nleg back behind the body. In this case, we angle   towards this wall here at about 45 degrees. Then \nwhat I do is, I'm going to take the leg from right   about right behind my heel, I'm turning it out to \nthe side here so my toe is pointed out this time   instead of pointing in. I'm still going to try \nto create this, but what I do is I turn my body   towards the wall or the post or \nwhatever you're holding on to so,   I'm getting rotation through here. I come out, I \nrotate and I'm kicking my leg up just like that.   Rotate, kick it up towards the ceiling as long \nas this leg stays back behind this midline here,   then I've got it in the same position \nas it was on the ground. Turn   and kick up and again, quality repetitions, I feel \nthis hip squeezing, I feel this hip squeezing,   both glute medius working together. So \nthat rotation just to open it all up.\n  Either way, guys, maybe you'll have a hard time \ninitially feeling these muscles contract because   the mind muscle connection is so dormant \nbecause you haven't done anything for a   long period of time. In that case, I like the \nones laying down on the ground because you get   that instant connection. Once you've got that no \ntransition to standing for that extra benefit. \n  So there you have it guys, two exercises, \nyou're choice which ones you pick.   They're going to help you to build that all \nimportant and overlooked glute medius to get   you on the right track. If you're looking \nfor programs guys, we have a whole--\n  Whoa, whoa, whoa, whoa, whoa, \nholy smokes, Jeff, that really   lit my ass up. I feel like I'm on fire.\nThat's because you actually are, Jesse.\n  Oh, oh, oh! Stop, drop and roll, buddy, \nit works every time, I promise.\n  Speaking of working guys, if you're \nlooking for programs that work,   we have them all laid out for you step by \nstep over at Athleanx.com. If you haven't   already done so, guys, make sure you \nclick Subscribe and turn notifications,   so you never miss a new video. And as always, \nguys, leave your comments below, tell me we want   to see in a future video and I'll do my best to \nbring it to you. All right guys see you soon."
}