{
    "id": "6Qrr0GLeGp0",
    "title": "The 10 Commandments of Chest Training (GET A BIG CHEST!)",
    "description": "If you want to build a bigger chest you have to make sure you are avoiding the biggest chest workout mistakes while not forgetting ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we are here to help you with your chest\ntraining. We're going to deliver. By the way, we – it's not him. No, no, no. We're reaching out, getting a little divine\nintervention today. We're laying down the 10 Commandments. The 'Shalts', and the 'Shalt Nots' of chest\ntraining so you can get the most out of your training. Let's get started right away. MALE: I'm sorry to interrupt, but Jesse? JESSE: Yeah? MALE: I've always been a big fan of your beard. JESSE: Oh. Thanks! MALE: Big fan of beards in general. It's a good beard. JESSE: You know what? I think I'm going to grow mine out again because\nI dig the beard, too. JEFF: Can we get this thing going? The firs commandment is: MALE: Thou shalt not shrug your traps. JEFF: You heard him. You'd better get those traps out of your chest\ntraining if you want to see the best results from your chest training. We've thought so much of this, and so highly\nof this that we made it the \"Chest Master Tip\". Meaning, when you get down to a bench-press,\nthe first thing you need to do is pull your shoulders down. Activate your lower traps to get those upper\ntraps out of the domination of that exercise. Why? Because when the traps shrug up, you're basically\nalso getting your shoulders up, and forward, which puts them in a better position than\nyour chest to actually do the pushing. You're going to see that's another major thing\nwe make sure we do properly. If you go to a dip station and you get ready\nto do your dips, what's happening? Most of the time you collapse under your own\nweight, and your traps shrug up again. You want to actively depress them, which puts\nthe chest into the position as a primary mover to then push, and initiate the contraction. Which actually leads us to: MALE: Thou shalt initiate every contraction\nfrom the chest. JEFF: You absolutely need to do this, and\nit's so simple, but we overlook it. You need to initiate from your chest. You can see it happen right here. Again, there's a very close interplay between\nthe roll of the front delt and the chest. If you don’t respect it, and see where that\nline is drawn you're going to miss out on the opportunity to get more out of every contraction. What your body wants to do is let your shoulders\ntake over, and move just a little bit in front of your chest here, and then they want to\ndo the pushing, as the line of first defense. If you actively keep that chest pushed out,\nand initiate the contraction from here you can feel it. The very first 1/8th of an inch that you move\nshould happen because of the contraction of the chest, and then from there, you continue\nto push. You're going to feel the difference. It's a major difference, but it does take\na cognitive awareness of the fact that the fist contraction has to come from the chest,\nand as soon as you initiate there you're going to put yourself in a better position for the\nentire rest of the rep. MALE: Thou shalt adduct at every opportunity. JEFF: Adduction. The absolute critical component of a complete\nchest contraction. Now- JESSE: Wait, Jeff. Jeff. Adduction. That's 1+1=3, right? JEFF: No, no, no. That's addition, and that doesn’t' even\nequal 3. Didn't you go to college? Dude, this is not a good advertisement for\nQuin PA. So adduction, when you actually do a chest\ncontraction, is going to be a final pushing of that, if you're going to get a complete\nchest contraction. The role of the chest is not push away from\nthe body, but to come across the body, and bring the arm across. I don’t want you to think that heavy training\nis always going to produce the best results. It will produce a component of the best results,\nbut if you're avoiding some of these adduction type exercises that I'm showing you here because\nyou think they're using too light of weights to produce a result; you're leading yourself\ndown the wrong path. Lighter weights that produce a complete chest\ncontraction are going to produce great results. If you take those weights, and push them to\nfailure, you're going to get the benefits of them. It doesn’t matter, your body doesn't understand\nthe number on the side of the stack, or on the side of the dumbbell. All it understands is the tension it's creating. When you create maximum tension by going to\na maximum contraction, which is when you get a better end result for your chest. I want to make sure you're not forgetting\nto include these types of exercises in your chest workouts. MALE: Thou shalt not avoid drop sets. JEFF: You stay out of this one before I drop\nyou. JESSE: Okay. JEFF: Drop sets, guys. Drop sets are a very critical component of\ncomplete chest training. Why? Because when you go back to what we talked\nabout earlier, the chest doesn't usually act alone. A lot of times it's getting help, sometimes\nunwanted, from the front delts, and from the triceps, too. But drop sets allow us to really take every\nlast drop of effort out of the chest to ensure that we're really hitting it hard. So what you do is, you do a regular bench-press,\nand then go grab a lighter set of dumbbells, and drop it down. Again, maybe half the weight that you used,\nand you go to another set here. The benefit here being that you might have\nbeen using some of the other assisted muscles here to get the heavier weight done. But when you drop it done, now you're really\nfocused on everything we already talked about. Initiating contractions, and really forcing\nthe chest to eek out those last few repetitions. That's going to be key. It doesn't just have to be here. You can do the same thing, even with a dip. You do a regular dip here with full bodyweight,\nor even a weighted dip, and then you drop down seamlessly if you're using a band. Just step into the band, as you see me do\nhere, and crank out a few more reps. Again, really in that second half of the drop\nset, really focusing on saying \"All right, take all the other big muscles out of it. Let the chest finish out the job here.\" And really finishing what you've started. MALE: Thou shalt include pullovers. Yes, pullovers. JEFF: I'm not going to make him repeat himself\nagain. He's right. Chest pullovers. Pullovers done for your chest is one of the\nbest exercises you could possibly do. It's something you 'shalt' start doing now\nif you want to see the best results. Especially for your upper chest. What you do is, you take a dumbbell, you lay\nback over the bench as if you're doing a regular dumbbell pullover for your lats. But instead of flaring your elbows what you\ndo is, you try to bring your forearms and your biceps closer to each other. From the bottom position here, you initiate\n– yes, reenacting that same commandment again – initiating the contraction from\nthe upper chest. The whole dumbbell movement is created by\nthe squeeze, initially, by the upper chest. Bring it just to the position where it's over\nyour head, and you bring it back down again. This is a great way, if you've never tried\nit, to feel this really intense contraction. Almost like this V-line here that forms the\nupper chest. A great way to activate it, and hit it every,\nsingle time. MALE: Thou shalt do squeeze ups. JEFF: Guys, when you're doing any of your\npushup variations here, you want to make sure you're getting some component of adduction\nif you can. As a matter of fact, you don’t have to be\nlimited to just having your hand in this fixed position on the ground, which prevents you\nfrom getting any closer movement of the arms into adduction. You can do other things. We've actually covered and entire video on\npushup variations, that I'll link at the end of this video for your to see, where you can\nget a lot more variety. You can see some of the exercises here. The key is, when you're getting yourself off\nthe ground, even if you are doing it from this fixed hand position, is not to just worry\nabout pushing form me, to you, but worry about pushing your hands like this. Even though they're not going to slide on\nthe floor, if you feel that you're going to slide on the floor then you're actually going\nto squeeze your body off the ground, which does what? It puts your chest out in front of your shoulders,\nonce again, and it gives you and overall better impact from every, single rep of pushups that\nyou're doing. Squeeze ups. MALE: Thou shalt protect thy shoulders. JEFF: All right. Your shoulders need to be protected when you're\ntraining your chest. Did you know that there are more injuries\ndone to the shoulder through chest training than there are through direct shoulder training? JESSE: I didn't know that. JEFF: It's true because most of us don’t\nhave any appreciation for the fact that every, single exercise we do for the chest – no\nmatter what it is – is involved in, obviously, the shoulder joint. Because we're using either heavier weights\nto try to really bulk up our chest, or because we're doing some awkward movements; we put\nour shoulders in some really weird positions. So what your job is to do is to protect it\nat all costs because any shoulder injury is going to take you out of the gym entirely. It's going to take you out of your chest training\nentirely, and there will be no gains made if that’s the case. So you can see the things I do here. One: I switch to a floor fly, as opposed to\nan unsupported bench fly. We've talked about this many, many times before\nhow the gains can still be made here. As a matter of fact, you can have eccentric\noverload gains that you can't have when on the bench, and still get way more shoulder\nprotection from the floor. You can also do more decline bench-pressing,\nwhich will put the shoulders a bit more back, into a natural position, and a safer position\nto press from. And if you don’t even have access to a decline\nbench, all it takes is a single plate propped up under the end – the foot – of the bench\nyou're using, that gives you even a slight 5 to 10 degree decline, that's going to do\nwhat the job was, that purpose of saving your shoulders. Guys, respect your shoulders. You're going to need them on chest day. MALE: Thou shalt not forget face pulls. JESSE: Oh! I know this one! I do this because you told me to do this. JEFF: Yeah, right. Well, that might be the only thing that you've\never done that I've told you to do. JESSE: I'm not a good listener. Why do you think I screwed up my math equation? JEFF: That's true. You stopped listening in nursery school, I\nguess. Guys, you have to do face pulls for more than\nthe reasons that we just talked about regarding shoulder health. The thing is, I say for every three sets of\na chest exercise you're going to do, I want one set of face pulls done at the end of that\nworkout. Why? Because you want to create muscle balance. Far too much of the pushing is going to create\nrounded shoulders, but beyond that, rounded shoulders make your chest look small. I don’t care how big it is. You could take the guy with the biggest chest,\nmake him go like this, and everything is caved down, and in. Open up the shoulders, have the ability to\nexternally rotate your shoulders, and get into better posture upright here. Your chest itself actually broadens, and gives\nyou the appearance of a better looking chest without ever even having to lift it. MALE: Thou shalt do overcoming isometrics. JEFF: Okay, no. Now we didn't just save Jesse's alma mater\nsome embarrassment. 1/10th of the embarrassment he would have\nhad. We are actually taking the shirts off here,\nto demonstrate something very important about the value of overcoming isometrics, and why\nyou need to include them in your chest training, if you want the right results. Jesse, come up here. All right, demonstrate something really quick. With Jesse in this position here, he's at\nthe end position of a bench-press. If I were to try to go and resist him, push\nagainst him as hard as I could, I really can't budge him that much because he's pretty strong\nout there. However, if I get him back into the bottom\nposition of a bench-press and I say \"Jesse, now go ahead and resist me.\" It's actually not that hard to push him right\noff the camera. But now, we reverse the roles. If I get out here and I press, Jesse really\ncan't move me. But now, if I get into that weak position\nhere, all the way down at this spot here, and I say \"Jesse, now go ahead and press\"\n– Jesse, go ahead and press. JESSE: I'm pressing! JEFF: You can press, Jesse! Whenever you want to press, you can press. I have the ability to generate good strength\nback there because I'm doing this. This is an overcoming isometric. The purpose of including these is to become\nmore isometrically strong in your weaker points of the range of motion in the bench-press. We know that the bottom point is a sticking\npoint. We don’t train that way. Isometrics give us the value of increasing\nour strength within 15 degrees up, and down of the position we train it in. By doing the exercises I'm showing you here,\nI load the stack up as much as I can, I'm trying to basically move an immovable object. But I'm increasing my fiber recruitment capability,\nwhich increases my strength generation in this weak spot. So now, when I attack a bench-press I have\nmore strength down there. I'm going to be able to get more weight off\nmy chest. Meaning, I'm not going to be limited by the\nheavier weights in my weak point. Ultimately, I'm elevating the weight I'm using,\nand therefore, the results I'm getting. Now Jesse, go put your shirt back on. JESSE: Thank God. MALE: Thou shalt not train chest on Monday. JEFF: I know. It's a tough pill to swallow, even on International\nChest Day you've got to switch things up, guys. The rule here is that you can't keep doing\nthe same thing. I know a lot of people say \"Jeff always knows\nwhat I'm going to do.\" I could tell you what your last chest workout\nwas. See how close I am. Flat bench-press, into incline dumbbell bench-press,\ninto dips, maybe, and maybe a little bit of cable crossover, and then maybe even some\npushups. JESSE: But, Jeff…I've- JEFF: Hold on, Jesse. How close was I? How close was I to what you actually did? The fact is, when it comes to chest training,\nI've never seen a more repetitive workout of ALL those workouts that we do than that. I think we fall in love with that sequence. I think it makes us feel good. It gets the pump going and we never vary. But I will tell you this: just like any other\nform of training, if you want to change yourself you're going to have to challenge yourself,\nand you're going to have to introduce all new things to your training. So what we want to do is, not just stop at\nchanging the day that we train chest. How about not training chest by itself at\nall? Maybe even switching the order that we do\nthe exercises. I know, this is making your eyes spin, Jesse. Maybe it's even changing the order of the\nexercises we do. Instead of just doing those flys – floor\nflys, not bench flys – after your bench-press, how about putting them before, as a form of\npre-exhaustion? You will NOT feel the same way if you do that\nexercise sequence in the reverse order. It's going to- JESSE: Jeff? JEFF: Yes. JESSE: You're messing with National Chest\nDay. JEFF: I said \"International Chest Day\". JESSE: I know. You're messing with it. JEFF: But what's the point? This is what's going to benefit you. JESSE: Yeah, but you can't mess with International\nChest Day. That's just the way it is. JEFF: What are you – why? Because you don’t know what to do on a Monday\notherwise? JESSE: Maybe not! I don’t know what to do on a Monday. JEFF: Have you been following our programs? JESSE: Yes, but I like to do chest Monday. JEFF: You don’t do chest every Monday. JESSE: I like to do chest on Mondays anyway. JEFF: So you've still been doing it? JESSE: Yes. JEFF: Guys, don’t follow him. If you're looking for a program that actually\nmaps out what to do, you won't have – turn this way. You won't have a chest that looks like this. You'll actually have a chest. You can get that, guys, by following our step\nby step programs over at ATHLEANX.com. We put the science back in strength. We lay it all out in a progression that makes\nsense, and that actually, yes, makes you get better gains, faster. Those are all over at ATHLEANX.com. If you've found the video helpful leave your\ncomments and thumbs up below. In the meantime, I'm getting out of here. I'm not standing too close to this guy. See you. MALE: Seriously?! Works every time."
}