{
    "id": "6rr5p1jCZC4",
    "title": "Stop Doing Chest Flys - I&#39;m Begging You!!",
    "description": "There are 6 reasons why you should never do a dumbbell chest fly ever again, and I'm going to show them all to you in this video.",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to perform a dumbbell fly\nfor you, but only because I want to dig it up out of the iron graveyard so I can re-bury\nit and throw one more pile of dirt on top of it. But I want to show you something different. I want to give you guys an alternative. I’m not trying to pick on the exercises\nI’m trying to stress to you that there are better alternatives. I’m going to lay out the four reasons why. Number one: we know with the dumbbell fly\n– I’ve even broken out the muscle markers to show this, guys – we’re in vulnerable\nposition here on this exercise. Just by doing it on the bench. I’ve talked about why I prefer the floor\nfly to its safety with the shoulder, without detrimental effects to the exercise because\nof the supported, or unsupported status here, at the bottom position of this fly. If I’m on the floor, I have a floor to support\nme. If I’m on a bench I have nothing to support\nme. There’s no protection against this overextension\nhere. Even if you’ve lightened the weights to\naccount for the fact that you’re weaker out here, you can still fail and cause excess\nstress to the front of the shoulder here. Mainly the anterior shoulder capsule. That’s something we don’t want to mess\nwith. That’s point number one. Point number two: because of this fact here,\nwe know that the weight in a bench-press becomes heavier here, feels heavier, in a fly. Whether there’s a slight bend, or a straight\narm here, virtually by the fact that our moment arm has increased. The effect on the muscle here, which is the\npec, becomes heavier because the pec is less able to apply its force as the distance of\nthe dumbbell gets further away from it. So, we know it starts to feel heavy, and we\nstart to feel weaker out here. If that’s the case, we have to decrease\nthe amount of weight we use to accommodate for our weakness in this position out here. I might be able to have a lot more weight\nup here at the top, but I can’t use it because I can’t support it down here. So that’s problem number two. Problem number three is, at the top, at the\nvery top of this exercise we’re here, applying very little, if no force at all, to the pec. I can sit here forever. But this is where we want the most because\nwhen the pec is in its peak contracted state, or close to it because we want to get to full\nadduction – even across midline, if possible. So that’s a strike against it. So, three, very real strikes against this\nexercise. Last, I’ve broken out the muscle marker\nto show you one other thing. We talked about the stretch on the pec. Like I said, I like to do this exercise because\nof the stretch I feel on it. We know that there are better alternatives\nto that as well. You can go to a bottom portion of a dip to\nget a better stretch on the pec than you can here, in this exercise. But what we’re really feeling is, you’re\nconfusing it for a stretch on a different muscle. We know when we get to the bottom of a bench-press\nlike this, we can see the pec is noted here by the purple muscle marker’s markings on\nthe sternum here. Then out here on the upper humerus. You can feel that attachment. You can trace the pec with your fingers, right\ninto where it attaches. We know from this position, if I were to increase\nthe length of that moment arm by opening up my elbows, the distance there, the amount\nof extra stretch on the chest is almost absent. If anything, it’s extremely minimal. Even if I brought my arm down a little bit,\nit’s very, very minimal. What I’m feeling is extra cartilage stretch\nin the ribcage, and I also feel the stretch in my arm, but that’s due to a different\nmuscle. That’s due to something called the coracobrachialis. That muscle starts in here on the coracoid\nprocess, deep inside the shoulder, and it runs outside, further down on that same humerus. You can see a little piece of it underneath\nthe bicep here. It’s inside here noted it up top here, too. Just so you have the general position. But you see when I take my arm from this position\nin here, at the bottom of the bench, and then I open it up, what increases in length is\nthe distance between those two points. Not by a lot, but by enough to feel the stretch\npalpably in that muscle. So, for those that are arguing “I feel a\nlot of extra stretch here”, it’s not really what you’re feeling. So, what’s the better alternative? I told you I wouldn’t leave you hanging. I’ve gone to this exercise plenty of times,\nguys, because there’s a reason for it. It’s a better alternative. Remember, the fly isn’t locked into being\nperformed on a bench like that with your arms out to your side. The fly is basically taking your arm through\nhorizontal adduction, realizing that’s the primary function of the chest. If you can get it across midline at peak contraction,\nwe’d be going good. So, we can do that with a cable and if you\ndon’t have a cable you can anchor a band to anything and do the same, exact thing. Now, look at the difference here. When I start in this position here, what do\nI have? I have the least amount of force on the chest,\nalmost zero, because the line of force is parallel to my humerus now. What I basically have is the least amount\nof force being applied in the weakest position of this exercise. That’s good because now I’m not a slave\nto the lighter weights. I can use the heavier weight and I can lift,\nand command in this top position. So now I have peak force applied here to the\npec because of the varying line of resistance of the cable. And it’s in this peak contracted state. So now the pecs are doing a lot more work. And I can use a heavier weight here. I don’t have to go light to account for\nthe fact that I can’t hold that weight out there safely. I can use the heavier weight so when I get\nup to the top here, I’m able to utilize that to my advantage. At the same time, I’m not concerned about\nthe extra a stretch, for the same reason I talked about when we were lying down on the\nbench. But what we’ve done is created an alternative,\nwhich is what? An adduction exercise. That’s what it is. It doesn’t get subject to the fifth thing\nthat I didn’t even talk about before. That is – we’ve said that even when you\nget to the top of a fly, there’s no resisted adduction up here. It’s absent because the weights are now\nmoving this way, but gravity is acting down. We can do more than that with this. We can continue to resist, resist, resist,\nresist across midline. A much more significant impact on the chest\nitself when you’re training it. So, guys, I’m not trying to pick on it. It’s time to bury the unsupported chest\nfly. A lot of guys want to do it. Do the motion. It’s critical. You need adduction. You’ve heard me say that a million times. The chest fly will give you adduction, but\nin an inferior way. Do it with a cable or band and I promise you\nguys, you’ll get better results. If you’re looking for programs that put\nthe science back into what we do, we choose exercises based on those that are backed by\nscience. Not just random ‘hey, this is what everyone\nelse in the gym does’. We choose the right ones based on science. They’re all built into our programs, all\navailable over at ATHLEANX.com. If you’ve found the video helpful, make\nsure you leave your comments and thumbs up below. If you haven’t already done so, make sure\nyou subscribe and turn on your notifications, so you never miss a new video when we put\none out. All right, guys. See you soon."
}