{
    "id": "6yp_-GcB4ew",
    "title": "MAX GAINS SERIES: Triceps Pushdowns",
    "description": "If triceps pushdowns are part of your tricep training then you are going to want to watch this video on how to squeeze every gain ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re going to talk all about the\ntricep pushdown. I am going to show you how to squeeze every,\nsingle ounce out of this exercise to get the best impact of it, because I know a lot of\npeople are doing this exercise. I’ve got to tell you; a lot of people are\nmaking some big mistakes when it comes down to it. We’re going to break it down from the anatomy\nof everything that’s going on in the elbow, actually in the shoulder as well, to perform\nthis exercise, and I’m going to show you why the little things matter. Where are the position of your elbows in relation\nto your side? What that has to do with the effectiveness\nof the exercise. Where your hands should be in relation to\nyour body when you’re doing the pushdown. The fact that your wrist and the placement\nof your wrist will have a key component in terms of maximizing the effects that you see\nfrom this. Also, when we’re talking about the wrist\nand the positioning of our arms and forearms, what’s happening here when we supinate,\nor pronate our forearms? Are we getting a different impact on the triceps\nthemselves? I want to cover all that here today because\nI’m telling you guys, if you add all these things up it’s going to make this exercise\na homerun for you every, single time you do it. So, what we want to start with is the position\nof the hands in relation to the body during a press down. It doesn’t matter which implement you’re\nusing at the moment because we want to talk about – even with a straight bar here – is\nhow close are you to the machine? Some guys will get right up on top of it like\nthis. Some guys will be a little further away, here. Still, others will actually be away from it\nand when they press down their hands are actually out in front of their bodies. You’ve probably seen all three, but which\none is right? Which one should you be doing? It depends. The fact is, when you get up on top of the\nbody here, the first thing you’re doing is letting the triceps rest. A lot of us will get our hands up in this\nposition near our chin, and this is not really placing a lot of tension on the triceps. We know, in order for this to have the most\ntension we want this line. The line here of the cable to be perpendicular\nto our forearms. So that would mean, if we’re going to get\nreally close to it, we want to have our hands starting at about waist level to actually\nhave tension on the triceps. Then we would go from there. So, the range of motion would go from here\nto here. Whereas, we know if we take a little step\nback here, we know we could still be a little more perpendicular to our forearms at a higher\npoint. Now, closer to our chest. We go through here, we have a little more\nrange of motion on the triceps in that position. But we also realize that if we went too far\nout away from our body, now the arms – just by virtue of being too far away – are going\nto have to drift. As soon as the elbows drift away, in order\nto get this down, and back, we’re going to probably initiate here with the lats. By initiating with the lats, it’s not necessarily\nwhat we’re trying to do if we’re trying to get the most work done by the triceps. I’ve talked about position here, where we\ncan actually do a rowing pushdown, but that’s really to cheat the concentric portion of\nit to overload the eccentric on the longhead on the way back up. But that’s not what we’re doing here. We’re doing a traditional pushdown. So, you have two options. You can either take that midpoint that we\ntalked about, which would be hitting a longer range of motion, and still getting the effectiveness\nof the exercise without compromising too far, or too close. Or you could do the rocking tricep pushdown,\nwhich is an exercise that I covered in depth. I’ll show you the video that we covered\nit, and what it looks like here. I want you to watch it when this video is\nover. I’m going to make sure I link it at the\nvery end. That will show you how to get the most out\nof that exercise from the beginning to the end, by changing the position of your body,\nin relation to that, by using this line of resistance, and keeping it as perpendicular\nto your forearm as we possibly can. Now with that covered, now I want to move\non and start talking about the positioning of the elbows and how far, or how much drift\nwe’re going to allow before we don’t want to have that anymore. Now we’re talking about the elbow positioning. What you want to make sure you’re not doing\nis allowing your elbows to start drifting so much that it starts to put you into this\nposition. We call this the jackhammer pushdown. It’s not a good thing. I’m sure you’ve seen guys doing this all\nthe time. They get up here, they load the weight up,\nand they’re pushing down just like this. That’s the jackhammer push. They look like they’re operating a jackhammer. The reason why you could use so much more\nweight to do that is because you’re not doing a pushdown anymore. What you’ve done is, by getting your arms\nhere, internally rotated, and elbows out, and now getting up on top of it, you’ve\nactually created a scenario where you’re doing a standing dip. Now what we’re doing is, if I were to take\nthis and pushdown there’s no difference than if I do a straight bar dip, or even a\ndip where I have my hands in closer. Now I’m activating the chest a lot to complete\nthe exercise, and we’re no longer letting the triceps do the bulk of the work. So, if you want to do this right, what you\nwant to do is the opposite. You don’t want the elbows flaring. You want the elbows held nice and tight to\nthe body. By virtue of doing that, you’re going to\nget more longhead involvement that crosses the shoulder joint, and attaches to the shoulder\nblade, that will actually want to be adducted and have your elbows in tight. Here’s the best way to do that. You want to go for elbows tight, hands wide\nposition. As far apart as you can. So hands like this, as wide on the bar as\nyou can. Elbows as tight as you can. You could almost pull apart on the bar here\nand keep the elbows tucked in this way. That’s going to keep you in this position\nright here. So, we’re not allowing the drift of that. We’re keeping it in tight, which now focuses\nall the movement on that arc of this extension, and flexion here of the elbow, which is going\nto maximize the work of the triceps. The next interesting thing is, whether or\nnot it even matters, whether or not you’re doing an overhand pronating grip pushdown,\nor an underhand grip. A lot of guys will swear that when they’re\ndoing the underhand grip they feel the longhead of the tricep, way back in here, contracting\nwith much more intensity. Others will say it doesn’t even matter. If you look at the science and anatomy there,\nat first glance you would say it doesn’t matter. Here’s what’s actually happening. Look here at the bones of the elbow. Really, if you look down a little lower you’re\nlooking at the bones of the forearm here. You have the ulna, and the radius. Now, the ulna is actually the part of the\nlower forearm that is hinging on the humerus to create the elbow joint. That is the bone that the triceps all commonly\ncome together and attach to. That means, if that happens to the ulna there\nthen, yes, you can argue that there will be a difference, or an impact on what’s happening\nwith the triceps. However, the radius is what creates supination\nand pronation of the forearm. The radius will roll over the ulna to create\npronation, or supination here at the forearm. But the radius and the radial ulnar joint\ndoes not impact what’s going on with the ulna itself. Meaning, that pronation and supination at\nthe elbow should not have any impact at all on the effect of the triceps. But here’s what happens: it actually does\nbecause we don’t operate in a vacuum. We have a joint that’s actually connected\nby virtue of being part of our arm to our shoulder, through a kinetic chain. That means, when we do things down here, we\ntend to do things up here as well. What I’ll show you is, when I get here into\nthis position and go into a pronated position, what usually happens when I’m in this pronated\nposition, my elbows will tend to want to drift away from the body. Even if I try to pin them as much as I can\n– you can do this without a bar in your hand – you’ll see that it’s a lot harder\nto get your elbows pinned tight to your body. Even back into extension, keeping them tight\nat the same time, if you have your forearms pronated. When I go underhand though, if I’m in this\nposition when I go underhand into supination, all of a sudden, those elbows will also come\nin. It’s much easier to get my elbows tucked\ninto adduction at my side and back behind my body to get that longhead into full contraction\nby having my hands in this underhand position. It has nothing to do with what’s actually\ngoing on at the forearm. But more of what the repercussions of changing\nthe orientation of your forearm will have on your ability to keep your shoulders in\nthe right position, to get into a better activation zone for he longhead of the triceps. That is why those that do this exercise and\nfeel like – especially if they’re doing a one-handed version of it – but if they\nget their arm back behind their body, that’s what you’re feeling. You’re feeling a better activation of the\nlonghead because of that. Not really because of what’s actually anatomically\nhappening here at the forearm. Now, get a little bit low here so I can explain\nthis next one for you. We want to talk about the position of the\nwrist. That means what type of implement we’re\ngoing to use. Is a straight bar the best thing you could\nuse? Do you want to use more of an angled V-bar? Or ropes, in order to better hit the triceps? I could tell you this, the straight bar is\ngoing to create limitations. Especially if you’re someone that has wrist\nissues. Here’s what happens. If we were to get into the tricep pushdown\nhere and we were to perform the exercise, one thing we don’t want to happen is overactivation\nof the wrist flexors to perform the exercise. That means we’re taking away from the work\nof the triceps. We get down to here, the triceps can’t do\nanymore, and then the wrist flexors try to cheat all the way down. We don’t want that. Some people even recommend just hooking fingers\non here, and getting into extension, and pushing down that way. So, when I’m down at the full position here\nyou can see that my wrists are into extension. But what I’m now focusing on is making all\nthe work happen through the triceps, just by having elbow extension. Here’s what happens, though. When we’re in this extended position of\nour wrist – and you could do this yourself – just lift your wrist up like that. Now, what happens is, when you got into full\nextension, you’ll see that your hands will actually angle a little more toward your thumb. They’re almost turning up this way. If I go into extension they’re not flat. They’re actually angling toward the thumb\nside here. So radial deviation is a component motion\nof extension of the wrist. So, we want that, but if I take my hands – which\nwant to be here. Again, extended like this, and then up into\nthis angle of radial deviation. If I force that down to get flat, to hold\nonto a straight bar, do you know what’s going to happen? Likely, you’re not going to allow it to\nhurt your wrists anymore. Or if you have a wrist restriction, to keep\npushing, and pushing, and pushing. What’s going to happen is this. If I can’t keep my elbows in here, and now\nI’m in this position, and I want to turn them down, and I can’t get them down anymore,\nwhat’s going to happen? I’ll cheat them down by just going like\nthis with my elbows. So, if my elbows come out, then I’ll act\nlike I’m getting more of this downward position in my hands to grab the straight bar. But what I’ve done is, I’ve just got myself\ninto that same issue we just covered, which is the positioning of the elbows too far away\nfrom the body. You want to make sure you’re aware of the\nfact that your wrists are going to be a key component of how you do the exercise. If that means using a straight bar or using\na rope to get into a position where your hands can be a little more angled upward; that’s\nwhat you should do. All right, guys. Finally, we bring it all home here asking\nyou the question “what are you actually trying to train? What area of your triples are you trying to\ntrain?” Are you trying to train the lateral and medial\nhead on the outside of your elbow here? Or are you trying to train that longhead of\nthe triceps? That meatier area on the underside here, closest\nto your side. You actually have the opportunity to do that. How you perform the exercise will actually\nhelp you to get more, or less from any of those heads. Here’s what we want to understand though. The two on the outside – the lateral head\nand the medial head – all they do is extend the elbow because they don’t have an attachment\nover the shoulder onto the shoulder blade it doesn’t matter what else is going on. The only thing that’s happening is how much\nextension you have at the elbow or not. So, if you were to do the exercise – going\nback to the beginning of the video that we talked about – let’s say you were going\nto do the exercise and have it out in front of you and just do this. Let’s say we’re not allowing the elbows\nto move, so we’re not worried about overactivation of the lats. We’re just talking about extension, and\nthen flexion. Extension and flexion. You could preferentially hit those two areas\nof the triceps better by performing the exercise that way. But if you wanted to hit the longhead. You could actually do that too because the\nlonghead exercises aren’t always the things that put the elbows and the longhead of the\ntriceps in stretch. We also have to consider the fact that the\nlonghead can be placed in a position to have a stronger contraction, by getting it into\nits fully contracted position. Which means close to the body, and back behind\nour body. We could do that if we make some changes to\nwhat we’re doing here. The first thing I would say is, it’s pretty\ndifficult to use a straight bar to do that. We already talked about the wrist limitations\nof that. Even if I went underhand, as I’ve said,\nit’s a little easier to get back there, but you still hit your body with the bar. So, right away, if I was trying to get more\nlonghead contraction here, or a stronger longhead contraction I’d maybe want to go to a rope. But here’s the thing with the rope. I’m still going to have the same issue when\nI come down here. Yes, I can get my arms tight and behind my\nbody, but I’m going to wind up hitting my body here if the rope isn’t long enough. What I always recommend in this position and\nin this case is to have access to something really long. Now, my buddy Schmitty Diesel with the straps\nhere, we have access to something much longer. So again, it doesn’t matter what you use. I just want to make sure that you have something\nmuch longer than a regular rope. Now look what happens. If I get into this position here, my elbows\nare tight and behind my body, look what I can do now. I can get way back behind my body with my\nhands into full extension because the rope is going to allow me that excursion. I can actually turn this pushdown into, almost,\na standing tricep kickback, which we know will hit the longhead of the triceps in that\ncontracted range. The fact is, guys, have a game plan and an\narea of what you’re trying to accomplish, and you’ll be able to do it. As long as you’re now armed with the knowledge\nof knowing how to attack the tricep pushdown. Again, there’s a lot you could do with this\nexercise. There’s a lot you could get out of this\nexercise. But it’s really helpful to understand all\nyour options and the best way to do it. So, I hope we just did that for you in this\nvideo. In the meantime, if you’re looking for a\ntraining program that pays attention to the details because they matter, guys. The anatomy is our anatomy for a reason. It sets us up to perform in a specific way\nthat we can operate at our best. If you apply that to every one of your workouts\nand exercises that you do, you’ll be amazed at how much more you’ll get out of your\nworkouts. That’s what we try to accomplish with our\nATHLEANX training systems. They’re all available over at ATHLEANX.com. In the meantime, if you’ve found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the days and weeks ahead. All right, guys. See you soon."
}