{
    "id": "72p58Iy6u7M",
    "title": "How to Fix Plantar Fasciitis (NO MORE HEEL PAIN!)",
    "description": "Wondering how to fix plantar fasciitis once and for all? Not by doing the same overused methods that you've likely already tried.",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to show you how to fix plantar\nfasciitis once and for all. All right, guys. If you have plantar fasciitis you know it. It’s one of those ailments that you instantly\nknow you’ve got because you’ve got that defined heel pain. Almost that sharp, knife-like pain in your\nheel. Especially when you get up in the morning,\nyou take that first step, and it feels like someone is ripping the under foot apart. That is essentially what’s happening there\nbecause the plantar fascia – which we’re going to show with this piece of band here\n– is absorbing stresses that it never has to in the first place. The problem is, all our focus and attention\nwhen we go for treatment is on this plantar fascia. That’s the mistake because, again, this\nis not the cause. This is the result of what’s happening somewhere\nelse. So, when we look at the foot, when we look\nat the plantar fascia, we know what it does. It’s supposed to attach back from the heel,\nup toward the toes, and its main function is to provide some support for that arch that\nwe have in our foot. A lot of us don’t have it. I have none because I have an extremely flat,\npronated foot. Well, it’s supposed to provide some good\nsupport for the arch. What it’s not supposed to do is have to\nprovide support during propulsion and to absorb all the forces of propulsion when we move\nour body. That’s what we’re asking it to do by having\nthings wrong with the mechanics of our ankle, or our knee, or hip, or even our back. Literally, our midback can cause issues down\nhere and you have to address those. If we’re talking about this, why is it so\nimportant? Because it comes down to the heel. You can see here with the heel, there are\na couple of states I want you to see, guys. The first thing is, we know we have mobility\nof the heel. This is the calcaneus. We know that it can move either in this way\n– inverted – or it can move out – everted. When it moves out, that’s associated with\nthis ability of the mid foot to adapt to the surface that it’s on. It becomes a lot looser. So, if I take this, and I move it out – you\ncan do this on your own foot, by the way. You’ll feel this. If you move the heel out you can see that\nall the joints in the mid foot are nice, and loose, and mobile, and I can twist and turn. That’s what happens when our foot hits the\nground. We go into this pronation, the heel kicks\nout, we go into this pronation, so we have the ability to adapt to the surface. Even if it’s an uneven surface. You want to have the ability to have that\nmobility to absorb the stresses of that. If your foot was a rigid lever here and it\nhit the ground every time, there’s nowhere for the forces to go, except up into the knee,\nup into the hip, or even up into the low back. Which can cause problems. You want that mobile adaption here to absorb\nthose forces. The next thing it does, if I turn it in and\nI invert it, what’s happened here? All that mobility is gone. You can see this is a lot more rigid here\nthan it was before. That’s a very important thing – and a\ngood thing – because what happens when I want to push off my foot when I’m running? I want it to be rigid, so I can push off and\ngain a lever and propulsion forward. If it was trying to push of a loose foot,\nyou could see that would be unstable and that’s not really productive, in terms of propelling\nme any distance with any force. There’s the problem. The problem is, and what happens is, when\nwe get into a position where we need to propel; that foot is in an unstable, loose state. That heel is everted instead of inverted. So how do we fix that? What’s the cause? Well, there are a lot of causes. Let me show you. We come back up. Again, people spend all their lives rolling\nit out with a tennis ball, getting an ultrasound on the bottom there, doing all the things\nto try and loosen that up, and that is not the problem, guys. That’s not the problem. You’re going to get temporary relief of\na symptom, but you’re not going to get at the cause. So, throw that away. What we do is, if I’m in – let’s talk\nabout walking and running. As I start to walk, again, when my foot hits\nthe ground here, I need the ability to adapt to that surface. That’s going to allow the absorption of\nforces, so I don’t get too much going into my knee, or hip, or low back. Then as I start to go through and walk through,\nI need this to lock up, at some point. We need that heel to kick in. So, I get that ability of that foot to the\noriginal lever, so I can propel off, and then step through, and then go again. Well, I could tell you this: if you have tight\ncalves, you’re going to lose the ability to do that. You’re going to cause a timing issue down\nhere in your foot that will be felt and absorbed by the plantar fascia in a way that it’s\nnot meant to handle. Let me spell that out for you a little more\nand show you how that works. Let’s say I’m – let’s work on this\nside here. As I’m through, you can see that’s the\nmoment and gate I need the most dorsiflexion. Meaning, the bending of the ankle upward. Closing down this angle between my shin and\nmy foot. I need dorsiflexion here. So, as I go through, if I don’t have dorsiflexion\n– why? Because I have tight calves and I can’t\nget that. What’s going to happen? I’m going to get dorsiflexion, but not from\nhere. I’m going to get it through that mid foot. How do we get that dorsiflexion here through\nthe mid foot? We have to make sure it’s loose. We have to make sure it’s unlocked. We have to make sure that heel is kicked out. So, what we do is, if you look at it – and\nI’m going through here. I don’t have any more dorsiflexion, but\nI know I need it because I need to be able to load this hip up to be able to come through;\nwhat am I going to do? At that point, I’m going to take it from\nhere by keeping the heel kicked out by having the foot collapsed down. Guess what happens now? Now, when I got to take a step – and I’m\nnot just talking about taking one. I’m talking about running a mile and taking\nhundreds, and thousands of steps. Every time, I’m pushing off an unstable\nfoot. A loose, floppy foot. The only thing that can provide support for\nthat is that lousy, little plantar fascia under your foot, which is not designed to\ndo that. Support the arches standing? Great. But to be able to supply the rigidness of\nthe foot to be able to propel yourself? No chance. So now I try to push, and I try to push, and\nI try to push, and I do that over, and over, and over again; that creates a lot of inflammation\nand strain in that tendon. Over time, it can cause some tension stress\non that tendon this way. Which causes heel spurs to form because of\nall that traction stress. And it’s just a big mess. But you need to stretch your calves out. So, we talked about some other causes. I’m going to get into those in a second,\nbut what’s the problem? What would you do for your calves? “Well, I’ll just go hang off here. Like this. If I just do this, and I hang down” – this\nthing is going to fall over on me. If I’m here, and I stretch my calves like\nthis, on the stairs, that should do it.” No. That won’t do it. That won’t do it because you’re not mimicking\nthe stress that you’re under when you’re at that moment in that backside gate that\nyou need to fix. So, what you would do is a stretch over here\nagainst the wall. You’re probably saying to yourself “Well,\nI’ve done this before. Okay, do that calf stretch? Yeah, do that with both your knee bent, and\nwith your knee straight so you work the gastrocnemius and the soleus, and I should be good to go.” Not really. There’s something you’re overlooking here. If you remember, when I took this position,\nthat position of the heel. We said that the problem was that the heel\nwas kicked out at that point. We want the heel to be able to be inverted,\nkicked in so we can turn it into that rigid lever we can propel from. So, if we’re in that position here, what\nyou want to do in order to turn this heel back in the proper position to be inverted\nhere, you want to drive your foot across your body here. You want to drive your leg across your body. So, it’s not just this way because if I’m\ndoing this, I’m just feeding more into that down, and in position, which is part of the\nproblem. I can turn it on by just allowing my foot\nto come and reach this way. So, as I reach into the wall that way and\nstretch back here, now what I’ve done, as you can see, I’ve kicked that heel in. Which has turned this foot into the lever\nit’s supposed to be. Now I’m stretching out the calf in that\nposition. Just like that. What we can do is make it more dynamic, where\ngo and reach across the body that way. But as I reach in, I’m still pushing down,\nmaking sure this heel is in contact with the ground to stretch that calf out. If I wanted to turn in all three dimensions,\nI could try to rotate back toward you guys there, and you can see that just by rotating,\nhow the heel has to kick in, and I maintain that stretch. You walk away from that stretch and you’re\nlike “Wow! That feels a lot looser.” Now, if I’m in this position here, my heel\nis better able to absorb those stresses and turn into that rigid lever without having\nto be thrown onto that plantar fascia, which is the problem. Now, how could other things be causing it,\nand what could you do? Outside of doing that stretch – which, by\nthe way, a quick way for you tell – if you have pain, say, in my left foot, and you go\nto test your calf flexibility; if you notice you have tight calves, that is almost always\nthe cause of the problem that you’re dealing with. So, you would stretch the calves like I said. You do this religiously. Every, single day. Just go through it for about three to five\nminutes every, single day. Sometimes multiple times a day. Over the course of a few weeks, by taking\nthe stress off the plantar fascia that inflammation will go down and your problem will be solved\nonce, and for all. But, let’s say you test your calf on that\nside and it’s loose. You don’t have any tightness in your calf,\nbut you still have pain there. Well, then you’ve got to look at the other\nside. Problems in the other side can cause loading\nissues on that side. So, let me give you an example. We talk many times here about the importance\nof having glute medias strength, and how a weak glute medias – and squatting alone\nisn’t going to do it, guys. Deadlifting alone is not going to do it. You need to strengthen those muscles independently. If I have a weak glute medias that does this,\nwe know it’s that Trendelenburg Gate that Jesse demonstrated so well back in that anterior\npelvic tilt video. If this drops because this is loose here,\nwhat has it done to this foot? You can see what happened. Again, if I put my weight this way, because\nI have a weak glute medias on this side, you can see it’s collapsed this foot. It’s kicked the heel out on this side. It’s made the arch fall here. It’s created that loose midfoot. So now if I’m trying to run and I’ve got\na weak glute medias on the opposite side, you can see how all those things are going\nto happen to you again. I’m going to have that midfoot trying to\npropel an unstable foot, and we’re going to have a lot of issues. So, you want to strengthen this opposite side’s\nglute medias. I’ve done a whole video on that, on how\nto od that. I’ll link those at the end of this video. But you would do something like, if I was\ntrying to strengthen this glute medias I’d stand up here against a wall, I’d let it\ndrop out to the side, and then I’d lift it up and squeeze in. So, drive this hip toward the wall. This is just going along for the ride. Drive it in, squeeze. Drive it in, squeeze. You can feel it right here, in that glute\nmedias, doing all the work. You can do that – you can even weight it\nby using a resistance band as well. Now, one last thing. I talked about all the way into the low back,\nor the midback. How the hell could that have any impact on\nwhat’s going on? Well, when you walk, you’re supposed to\nbe able to rotate. You don’t see it as much, but we do. Obviously, as we step, we rotate. With every step we take. So, let’s say I’m able to rotate this\nway. I’m going to over rotate this way. What happens as I rotate this way? You can see this foot comes down. It goes from here, and down. So, that means if I can rotate in this direction,\nthis is going to come down. If I can’t rotate back, that’s going to\ncause a problem in our ability to get out of that position here. If I lack rotation in the opposite direction,\nthat’s going to prevent me from being able to – in a magnified way, as we do step,\nafter step, after step, after step, and run, after run – that’s going to prevent me\nfrom being able to get off that unstable foot. That’s going to cause a problem. So again, an inability to rotate can cause\nthat foot to be put in the same position. So, you want to maintain thoracic extension\nbecause thoracic extension gives you the ability to rotate. I can’t rotate much when my spine isn’t\nextended. If I can get full thoracic extension – again,\nwatch the video that we did on the posture fixes and how to do that. It’s critical. You need to maintain thoracic extension. But if I could get there, and then I could\ndo rotation as well, and we can work on that with a drill I’m showing you right here\n– which I’ve shown you many, many times before. Those will now allow you to maintain good\nmobility through your spine, so it doesn’t down-load, toward your ankle, and into your\nplantar fascia, once again, causing all these issues. So, the highlight here is that you’ve got\nsome things to work on. The first thing you need to do is figure out\nwhat is essentially causing your pain. Run through some test to see your stiffness\nand flexibility on those ankles. Assess your glute strength, see if that could\nbe an issue. Once you’ve identified it, guys, it’s\nall going to make sense. But for heaven’s sake, stop looking at your\nplantar fascia and blaming it saying “Why is this damn thing not working? Why is rubbing this ball not maintaining a\nsolution to this for the long-term?” Because that’s not the problem. That’s never the way to solve it, guys. You’ve got to look above at the other joints\nto see what’s going on. We’re one big, kinetic chain. So, there you have it, guys. I hope you’ve found this video helpful. We always try to put the science back in strength\nhere. Again, it’s a bit of a detailed explanation,\nbut I think the guys that are suffering from this – and girls – are going to really\nappreciate the explanation because they’ll finally understand why they haven’t been\nable to solve it. If you’re looking for programs that build\nin the science in everything we do, all our training, all our workouts are built on science. You can get them over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful let me know below and leave your comments on what other things I haven’t covered,\nthat maybe I could help you address. I’d be glad to do those in the days and\nweeks ahead. If you haven’t already, guys, please subscribe\nand turn on your notifications so you never miss a new video from us. All right. See you soon."
}