{
    "id": "7Nu7eSe9KHQ",
    "title": "Ab Workout with Dumbbells (CHISELED ABS!)",
    "description": "Get rock hard abs here - http://athleanx.com/x/chiseled-abs Subscribe to this channel here - http://bit.ly/2b0coMW Do you ever do ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. We're doing an ab workout today and we're\nusing dumbbells. You see, I'm a proponent of incorporating\nweighted ab work into your ab training. Not just that, you can actually – as you'll\nsee today – use a dumbbell for, not just the added weight, but as an implement to do\nyour ab workout. You're going to see in our third exercise\nhow we do that. But the idea here is, we're going to do a\ndrop set. We're going to run the rack. We're going to do a gauntlet style, as my\nboy CT would say. The fact is, make your exercises and your\nworkouts harder by incorporating different techniques into how you do them. I think the biggest place we fall stale in\nour training is ab training. We literally just do either reps until we\nget bore, or we just do everything in straight sets. We do nothing to change up the way we train\nour abs, and that's not going to be the case today. So we've got four sets of dumbbells for me. I'm using 25s, 20s, 15s, and 10s. Maybe you can't start that high. That's okay. You can drop down to the point where you're\neven just doing bodyweight. You can even do two rounds of bodyweight,\nbut we've got four rounds. You can do the four exercises shown here. We're going 10 reps in each direction on the\nRussian twist. We're doing 10 reps on the Otis-Up [0:01:13]\non both arms, we're doing 10 reps on each arm with the single arm dumbbell rollout,\nand then we're doing 10 reps one each arm of a single sided renegade row. All right, guys. Let's get this thing rolling and let's see\nhow far you can stick with me. So there you have it, guys. A complete dumbbell workout for your abs. yeah, that's right. Not just for the sake of adding dumbbells,\nbut for the sake of actually making your ab training more difficult. Break out of the monotony. Break out of the routine of ab training and\nyou'll start to see much better results from them. Guys, if you're looking for a way to break\nout of the routine, to start training like an athlete so you can start getting better\nresults from your training; head to ATHLEANX.com and get our ATHLEANX training program. In the meantime, if you've found this video\nhelpful, if you like this workout, if you continue to like to see me put myself through\nthe pain, let me know below and I'll continue to try to do that as often as I can. In the meantime, let me know what else you\nwant to see and I'll cover that in a future video. All right, guys. See you soon."
}