{
    "id": "7R88yqmcGrw",
    "title": "Which Triceps Pushdown is Best for Your Triceps (IT MATTERS!!)",
    "description": "If you want to build bigger triceps then surely you are doing triceps pushdowns right now. But do you know which version of the ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. \nToday I'm going to answer the question for you,   which version of the Pushdown is when you're \ntrying to build bigger triceps? I don't know   if you know this, but I'm actually a mind reader. \nAnd a few times in this video, I'm going to read   your mind exactly what you're thinking, okay? \nLet's start first of all, you're thinking,   what the hell is Jeff doing in a tank top? You \nknow you were thinking that. And where can I   get that killer tank top? Well, you actually can't \nget it over at Athleanx.com because we don't have   tank tops, we have t-shirts that I cut the sleeves \noff of to create tank tops. We don't have hoodies,   we don't have sweatpants, we don't have shorts. \nOh, by the way, speaking of shorts, we do have   is a brand-new Athlean-X shorts channel athlete. \nAthlean-X videos in 60 seconds or less. You're   going to want to make sure you go over there, \ncheck it out and subscribe. That being said,   I digress here, guys. What I want to do is figure \nout though, what Pushdown is best for you. And to   do that, we all have to be able to do something \nthat we could do right now without having to   be in front of a machine to test it out.\nAnd let's stand up and I want you to straighten   your arms, palms down towards the ground, create a \nhard tricep contraction just like this. They hold   it for about two or three seconds. The next thing \nwhat you do now is take your arm, shake them out.   Underhand now palms up and I want you to bring \nyour arms down and contracture triceps as hard   as possible. So now mind read again because I \nknow what's going on in your head right now.   What you're thinking is why the hell did I stop \ndoing the other handgrip push down? Because I feel   that a lot more than I do the overhand grit. And \nthere's actually a reason for it. And I actually   know what else is going through your mind. \nHere's the third time you're actually thinking to   yourself, I stop doing this because I was told to \nanatomically it doesn't even matter whether I'm in   pronation or supination that doesn't impact the \ntriceps. How am I doing on these mind reading   things right now, guys? Probably pretty good. \nWell, you were told good information because   there is no impact on the triceps, whether or not \nwe're supinated or pronated or so we think.\n  See the biceps, if I'm in this position here and \nI pronate or supinate, you can see that it impacts   the contraction of the biceps because they're \nattached to the radius. But with the triceps   being attached to the ulna, it doesn't matter \nwhether it's supination, pronation. Or again,   like I said, so you think. Because if I get \ninto an overhand grip Pushdown or whether I   get into an underhand grip Pushdown, something \nmajor happened that you maybe didn't even see.   If I got here and I were to go into isolated \npronation or isolated supination, then yeah, that   doesn't impact the tricep at all. But we don't \ndo things that way, we're a kinetic chain. What   we do is we move more than just the forearm when \nwe do supination, pronation. And when we do that,   you can see that we've impacted some other things. \nWe've brought in internal rotation to the shoulder   when we did the pronation an external rotation, \nwe went to supination. And we also have an   impact here, most importantly on the elbow and \nhis position related to my body. If we keep our   elbow tucked nice and tight and our arm back, \nwe're going to get the long head of the tricep,   that big meaty area in the back here, the one \nresponsible for the most size. We're going to   get a better full contraction on that head of \nthe tricep as opposed to in our arms, out in   front of our body and the elbow is drifting.\nSo, you're probably already thinking, well,   I'm already going in the direction then of the \nunderhand pushdown. Well, you're right. When   I'm in this position here at the elbows drift, \neven just a little bit. And we probably seen the   guys that do this, too and really bastardise it, \nwith just the drifting of the elbow a little bit   in the fact that the arms are a little bit \nout in front of the body is going to limit   the impact on the long head of the tricep. When \nI flip underhand like this, you can see that the   elbow is going to get tighter and when I get down \nin the contraction, the elbow is going to be a   little bit further back behind the body. I will \nprove that to you one more time, that you don't   just do this in isolation. Because if you did do \nthis, and you could try this yourself, you can   see that you get stopped here. Pronation at the \nforum doesn't allow me to get all the way down   flat. So how do I get down flat enough to grab the \nbar? Well, that means I got to substitute at the   shoulder and let the elbow flare out to be able to \ngrab that bar with the palms down grip anyway.\n  So, if there is a limitation to the \nunderhand Pushdown it's the fact that   this can still be a little bit demanding on the \nwrist with the underhand grip. So, what you do is   you simply take away the straight bar and you just \nattach to single handles. And before you start   saying--I'm going to read your mind one more time, \nbut if I don't have a push down machine, how could   I do this? Well, you attach two bands to a pull up \nbar and you grab hold of a band in each hand just   like that. Or if you do this in a gym on a cable \nmachine, you grab the left hand with the right arm   and the right handle with the left arm and then \nwe get into this position here where we open up   and we press down and back. Okay, now this \nis going to bring in that second point when   you were saying to yourself, \"I can't lift a \nlot of weight and on the other hand version,   and therefore I shouldn't do it because I'm \nnot stretching the triceps as much as I can.\"   Well, guess what? The reason why you can't do as \nmuch weight there is because the overhand version   of the tricep Pushdown is incorporating \na lot of other muscles to the task.\n  When I get in this position here, \nI've got the chest contributing,   I've got the shoulders contributing, and I've \ngot the abs contributing to that movement.   We don't want that if we're really \ntrying to hypertrophy the triceps,   looking for inefficiency, taking some of the \nmuscles out. If it's just strength that you're   looking for, then by all means load up the tricep \nPushdown and do that, but you should be doing   the other exercises for that. You all should \nbe doing the tricep Close Grip Bench Press,   you all should be doing Tricep Weighted \nDips, you all should be doing Skull Crushers.   That makes the overhand version of this redundant. \nIf you want to introduce a new stress, you go   underhand here and you account for the things that \nare lacking right now from your overhand dominant   Pushdown down based tricep training routine. \nSo, guys, I hope you found the video helpful.   if you haven't already done so guys, make sure \nyou click Subscribe not just to this channel,   but to the Athlean-X Shorts Channel as well. \nRemember Athlean-X videos in 60 seconds or less?   If you're looking for program guys, we put the \nscience into all the selection of the exercises   we do, because as you can see here, it matters. \nYou can find them over at Athleanx.com. And guys,   make sure you leave your comments and thumbs \nup below. Tell me what you want me to cover   in a future video and I'll do my best to \ndo that. All right guys see you soon. \n "
}