{
    "id": "8B_uf-lR8cI",
    "title": "Bodyweight Triceps Workout (SORE IN 6 MINUTES!)",
    "description": "If you want to build bigger triceps but don't have access to equipment or a gym, there is no need to worry. In this video, I show you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The Sore in Six series is back. Remember, bodyweight only this time, and we're\nhitting the triceps. We're actually going to do it with just two\nexercises. The triceps are one of those muscle groups\nthat's relatively small in comparison to the rest of our bodies that are actually easy\nto overload without the use of weights. I'm going to show you over here, in our rack,\nbut you're not going to have to use this, okay? I'm going to make that very clear. You could use the back of a couch, the top\nof a bed; whatever it is. The two exercises, though, are going to rely\non this. The first thing you're going to do is a cobra\npushup. We're going to put our feet up, on top of\nthis to get into a decline position. We're going to do the cobra pushup in 21 style. Meaning, 7 reps in the bottom range of motion,\n7 reps in the top one-third of the range of motion, and then 7 full reps. When you're done with that you've got the\nfull one minute period to crank that out. If you finish in 40 seconds you've got 20\nseconds of rest. Then what we do is a walk-in tricep bodyweight\nextension. So we get up in here, and we're going to utilize\nthe top of that now to do our walk-in extension. Now this is a tough exercise. You're going for a slow, eccentric contraction\nhere, lowering down nice, and slow, letting the long head of the tricep stretch out here,\nand of course, controlling your bodyweight and pushing yourself back out. But you've got to do this now for a full minute. So how do you do that if you start getting\ntired? You walk your body in. Move your feet in to make it a little easier\nto lift your bodyweight. Then we go back, and we repeat this two minute\nseries here, three times, for a total of six minutes. When we go the next time our feet are flat\non the floor to do our cobra pushups in 21 style. Again, finish as fast as you can. The rest you earn, that's your rest until\nyou have to get right back up and do the bodyweight tricep extension again. You're always going to be using the top of\nthe bed, or the couch, or whatever it is you're using for that. Then finally, we go back one more time, and\nthis time we're going to have to go on our knees. We're probably, at this point – I know I\nhad to, for sure. If you want to you can keep it up on your\ntoes, but you're probably going to have to drop down to your knees. You do the 21 rep style again for the cobra\npushups, and then you finish one more time with the bodyweight walk-in extensions. You might be right up next to this damned\nthing by the time you're done, but as long as you stay repping out you'll still be repping\nyour triceps. Let's give this one a shot. So there you have it, guys. There is your Sore in Six Minute bodyweight\nedition for triceps. I know this is one of those rare occurrences\nwhere I actually shot the workout portion of this yesterday. So I'm here now, a day later, and my triceps\nare sore as shit. This has probably only been about a 14 hour\ndifference. I keep Jessie here working long, long hours. Guys, try it. Give it a shot. The key is: you do not always need to use\nweights to get an effective workout and I want to prove that to you with our entire\nSore in Six series. If you're looking for an entire program that\ndoesn't even use anything – not a single piece of equipment, not a pullup bar, nothing\n– it's our Zero program. It's over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful and you liked this series make sure you leave your thumbs up below, and a comment,\nand let me know what else you want me to cover in all of my videos, and I'll do my best to\ndo that for you. All right, guys. See you soon."
}