{
    "id": "8Ki5gtfleCc",
    "title": "Burn Chest Fat at Home (BODYWEIGHT EXERCISE!)",
    "description": "Burn Fat and Build Athletic Muscle at Home - http://athleanx.com/x/home-workout If you want to burn chest fat in order to get rid of ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So if you've got a saggy or a flabby chest\nthat you just can't wait to get rid of, I'm going to show you a bodyweight exercise combo\nhere today that's going to help you to start doing that. You see, when you have an abundance of chest\nfat, or this flabby chest, or just simply a chest that you can't stand to look at in\nthe mirror, it can be pretty embarrassing. But there's something that you can do about\nit. There really are two things that you should\ndo about it. Firstly, we know we can't do a single exercise\nto start targeting a certain area and burn fat in that area. We should know that by now. But the issue is, you do have a two headed\nissue. You have an abundance of chest fat, number\none, overlying and probably underdeveloped pecs. So you need to figure out a way that you can\nburn fat and you need to figure out a way that you can actually tone the muscles and\nbuild the muscles underneath to have that effective combination of getting a much better\nlooking chest. Now, you want to pair it, always – I stress\nhere always on this channel – nutrition, nutrition, nutrition. If you refuse to get your nutrition in line,\nyou want to keep eating at Arby's, your chest is going to look like shit from now until\nthe end of time. You've got to make sure that you get your\nnutrition in line. Once that is done, however, you have to make\nsure that you're addressing both components. Conditioning and strengthening. Check out this combo that I've got for you. If you do this combo you're going to get both\nthe conditioning benefit, and you're going to overload and build your chest. We're not talking about regular pushups. We're talking about overloading your current\nlevel of ability. We can do that very easily with plyometric\nversions of them. So what we have here is a combo that starts\nwith, what we call, a taps version of a pushup. So I'm in here – this is the more advanced\nversion, by the way – I'm in between two benches. I go down into a pushup, plyo, touch, and\nthen I come out, and I immediately plyo jump over, or lateral box jump over the bench all\nthe way to the other side. Come down to the ground, come right to what\nwe call a Hannibal pushup, come out of that, box jump right back over lateral, complete\nclearance of the bench, right back into the taps pushup. We go right back to the left side now. We do a Hannibal on the left, come back into\nthe center, and so on, and so forth. Is this an easy combo? No! But again, we want to make enough overload\nhere for the chest. At the same time, we want to elevate our heartrate. We want to start burning some fat and we want\nto start burning some calories. Now what I suggest you do on this combo to\nmake it extremely challenging, you might only be able to get back and forth, maybe, three\nround trips, or two round trips. Don’t worry. For you guys that can't do this I have a beginner\nversion in a section, but you do as many as you can. You take about a 20 to 30 second rest, and\nyou do it again. You treat it like interval training, but it's\nnot regular static running interval training. What you're getting is this involvement of\nchest overload. For the beginner version what we want to do\nis take it down to the knees. So you come down to the knees, you do your\ntaps version, and instead of doing a complete jump over the bench, you're going to turn\nand just do a box jump to the top of the bench, jump back off, come back down to the ground,\nand once on the other side here. You can do three little, mini pulses. Try to get just a little bit of clearance\nof the pushup. It's less explosive, but it's still probably\nan overload for those that are just starting out. You do your three little pulses, hop back\nup, box jump up to the top, go to the middle, repeat the taps, and of course, keep it going\nback to the left, back to the center. Again, the same rules apply here. Do as many circuits of these. Break them into the time frames in which you\nfatigue in. once you fatigue, give yourself a little rest,\n20 to 30 seconds, and get back into it again. The idea is this: if you want your chest to\nstart looking better you have to attack that problem, like I said, from all angles. One, with your nutrition; two, shedding extra\nbody fat through your extra conditioning work; and three, you want to start tonight the muscle\nunderneath. This combo is a great way for you to do that. If you've found this video helpful, make sure\nyou leave your comments and thumbs up below. If you're looking for a creative way – it's\nnot the same old, boring bodyweight exercises that a lot of times don’t actually provide\nthe overload that actually causes muscles growth – then go get our six week program\nATHLEAN0 where I lay it out for you step by step, week by week, and we also include our\nmeal plan in there as well. That's over at ATHLEANX.com. In the meantime, tell me what else you want\nme to cover here on bodyweight Wednesdays and I will do my best to do that. I'll see you guys back here again real soon."
}