{
    "id": "8mOjYFwmgxk",
    "title": "Bodyweight Chest Workout (SORE IN 6 MINUTES!!)",
    "description": "Some think that bodyweight chest workouts are not intense enough to build muscle at home without equipment, they would be ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The Sore in Six: Bodyweight series continues,\nand this time we're hitting the chest. We're going to get some soreness going on\nbecause we're going to get a great, metabolic overload going here. If you watched my video on this before I told\nyou, metabolically, if we can overload ourselves we can actually build muscle that way. It's one of the three main ways that we build\nmuscle. So here's what we're using. We're using this, and this. I'm not going to call it a bench. I'm not going to call it a dip station because\nyou don’t need this, or this. I could use the back of a couch, as you see\nme doing here. Or if I don’t have access to a dip station\nI could certainly use a countertop, like you see me doing here. We're going to do use mechanical drop sets\nto get us through this because we need to get six minutes of action going here. The exercises are going to be a pushup, but\nwe're going to have three different versions of it. We're going to have a decline pushup, we're\ngoing to have a flat pushup, and we're going to have an incline pushup. We know that the decline pushup is the most\ndifficult version. We know that when we go down we're working\nmore of our upper chest here, which is generally weaker than the rest of our chest. And then we know when we go flat we transition\nthat a little bit more to the mid-chest, which is slightly stronger. And then we know if we turn around and use\nthis surface again this way, we can get this incline pushup, which works more of the lower\nchest. Again, we are a little bit stronger here. So as fatigue sets in we can continue to go\nthrough it. You're going to do a minute starting in the\nhardest position, when we're our freshest. We're going to start with the decline pushup. Now the great thing is, this workout is going\nto be segmented based upon your ability levels. So beginners, intermediate, and advanced. So if I'm going decline, in the first minute\nwe're going to get through the entire one minute of this. The beginners can do it from their knees,\nlike this. We'll make it a little easier for them to\ntry to rep out for the full minute. The intermediate people are going to go from\ntheir toes, here, with that decline pushup. Advanced guys are going to go with the twisting\npushup. You come down, you push up, and through the\nfingers there. So we're turning, and twisting right here,\nin the middle of the chest. Come down, and go to the other side. Here, twist. That's minute one in the decline position. If you're in an advanced position – doing\nthe twisting pushups in the decline – if, for some reason, you can't get all the way\nthrough the minute, you drop down to the flat position here. Still do the same exercise, but it will be\nfrom there. If you have to drop again, for whatever reason,\nyou can go to the incline position, and you can twist here. Same thing goes for the beginners. The beginners start on their knees. If, for some reason, they tire out here, they\ncan drop down, and go to their knees here, and finish out their one minute knee pushup. Now, in the second minute you come right over\nhere to the dip section. Stay in the contracted range of motion, right\nup here, at the top. Just a little dip, and up. Remember, we want to keep all the metabolites\nthat are accumulating from what we just did, keep them there, and then one eccentric rep,\nall the way down. Step up if you have to, or jump back up. One, two, three, and down. Beginners, do this for 20 seconds. Intermediates, do this for 30 seconds. Advanced guys do it for 40 seconds. Now, minute three I come back down. If we're intermediates we're on our feet here,\nflat on the floor, and we're doing flats. If we're advanced we're coming up, and we're\ndoing twisting from the flat position, and if we're beginner we're down on the knees\nand we're doing flats from here. Remember, if we have to drop here because\nwe don’t get our reps, you go to the incline, and you rep out. The goal is to continue to make sure that\nyou rep all the way through that full minute. Minute four, you're back up there. You do the same thing. 20, 30, or 40 seconds based upon beginner,\nintermediate, or advanced. Then finally, we come back here, we work on\nthe incline position. So again, the advanced guys are up here for\na minute straight, doing the twisting pushup. The intermediate guys are doing the regular,\nflat pushup, no twist. And then the beginners are down, on their\nknees, and they're working through here. Guys, it ain't easy, but it works. Again, getting yourself to work for six straight\nminutes is something you're probably not used to, but that's where the benefits lie. Push yourself here. I know you can do it. I'm going to take you down through the advanced\nversion, but you pick the one that's your level, and you push as hard as you can, and\nget through it. So there you have it, guys. Sore in Six Minutes now in the book, Bodyweight\nEdition. The idea is this: you're never out of options\nif you have no equipment. As a matter of fact, I take that as an offense. If you don’t know what to do – you should\nbe able to train in a cardboard box and still get a great workout in. If you don’t know how to do that, or if\nyou're looking for a program that will show you how to do that, step by step our ATHLEAN-0\nprogram was created, literally, with that goal in mind. I want you to be able to do it on a deserted\nisland because it requires no bars, no benches, no bands; nothing at all. Nothing at all. You could do the entire six week program. That's over at ATHLEANX.com. In the meantime, if you've found the video\nhelpful, if you like the Sore in Six series, make sure you let me know what else you want\nme to cover – still no penis – that ain't going to happen. Let me know, and I will do my best to do that\nfor you in the days, and weeks ahead. All right, guys. See you soon!"
}