{
    "id": "8zUEUBRd6b0",
    "title": "The MIDDLE Chest Solution (GET DEFINED PECS!)",
    "description": "If you want to develop the middle chest or the inner chest to get more defined pecs, you need to watch this video. Here I'm going to ...",
    "transcript": "What's up guys, Jeff Cavaliere, Althleanx.com. \nToday, we're talking about the inner chest,   that middle chest line that makes the chest what \nit is, If you don't believe me, look what happens   when I actually take that line away, suddenly it's \nless impressive. See, the fact is very much like   the abs, it's the attachment point that creates \nthe visual contrast that makes that muscle look   more impressive. If I took the same eight pack \nthat this guy has here and we remove the linea   alba and the tendinous attachments, it's suddenly \nnow becomes a one pack that even though the waist   circumference hasn't changed, it just doesn't \nlook so good anymore. So, what can you do if   you're lacking that middle line? Well, there's a \nfew things that you need to do. You need to create   that contrast and that contrast is created in two \nways. Number one, your anatomy that you were born   with. And secondly, your ability to grow this \nmuscle. I'm talking about the entire muscle,   not just the inner chest, that's not possible. But \nlet's talk about the anatomy. We break our muscle   market to do that. We know that the chest has an \nattachment right here on the sternum, a tendinous   attachment. And with a tendon does it attaches to \nthe bone, it rides out into this muscle belly and   then goes out to another tendon to attach to the \narm. Well, the tendon attachment actually is in   your advantage because what it does is it doesn't \ngrow like a muscle belly does. So, it sutures   itself down to the bone that it attaches to, in \nthis case, the sternum, and it stays there.\n  But as we grow the muscle itself, we know \nthat that will stand out further and further,   creating that visual deepening of the chest \nthat creates that line. However, we also know   that there's another thing that can hide that, and \nthat is what you eat. Right? Let's face it, guys,   any discussion of how a muscle looks has also \ngot to consider the fact that if you eat poorly,   you have higher levels of body fat, it's \njust not going to look as good. See, this   chest of mine right here, though it may not be the \nbiggest one out there, because I have good muscle   definition from low body fat levels, it looks \nmore impressive than it actually might be. \n  Again, this guy right here has a bigger chest \nthan I do, but he certainly doesn't have the   definition. Which, again, in the opinion of \nwhoever is looking at that, could change how   they feel about it. The other thing, though, is \ntraining. We know that we can impact our training   by how we do what we do. And the thing you're \ngoing to want to make sure you do is two things.   Number one, don't isolate your training focus \nto just strength. If you're isolating to just   strength, you're likely never going to develop \nthe type of inner chest that you're looking   for. And there's a reason for that. Most of the \nstrength-based exercises that are looking for   a strictly progressive overload, which is a good \nhypertrophy stimulus, but it's not the only one,   are going to be limiting how much adduction \nyou get in the exercise you're performing.\n  I mean, an incline bench press or a flat bench \npress or a weighted to dip or a weighted push   up or are going to be done with the arms in \nthis position here, never actually approaching   complete chest contraction by getting into a fully \neducated state. You want to explore other options.   We know that eccentric overload is a great option. \nWe want to include exercises that allow us to get   more stress placed on the origin in the assertion, \nwhich is an exercise like this allows you to do.   But you want to allow that to be an additional \nstimulus for growth, because, again, growth is   what's going to make this entire chest stand out \nand create the deepening of the line. The third   thing, however, is I think where everything is at, \nwhere people don't necessarily do enough of this,   and that is go for that metabolic route, drop \nthe weight down. If you drop the weight down,   you may actually get into a fully contracted \nstate for the first time ever because you need   to go a little bit lighter in order to get there. \nSo, if you take an exercise like the crossover,   if you always stop right here, you're never really \ngetting it to a fully contracted state. If we're   talking about getting the best chest development \nto create maximum hypertrophy and the most   deep line, you can get that, then you want to \nmake sure you take it even further than that.   Bring it all the way across the body, even \nif it means lighten the load to do that. \n  Now, don't just stop after a few repetitions, you \nwant to really, really revel in the burn and such   an intense burn here on these exercises that \nyou can barely stand it. But this is a great   way to create that full chest contraction. You \ndo the same thing for the upper chest by simply   lowering the angle of the arm and bringing it up \nand across your body, but still make sure you're   getting it across your body. Even something like a \nbench press, if you were to drop one dumbbell can   be tweaked to get more adduction stress by simply \nsliding over. Right? Shifting your body, rotating   onto one cheek and then driving your arm up and \nacross your body like you see me doing here.   And of course, you can do the dumbbell pull over, \nwhich is really squeezing the hands together,   creating a really hard adduction from the top down \nto really hit the upper chest better. But the fact   is, guys, all of these exercises are going to \nallow you to create a better overall contraction,   not isolate the inner chest fibers. That's not \nnecessarily possible. However, we do have some   science to support the fact that doing these full \nrange of motion exercises or as I call them, full   range of contraction exercises, we can actually \ninclude some additional fibers into the job.\n  There's a thing called the non-spinning chest \nfiber that actually starts here on the sternum   and it heads out towards the arm, but never \nquite makes it. So, you might think to yourself,   how could they contribute to a contraction \nthat they actually don't attach to the arm   it's pulling? Well, interestingly, what happens \nis these fibers have proteins that come out of   them that make them somewhat sticky. So as the \ncontracting fibers cross over and slide by them   on the way through full contraction, they \ngrab hold of them, and they involve them in   the contraction. So, you're getting an overall, \ngreater production of force and greater capacity   for growth by involving fibers that maybe never, \never got dragged along for the ride or engaged   because you never went far enough. So, the fact \nis, guys start taking these exercises all the   way through full range of motion, even if it means \nlightening the weight and I promise you, you are   going to start to see better results.\nIf you're looking for a step-by-step meal plan,   guys, because again, nutrition matters. I \nhave them included in all my programs as   well as all of our step-by-step workouts to get \nthe job done. They're over at athleanx.com. If   you found the video helpful, make sure leave \nyour comments and thumbs up below. And also,   if you haven't already done so, guys, make sure \nyou click subscribe, turn on your notifications,   so you never miss a new video when we put \none out. All right, guys, see you soon."
}