{
    "id": "9O--R7E32jw",
    "title": "Arnold Schwarzenegger&#39;s 6 Favorite Exercises for MASSIVE Gains!!",
    "description": "Arnold Schwarzenegger had 6 favorite exercises that he attributed the majority of his muscle growth and massive gains to. In this ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. You \nknow when no last name is needed to introduce you   that you've done something important. \nToday, we're talking about Arnold's six   favorite exercises for massive gains. \nI'm going to share those with you.\n  Thank you for inviting me, Jeffrey. This is \nawesome. I'm so happy to be here in the Xbox.\n  This is a new low, Jesse. \nWhat are you talking about?   This isn't Jesse, it's Arnold.\nOkay. Do you have somewhere you can go, please?\n  Oh, I could to the chopper. Thank you for \nthe suggestion. I really appreciate it.\n  You know, I can I have this please. \nYou're talking about a legend.\n  Do you want me to leave?\nYou can leave--on a chopper, anywhere please. \n  Guys are talking about the golden sex \nexercises that Arnold referred to himself.   I'm going to break them down one by one for you, \nas we always do here, guys. We're going to take   that old school effort and combine them with \nsome new school science and I'm going to give   you a few other suggestions and modifications to \nthe exercises that will help you along the way.   We actually did this in our new Old School Iron \nProgram, which, by the way, here's a little   contest for it, we don't do enough of them here. \nIf you can guess the six exercises before you   watch the video, put them all down on a comment \nbelow. And in one line, tell me why you deserve   our Old School Iron Program and we're going to \nselect 10 of you guys to give them to you. And   if you're going to be the guy who watches \nthe video first and then goes back and puts   them in later or copy and paste somebody else's \nanswers, they even have a damn good reason for   why you should get the program. All right, guys, \nlet's start breaking them down one by one.\n  All right. So, exercise number one from Arnold's \nGolden Six was his favorite chess exercise.   No, not the one that you're thinking, hold \noff on that one for a bit. It's the Barbell   Bench Press but done with an extra wide grip. See, \nArnold felt that when he got his hands out wide,   he could minimize the tricep contribution \nand maximize his chest development.   And although he would use slightly less weight \nto do this, it gave him an opportunity to build   that massive chest that he's known for. \nNow, guys, as far as a recommendation from my   side of things, I know firsthand this would \nbe a very uncomfortable way to do the bench   press. And anybody that has any shoulder issues \nat all is going to find it very challenging   to do the exercise with this extra wide grip. And \nthat's because we know that when you take that   really wide position in your hands, you could \ndo this thing right where you are right now.   Try to go back behind your body, you won't get \nmuch extension of your elbows behind your body.   So, in order to get that far down towards your \nchest, you're going to have to instantly rotate,   which gives you a little bit more motion to get \nthere. Again, if you have shoulder issues already,   that's not going to be good. So, if \nyou can take a slightly narrower grip,   you're going to have an opportunity to get more \nextension, more naturally, the bar will go down   easier and your shoulders will feel better.\nAnd there's another side of it, too. If you're   looking to just increase your overall strength, \na slightly narrower grip is actually going to   help you not only getting the triceps back \ninto the equation for a greater output in   terms of our pushing strength, but we know that \nbiomechanically, if I wanted to push something   as much force as I possibly could, I wouldn't \ntry to push it from the really wide position.   I get those elbows in tighter hands just \noutside my chest and push from there. But   whatever way you do it, guys, make sure that \nyour goal in six always consists of at least   some version of the Barbell Bench Press.\nExercise number two in Golden Six was the   Behind the Neck Press. And I swear I just \nhurt my own ears saying it. The fact is,   guys, I'm not a big fan of the behind the \nneck variation of the overhead press because   of the artificial position it places your \nshoulders in when pressing, which over time   could damage your shoulders. I've thrown it in the \niron graveyard for a reason. But interestingly,   if you look at the way Arnold did this, he was \nactually way ahead of his time because he kept his   elbows forward while his hands were back, so even \nthough he was pressing the bar behind his head,   his shoulders were in the right plane. \nAnd if you had the flexibility to do this,   then by all means, you probably could pull \nthis exercise off. But very few people have   the ability to do this. The easier thing to do \nis just do what Jesse's doing here and make the   modification and putting the barbell in front \nof your body. Because once you do that, and   especially if you take a little bit narrower grip, \nthose elbows will naturally come more forward,   placing your shoulders in that scapular plane and \nmaking a very safe variation of the exercise. \n  And of course, you could do what I'm showing you \nhere, that's just a Dumbbell Press. And we know   that the dumbbells are going to give us a really \neasy opportunity to get those elbows in the right   plane. But just make sure that if you're doing \nit, you're not sitting down, because when you sit   down and press your shoulder blades back into the \nbench, you're pressing from, you can interrupt the   normal scapulohumeral rhythm that you press with. \nOnce again, no matter what variation you use,   if you're looking for massive gains, the Overhead \nPress better be in your goal than six.\n  Exercise number three was Arnold's favorite \npulling exercise and it's up here on a Pull   Up Bar. That's right, Arnold did pull ups, as \nyou see here, with the overhand wide variation   or he did the Chin Up. And the Chin Up is what \nmade its way into his golden six because it gets   the additional benefits for the bicep's growth \nand development too. Because once you had that   arm underneath here, guys, you know you're \npulling with the lats and you're pulling with   the biceps to get your body up to the bar. \nBut interestingly, what Arnold did here was he   programmed them for body weight reps almost all \nthe time. Him and Franco Columbu used to say   it's not really a great idea to weight your Chin \nUps or your Pullups. I actually tend to disagree   just a little bit, because I think that the \nexercise can be one of the best mass builders   when you go for a little additional overload \nand add some weight around your waist. If you   have the ability to handle more weight on \nthis exercise instead of always ripping out   for 12 or 15 or 20, if you're able to get that \nhigh, put some weight around your waist and treat   this like you would any other strength building \nexercise in the gains will be waiting for you.\n  Which brings us to exercise number \nfour, and that's Arnold's favorite.   No, still not that one, guys. This was the \nfavorite for building bigger biceps and it   was the classic Barbell Curl. Now, listen, if \nyou want to build your biceps up, you're going   to have to curl at some point and there's lots of \ncurl variations. There's a seated Dumbbell Curl,   there's an Incline Curl, there's Preacher Curls. \nBut guys, if you're looking for the most mass   possible, it's the Barbell Curl that gives you the \nbest option. Because you can take that weight and   lift it up and provide that slow eccentric on the \nway down to the point where you can actually even   overload that exercise with a little bit of \ncheap momentum at the top to then slow once   again that eccentric down and overload, those \nbiceps in a unique way to cause more growth. \n  The fact is, if I was going to make any change \nhere at all, because I love this exercise as it   is, I'd like to at least include a little bit of a \nstrict variation, too, and that's the Stretch Curl   here. All you do is back yourself up against the \nwall, make sure that you're back and butt stay in   contact and simply lift with the sheer force and \nstrength of your biceps alone. Now, of course,   when you go to failure here, you can always step \naway and add a few of those cheat reps at the   very end to overload them even further. But the \nfact is, guys are looking for massive gains in   your arms, the Classic Curl is always going to be \npart of your routine then, now and forever. \n  Exercise number five and Arnold's goal in \nsix might come as a surprise to you because   it was devoted strictly to abs, it was the full \nsit up. It was more surprising to a lot of people   is that he even did sit ups because a lot of \npeople think that the exercise doesn't belong   in anyone's routines anymore because it's not \nsafe for your back. I actually tend to disagree.   But instead of doing what Arnold did, which was \n200 repetitions a day, you can take down the   number of repetitions and potential strain the \nexercise could cause by doing a few things. \n  Number one, weight it. When you weigh that, \nyou can create the overload you're seeking   in far fewer reps with a lot less volume. But \nimportantly, no matter how you do it, you'd better   do it right. And to do it right, you want to paint \nyour spine back to the ground on every repetition.   Don't slam yourself backwards, pulling yourself up \nwith flexors and then disengaging them at the top   and slamming back down. You could be much more \nkind to your spine by lowering yourself down   one segment at a time. And beyond that, you could \nbe much more kind to your spine, but not engaging   your hip flexors at all in the first place. \nSo instead of anchoring your feet under   something and then pulling up to create \nthe counter force to get up to the top,   put your feet behind something. Over and behind \nsomething, so that when you pull your heels back,   you actually engage your hamstrings. And \nby doing that, you can reflexively turn   off those hip flexors to a greater degree and \nallow your abs to do more of the work. Either way,   guys, the facts are facts in the full set up \nis still one of Arnold's golden six exercises,   and it can still be one of your go to ab \nexercises provided you do it the right way.\n  Which brings us to exercise number six, Arnold's \nall-time favorite, no still not that one guys,   it's the Barbell Squat. Look, we know the squat \nis the king when it comes to building your leg   size, especially if you go heavy and Arnold \nis known for going heavy on the squats. Look,   even skinny guys like Jesse have benefited \nfrom going heavy on their squats. The point is,   if you're going to--\nHey, who you call skinny,   look at this chest. Come on. \nI thought I took that away from   you. I'm going to take it back. \nDid you just say, I'll be back? \n  Leave, please. \nOkay.\n  So, can we talk about the squat here, guys. Heavy \nsquats we know can build substantial leg size   and Arnold relied on them to do so. However, if \nyou're someone that has knee problems and says,   you know what, squats just can't cut it \nfor me, I can't do it without hurting. Guy,   I have another classic exercise you can do that \nwill help to build your legs as well, and it's the   classic Reverse Barbell Lunge. Yes, you can use a \nbarbell like they did in the old days and get some   good gains from this exercise, but you're going to \nhave to put some weight on the bar. The fact is,   if you can do squats, guys always make sure you \ninclude them in your training, but don't skip leg   training altogether if knee injuries are part \nof the game here. There's always something you   can do to continue to build up the size of your \nlegs, regardless of how they feel right now.\n  Nice for you to join us. \nWhat are you talking about?\n  So, guys, the Golden Six, Arnold's favorite six \nexercises, you might be sort of still surprised   by the admission of, let's face it, the Chest \nFly. Guys, I've talked about this before, even   Arnold didn't have it in his Golden Six. Although \nI will say, he loves the exercise to death. I made   a video about it, you're going to want to watch \nat the end of this one to see why I break down--I   still like the Fly, just not done on a bench, I'll \ngive you the reasons why. At the same time guys,   you have an opportunity here, Jesse's idea \nto win the old school Iron Program. \n  And if you fast forward it all the way at this \npoint to make sure that you've got all the   exercises right, he knows when you do that, then \nyou better leave a damn good comment. Because he's   going to be reading them all, and you're going \nto be under his scrutiny to determine whether   or not you win. If you want to bypass all of \nthat guys, you can head right to Athleanx.com,   get our Old School Iron Program over there. \nIf you found the video helpful make sure you   leave your comments and thumbs up below. And also, \nif you haven't already done some, make sure you   click Subscribe and turn on your notifications \nso you never miss a new video when we put one   out. All right guys, see you soon. And Jesse, \njust kidding that was a good job. Nice job. \n  What's the matter, Old School Iron \ngot you pushing too many pencils?\n  Will you get out of here?\nJeff, you son of a bitch. \n "
}