{
    "id": "9SKuFe2SERs",
    "title": "How to Fix a Bulging Disc (NO SURGERY!)",
    "description": "Bulging discs are one of the most common conditions that will derail your workouts quickly. In this video, I'm going to show you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to show you what to do for that\nherniated disc. The bulging disc in your low back that I think\n– probably 99% of the world has been diagnosed with. I'm going to show you how to fix it without\never having to go under the knife, and I've actually got Jessie here because Jessie walked\ninto my office one day at 22, I think. JESSIE: Yeah. JEFF: 22 years old and he said \"I can't believe\nit. I had an MRI. I've got a bulging disc in my low back and\nI need to have surgery.\" I said \"Dude, you don’t need to have surgery.\" Because what I'm going to show you here today\nis going to do exactly what I showed Jessie, and it's going to help you get rid of this\nthings once, and for all. So what are we talking about, first of all,\nwith a bulging disc? When we look at a bulging disc there are three\ndifferent terms that people use. There's 'herniated disc', 'bulging disc',\nand then a 'ruptured disc'. A ruptured disc is a different scenario. A ruptured disc is when this disc here, that's\nin between your vertebra basically explodes. It's not fixable without surgery. But that's a very small percentage, and that\nusually happens in a very traumatic incident. What we're talking about more often is this. This is a bulging disc. A herniated disc. The disc starts to protrude out the back. This is what this red area is. A lot of times you can be diagnosed with a\nbulging disc because an MRI tells you that you have a bulging disc, but you don’t have\nany symptoms. The symptoms might either not be present,\nor come and go based on whether or not that disc is actually touching the nerve. If it's not touching the nerve, or making\ncontact – in this case, it's not – you wouldn't have any problems with that. If the nerve touches that disc, though you\nstart to feel the pain, and the tingling, and the sensation down that distribution of\nthe nerve root. So it could be in the front of your thigh,\nif it's an L4, or L5. It could be more in the back of your leg if\nit's more of a L5-S1. So it depends on what level, and what nerve\nyou're touching. Now, here's the thing you don’t want to\ndo – and what I told Jessie not to do, because he was like \"Dude, I've just been doing these\nstretches, and I think that's what I'm going to have to do to start off.\" I said \"No. Don’t do back stretches if you have a lumbar\ndisc.\" If you start doing the things that Jessie\nis doing right here, you're going to make the condition worse. A lot of people will prescribe these for you,\nand that's not what you want to do because flexing the spine, bending it, pulling one\nleg to the chest, pulling both legs to the chest; that's flexing the spine, and that\nmakes the disc protrude even more. So why do people tell you to do it? Because, if you look here at the spine, the\nmuscles the run up and down, these basically get tight from the spasm of trying to protect\nagainst the disc. So you might stretch and feel a temporary\nrelief, but you're not doing anything to fix the long term cause, which is the disc underneath,\nbut you are actually making it worse. So instead, what you want to do is the same\ntwo, or three step plan that I gave Jessie. And it starts right here at the bar. The first thing, if you're going to fix this\ndisc because you're going to want to extend, and not flex. But before you do that you've got to fix a\ncouple of things. You'll want to decompress your spine. I know people use inversion tables and all\nthat. If you don’t have access to one you really\ndon’t need one. All you need is a pullup bar. So, as I have Jessie, the first thing I tell\nhim to do is grab the bar. Then just don’t hang with your feet off\nthe floor, like he's doing here. Put your toes down if you can. If this is too high because you're too short\nyou can always setup a bar and a squat rack at a high that you can still touch your feet\nto the ground. But the touching of the feet to the ground\nis really, really important because it allows you to decompress, and drop your pelvis. So as I reach up here, I've got a hold, but\nif I'm holding up here, I'm actually restricting. I'm using muscles and my hip flexors to hold\nme up. But as soon as I let my toes touch, now I\nfeel like I can kind of release. What I've done here is, I've dropped my pelvis,\nand I'm obviously keeping my spine elongated so I have some space here in the spine. We want to try and create, at least, a little\nbit of room so if that disc is touching one of the nerve we can let it off. The next thing we have to do is, we either\ngo to step three, or if you're doing this – that's called a list – and we need to\ncorrect that first because step three won't work unless you've fixed step two. So are you doing this? Are you leaning away from the pain? Meaning; if the pain is going down your left\nleg are you leaning over here – my left leg – are you leaning over here, in this\ndirection, away from the pain? You can easily see that in the mirror. Have somebody tell you if you are. If you are, then let's go over to the wall\nand fix that first. Okay, so to fix that list, remember, if you're\ndoing this because you're trying to get away from the pain, then we've got to fix it here,\nagainst the wall. So what you do is, you'll use the wall to\nyour advantage. If I'm leaning this way I get myself over\nhere into the wall, and I put my feet further away from the wall. From here. So now I can take my hand on the outside,\nand I can start to push in this direction, toward the wall. What I'm trying to do is get my hips and my\nshoulders to be level again. What that's actually doing is helping to centralize\nthat disc because we don’t want to start trying to go into extension in step three\nif we haven't centralized the disc. Right now it's over here, and I'm trying to\nlean away from it. So if we could do this without pain, then\nwe're in a good position. You do this about 10 times. 10, or 12 times. If you find that you're running out of room,\nand it feels even better the further you go, you can always take a medicine ball, or a\npillow, or a sweatshirt, or something, and you lean into it this way. So I've got my lean here, and my feet are\nover here, but now you can see I've actually gotten more range of motion that I could drive\nmy hips through. So it's an overcorrection. A lot of times the overcorrections are necessary. So now, we've done the decompression, we've\nrecentralized – if the list is necessary. If you're standing nice, and tall you don’t\nnecessarily need that, and you go right to step three, which is going to be down here\non the floor. All right, guys. So we're almost there. This is the last step and what you do is,\nyou want to get yourself down on the ground, and we're going to extend. We've fixed the list, we've decompressed,\nand we're in a good spot to actually do this thing, and do it once, and for all. So you're going to take your hands, put them\nflat down, under your shoulders, but don’t get lazy about what's happening below the\nwaist because that matters, too. Put your feet together, contract your glutes\ntogether, get nice, and tight from below, take your hands here, and you're going to\nstart to press up. You press up only as far as you can go because\nyou can over extend. If I start to lift my hips off the ground\nhere, I'm not extending anymore at my low back. I'm just pushing up with my hips, and that's\nwhat we don’t want. So you only go so far as your hips will stay\nin contact with the ground, and that's it. You hang out here for about 15, or 20 seconds. Then you lower yourself back down. Re-contract. You can see Jessie doing the same thing here. As he's pushing up he's trying to make sure\neverything stays in contact with the ground. That was my one, main instruction for him,\nand to go for a little bit more extension each time he did it. He would find that each rep he'd get a little\nbit higher, and a little bit higher. If you can't – let's say you're in a really\nbad spot, and it's really hurting you. You can actually just get yourself in this\nposition, right here, which is enough extension as it is, and you can watch TV for about 10\nminutes, or so, if you can tolerate it. Just to try to get more of that extension\nin place, and start to recapture that disc. The good thing is, guys, that disc – 98%\nof the time – will be able to be recentralize, and recapture, and once it does, and it gets\noff that nerve root, you're not going to have the problems. You're going to go back to lifting, and doing\nthe right things inside the gym without being derailed by your disc pain. So now, the last thing you can do if you had\nto is, during the day you might not be able to lie on the ground. So you could do this standing. What you want to do here is just hook your\nhands – I talked about it in a previous video, these two bumps right here on your\npelvis. You just want to get one hand on top on side,\nand one hand on top on the other side, hook them, and just push forward with the palms\nof your hands, and then lean back. Same thing though. If you have to decompress first, you decompress. If you have to do the list thing against the\nwall, you do the list. But then you just lean back and you're creating\nextension this way – which is kind of a portable way to do it because you can do that\nanywhere. Guys, disc problems are very common problems. Like I've said, if almost all of us were MRI'd,\nwe'd have some sort of a disc problem. But that doesn't mean it's a problem for you. If it is symptomatic, then there are ways\nto fix it. You don’t need to rush yourself into surgery. Jessie's now been a year and a half, or two\nyears since he's had any pain at all. He's been deadlifting, he's been squatting,\nhe's been doing a lot of things to help keep it nice, and strong. We'll cover that in a future video, too. In the meantime, I wanted to make sure I got\nyou the way to fix it so you could get on your way and start feeling a lot better. Guys, all of our programs here aren't just\nprograms for working out. As a physical therapist I care about what\nhappens to you. Not just in the gym, but around the gym, because\nit's going to matter, ultimately, to how you perform in the gym. If you're looking for our programs where we\nput the science back in strength, head to ATHLEANX.com and get our programs. You can do that right now by clicking on the\nlink. If you haven't already, subscribe to our channel,\nand click on the notification link so you don’t miss any other videos, and you can\ncatch our latest video up here. All right, guys. I'll see you over at ATHLEANX.com, and I'll\nsee you back here for another video in a couple of days."
}