{
    "id": "9TGhtatQeag",
    "title": "Biceps Workout Tip You&#39;ll NEVER Forget!",
    "description": "What if I told you that I can show you a biceps workout tip that you'll never forget? In this video, I am going to show you a tip that ...",
    "transcript": "So come over here, guys. I want to \nshow you something. This is going to be   probably the best bicep video you ever seen, \nincluding all the ones I've already done on   this channel. So, if you've been trying to build \nyour biceps, I'm sure at some point you're using   some version of an easy bar curl, right? \nYou've approached a rack like this at the gym,   you've grabbed it and you started curling \naway. How you grab this thing, though,   may or may not lead to more or better results. \nBecause the way these bars are actually set up   is that they're set to kind of stay in one \nposition here on the rack, they all fall down into   one position. That's because of the way the bar is \nengineered. The center of mass keeps it like this.   The problem is you look at this, it's got two \ngrip options here. You've got these inside grips   and you've got the outside grips. And a lot of \nus don't like to grab the narrow grip because it   doesn't really feel comfortable when we're curling \nlike this, so we'll grab the more comfortable   shoulder width. But if you grab it like this, look \nwhat happens as the bar is set up. I grab it. I'm   actually doing something that's less optimal for \nmy biceps, why because I've actually grabbed it   from a less supine position. In other words, I'm \ngrabbing it from more of a permanent position.\n  You can see that the angle of my hand when I \nput this down is like this, not turned over.   So, what you have to do if you want to get more \nout of this, is to actually understand that   and then flip that bar over before you grab it. \nSo, that when I grab this outside handle now you   can see that the hand is having to be separated \nmore, right? This would be that kind of flat   position. I can separate more to grab those same \ngrips and then get in this position to get a lot   more bicep contraction and not let the brachialis \nsort of dominate the flexion of the elbow to bring   this bar up to the top. Now you probably see me \nalso doing something else that I do automatically   that I shared with you before, and that's the real \ndesire and need to keep the wrist somewhat bent   backwards at the top of a curl. It's essential \nto an optimally performed bicep curl. Why?   because of anatomy. We know that an accessory \nmotion to supination is wrist extension,   and this is why that happens. So, if I was going \nto just lay this in here like it's in my body,   you can see that this is the radius and this \nis the ulna, right? And my hand is pretty   much in this position. If I want to pronate \nlike this, then this radius has to rotate   around the ulna, which doesn t really move.  \nRight? The ulna is kind of fixed. But we know   that if I want to get back into this position \nin supinate and continue to go that way, that I   need to have this extension at the wrist. Why? \nBecause if I have a flexed wrist here and this   tries to open up, you'll see that it's actually \ngetting blocked by the bones that are in there.   Right? The bones, the carpal bones of the wrist \ndon't have freedom of movement there to allow   for that. So, if I can get into extension, all \nof a sudden, that can open up a lot easier. So,   it's really important that we have that ability \nto do that. So how else would this apply? Because   it's not just that exercise you're going to do. \nI want to make this an all-encompassing video   for you so you get this right every single time. \nSo, if you were to go do, let's say, a Cable Curl,   there's a few other benefits that \nactually come in play here that   help you out. So again, if I \nwere just to curl up like this,   I'm going to limit how much I can get in terms \nof separation. I want those risks back for a   couple of reasons because number one, as the \nrisk go back, I'm actually going to see you   can see the elbow coming in tight to my body. \nI'm able to get the elbow underneath because   I'm going to show you something in the second here \nwhen we get to the straight bar that illustrates   exactly why you need to get this right.\nBut I want this so I can get underneath.   And when I'm underneath, I'm getting more of that \nsupination by getting that wrist bent back. But   also, I'm keeping the force on the biceps with \nthe cable. If I curl in here like this, the line   of resistance is this line right here, this cable \nline. And look at its relationship to my forearms,   right? It's approaching parallel. And we know \nthat in order to keep the force on the muscle,   we're trying to work. We want it to be more \nperpendicular to the moving segment, in this case,   the forearm. So, if I bend those wrists back a \nbit, look at the relationship now that cable is   more perpendicular to my forearm and right away I \nfeel a lot more tension on the biceps even at the   top of this exercise. And the more I can kind of \nkeep that by keeping the wrist bent back, I have   more tension here on the biceps. So, reason number \ntwo of why you want to get some of that wrist   extension here as you come up. But over here at \nthe straight bar, you might be thinking, well, how   do you do that? Because you really again, you're \neven more limited than you are with the cable   because gravities are acting straight up and down \nhere, not the line of force being the cable.\n  So, here's what we do, pulling out all the stops, \nguys. Raymond, muscle marker, everything. This   area right here is where you want to direct your \nforce when you're curling with a straight bar.   Why? Because it's going to encourage supination \nand it's going to get the elbows tucked into the   sides. How? If I grab this straight bar here and \nI focus on pushing through this part of the hand   just like that, then what that does is it first \nof all, it prevents the elbows from drifting,   which just takes away some of the work of the \nbiceps. But it actually by pushing through that   inside portion of the hand right there, you can \nsee the bar actually being pushed through there.   I can almost supinate my hand into a straight bar. \nSo not even being limited anymore by the fact that   I don't have any manipulation or orientation \nof the bar that allows for more supination. So,   I'm able to come down, up, push through that inner \nportion of the hand, almost allow for supination   in a bar that was once thought to be unable to \nallow for that because of its fixed nature. So,   I'm able to kind of do that. And again, in order \nto do that, I've got to get the elbow underneath   for leverage, so it discourages any flaring \nof the elbow because it has to come underneath   to push through this portion of the hand.\nAnd then finally, if I go over to a dumbbell, I've   shown you guys this before, but again, it bears \nrepeating because if you understand the whole   concept, you're going to get this right every \ntime. And if you struggle to grow your biceps,   you're going to start growing them. So, when I \ngrabbed the dumbbells, I told you about an offset   grip. If you take a grip all the way at the end \nof the dumbbell, the top end of the dumbbell here,   just like that. And then you curl, and you \nmake sure that the dumbbell is level at the top   or if anything, pinkie side higher, you're going \nto make sure that you're getting the biceps to do   more of the work because the biceps are the \nsupinator. It's the differentiator between,   let's say, the brachialis and the biceps is their \nability to do supination. And how do I know that?   Well, quick little story you probably been \nwatching for a while here and wondering why   I've had this brace on or this little sleeve, it's \nbecause I've had a bicep tear. So, if I actually   come down here, you can see the difference, right? \nThe fullness in here and what's lacking in here.   But when I had the injury, when I was walking \nmy son into school and he slipped on the ice   and I went to go grab him, I had \nto assess what was going on.\n  The first thing I did was look at \nmy ability to move into supination,   not just flexion. Because if I could go like this \nand still see a bicep, but not really know whether   it's torn or not. Because I could carry the \nbiceps along in elbow flexion and make it ball up,   but not necessarily have it still be attached. So, \nthe way you test for that is you want a supinate   and you can see that when I supinate just the \nwrist here in the forearm that I get good movement   here. So, I have supination capabilities. It is \nthe differentiator between brachialis flex and the   elbow and the biceps flexing the elbow. If you \nwant to grow your biceps, learn from this injury,   realize you need to get into supination. The \nbest way to do that is to allow for it by getting   some extension at the wrist and to keep those \nelbows as close to the body as possible. \n  Guys, I hope you found the video helpful. If \nyou're looking for more of these deep dives,   leave your comments below. I'll do that. If \nyou're looking for more bicep workouts and tips,   you can find those over here. \nMake sure you click, subscribe   and turn on your notifications so you never miss \na video when we put one out. See you soon."
}