{
    "id": "9XP_pmTwYsw",
    "title": "How to Lose 5 LBS Fast (TRY THIS FIRST!)",
    "description": "If you want to lose 5 lbs fast, particularly of unwanted body fat, then you are going to want to do what I'm showing you here first.",
    "transcript": "Think about what you were doing three \nweeks ago. Now, if you could have lost   five pounds between then and now, would \nyou have done it? Well, guess what,   you're going to get that opportunity with \nthis video. Because I'm going to show   you how to do exactly that and all you're \ngoing to have to do is just one thing. \n  What s up guys, Jeff Cavaliere, Athleanx.com. \nSo today I'm going to help you to lose weight.   That's right. And it's going to be very simple \nbecause I'm only going to ask you to do one thing   for me. Now, if you are to the point where you are \nseriously struggling with food because you have a   food addiction, guys, it's a very serious matter. \nAnd getting the appropriate help there is going to   be the right move for you. If you have a healthier \nrelationship with food, but just struggle to lose   weight, well, then what I'm going to show you \nhere is going to work for you, I promise. \n  Quick, shameless plug for those who haven't \nchecked out the March issue of Men's Health   magazine, please do so because inside \nis yours truly. If you like Face Pulls   and muscle markers, you're going to be happy. \nSo you may have heard about something called Time   Restricted Eating, better known as Intermittent \nFasting. Well, that's when people are given a   window within which to eat in a 24 period, let's \nsay six hours of eating opportunity and 18 hours   where you cannot eat. This is not what that is. \nInstead, this is called Time Prescriptive Eating.   And when we're talking about is eating around \nthe clock. And what I do is I prescribe a time   for you to eat throughout the day. Now, I don't \ncare what you're eating right now because the   beauty about this method is it actually doesn't \nmatter. It's going to be a self-regulating,   self-correcting method if you do this \nappropriately. But you cannot change   the rule that is you need to eat at a specific \ntime every two and a half hours throughout the   day. That is the rule. That's the only thing you \nhave to do for me. How would this play out? Well,   let's say you have to eat breakfast. \nNow don't worry if you don't like breakfast foods,   you can eat whatever you like in the morning, but \nyou have to eat at, let's say, eight o'clock. Now   two and a half hours later, you're going to have \nto eat again at, let's say, 10:30. Then two and a   half hours after that, you're going to have to eat \nagain at 1:00. One more time in the afternoon at   3:30. And then of course, from here, you're \ngoing to have to eat at 6:00 and wrap around   one more time to 8:30 and that concludes your \neating for the day. Now, one thing this is not   is this is not a body builder approach to eating. \nI'm not talking about the antibiotic benefits   of eating six times a day. If I can tell you \nan embarrassing story please let me do so. \n  I actually remember leaving parties to go out \nto my car to have a protein shake that I had   been kept on ice because I was afraid I was \ngoing to become catabolic and start losing   muscle if I didn't eat every two and a half \nhours. Luckily, science has shown us the truth,   and we know better than that now, so that's not \nnecessary. However, what this does is it starts to   institute a few different things. Most of all, it \nteaches you how to eat. Look, anybody can be told   what to eat, but when you don't know how to eat, \nyou're never going to be armed with the tools   to be successful for the rest of your life. So \nwhat we get from this is we start to learn portion   control what is and is not hunger and also what \nfoods do a better job of keeping you full. \n  So let's say we go back to this equation. \nYou start to eat, and you eat way too much   in the morning. Well, what we find is that \nthe 8:00 time when I wrap around a 10 30,   I just can't eat. So we self-correct, we start \nto decrease the amount of food that we eat at   8:00 in the morning so that we can accommodate \nthat other meal. Remember one rule in place you   must eat when it's time to eat. At that point, we \nstill have to be expected to eat again at 1:00.\n  Well, maybe I'm not hungry. Well, either. I \nate too much at 8:00, that still left me rather   full at 10:30, hat leaves me to full to eat at \n1:00. Once again, I back regulate, and I start   to decrease the amount of food that I take in \nhere. As those portion sizes go down, you might   find that you're going to start to make different \nfood choices. You're going to want to choose more   proteins and fewer of the high calorically dense \nfoods. So more of the fibrous carbohydrates are   going to be lower in calories, but more filling. \nThat will help to get you to that next time frame   so more satiety in that short time frame and then \ncarry it over to still allow you to be hungry   when that next time frame rolls around. \nAnd of course, we talk about confusing our   hunger. What does it mean? Sometimes \nwe think that we're hungry when we're   actually thirsty. So another thing we can \ndo is just simply add 16 ounces of water,   a simple Poland Spring bottle will do the job at \nevery single one of these six meals. That will get   you to about 100 ounces of water a day, which is \nmaking sure that you're remaining hydrated. \n  And as I said before, guys, the beauty about this \ntime prescriptive eating is that it works for   everybody. Anybody can start doing this right now. \nJust start setting your times and stick to those   times as the one and only rule in the food choices \nthemselves will start to improve. And what's nice   about this, as I said, you're going to see quick \nresults because as you start to stick to this,   you're going to become less of a binge eater and \nmore of a timed eater, which is going to help to   correct some of those really enormous amounts \nof calories you're taking in right now to lead   to those quick results. And the nice thing about \nquick results is it becomes self-propagating. \n  You look in the mirror, you say, wow, this is \nworking, you get excited, and you do more of it.   And as I mentioned before, maybe that starts to be \nthe introduction of some exercise along with this.   Maybe it starts to be you become more committed to \nactually preparing your foods ahead of time. All   those things start to come in phases, but if you \ndo what I'm showing you here, it will work. \n  Guys, if you're looking for a step-by-step meal \nplan, you can find them over at Athleanx.com.   And the meantime, if you're looking for exercise \nprograms as well, they're included there too.   Guys, make sure you give this a try, I promise you \nit will work, if you do. I back here again in just   a few days with another video. If you haven't done \nso, click subscribe and turn on your notifications   so you never miss a video from Athlean-X in \nthe future. All right, guys see you soon."
}