{
    "id": "9yzYzWYtkvI",
    "title": "How to Fix a Sunken Chest! (PECTUS EXCAVATUM)",
    "description": "Build your body with science here - http://athleanx.com/x/start-here Subscribe to this channel here - http://bit.ly/2b0coMW If you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to talk to you about a sunken\nchest, or in more severe cases, something called pectus excavatum. You see it's that noticeable deformity in\nthe lower chest that sinks in, down near the lower sternum, that really, really can be\nsomething that's not just psychologically tough for those that have it, but it could\nactually be physically impairing because it can interfere with your ability to expand\nyour own lungs, or even have your heart contract without beating against the sternum itself. So what I want to do is give you a game plan\nto, number one: figure out how severe your sunken chest is – is it something simply\nthat is cosmetic, or is it bordering more on that line of interfering with your physiology? So what are we talking about? Let's look at a couple of pictures. This picture right here, this would be what\nI call a 'mild' form of this. As a matter of fact, I actually don’t have\nthe best pec development myself. What we do is, sometimes we confuse poor lower\npec development because of attachments with this sunken chest. So if you look here at me, this pec here noticeably\ntakes a little left turn, compared to this one that's a little bit more full. This is simply having distal attachments – or\nfurther out on the sternum – than this. Which makes this look wider at the bottom,\nand creates a little bit of a hole here in the lower sternum. But that's something that – again, we can't\nchange muscle attachments. What we can do is try our best to develop\nthat. But this picture right here, this is definitely\npectus excavatum. You can see a major hole here, or a sinking\nin the bottom of the chest that can probably, in this case, start bordering on those physiological\nimplications that I talked about in the beginning. If you have this I'm going to tell you here,\nright now guys, I never bull shit you and I tell you the truth. If it's this bad and it's actually making\nyou more fatigued, or it's getting in the way of your ability to do endurance events\nbecause of this limitation on lung expansion; you're probably going to have to look at the\nsurgical route. The good news is this: there are two procedures\nnow. One of them is the NUSS procedure where they\nactually go in and correct this. Almost like the same way you would brace your\nteeth. A long duration change to the sternum by actually\nbracing it and trying to pull it outward by putting a bar in there and trying to pull\nit outward. The second thing is actually a little bit\nmore optimistic because it's less invasive. It's a metallic bar, a magnetic bar, that\nthey put in the lower chest and then externally fixate a brace that will pull that out over\ntime. But both of them are long duration fixes. You're going to have to have that on for a\nlong period of time, just like you would braces for your teeth. So what I want to do is say \"Look, even if\nyou have those conditions and you want to try to do something in the gym, something\nthat's in your power that's not going to require that\", what I show you where is going to help\nyou. If you have a much more minor version of this\n– like I showed you in the beginning – what I'm going to show you here today is going\nto help you as well. So the first thing you want to do is: adjust\nyour posture. Why? Because we know that if your chest is sunken\nin, the first thing that's going to happen is, you're going to get tightness mostly in\nyour pec major and pec minor, which is going to round your shoulders down, further creating\na sunken chest, right? If it's already hollow and I do this, I lift\nup here and show you – when I do that – everything sinks in even more. Now what we have to do is stretch those two\nmuscles. Instead of making this video a million minutes\nlong, what I've done is I've already done a video in depth on how to – I even broke\nout the muscle marker on how to stretch the pec major, and the pec minor specifically. Each one. I want you to make sure that you do that. Then what I want to show you is the other\nthings that you can do. It's not just the exercises, guys. It's the 'how to' on the exercises that's\ngoing to matter the most. Right away we start with working the other\nside because when you stretch a muscle on this side you want to make sure that you strengthen\nthe muscles on the opposite side. So we've got to make sure that those rhomboids,\nand mid-scapular muscles are strong enough to handle the posture that you have to, now,\nrecreate and retrain. So we do that with band pull apart. When we do that we stand back, we actually\ndon’t just do them from here with a sunken chest. You always have to make sure that you're creating\nthe condition and the positioning that you want. So you try to protract your chest out. \"Lift your sternum\", is what I say. If your sternum is pointing down here, the\nangle of it pointing down, lift it up until it's right, straight ahead. So I can rest a glass of water on top of it. From here is where I do my band pull apart. Right from here and I pull back, and I hold. The idea here is to get your shoulder blades\nretracted, pulled together, and down. Now what I want to do is, I don’t want to\ndo one set of 20 here. What I'd rather have you do is 20 sets of\n1. Execute each rep as if it's the only one you're\ngoing to do. Then retrain your muscles to contract in that\nposition. So right here, the quality is always going\nto be better than quantity. As I transition here to some of the other\nexercises that you're going to want to do, focus on how I'm telling you to do this and\nnot just what to do. Everybody always tells you what to do, but\nthey don’t tell you how. The how is much more important because you're\ntrying to create a long term change. If you're not going to have a brace on here\n24/7 you need to be able to do things that are going to have an impact on it. Guess what? You're likely going to have to own this program. Meaning, you're going to have to take ownership\nof the fact that your special circumstances require you to do much more than the average\nperson who doesn’t have this. But if you're okay with that then that's cool. I'm going to show you exactly how that's done. When you bench press, let's hold off on creating\nmass as a major focus at this moment because you can always do that. This is more of a repetitive program that\nyou would do three, or four, or five times a week in small doses. Why? Because we're trying to create that brace-like\neffect. So when I bench, as I pull the dumbbells down\nyou actually want to pull the dumbbells down and move the chest up, and pause at the bottom\nof the rep. at the same time you're trying to pull your\nstomach in. Contract your abs because you want to make\nsure that whenever you're expanding your ribcage you're getting a co-contraction of your abs\nat the same time. Because the sunkeness actually results in\nthis sunken chest, but also in extending stomach. You lose ab tightness and strength when you\nhave pectus excavatum. So we want to be able to contract that, pull\nthat in, and then lift the chest up. That will actually help to make the appearance\nof this start looking better. So when I do that on the bench press I pull\ndown and push out at the same time. It's literally and active movement. I'm not just coming down here. I'm coming down and moving my chest up toward\nthe ceiling as far as I possibly can. Hanging out at the bottom here, and then coming\nback up out of it. Again, this is not what the chest training\nsession looks like. That's still doing the same technique, but\nwith heavier weights in an effort to build. This is the repetitive three, four, five times\na week program that you do three sets at a time, just as if you would do rotator cuff\nwork three, or four times a week to try to overcome a weak rotator cuff. It's the repetitive stuff. Next we have another great exercise. The dumbbell pullover. The dumbbell pullover helps us to create the\nrib expansion, at the same time it requires us to contract your abs, if you're doing it\nright. A lot of people don’t do that portion of\nit. So we come down here with a dumbbell, put\nyour shoulder blades right on the top of the bench, okay? Then don’t leave yourself up here in the\nair like that. Drop down. Just by dropping all the way down I've already\nextended the rib cage, and expanded the rib cage. When I breathe in here I've got this massive\nexpansion of the ribcage, but at the same time, as I come back up I'm breathing out\nand tightening the abs at the same time here, to create that core contraction while I have\nthe expanded chest. So don’t just do pullovers. Pullovers alone is not going to do it, guys. You want to have the right performance of\nit. As I said in the beginning, I'd rather you\ndo 20 sets of 1, than 1 set of 20 here. Come all the way down, just drop, expanded,\ntight abs. Don't be afraid to hang out down here because\nagain, we're going more for that brace-like effect, making change. Look, if you're younger, you're an adolescent,\nyou've got soft bones still; you can actually change your bone. That's what happens when you have braces. You're actually changing the bone that your\nteeth are anchored into. It just takes a very, very long effort – prolonged\neffort – over the course of many, many days, many, many workouts, many, many hours. So don’t think you're going to make these\nmassive changes in a pectus condition just by running through the gym and doing a couple\npullovers, or bench press. That's not how it works. Same thing here: dips. When you do your dips – another good exercise\n– lower portion of the chest. What you do is, you do the same thing you\ndid on the bench press. When I come down I'm not just dropping here\nat my elbows. In fact, if I do that and I do this, I'm actually\njust sinking my chest in more, right? Just recreating the same positioning here. What I want to do is, I want to go down at\nthe same time that I'm pushing out my chest, pull my shoulder blades back together, and\nof course, tightening the abs that way, and up. That way, and up. Breathing in. again, hanging out at the bottom here. This is not meant to go to failure every single\nset with the fact of over doing your chest work because that's not how you build a bigger\nchest either. You've got to give it a chance to recover. This is more of that remedial stuff that you're\ndoing on a consistent basis. Another exercise here. We've got two left. What we do is, we take a dumbbell – a single\ndumbbell – and we pull it up, and across. So we're literally just adducting from the\narm this way, up, and across the body. Trying to get a lift up, and across. Initiate the movement from the chest. You're not lifting with your front delt here. You're initiating with a contraction of the\nchest on the inside here, okay? Again, more longer duration work. Finally we have a stomach vacuum. Now, the stomach vacuum is another exercise\nI went much more in depth on, and I'll link over here so you can see more of the nuances\nof it, but the good thing about the stomach vacuum is, you are teaching yourself to, again,\nexpand your ribcage, and at the same time contract your abs, and bring them in. so we can create this differential here and\ntry as best we can to cosmetically reverse that sunken in chest. So here's the bottom line out of all this:\nwhether you have a minor case of pectus excavatum, whether you have just a little bit of a different\nattachment of the lower pecs that create a wideness, that sort of sunkeness on the lower\nchest; whether you have a severe case of pectus guys; there's a lot of things you can do to\ndevelop the rest of your body. Don’t let that define you. Don’t ever let what you feel self-conscious\nabout define you. I realize that when people say – when they\npoint to themselves – they usually point right here, in this particular case. This issue is right where you're pointing. So it reinforces all those negative thoughts\nthat you might have. But remember this, guys: everybody has something\nthat holds them back, and there's always something you can do. Let it motivate you to do something about\nit. Let it motivate you to train the rest of your\nbody to make people take notice of that instead. But you can do something about it. Whether you go down the surgical route and\nthat's what helps you to fix that condition, or whether you go down this route here and\nit helps with the minor cases to at least become more cosmetically in control of what\nyou have going on here; just make sure you do what I'm telling you. Forget about just doing the exercises. That alone is not going to help you. It's how you do the exercises, and it's the\nquality of what you do, and it's the frequency. I can't say that enough. The frequency. Adopt this as your program. Other people have their things they have to\ndo to maintain whatever it is that they're dealing with. Your program happens to be this, and something\nyou're going to have to stick with and own if you want to make permanent changes, but\nI know if this is something that bothers you, I know it will be something that you will\ndo. In the meantime, guys, I hope you found this\nvideo helpful. Here we've always put the science back in\nstrength, and we try not to bullshit you about anything. I try to give you the exact answers to whatever\nit is that you're dealing with. I do the same things with all of our training\nprograms over at ATHLEANX.com. All of our programs, no BS, step by step,\nwe put the science back in strength. Those are all available over there. In the meantime, let me know what else you\nwant me to cover here on this channel, because this was a direct response to all of your\nrequests that I got from you viewers out there, that wanted me to do something on this. All right, guys. I'll see you soon."
}