{
    "id": "_9pWLqaULjQ",
    "title": "You CAN&#39;T Build Muscle and Burn Fat at the Same Time!!",
    "description": "Have you ever wondered if it's possible to build muscle and burn fat at the same time? If so, this video will answer your question ...",
    "transcript": "Anyone with half a brain knows you can't burn\nmuscle and burn fat at the same time. Is that Professor Dickweed again? What's up, guys? Jeff Cavaliere. Athleanx.com. And Jesse. Athleanx.com. Yes, I'm still doing that. What is with the winter hat? It's snowing outside not in here. I'm still cold. Leave me al one. Today we're answering another one of your\nquestions. It's an AX Jeff, and Jesse, what have we got\nfor AX Jeff? All right, coming from Wayne Beckett, Jeff,\nwhy would you say that you can build muscle and burn fat at the same time when everyone\nwith half a brain knows that you can't?? With two question marks. Geez. Any exclamation points in there? That was a little angry. I'm surprised there's not. Geez, Wayne. Listen, Wayne, okay calm down. All right, okay, listen. I have a respect for all of my viewers' questions,\nso I'm going to respectfully answer the question. But I'm going to tell you in advance I might\nget a little heated here because this is something I've been pretty passionate about I think\nfor about a decade. It's been ten years, right? Yeah, this is related to bulking and cutting,\nand I have actually talked about this many times in this channel. Here's me back in my basement, Angry Jeff,\njust screaming about bulking and cutting then. Well, guess what, my opinion hasn't changed\nin the ten years. But I think it bears repeating because this\nis a common question and we need to make sure that it gets addressed in a real thorough\nway, all right? So that everybody understands what we're talking\nabout. Where this comes from is the fact that many\npeople hold the belief that these two things, these two goals, are too much opposed from\neach other to actually be able to be achieved together. Right. If you want to build muscle, they'll say you\nneed to be in a calorie surplus. Right. If you want to burn fat, it's said that you\nneed to be in a calorie ? Deficit! Deficit. I know that one. It's starting to rub off on you, Jesse, you're\ngetting good. That's actually not true. Yes, you do need to be in a calorie deficit\nin order to burn fat. Right. In order to build muscle, you don't have to\nbe in a consumed calorie surplus. There's a big difference. Our body is smart. We have ways to actually produce energy and\ncreate an energy surplus without having to take them in through the consumption of food\nand calories. That means, thankfully so, we can tap into\nour own body stores of body fight. Okay. In order to create the energy needed to support\nnew muscle mass and muscle growth. Right. That's a good thing. Because if you think about what the goal was\nin the first place-- building muscle and burning fat-- obviously if that is something you were\nlooking to achieve, you likely have body fat to burn. Unlike you. Unless it's me, but the good news is I'm not\nlooking to do that. Because yes, it becomes way more challenging\nthe lower level of body fat you get down to. If you have very low levels of body fat, you\ndon't have the luxury of being able to tap into those stores to do that. And what happens then is your body starts\nto tap into muscle because muscle's also willing to provide the energy need to do other things\nin the body, but it's not going to be very helpful to break muscle down in the goal of\ntrying to build new muscle. No, that's bad. Right, that would be bad. So we don't want to do that, but that requires\nthough that we focus on the intake side first, okay? And we make sure we don't make some big mistakes. And when we're talking about the intake, though\nI said it wasn't about the consumed calories you take in, you still have to focus on how\nyou're consuming what you're consuming. And the first thing I would caution you is\nnot to get too aggressive in the deficit that you're trying to create in terms of the calories\nyou take in on a given day. Okay. Because if you take in too few calories in\nthe pursuit of trying to make this happen fast-- and I'm going to talk about fast versus\nsustainable in a little bit here-- if you try to make this happen too fast, you slow\nthe whole process down to the point where it actually doesn't even work anymore. So what you want to make sure is you don't\ntry to exceed anything higher than ten, 12, let's say a top end of 15% of a deficit from\nwhatever your maintenance level of calories is right now to achieve this. So let's throw some numbers around this. If your maintenance level of calories is 3,000\nin a day, let's do some math, Jesse. What would be 10% of 3,000? This is an easy one. 300! 300. Good. Now what about 15%? Okay, now you're getting tricky with me. It's not that hard. It's half of that, so it's 150 plus 300, that's\n450. Okay. So somewhere between 300 and 350 calories\nof a deficit that you want to create in terms of what you're consuming on a day in order\nto make this work and not really exceeding that. Because when you exceed that you then start\nto walk that line again where you start to look at potentially muscle protein as a source\nfor providing the energy for what you're trying to accomplish, which again, we said is not\ngoing to work. No, that's bad. Cutting into muscle to try to build muscle\nis not where we want to be. One of the fat storages where we're using\nand utilizing to energize this process. The second thing you're going to want to do\nrom the intake side, you're going to want to make sure that you're eating enough protein. Because many studies will show you that eating\nenough protein is going to be required to make this process work. Oh, I know this. It's one gram of protein for every one pound\nof body weight. A lot of people will say that, it's actually\nnot true. The good thing is you don't have to have that\nmuch actually. Really? No, you really don't. Studies will show that .8 grams will do the\njob all the time, and some people even suggest as low as .6. I'm not necessarily one that goes that low,\nbut I will say .8 is something that could be done. And there's a big difference between .8 and\none. By why is it one? I think, honestly, I think it's just because\npeople round up. Well it's easier for people like me. For you, yeah. They make it Jesse-proof by just saying, Just\ndo one, instead of .8. But we know that the difference between .8--\nor some of us know-- the difference between .8 and one is 20%. And 20%, if you don't realize how big that\nactually is in your total protein intake in a day, think about it over the course of a\nmonth. And think about paying for 20% more protein\nover the course of a month. Oh. We know how expensive protein can be in whatever\nform you eat it. Yeah, that's a big grocery bill right there. It's a big savings. The third thing I want you to focus on in\norder to do this right is you need to increase the quality of the nutrition that you put\nin your body. Yes, of course. Because what it does is two things. As you increase the quality of what you eat,\nthe nutrient density goes up. In other words, more productive food, foods\nthat can actually provide your body with vitamins and minerals to accelerate the processes to\ndo what it is you're looking to accomplish. Which, in this case, is burn fat and build\nmuscle. The second thing is by increasing the nutrient\nquality here and the quality of the foods you eat, they actually usually become calorically\nless dense. So that allows you to actually take in more\nfood and still be on that lower side of the calories in that 10%, 12%, 15% range to accomplish\nthis a little bit easier. You still get to enjoy the foods you have,\ntoo. So that means less of the kind of bullshit\ngummy bears and sugary crap that somebody used to eat. Yeah, that is all a bunch of bullshit. By the way, what's Daisy doing over there? Daisy? What is Daisy doing? I don't know, she's Hey, what are you Oh,\nyou're impossible. What? You're impossible. Daisy's right there, by the way. Oh, hi, Daisy. Now the next thing is the training side of\nit. Okay. So now we know that from the training standpoint\nthere's two things we could do in terms of training. We could focus on conditioning and cardio,\nwe could focus on resistance training. Focus on resistance training. As a matter of fact, that is one of the non-negotiables\nhere. You have to resistance train in some form. And I say resistance because it doesn't have\nto be in the form of weights. Although I would highly encourage you to do\nthat. But body weight training would work, band\ntraining would work. Oh! Water aerobics with nana down at the Y. Do you do that? Maybe? Water aerobics with nana down at the Y. With Jesse's nana down at the Y. However you want to do it, guys, some form\nof resistance training is necessary because that's what sparks the whole desire for your\nmuscles to actually come back and grow back bigger and stronger. If you don't provide the stimulus, this whole\nthing goes out the window. There's no build muscle portion on the build\nmuscle and burn fat. I will give you this other revelation that\nmight shock some of you. The conditioning part of it and the cardio\npart of it is completely unnecessary to achieve that goal. Really? Now, I am going to follow that right up with\nif you want to be a normal, functioning person with a healthy heart-- which all of us should\naspire to be. Yeah. Then you should be doing conditioning and\ncardio. I'm just saying that you can actually achieve\nthis all through nutritional changes alone and creating that deficit. But it's going to be a lot more effective\nand it's going to be a lot easier for you to do this if you incorporate some of the\nconditioning and cardio as well. I'm going to go back to that example of 3,000\ncalories. Okay. Here's the problem that happens when you try\nto just do it through cutting your food intake. All right. If I were to take 500 calories out. Now, let's say we've already made the changes\nto increase the quality of the stuff that we're eating. If I take 500 calories out of the equation,\nthat's 500 calories of nutrient dense high quality food, right? Right. Now, I have an alternative to do something\ndifferent. If I do, let's say, 300 calories that I take\naway, but then I burn 200 additional calories doing some type of conditioning, right? Right. What's happened to the extra 200 calories? You get those nutrients back in your system. But I didn't have to take them out so I have\nthem. 200 calories is a lot. Yeah. 200 calories if you did it in strictly protein\nat four calories per gram is actually 50 grams of protein. That's a lot of protein. And when you consider that you only need,\nagain, that .8 grams per pound of body weight, that's going to add up very quickly. Yeah. So you're going to become a lot less likely\nto walk that thin line between burning fat and sort of tapping into muscle storage in\norder to achieve your goal of building new muscle. So the holy grail here is really trying to\nfind the balance between the two and realize also as you build more muscle that number's\ngoing to go up. Your caloric maintenance levels are going\nto go up because sustaining new active muscle tissue is going to require more calories than\non a given basis. So you can actually start to upwardly adapt\nthis number as you start to make changes and build muscle at the same time. Here's the recap. Wayne, it can be done. Wayne, it can 100% be done. Wayne, yes, it's likely going to take more\ntime than a successful bulk and cut. I still use the word successful because that's\nthe key word here because for every successful person that makes it through a bulk and cut,\nthere are millions? That's a lot of people. Millions of people that don't make it through\na successful bulk and cut because they get into the bulk, and what happened is they never\nlearned the key requirements of realizing what good nutrition is and how to be dedicated\nto good nutrition, and how to remain consistent with your training. That makes this a sustainable, long term lifestyle\nchange that makes this something that once you incorporate it like I did back in my teens,\nit's something you're still doing and living every single day, almost as second nature\nbecause it's part of your life. The bulk and cut cycle, though it may happen\nfaster if you do it successfully, is not going to be a sustainable approach for many. And what happens is-- I've mentioned this\nbefore and I'm not accusing you, Wayne, I'm just throwing it out there-- is you start\nto adopt something called the big guy lie. Remember that? I think so. The big guy lie is the guy who starts off\nwanting to build muscle and burn fat, and then when he starts his bulk and never gets\nout of that, it's that perpetual bulk, he then all of a sudden says, You know what? Being ripped doesn't really matter. Having abs is overrated. Just being big and strong and being able to\nlift things is really the only important thing in the world. That's the big guy lie because we know that\nwasn't your original goal. You would have liked to have done it, and\nI'm tell you, you could do it. You can still do it if you're willing to put\nin a little bit more time to get there. I promise you guys this will work. My stance has not changed in ten years, it\nwon't change ten years from now. It's going to work if you're willing to put\nthe work in slowly but surely. That being said, guys, I want to answer your\nnext question. If you can, put your question down in the\ncomments below, and Jesse will look through them and pick the next one. Yes, I will. Hopefully one a little less angry than Wayne,\nbut if we have to, we'll address him. In the meantime, if you're looking for programs,\nguys, we actually map out nutritional strategies and meal plans that will allow you to do this\nat the same time-- build muscle and burn fat-- and we make it a lot easier than you think\nit is because we show you the step-by-step way to do it. You can get them all over at Athleanx.com. If you haven't done so, guys, make sure you\nclick subscribe, turn on your notifications so you never miss a new video when we put\none out. All right, guys. See you soon."
}