{
    "id": "_fgxPmIo_dc",
    "title": "Eat Like Jeff Cavaliere (RIPPED YEAR ROUND!)",
    "description": "If you ever wanted to eat like Jeff Cavaliere and be ripped year round, this video is going to show you how. I'm going to cover my ...",
    "transcript": "What's up, guys, Jeff Cavaliere, athleanx.com.   So there's one question that I have been asked \nmore than any other over the last 10 years   is, Jeff, how do you stay as lean as you do \nall year around? You literally never change.   Well, I take that as a compliment, but \nhonestly, it comes down to the way that   I approach nutrition. You see, there's no deals \nwith the devil. I didn't promise my firstborn son.   I don't take TRT. I don't take any drugs I never \nhave in my entire life. There's nothing that I   do special except my special ability, I guess, to \nstay incredibly consistent with my nutrition. \n  Because quite frankly, I've talked about it in the \npast, I don't even really do cardio. I do enough   just to maintain some shape and to focus a little \nbit on my heart, but I don't do nearly as much as   I should, but it's certainly not a factor in how \nI remain as lean as I do. It all comes through my   nutrition. Now that being said, people say, Well, \nJeff, I know that, and I've watched your full day   of eating video, but maybe you can update \nthat for us. You can make another one.  \n  Well, guess what? It would be a pretty boring \nvideo because it's going to be the same   exact information that I gave you back then. As \nmatter of fact, the same thing pretty much that   I'm eating. And it's the fact that I can have that \nconsistency that I believe leads me to the levels   of body fat that I demonstrate consistently. \nHowever, there is a system and the system   that's in place here is what is allowing me to do \nthat all the time and to remain as lean as I do.   So I want to share that exact system with you here \ntoday so you can actually start to do the same.\n  Now that being said, depending upon what your \ndesired level of leanness is, it's going to be   either easier or more difficult to actually get to \nwhere I'm at. And that's a good thing because not   all of us want to be Jeff Cavaliere lean, it might \nnot suit you or your purposes in life. As a matter   of fact, a lot of us feel much more comfortable \nin the mid teen range and body fat levels,   and they want to stay there. And the good news \nis you're not going to have to be as consistent   as what I'm showing you here, but the rules \nwill still help you out to a great degree.   If you want to get even leaner than that somewhere \nin between, again, you're just going to have to   sort of up the ante on your consistency, but \nyou're not going to have to veer away from the   rules. So no matter where you want to be in terms \nof your level of leanness, you're going to be able   to apply exactly what I show you here today.\nAll right, so first up here I'd like to think   is the cornerstone of how I do things, because \nif you can't do this, it's never going to work.   And that is, you need to eat what you like. \nNotice I didn't say eat whatever you like,   because that's not the way we play this game. In \norder to get lean, you're going to have to have   smarter nutritional choices. You're going \nto have to have foods that are a little bit   lower in caloric density, but higher and nutrient \nvalue and my diet is filled with those selections.   But it's not perfect, as you'll see again, if \nyou watch that full day of eating video. \n  However, you need to find the foods that are going \nto fit into that criteria that you still really,   really like. Because if you're forcing foods into \nyour daily meal plan, you're never going to be   able to stick to that plan for the long term, so \nit's never going to become a lifestyle. For me,   there's not a single food that I put in my body \nevery day that I don't thoroughly enjoy. And I   mean that. I thoroughly enjoy every food that \nI eat, if I didn't, I couldn't maintain that   consistency. And there are so many food options \nout there that make this job so much easier.\n  And not just foods, but the way that we put \nthem together, the recipes, how we eat them,   how we prepare them. You can make any food \nincredibly enjoyable, you just have to   experiment and take the time to find those \nfoods that you like. Because when you do,   the whole deprivation basis of a diet is no \nlonger there. There's no longer the period   of being on the diet that ultimately ends \noff the diet. And that is where you start,   because if you don't like what you eat, \nyou can't eat what you're eating. \n  The next thing you have to do is pick an approach \nand stick with it. And again, there are a lot of   different approaches here, some that I agree with, \nsome I don't really agree with at all. However,   if you're able to take an approach and stick \nwith it and have consistency for the long term,   I'm talking year after year after year because \nthat's the only acceptable form for me,   then by all means, continue to do that. I'm \nnot a believer in keto. However, if you can   eat that way and that has worked for you, then \ngo ahead and eat that way. I'm not forcing you   into my method, but since this video is about \nmy methods, I'll share with you what I did. \n  I went the low-fat approach, and the reason \nwhy I did that was for two reasons. Number one,   I realized that the caloric density of fats on a \ngram per gram basis was more than twice as much as   proteins and carbohydrates. Secondly, I realized \nthat at the time I had a lot of fat in my diet.   So what I did was make the easy cut. I always \nurge you guys to make the cut that you think   might be the easiest to make. But what I did was \nmake a giant mistake here because I went to the   extreme. I figured less fat is better than \na lot of fat, and no fat is even better than   some fat. And that was a big mistake because \nI went all the way down to pretty much the   no fat level and my body paid for it. \nI wasn't able to stay warm, even in the sunshine,   I had problems with my vision. I talked about \nall these things before photosensitivity,   I went to the extreme and I paid for it. So what \nI did was what a smart person would do, I hope,   is make some modifications back in the other \ndirection. And I gradually added fat back in,   but not to the levels I did before. And because \nagain, the caloric density of the foods that I   was replacing those fats with was less, I was \nable to create that caloric deficit needed to   get to a leaner, body fat level. I urge you again \nto find the method that works for you, but again,   if you're looking for the one, that might be the \neasiest to do if your diet's already high in fat,   that's the one I'm going to suggest you do. \nAnd so the next rule here is one that I believe   is very important for my success, and it can \ndo the same thing for you. And that is I eat   at specific times during the day. I eat around \nthe clock or based upon the clock. And no, it has   nothing to do with optimizing the anabolic window, \nwhich is another thing we learned a long time ago   doesn't really exist. However, what it does is \nit provides a level of consistency because I eat   only during specific times, each and every day and \nnot outside of those times. And the consistency   comes because it prevents me from eating for \nany other reason other than it's time to eat.\n  Now it just so happens that my body has built \nup to a point where I am hungry every time those   windows of time open up and come around. However, \nI'm not eating because I'm hungry throughout the   rest of the day. And oftentimes we just eat when \nwe're hungry, and that opens up a Pandora's Box   because we know when we just do that, we become \ngrazers and grazers, become big calorie consumers   and trying to get into a deficit is very difficult \nwhen you're mindlessly grazing. Not to mention the   fact that a lot of us confuse hunger for a lot \nof different things. Even thirst can make someone   feel hungry and if you're eating every time \nyou're thirsty, you're doing the wrong thing. \n  So what I do is I pick a window in the morning. \nAgain, they are about half hour windows somewhere   in the morning for breakfast, a mid-morning \ntime, a lunch time, a mid-afternoon time,   a nighttime, and then once again, my \nlast meal of the day, which is dinner.   That being said, I never eat outside of those \ntimes because I don't want to allow myself to   become susceptible to any other emotion or feeling \nor craving. And by becoming mechanical about it,   I'm also a lot more prepared for my meals \nthroughout the day. So if I'm not going to   be in the office or if I'm going to be out \nand about, I can plan ahead and make sure   that I have the meals available to me or a \nplace that I can get the meals available to   me that are going to allow me to eat and \nstay consistent with how I do things. \n  Now ironically, this is actually similar \nto something like intermittent fasting.   Not at all in terms of the biochemistry \nand the hormonal reactions that occur   from a six-hour eating window throughout a 24-hour \nday. But because the rules are in place, I am   confined to these specific eating periods that \nallow me to maintain this consistency that keeps   me on track and prevents the overage that would \noccur if I was eating outside these windows. \n  Which brings me to my fourth rule here, and \nthat is the institution of more eating periods   throughout the day. I already mentioned that \nmid-morning and mid-afternoon eating period, not   everybody does that. But what happens is if you're \ngoing to eat by the clock and you're going to try   to stay consistent, you're going to find that \nhunger may wind up beating you. In other words,   the hunger may wind up eclipsing your ability to \nwithstand till that next time period of eating.   And to overcome that, you simply institute another \neating period. I didn't start off by eating that   many times during the day. I started off, like \neverybody else, breakfast, lunch and dinner. \n  But when I started to realize that I was \nconsistently having that mid-morning craving   and instead of just mindlessly eating throughout \nthat period, every time I started to get a little   bit hungry at 9:30 at 10:15 at 11:00 at 11:45, \nI confined it to that rule of eating within that   period of the mid-morning snack and everything \nwent away. To the point where, as I said,   my body became accustomed to that time period, and \nnow I don't find myself getting hungry until that   time period. Remember, you just ate at, let's \nsay, 8:30 or 9:00 in the morning whenever your   breakfast was, you're not going to be immediately \nhungry. So we're only talking about the ability   to withstand maybe 30 or 45 minutes of hunger. \nBut when that next eating window is approaching   and you don't have to wait all the way till \nlunch, it's going to set you up for success. \n  So those four simple rules forming the basis \nof how I eat, the question oftentimes becomes,   But Jeff, how do you break the rules? When do \nyou break the rules? When is your cheat day?   And see guys I already talked about it many times \non this channel before, there is no cheat day for   me. Cheat meals, you know, again a couple of \ntimes a year, once a year for my carrot cake.   I don't have the cravings for the cheat \nmeals. And what cheat meals are implying   is that you're departing from the restrictions on \nthe ordinary meals that you're eating. You see,   there's an instant comparison between your cheat \nmeals being the ones that are much more enjoyable   and the meals you're eating every day being not so \nenjoyable. But if you go back to rule number one,   I made you pick the foods that are incredibly \nenjoyable to you from the very beginning.\n  And when you form the basis of your eating \nplan around those incredibly enjoyable foods,   you're not going to feel the need to have \ncheat meals as often. But we talk about again,   what is your desired level of leanness, because \nthat matters. If your desired level of leanness   is to be in the mid-teens and look damn good \nin the process, well, you're going to find the   ability to have your cheat meals more often. As a \nmatter of fact, the cheat days can actually exist   at that level. And that might give you the sanity \nthat you need to stay consistent. Because again,   consistency is the key and consistency can \noccur at all the different levels of body fat.   Remaining consistently in your mid-teens and \nbody fat levels is a good thing, and if you   have to do that through the use of cheat days \nor cheat meals, then by all means do it. If   you have to do that through a different style of \neating, they all end up in caloric restriction,   then do that as long as you can stick with it \nfor the long term. Guys, the point is how you   eat will determine how you look. If you can \nget your nutrition in check, you're going to   be able to get your body fat down to a leaner \nlevel. How lean you want to go is up to you.\n  The more you want it to be lean, the more you're \ngoing to have to sort of set these rules in place   and stick with them a little bit of varying \nhere, and there are going to be able to still   allow you to look damn good without having \nto get so extreme. But I will tell you this,   the more that you can stick to the rules, \nthe easier sticking to the rules becomes.   That's what rules are there for in the first \nplace. When the rules are in place and you don't   allow yourself to veer outside those rules, your \nlife becomes a lot more consistently predictable.   And when it's consistently predictable, your \nability to look a certain way is going to be   that much easier. At that point, guys, it's up \nto you to what level you want to do it to.\n  If you're looking for that video again, \nhow I break down exactly what I eat,   you can find that here. If you're looking for a \nmeal plan that reflects exactly how I eat from   a day-to-day basis, you can find it in our \nAthlean-X Programs at athleanx.com. If you   find the video helpful. Make sure you leave your \ncomments at thumbs up. Let me know what else you   want me to cover, and I'll do my best to do \nthat for you in the days and weeks ahead.   Click subscribe and turn on your Notifications \nso you never miss a new video. See you guys."
}