{
    "id": "_qPZVaPXHKk",
    "title": "How to Get a Wider Chest (INNER to OUTER!)",
    "description": "To get a wider chest and broader pecs you need not do any crazy exercise. Instead, you need to focus on how you're doing the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to show you how to build a\nwider chest. I don’t care what angle you're viewed at. To do that, we're breaking out the muscle\nmarkers and we're bringing in Jesse. Your beloved Jesse. JESSE: Wait, wait, wait. You forgot my intro. JEFF: The 'what'? JESSE: My intro. It's awesome. Just do it again. JEFF: And to do that, we're breaking out the\nmuscle markers and we're bringing in Jesse. [music plays] JESSE: It's awesome, right? JEFF: I don’t believe you. JESSE: What? Come on! JEFF: Guys, let's talk about wide chests. Thank you for coming because you're my example\nof someone that does not have a wide chest. So, thanks for being the shining example of\nwhat we need to fix. JESSE: That's mean. JEFF: So, here we go, guys. What we're talking about when people talk\nabout a 'wider chest' is, we're really talking about the difference between here and here. Now, we start to take out the muscle marker\nand realize that we're talking about the length of the muscle from its origin here on the\nsternum or clavicle, out to the arm. It feeds into this direction. Top down there, and – I hope you don’t\nmind me drawing on you. JESSE: I'm honored. JEFF: Okay. So, it comes up like this, up through here,\nand feeds up into that point. So, what we see with Jesse is, if we turn\nto the side, this is where it falls apart. It sort of disappears over here. There's no overhang, there's no width. And while there's nothing you can specifically\ndo to create a targeted attack plan just for this area of the chest, there are ways that\nyou do the exercises you're doing that are going to allow for a much better developed\nchest because a bigger, more developed pec is going to stand out more. More importantly, it's going to hang over\nhere more. But it's how you do the exercises you're already\ndoing. So, what I want to do with Jesse and take\nyou guys through is each of the exercises that will have the most impact. Not just what you're doing, it's how you're\ndoing it. Remember, how you do what you're doing and\nwhy you do what you're doing is always going to have the biggest effect. You ready to go through the exercises? JESSE: Let's go. JEFF: All right. So, I mentioned \"common exercises\". The dip is one of the best ways to attack\nthis and start developing your chest. It's how you do the dip, though. So, the first thing you want to do is make\nsure you're applying the most tension to the pec as you can, by prepositioning your body\nthe right way. Meaning, put some extra stretch on it. The way we do that is to get away from these\nrounded shoulders – like that, when we do dips. That's ugly and a lot of people do it. Instead, open the shoulders up. Really try to open your chest up. I say, \"act wide to get wide\". So, we act wide and that puts a lot more of\nthat stretch on the pec, based on that attachment we just saw. Now when we go and do it you don’t just\nget down there and bounce right out of it like that. You've got to savor that stretch on the pec\non the bottom. So, he's in this position for one or two seconds\nand then comes back out of it. Think of it like a pause dip. Down, he has the tension here. You can see it working. Now come up. What this is doing is exploring more full\nrange of motion. There's no magic technique that's delivering\nimpulses right here to this area that's going to make it overhang and get wider. It's just that he's training this exercise\nthrough a more intentioned full range of motion. Good job. JESSE: Thank you. JEFF: Remember I said, 'It's not the exercises,\nbut it's how you do the exercises'? Obviously a bench-press is part of the equation\nhere, but how you do it is the most important thing. Jesse, go ahead and do a bench-press. Lots of things here that I don’t like, and\nI don’t want you doing. So, let's reset this. The first thing: remember I said, \"If you\nwant to get wide, you've got to be wide\". To be wide you've got to open your chest up. Consciously open your chest up to setup the\npositioning. That's going to fix your shoulder blades and\nput them in the right position to start anyway. But you can see that even getting into that\nposition, he's placed more tension and stretch right here on the pec. So, what we want to do is make sure on the\nbottom of every repetition we savor that. We allow that stay there and develop it. So, what we do is press, and when we come\nback down, he gets to the bottom and once again, a pause. He's going to hold that there for just one\nor two seconds and come back out of it. When you come out, the second thing he was\ndoing before was pushing and leading with his shoulders, which is going to immediately\ntake the tension off the pecs that he established at the bottom in the first place. We don’t want that. Once it's established here, you want to keep\nit by leaning and pressing with the chest. Almost squeezing your biceps together, rather\nthan leading with your shoulders. So those two, little tweaks there are going\nto make a profound difference on the development of the pec. Again, not because there's a magic to what's\nhappening there. It's just that you're exploring a more full\nrange of motion by getting down there and opening up that chest. Then making sure tension is applied to it\nin that stretched position. Next up is a pushup. We talk about common exercises, but they're\ncommonly performed incorrectly. At least when it comes to the purpose of trying\nto apply as much tension to the pec throughout as much of the available range of motion as\npossible, we can do it with a pushup, where some people think we're limited. We're not. What you do is get down into a position do\nto a pushup, but instead of limiting yourself down to the ground, you can grab a pair of\ndumbbells. Not only is this going to help some people\nwho have wrist limitations, but they're going to allow for a greater range of motion on\nthe chest to get that arm a little bit more behind the body. These are all safe positions for the shoulder. We'll talk about one that isn't so much, later\non. You get down here, you can see the tension\non the outer pec there. It's not necessarily specific to the outer\npec. It's just tension on the pec in a more elongated\nposition. A more fully extended position, or adducted\nposition, is going to allow for more overall tension, greater range of motion, and greater\nrange of motion under load. All the things that are going to develop a\npec better. So, you see Jesse doing it here. Once again, you can apply the pause to the\nbottom of every, single repetition. The thought, as he goes down, he wants to\ntry to attack the ground with his chest. The hands stay where they are, the shoulders\nalmost stay back, and the chest leads the way down toward the ground on every repetition\nto try and open it up and get wide. Again, hang out for a little bit on the bottom\nand come up. Just increasing the tension for a longer range\nof motion that's what your pec is allowing you in the first place. So now you're probably thinking, \"Jeff, if\nyou're so in love with this tension applied in a more abducted or extended position of\nthe arm then you must love the fly.\" Like this. If you haven't watched enough of my videos,\nI advise that you do because you'd see that I hate the fly. As a physical therapist, if there's one exercise\nthat does accomplish this – it does – but at the expense of your shoulder and at a high\nrisk of your shoulder health. That would be it. But there are things you can do. I wouldn't leave you hanging. This is one of them. If you have access to a cable what you do\nis put yourself in this same position here. What Jesse did, and what I want you to do\nas a first step is open up. Get that chest further back. We know, just by virtue of this muscle marker,\nif this arm is rounded forward, we've just shortened that muscle from origin to insertion. But if we open it up, we've already applied\na stretch to it, just by changing our posture. So, from here, he has the tension on here\nand he's going to initiate from this area. Initiate and then we can fully adduct on this\nexercise. One of the things we can't really do on the\nother exercises. So, you take this pec through its entire range\nof motion. All the way out, and then across, and adducted,\nand shortened all the way across the body. It's a great option for us to do that. Again, you keep the chest out the entire time. Never let it collapse and cave in. Always keep it out. For me, keeping the numbers out, and then\nbringing the arms across the body. Let's say you don’t have access to this. What you could do is go over here and do what\nwe call a floor fly. The benefit of the floor fly is that it gives\nus that safety net. It gives us the floor as something to protect\nand over extension of the arms, jeopardizing your shoulder health. But what you do instead of doing it flat on\nthe floor, you use one of these. A half of a foam roller. This will allow you to get even a little bit\nmore of that opening of the chest because you're up, elevated about two or three inches\noff the ground that you see is now possible. When we do this, because of the ability to\nopen up safely because the elbows are really only a millimeter or so off the ground, and\nthe ground is there to catch us if we need it, we have the opportunity to apply that\nsame tension in amore abducted position. Greater range of motion. Increased tension over greater range of motion. All the things we said in the beginning that\nare going to allow you to get more out of every repetition you do. The accumulation of which is going to apply\nmore overloaded stress to your pec and it's going to help it to grow. When it grows, what happens? This pec starts to get bigger and bigger and\nthe width will come. The width will start to come in as we see\nhere. Again, this is not Jesse's end goal. This is a just a step up. And for you guys who aspire to be even better\nthan this. Again, it's all going to come down to how\nconsistent you are with the right type of training and how you do the exercises you\ndo. If you're looking for a program that puts\ntogether all these things in a step by step fashion, putting the science behind what we\ndo because we know how much it matters; they're all over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you haven't already done so, click 'subscribe'\nand turn on your notifications so you never miss a video when we put one out. JESSE: Oh, if you guys loved the intro, let\nme know. Leave a comment below saying \"Intro\". JEFF: Do you have a specific outro or are\nwe good? JESSE: No, we're good with that. JEFF: Okay, good. JESSE: I'll develop an outro at some point. JEFF: All right, guys. I'll see you later."
}