{
    "id": "_x5tKBtcH7g",
    "title": "Pushup Variation for Bigger Chest (YOU VS. THE WALL!)",
    "description": "Build a big chest without any equipment here - http://athleanx.com/x/chest-mass The pushup and its many variations is one of the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So you could definitely build a bigger chest\nwith bodyweight movements if you remember to up the ante on the difficulty level of\nthe exercises you're doing. You see, lots of us will continue to do rep\nafter rep of pushup and as we get better that number will grow 20, 30, 40, 50. But it's not the same as, let's say, adding\nweight to a bench press. Here you're working more muscle endurance. There's no real control on that top level\nrep range that you can get to, unless you increase the difficulty level of the exercise\nitself. We can do that by adding another element of\nspeed. When we do that we become a lot more explosive\nin the process. You have a version of a pushup that you can\ndo that has a lot of explosivity in it and also an added benefit of training your core,\ntoo. We have it right here with just sitting up\nagainst a wall. So normally we have our pushups, okay? And we can do that here as I fix my mic. We can do that just by exploding off the ground\nwith plyo-pushup that way. But we can make it a lot more explosive by\ndemanding a pause in the middle. So we come up against a wall, we come down,\nup, and we stick it into the wall, okay? Obviously, core is working. Stick. Stick. Stick. However long you hold it is a longer challenge\nfor your core. You can even come up and do it with one arm. Right there. Right there. You can see – how many did I get of those? 10? Eight? It's not the same as being able to do 60 or\n70 pushups. I've increased the difficulty level tremendously,\nbut that is what will give you more results. That will help you to build bigger, bigger\nmuscles because you're providing the overload. Guys, if you're looking for step by step program\nthat will challenge you in all ways – I know how to challenge you – no matter what\nlevel of difficulty you're at; head to ATHLEANX.com and get our ATHLEAN0 program. I show you how to train with really nothing\nat all. Maybe just a wall, but that's it. That's over at ATHLEANX.com in our ATHLEAN0\nprogram. In the meantime, if you can't wait to try\nthese out and give it a shot, make sure you let me know how you do below and whatever\nelse you want to see me cover on one of my Bodyweight Wednesday videos. Let me know that below, too. All right, guys. I'll be back here again soon. See you."
}