{
    "id": "AADG66TfLfI",
    "title": "11 EXERCISES FOR FASTER MUSCLE GROWTH!",
    "description": "If you want to experience faster muscle growth then you need to find some way to include the 11 exercises in this video into your ...",
    "transcript": "What's up, guys? Jeff Cavaliere. Athleanx.com. \nToday, we're going to cover 11 exercises that   allow you to tap into one of the most overlooked \nand underutilized muscle functions to get better   results. It's called the stretch reflex. \nSo today we're going to go through that oh,   why are you back here again? Oh dude, stretch \nreflex. I'm What are you doing? I'm stretching.   It's not that kind of stretching. It's not? No. \nOh, this is going to make my intro really awkward.   Feel good now? 11 exercises, guys, handpicked \nbecause they provide you with the best opportunity   to tap into that stretch reflex, which creates \na greater potential for muscle recruitment and   an overall better gain. So with that being said, \nguys, we're going to cover every single muscle   group in the body here one-by-one. Let's start \nbreaking them down. So now the stretch reflex is   actually something we all have. It's just that \nwe're not really tapping into it if you don't   know how to. You see, to protect the mechanism \nthat our muscles have, that allows us to get a   better strength of contraction when the muscle \nis momentarily stretched to its limits. And we   can do it by actually doing it purposefully, \nright, building it into the exercises that we   do. So one of the best ways to do this if we're \ntalking about our triceps is to do something like   the lying triceps extension. Now there's a reason \nwhy this works better than anything else because   it takes the tricep muscle through a full stretch. \nSee, if you just did this, this is the tricep push   down. You can see that while I'm getting a stretch \nbecause the elbow is flexing as much as I can, I'm   actually not getting a full stretch of the tricep \nbecause the long head requires that my arm be up   and over my head like this. It's not happening \nhere. So, the right one is this, the lying triceps   extension. Because here I not only get the elbow \nto be bent as much as I can, but I get the elbow   up and over my head that recruits that long head \narm stretch. So here's what we're going to do,   you're going to take this exercise and do it one \nof two ways. Either you do it just like this,   which means you get down to the bottom here, go \ninto a full stretch, and then turn that around as   quick as possible. Get into the stretch and out of \nthe stretch to elicit that stretch reflex. If you   want to do this in a more advanced level then you \nwould do this. You take your rep all the way down,   you come up one quarter, hold for a brief \nsecond, and then allow sort of a drop into   that stretch reflex and come out of it. It becomes \na little bit more ballistic at that point. Again,   more for the advanced people who have actually \nhad experience with the stretch reflex,   but the fact is you could do it either way. If \nyou want to get the triceps to have a stronger   strength in contraction and greater overall gains, \nthen this is what you do. Now when it comes to   the biceps, the exercise of choice here is the \nincline bicep curl. Why? Because it gives you   that opportunity to put the biceps in a stretch \nposition. Anything done standing is going to start   with your arms out in front of your body, or at \nbest, at the side of your body. But if we can   get our arms back naturally behind our body, then \nwe've already started to tap into that stretch,   but how we do the exercise matters. See, because \nif you do your incline curls like this, you're   actually never even allowing the bicep to get into \na stretch position at all. And a lot of people do   this, they cut short the bottom range in motion. \nSo to do this the right way, what you do is you   make sure the arms are sinking all the way back at \nthe bottom. And again, you want to make sure that   you get out of this position to apply that stretch \nof the biceps. We could do something extra here,   which is another way to utilize the stretch \nreflex, and that is to contract the antagonistic   muscle, in this case the triceps. We know that if \nwe can contract the triceps we have to momentarily   relax the biceps to allow for a greater stretch. \nThat momentary contraction of the triceps gives   you that relaxation in the biceps, that triggers \na stretch reflex, which allows for that greater   strength in contraction out of the bottom. In \nthe advanced version we'll do the same thing.   You come down to the bottom, up a quarter, hold it \nfor a brief second, drop down into that position,   get that tricep contraction, and bounce right back \nout of it again. Either way, it doesn't matter   which one you do or where you're starting from, \nthey're both going to work to get those biceps   contracting harder. So now when it comes to the \nback, I actually got three exercise options here   for you. Because you want to stretch the back \nout you got to make sure that you get your arms   up out in front of your body. And there's no \neasier place to start than right here on a lap   pull down. But you're not going to do this. \nYou're not going to do the overhand lap pull   down. Now there's nothing wrong with this. I've \ndone this exercise a million times and love it,   but when you're trying to tap into the stretch \nreflex, then you've got to switch your hands to   this position. Why? It's not just about the hands, \nit's what happens to your arms when you do that.   Your arms come out in front of your body. And we \nknow that since the lats attach to the upper arm,   going from a position of here to here creates a \nbigger stretch on the lats without even doing any   of the reps in the exercise. So when we do this, \nnow we come down, and we can do them in the same   way. We either can do them the standard way of \ngoing into that stretch position at the top and   trying to quickly reverse the direction back down \nagain. Remember, get that momentary stretch, take   advantage of that built in function of our body, \nand get back down into a stronger contraction on   that lat pull down. If, however, we want to go in \nand do this with a little bit more advanced way,   we can just make sure that we get it up there \nagain. Remember, pull down just a little bit,   hold for a second, let it fall up to the top, \nand pull down again. Now we can do this to other   exercises. One of the ways I like to do it is with \nthe seated row. And maybe you might have noticed   when Jesse did the exercise the handles weren't \nat the level of his midsection or at his chest,   they're actually much lower, why? Because if \nwe allow ourselves to get our hands down low,   out in front of us, because we're leaning \nforward it's actually creating a relative   elevation of our arm, more stretch on the lats. As \nyou see here now, with me being in this position,   I can get that stretch and I can take advantage \nof the stretch reflex by being a little bit   aggressive as I get towards the end of that \nrepetition. Remember, allow the stretch to take   me through that full stretch and come back into \na stronger, more powerful contraction. The second   version of this would once again be get the hands \nup, hold for a brief second, allow it to drop, and   then come back into a more powerful contraction. \nThe last exercise is one that I actually credit   to my friend and colleague John Meadows, and it's \nthe Meadows Row. But instead of doing it this way,   if you want to take advantage of a greater stretch \nreflex, then what you have to do is just apply the   slight rollout to it. So this exercise you can \nsee is a great way in a closed chain environment   to train your back. But as I get the bar down \nto the ground, I simply roll it out to again,   allow myself to get a greater stretch and \nquickly roll it back and right up into the   rep. More powerful contraction, more muscle fiber \nrecruitment, better muscle gains in the long run.   So now when it comes to the chest, maybe you're \nthinking, I know Jeff's not going to go to the   chest fly. Well, sort of. I mean I'm not going \nto do an unsupported dumbbell bench fly because   I know the vulnerability of the shoulder in that \nposition and we wouldn't want to play around with   the stretch reflex of that exercise. In fact, we \ndon't even do the exercise. However, you could do   the standing version here, which is the 3D cable \ncrossover. We had the opportunity to do just the   traditional way here where we get that stretch and \nthen explosively come out of it, or we can take   it up that quarter of a way, drop it back down a \nlittle bit more ballistically again, under control   always, come up back up to the top with another \nstrong contraction. But we don't have to stop   there. We can apply this to a bench press also \nand in the form of a dumbbell bench press we have   a couple things we want to make sure that we do \nto make this even more effective. The first thing   is utilize what I've covered before as the chest \nmaster tip. Whenever you're training your chest,   you want to make sure that you take your traps and \nyou depress them. Because when you depress your   traps, not only is it setting your shoulder blades \nback and down, but it's taking your shoulders from   a position of dominance from here and it's getting \nthem out of the way so that the chest can do more   of the work. But I've also given myself a greater \nstretch on the chest, touching the outside of your   pecs with those dumbbells and driving at every \nrepetition more forcefully. Of course you've got   the opportunity to do that extra quarter rep if \nyou so choose, to get that more ballistic extra   push to make that repetition even that much more \nexplosive. So you might be wondering, Well, Jeff,   what about a dip? A dip is a great exercise for \nthe chest that actually does place a good stretch   on the pecs, especially those lower pec fibers. \nHowever, I wouldn't use it as a choice here   because you're already in a vulnerable position at \nthe bottom of a dip. So going into a bottom of a   dip more aggressively is just taking an already \nvulnerable shoulder anterior capsule and placing   more stress on it. So a good exercise that does \nplace a stretch on the chest, but not for this   particular use. So when it comes to the shoulders, \nif you want to create more width and size,   the middle delt is where you should probably \nfocus your efforts. However, the side lateral   raise, as you can see here, has its limitations, \nas far as the stretch reflex recruitment goes,   because you never really get there. You see, \nif you want to stretch your middle delt out,   you're going to have to bring your arm across your \nbody. And the only way to do this is to utilize   either cables or to change the way you do the \nexercise and the position of your body when   you do it. And we could do this here with this \ninclined side lateral raise. You could see as I   lay myself on the bench in this way, I don't get \nstopped by my own leg in the lateral raise. I can   go across my body, further out in front, and get \nthat stretch that we're looking for. And again,   we can do this in that one and a quarter way, \ntake it up just a little bit and then drop it   and more forcefully come out of the bottom here. \nThe choice is up to you, it depends on your level   of experience, but this is the way to do it if \nyou're looking to take advantage of this and   apply it to your shoulder training. So now when it \ncomes to the legs, we can apply the stretch reflex   here as well. Think about it, a squat gives us a \ngreat opportunity to do this. However, you might   be thinking, Oh, we're hitting our quads, right? \nNo, the stretch reflex when applied to a squat, is   actually placing it on the glutes. Because if you \nthink about what happens at the bottom of a squat   you'd realize there's not enough stretch on the \nquads to actually take advantage of the reflex.   You see, if you get to the bottom of a squat, \nand you were to simply lay yourself on your side,   you'll see that this is not placing the quads on \nany type of significant stretch. Even though your   knee is bent, it's not bent enough, and of course \nto get a greater stretch in your quads knowing   that the rectus crosses the hip as well you'd \nhave to get your leg behind your body. So this   isn't going to cut it there. But we do know that \nbecause we're in deep hip flection at the bottom   of a squat, we're going to have a great stretch \non the glutes. We're going to get a stronger   thrust out of the bottom of the squat, the hardest \nplace to perform the lift. Now that being said,   that doesn't devalue the pause squat. As a matter \nof fact, the pause squat is done for a different   reason. Remember, there's different aspects to \nyour training. This is not the only thing you   should be pursuing, the stretch reflex. Because \nof the bottom of the paused squat you're learning   to take the stretch reflex out of the equation so \nyou can get more strength and just overall ability   to overcome the inertia of being at the bottom \nof the lift so that when you go back and add the   stretch reflex to it, now you get the benefits \nof both of them. And finally, here we can hit   the hamstrings with an exercise like the single \nleg RDL or we could hit the glutes. You see, how   you do this exercise will actually change whether \nor not you're going to shift the focus from the   hamstrings to the glutes. A lot of people would \ndo this exercise like this. And this might be   good if you're trying to create a stretch on the \nhamstrings. You see, because as you lean forward,   you're not getting any real loading of the hip \nbecause you're not allowing yourself to go into   hip flection at all. You're just simply bending \nforward at the waist which creates that stretch   on the hamstrings. This is the best way to perform \nthe exercise if you're looking to get the stretch   reflex on the hamstrings. But if we wanted to \nshift the focus to the glutes, if you sit back,   you see you create the hip flection by hinging at \nthe hips. And when you do hinge, that will load   the glutes up, preferentially recruiting them over \nthe hamstrings because the focus isn't so much   on keeping a straight knee as it is on maximizing \nyour hinge. Again, whichever you choose here guys,   the way you do it's going to be the same, and the \nidea is recruiting more muscle fibers to the task   at hand by taking advantage of a reflex you're \nprobably overlooking right now. So there you have   it, guys, 11 exercises primed to help you \nget better gains, start to implement them,   and use them yourself to see better gains. In \nthe meantime, if you're looking for a program   that builds in all these exercises at the \nright time to get you the right results,   they're all in our Athleanx programs over at \nAthealnx.com. If you haven't already done so,   guys, make sure you click subscribe and turn \non your notifications so you never miss a new   video when we put one out. Maybe even a better \nintro from Jesse. All right, see you soon."
}