{
    "id": "AAjlNtI1NiI",
    "title": "Dumbbell Chest Workout (INCOMPLETE WITHOUT THIS!)",
    "description": "Build a ripped, athletic chest doing the best exercises the right way http://athleanx.com/x/build-a-ripped-athletic-chest The typical ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.COM. So, you want to know what one of the most\neffective chest exercises is? You've probably just got to look to your last\nback workout and you'll find it. You see, the Dumbbell Pull Over, the Lat Pull\nOver it's been called, is actually one of the most effective chest exercises you can\ndo. And it will be if you stop forgetting about\nit, Number 1. And Number 2, you start making a few of the\nmost important tweaks. And I'm going to show you right here, right\nnow to make it really really good for building your chest. Here I am demonstrating this movement, guys. Again, it should look familiar to you if you\nhaven't already abandoned it. You're just taking the dumbbell from this\nover the chest position, your hands up grasping the dumbbell, 2 hands on 1 end, and you lower\nit down. Now the first thing I want you to notice is,\nI'm not lowering the dumbbell all the way down past my head. It's not necessary here where it might be\nused as an added stretch for your lats in the original version of the exercise as a\nlat exercise. Here we don't need to do that and especially\nif you don't have the mobility present in your shoulders to accept that, it's going\nto become a lot safer of an exercise. So we're not going to need to take it down\nthat far for our chest. We're only going to have to take it down to\nabout the level of our head. So that's the first thing you want to do. The second thing, as I re-initiate the movement\nback up, this is where everything matters here. It's how you contract and how you initiate\nthe contraction back to the top that makes all the difference in the world. Instead of initiating with your lats, as I'm\ndemonstrating here, instead of taking your lats and making them be the Straight Arm Pull\nOver or the Straight Arm Push Down type contraction\nthat we've talked about before, you're not going to do that. What you want to do is, you want to add an\nextra squeeze of your hands on the dumbbell in towards each other even though they won't\nmove any further, and then down. In and down. In and down. It would almost look like you're doing this\nif your hands were free but they're not. So the hands are going to be connected here\nat the dumbbell. They'll be pushing in as you pull down in\nfront of you. You're almost doing a little bit of internal\nrotation as you come down, ok. Now, what happens there is, you're actually\nnow engaging the chest because all we're doing is mirroring what would be a Standing Press\nif we stood up. See, we get confused because we're laying\non our back and we have our hands up over our head, and we don't realize that we're actually in\nthe same exact position as we would be if we were standing out here with our arms out in front of us at the end of a pressing\nmovement and our arms horizontally abducted as we would be at the end of a crossover movement. So, it's the same movement except we're in\na different frame of reference laying on our back. So, to make this exercise really, really effective,\nyou want to always concentrate on just getting it from that head level. And then when you initiate, you're squeezing\nyour hands in towards each other. Get it up to here and all you have to do is\nbring it out to about the level of your chest. Go back down again. Here, and come back up to the top. You'll see me here as I demonstrate a few\nmore reps exactly doing that. I'm squeezing there. I'm initiating there. It's all in the finer points. It's how you feel the contraction that matters. Remember, guys, it's not just about moving\nfrom point A to point B. You're in control if you allow yourself to be when you're in\nthe weight room. It's what you get out of your workouts that\nwill be determined by how you go from point A to point B, not just getting there. Guys, if you found this video helpful, make\nsure you leave a comment and a thumb's up below. If you're looking for a way to start building\na ripped, athletic body, like an athlete by training with a little bit more sophistication,\nnot just working out. I say it all the time. Working out is for the casual lifter. Training is for the guy that serious about\nwhat's he's doing. If you're looking to train like an athlete,\nthen head to ATHLEANX.COM and get our ATHLEANX Training Program. In the meantime, leave your comments. Let me know whatever else it is that you want\nto see. I'll make some videos to make sure I can help\nyou in the weeks ahead. Alright, guys, I'll be back here again real\nsoon."
}