{
    "id": "AB5yJWn-Yik",
    "title": "How LOW Should You Squat (IT MATTERS!)",
    "description": "The depth of your squat is one of the most important aspects of your leg training that you can get right. Not doing so will have you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So how deep should you squat? Well, if you\nlook like Jesse here when he’s squatting, I’m going to say, “Not that deep.” The\nreason being, that evident butt wink he’s got going on there. “Butt wink”, for those of you that aren’t\nfamiliar with it, is when your lumbar spine goes into this position of extension, or neutral,\ninto this rapid flexion, right back out of it when the squat gets to a point where it’s\ntoo deep. When I say, “too deep”, I mean too deep\nfor Jesse. And when I say, “too deep for Jesse”, I mean too deep for Jesse right\nnow. We should all be striving to get as low as we possibly can. As a matter of fact, if I’m going to get\noff this ground at some point, from this position, I need it to be deep, and need to know, and\nhave the strength to be able to get out of here. So, the most functional position of squatting\nis one that will take us a low as possible. But only if your body is ready for it. So,\nI’ve put together a checklist for you to determine what might be causing your body\nto do what Jesse did, because he’s certainly not alone. We all know that. And how you can attack these\nthings one by one. So, ultimately, when you fix your cause – what’s causing you to\ndo this – you’re going to be able to squat safely, ass to grass, and go as deep as you\ncan. So, we’re going to knock these out one by\none. It starts here with Jesse being down. There’s a reason he’s here, by the way.\nNot just to showcase the bad squat. It’s to showcase that we have some things that\ncould be causing the problems here. One is the hip capsule mobility issue. Meaning,\nthe tightness in the hip capsule itself which is causing a limitation in your range of motion\nat the hip. The second thing is an anatomical restriction of the hip. That, again, will be restricting your range\nof motion, and we’re going to have to be able to determine the difference between the\ntwo. But both of them are going to limit your ability to get low. The third thing is a pelvic\nmuscle tightness. Namely, in the hamstrings, or the adductor\nmuscles. Then we have ankle mobility and flexibility issues and pelvic stability issues. All of\nthese, or any combination of them, or one in particular could be causing you to be losing\nthe control of that spine at the bottom of the squat. The first three, ironically, are supposedly\n– you’re able to screen these out with the use of this convenient test that Jesse\nwill show here. You’ve probably heard it before. People say “Look, if you can get into this\nposition here, and sit back to a point where you’re low enough in your squat where your\nhips are past your knees. Below your knees as they would be in a fully performed and\nexecuted squat. If you can still maintain an anterior tilt\nhere – meaning, you still have the ability to get into a curvature here, not that you\nhave to maintain that throughout a squat – but if you can still maintain some curvature here;\nthere’s no way you have a capsular mobility issue, or anatomical restriction, or pelvic\nmuscle tightness. They use this test as the example. I’ll\ntell you right here, this test is absolute garbage. Garbage. Why? Because it’s not\ncomplete. Here’s why. If I were to take out this goniometer here – we measure angles\no f the body with this thing. If I were to go in here and measure the angle\nof Jesse’s torso, while it looks like he’s below his hips, it’s actually deceiving.\nIf I come in here and angle this to his torso here we have about 95 degrees on torso. 95\ndegrees. If he were to sit back – for you guys that\ncan creatively look at this – if we were to tilt him back up this way, he’d actually\nbe falling backward. Jesse, go ahead and sit up into a squat now. If he were to go back\nwhere he just was, he’s going down. Instead, what we need to do is measure where\nJesse is in his squat. At the bottom of the squat. Go ahead and get up. If we measure\nat the bottom of the squat here, now he has more of an angle of about 131 degrees. So,\n131 degrees of flexion here to get down. Now, the normal range of motion for a hip\nis around 120-125. If I have to get him back in that position and recreate that he can’t\nstay up here like this. What he has to do is, he gets into his anterior pelvic tilt,\nhe’s in that deeper position of the squat, and now he’s got to bring his chest and\neverything else down toward the ground. Now, he’s lost all this. It’s all gone.\nHe doesn’t have the ability to do that anymore. So, we can’t rule out those other issues.\nHe could be having – now that we’ve actually gotten into the true degree of flexion that\nhe’s going to be in for his squat – we could be dealing with a hip capsule mobility\nissue. We could be dealing with an anatomical restriction.\nWe could be dealing with pelvic muscle tightness. Here’s the thing, if you try this test,\nyou’re able to get down here and you still – I can’t demonstrate on Jesse – but\nyou’re still able to keep that anterior tilt; you can skip ahead in this video and\ngo down to four and five. Start looking at your ankles or your pelvic\nstability and we’ll time stamp those areas for you. For those of you who have lost your\nability to stay in an anterior tilt at this point, you need to stick with me now and go\nthrough them one by one. So, the first thing now, if we’re going\nto look at that capsular mobility of your hip is, you’ve got to lay on the ground.\nYou don’t need someone like me to do this for you. You can do it yourself. But what\nyou want to do is see how easy it is for your hip to get up into flexion here. Normally, we’re looking for at leas 120\ndegrees. 90 would be there, but we’re looking for about 120 degrees of flexion. What you’ll\nfind is people that either have degenerative hips, or capsular tightness overall, and they\nstart to lose the ability to get flexion here. They certainly start to get a hard end-feel. Meaning, it hits here, and it won’t go.\nIt’s like hitting a wall. Here, Jesse’s got that bouncy end-feel. So that’s another\nthing to look for. Once we get here, let’s say we have an anatomical restriction going\non. We’re not going to be able to instantly\ndetermine whether or not it’s anatomical – meaning the bones are hitting the bones\n– or it’s more of this tightness in the capsule. What we’ll do is, if he hits a\nwall here, if I turn his leg out a little bit toward you guys, and I’m able to go\na little further; then we’ll probably think we’re dealing with more of an anatomical\nrestriction. Which will happen if you test it a little\nbit further on here. But right now, if he can get up here, the next thing I would do\nis test his internal rotation. I’m just going to turn his knee in. So, the foot comes\nout toward you guys, the knee goes in, and I’m looking for about 30 to 35 degrees here\nfrom here. So, if I go here, and I’ve got that, I can\ntell you right now, anyone with real capsular restriction is going to have a difficult time\ninternally rotating. They’re going to have a difficult time getting into flexion. If\nyou are good there, you can move onto the next step here, where we’ll go after that\nrestriction of the bone on bone and see if that’s what’s going on with you. So, we’re moving on now and looking for\na way to figure out whether we’re dealing with more of a muscle tightness here, or if\nwe’re dealing with more of the acts of bone on bone. Anatomical limitations. You can see\nwhat happens here. Why would this even matter, first of all? Well, let’s say we’re taking\nthis hip here and going deeper into flexion. Going deeper into the squat, deeper into the\nsquat. What happens is, at a certain point here, the femur doesn’t have anymore room.\nIt can’t continue to rotate. It winds up hooking onto the pelvis here. In order for\nit to keep going it’s going to grab the pelvis with it and turn it under. You see that posterior tilt is happening because,\nin order for the femur to keep going – because you’re driving down into the squat – it’s\ngoing to have to grab the pelvis and move with it. So, you get that pelvic tilt. You\nget that butt wink. That’s one issue. So, we want to make sure we determine whether\nor not that’s happening. What we could do is, as I’ve said before,\nif it is this, then you can test it yourself. You can turn your hip out a little bit more.\nIn other words, drive your knees out a little bit more into external rotation. If you do\nthat, you should be able to clear a lot more room. Anatomically, the way these bones setup\n– just like in the shoulder, too. When external rotation clears more room, you’ll\nget more flexion out of it by having your knees out. So, there is a fix for that, even\nif you anatomically think you’re screwed. You can change that a little bit by changing\nthe position of your knees as you squat down. So now, the other thing to consider before\nwe get into it – because I’m going to show you how to differentiate between the\ntwo with one, single test – you also have these muscles that run back here. Hamstrings\nthat run from the base of the pelvis here, and cross the knee, and we also have the adductor\nmuscles that are attaching to the other side – the front side – of the pelvis, that\nare attaching to the femur. So, when we move this down, and we keep this\nback – when the pelvis is back – you’re getting more of a stretch. You’ll be able\nto feel that. That restriction from these muscles that could be holding you back because\nthey’re too tight. The same thing with the hamstring. Don’t let people tell you that “You’re\nletting some of the tension go because you have a flexion of the knee there, and that’s\nletting some of the stress off the hamstrings.” Yeah, fine. But the hamstrings are a long\nmuscle that attach all the way to the back of the pelvis here, and that’s going back\neven further as you go down to squat. Especially if you’re talking about going ass to grass. There are going to be length inhibitions here\nthat are causing you to still feel to much tightness here that will restrict your pelvis.\nAnd if it’s going to keep going, it’s going to pull it under with it because it’s\nattached. The hamstrings are attached right back there via the hamstring attachment to\nthe pelvis. So, let’s figure out one simple test which\none you’re dealing with. You’ve got to differentiate between the two of these. Now,\nlet’s differentiate between those two. What we do is get up onto a box here. The box just\nneeds to be high enough to take your ass a little bit below your knee, into proper depth\non the squat. We have that here because of the foot position and the elevation. Now, as Jesse sets up here – put the squat\nbar on your back. All right, great. We should already instantly determine that this is not\nthe right position. The same way it wasn’t the right position when he was on the floor\non all fours because he’s not squatting from there. He can’t squat that upright.\nHe doesn’t have the proper angle here between his torso and his leg. So, he has to angle more forward, which he\nwould in his real squat, in that 131 degrees. In order to get there, all of a sudden, he\nstarts to lose this ability here. Now, he’s going to feel it, and you’re going to feel\nit one of two places. The first thing could be, you’re going to feel it right in here.\nDo you feel that? JESSE: That’s where I feel it. JEFF: He feels it right in the front here.\nLike it’s jamming in the front here. Now you’re dealing with something anatomical.\nBut it doesn’t mean you also don’t have the muscular component because here’s what\nwould happen. If I were to fix it and tell him “Jesse,\nif it is anatomical here we can create some extra space by letting the leg drift out a\nlittle bit more, driving your knees out a little bit so you get more external rotation.”\nWhich allows him to get a little bit more mobility here. It frees that up, but now where\ndo you feel it? JESSE: On the inside. JEFF: Inside. So now he’s feeling the adductor\nissues. The adductor and underneath the hamstring. So that could happen to you. You could feel\nthat, when you make that change, you’ve freed it up in one place, but I’ll tell\nyou what happens. If you’re going to take your knees and move them out, and the adductors\nconnect to this femur here, and you move it out further; you’ve just increased the flexibility\ndemands you have on those muscles. So now you’re going to have to address both\nthe fact that you want to change your squat pattern a bit by driving your knees out, but\nthen understand that the demands on the adductors are going to be even higher. So now you need\nto make sure you’re stretching them out. We’ve gotten through all those. Again, for\nthose that were already skipping past this; good for you. You’ve eliminated two other\noptions. But for these guys who have already gone through\nhere, it doesn’t mean, unfortunately, that you may not have other contributions from\nthose final two places either. Whether it be pelvic stability, or ankle issues. So,\nyou’ve got to watch those, too. We’re moving onto those right now. Now we’re down\non the ground here. We’ve got to look at the ankle mobility. This is Jesse’s leg. JESSE: Hey, guys. JEFF: Jesse. It’s an unmistakable leg, believe\nme. For many reasons. The fact is, we’ve got to make sure that his ankle mobility is\nenough to allow him to go down. Why? Because if the ankle, if you’re going down into\na squat you need to have your ankles to continue to give you something call dorsiflexion. Meaning,\nas your knee goes down – go ahead, Jesse. Down. It needs to be able to give and create the\nopportunity for your pelvis to come down. If you hit a wall here – go back – and\nyou can’t go forward anymore, but he’s got to continue to get down; what happens?\nThe pelvis is going to drop and go with it because you can’t get any more forward with\nthe ankle. So, he’s got to have the pelvis come with it. That would be another cause\nof butt wink. What we’re looking for here is a simple,\nsimple test to determine whether or not he’s got enough ankle dorsiflexion. All you’ve\ngot to do is setup a few inches away from a wall, or a box, and what you do is just\ntry to lean forward, keeping your heel on the ground here, and see if you can touch\nthat knee to the wall, or to the box. Jesse can’t and there’s a reason for that. If I were to take out the goniometer and I\nwould measure what I’ve got here. From 90 degrees I’ve got about 23 degrees forward.\nYou’re looking for about 20 degrees of dorsiflexion to be able to do that. If you get in this\nposition here and you can’t get there – go ahead, Jesse. Back a little bit more. Let’s\nsay you restricted in there. The question you want to ask yourself at that\npoint is “Where are you feeling the restriction?” Are you feeling it right here, in front? Where\nyou’re feeling a pinch again? Or are you feeling it back here in the Achilles? If you’re\nfeeling it more on the backside you’re probably dealing with a calf muscle tightness. If you’re feeling it more in the front side\nyou’re probably dealing with a subtalar mobility issue, where you’ll want to work\non more ankle mobility drills. I have a couple that we’ve done on this channel that we’ll\nlink for you. One that was right here, actually. It was a very, very helpful one for that specific\nissue. But in the meantime, which one are you dealing with? Determine that and that will give you your\nplan of action. But we’re still not done. We have one more where we’re on our feet,\nin the squat, and our bodies betray us because we lack pelvic stability. We’ve got to check\nthat out now. So finally, what we’ve got to do is look for that pelvic stability because\nthat’s a very, very important thing. What you can do right off the bat is, you\ncan potentially be setting up improperly. Meaning, in too much anterior tilt. What would\nhappen here is – Jesse, get into an anterior tilt. If you set yourself up this way when\nyou squat, then when you come down – come down slow – there’s that wink. There’s\na reason why he’s winking badly at that point. If he already gets himself into that anterior\ntilt he’s already putting himself in hip flexion. He’s putting himself in about 15\ndegrees of hip flexion. Meaning, all the reasons we talked about before with the capsular mobility,\nthe anatomical restrictions, and whatever else could be going on; it’s going to be\nexaggerated because he’s already taking away some of the hip flexion. So, what you want to do instead is, you get\nup at that top, and you’re going to put yourself, not so much in an exaggerated anterior\ntilt there. But get yourself tucked under a little more by squeezing your glutes. The\nthing that squeezing your glutes does is – it actually does two things. Number one: it gives\nyou more stability here. It puts your pelvis in a little bit better\nalignment underneath your spine to support it. But it can also correct any hip alignment\nissues. Meaning, hips open to the left, or hips open to the right. I did a video on that\nas well. What we do is, let’s say we get to the bottom of the squat. What happens is,\nJesse – boom. He winks. What you want to do is – I think, a lot\nof times, in the most difficult position of the squat, the low portion of the squat, that’s\nwhen we tend to lose our stability of the hips. So, what we can do is focus on trying\nto improve that. You put something at that level that gets you right to the point where\nyour butt winks. For Jesse we had to put it on top of a mat to get it a little bit higher. Now, if he’s in this position – what you\nwant to do as well – you want to fix your position. So, if you’re in a wink you’re\ngoing to get yourself back into a more neutral position, or even more anterior. So, you can\nactually work to overcorrect here. Get yourself into this anterior position here. Now, his goal is to try and lift himself an\ninch or two off that ball – good – without losing his ability to stay there. So, a little\nbit of a wink there. Go ahead and just slide – right there. Perfect. See, now he’s\ngot the ability to do that. Why? Because he’s got focused stability there. He’s focusing\nall his attention on that pelvis and making sure the pelvis doesn’t move. We need that because when the legs are moving\nthey need to be able to push off a stable pelvis. For the same reason it works in reverse.\nIf you’re going to jump you want to be able to jump off something solid, not off sand\nbecause we need stability from below. The legs need stability from the pelvis in order\nto be able to provide the best strength and function. So, if he’s here, he can now grab a kettle\nbell to overload his ability here and challenge his ability to be able to stay right there.\nJust like that. Now you can do a couple squats. As many squats from that position. Up and\ndown, just a little bit. From here, up a little bit. Go up, like, 5 inches. There, and down.\nRight there. And up. And down. And up. You see that? You’re really working on maintaining\nthat pelvic control. So, if you have an issue there, you’re going to want to make sure\nyou address it because pelvic control issues will totally cause you to give out at the\nbottom of a squat and bottom out. And then you cause that dreaded butt wink. So, there\nyou have it, guys. Hopefully you’ve found the video helpful.\nObviously, I could not have done it without the help of my skeleton – I mean, my skeleton\nand Jesse. Guys, the fact is, squatting ass to grass is a fundamental requirement of our\nbodies. However, your body had better be prepared to do it. Hopefully if you take a few minutes to go\nthrough this step by step instructional here you’ll see whether or not your body is prepared\nto do this. The good news is, if you uncover a reason for why your body is giving out at\nthe bottom of your squat you’ll realize that there’s pretty much a fix for any of\nit. You just have to dedicate a little bit of\nextra time to make sure you’re fixing your body to be better prepared to handle the loads\nyou’re going to in the squat itself. If you guys found this video helpful make sure\nand leave your comments and thumbs up below. If you like these comprehensive videos where\nwe break out all the tools we’ve got here, make sure you leave your comments and let\nme know what else you want me to cover. I’ll be happy to do that for you. You guys know,\nthis channel is always about putting real science behind the strength. Not just breaking\nout problematic studies, but what really works in practice. We’ll continue to do that for you here.\nIn the meantime, guys, leave your comments and thumbs up, subscribe, and we’ll be back\nhere again in just a few days with another video. See ya. JESSE: Are you calling me a tool?! JEFF: Absolutely."
}