{
    "id": "aBgv30fkD7c",
    "title": "Weightlifting Belts | Weak Abs (UH-OH!!)",
    "description": "Build your own natural “weight belt” and get ripped - http://athleanx.com/x/built-belt If you rely too heavily on using a weightlifting ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. It's Washboard Wednesday and we're talking\nweight belts. I'm talking about how this weight belt might\nbe making your weight belt weaker. You see, you actually have a weight belt that\nnever cost you a penny, and you carry it around with you all the time. It's your transverse abdominus. But by relying on this far too often you're\nactually going to weaken that and have it cost you at the moment that it matters the\nmost. On your big lifts. Let me reach for this one. You see, the transverse abdominus is a muscle\nthat lays right here under the rib cage and it wraps all the way around our body. Through the magic of the muscle marker we\ncan actually see what it looks like. It actually comes right here, all the way\naround, and as you can see the orientation of the fibers is such that it lays just like\na weight belt would. It actually functions the same way. It doesn't move our body down this way. What it does is, it actually takes our body\nand it cinches it in. so it does this. It does the same thing that a weight belt\nwould do as you pull it tighter. It's going to pulls ourselves and our abdomen\nin tighter, which will provide the circular stability of the spine and core. So if we're going to train that muscle, you\nwant to learn how to actually contract it so that it actually flattens the belly down. Okay, so what it does is it takes this belly\ndown from being out here and it learns to flatten it down, provide stability then, again,\nit wraps all the way around. I teach you how to do this through a lot of\nour lower ab exercises. As a matter of fact, most of our ab exercises\nin this video that I cover over here – you're going to want to watch that and see how we\ndo that specifically. But the importance of this video is to get\nyou understanding the fact that the more of this that you use, the more you're actually\ngoing to be completely counteracting what you're trying to accomplish in the first place. That is stability. If you wear a weight belt, the first thing\nthat happens is – if you wear it appropriately you're actually going to have a little bit\nof extra room in here. You never want to pull it all the way tighten\nlike this because you actually don’t give yourself any room to push out against with\nthis intra-abdominal pressure. So you have it a little bit loose so you can\nnow push into it and then have that pressure against the pad, which is pushing back in\nthe opposite direction. Just giving you that extra torque in spinal\nstability. If you do that, think about what you're actually\ndoing. You're actually training yourself with a distended\nbelly. You're training yourself this way. You push out as you stabilize. When, in actuality, the healthier, more protected\nspine has the ability to bear down and still have that intra-abdominal pressure, but with\na flatter belly because you have the contractions of the transverse abdominus. So that's one reason why you wouldn’t want\nto rely on the weight belt. The second one is, over use of this is just\ngoing to make inactivity of the transverse abdominus result in a weaker transverse abdominus\nso you can't rely on it when you really need it. So I'm advising you to ditch the weight belt. Here's the instances where I would say it's\nokay. If you are somebody with a history of back\npain, whether you had surgeries, lumbar fusion, discectomy, significant back injuries that\nhave laid you up for a significant period of time; then I would say it's okay to use\nthis as you get yourself back into training from that injury, but only if you agree that\nyou're going to train your core directly and increase the strength of your transverse abdominus\nlike I showed you in that video that I linked over there, with the focus of building that\nup over time. So you can wean yourself off of this. Use this as a crutch to get you back in the\ngame again. On the other end of the spectrum, if you're\na competitive power lifter there's a power lifting belt that we, again, covered on the\nInstagram profile that will allows you to generate even just a little bit more force\nin your lift, that will increase your lift total by even a small amount. That could mean the difference between first\nplace and third place, or setting a new PR. In those cases you can train there, but not\na lot of the guys that are watching this channel are competitively power lifting at that degree. A lot of them are watching to either get bigger,\nstronger, faster, and more athletic. And again, athletic, you're not allowed to\ntake these out with you on the playing field, or at least not comfortably. So we don’t want to train you to become\nreliant on this. I want to train you like an athlete to rely\non the one that you have with you all the time. So guys, I hope you've found this video helpful. Hopefully for those that are over reliant\non their weight belts it will be a wakeup call. In the meantime, if you're looking for a program\nthat will train you like an athlete and make you rely on the muscles that you have so that\nyou become more functionally strong and capable of performing at a moment's notice because\nyou have everything that you have with you all the time and you're prepared to use it;\nthat's over at ATHLEANX.com with our ATHLEANX training system. If you want to see anything else covered here\nin a washboard Wednesday video make sure you leave it in the comments below and I'll do\nmy best to bring those to you in the weeks ahead. All right, guys. I'll see you again real soon."
}