{
    "id": "AD6YTTb5WQY",
    "title": "How to Fix a Stiff Neck in Seconds (THIS WORKS!)",
    "description": "Build your body with science here - http://athleanx.com/x/athlete Subscribe to this channel here - http://bit.ly/2b0coMW If you ever ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Stiff necks. You're probably experienced one, at least\nin the last year, maybe more often than that. I can tell you this: when you have one it\nreally crushes your workout efforts because there's really nothing that you can do that\nfeels great if your neck is stiff. Particularly, if you're lifting with your\nshoulders, your upper body, even your legs, if you have to get your arms up in this position\nto squat. But we can actually do something about it\ndepending upon what is actually causing it in the first place. I'll say this, right off the bat. If you're somebody that has a stiff neck while\nat the same time you're experiencing numbness, or tingling down your arm – especially one\narm, not two – you've got to get checked out. You've got to at least go see a physical therapist. Have somebody check you out and determine\nthat you don’t have some sort of a disc issue here, that's also causing the pain and\ndiscomfort in your neck. Then you don’t want to be fussing around\nand messing around with what I'm going to show you here today. But if what you have is definitely the more\ncommon side effect of muscle stiffness, or joint stiffness, then you can do what I'm\ngoing to show you here, and it's going to help you quickly. So what you have to understand is, if you\ncan't move your head to the left, or if you can't move your head to the right we have\none of two things going on. It's really a 'chicken or the egg' scenario. Either the muscles have spasms that connect\nhere to the neck into the spine and are making difficult for you to move because they're\nin spasm – in this case it's a muscle issue – or the joint itself has become stuck and\nthat is causing a reflexive reaction, by the muscle going into spasm because they don’t\nlike the fact that the mechanics here in the spine are different. In that case you'd want to work on the joint\nissue. Either way, you'll see what I show you here\ntoday will actually help both. So if we want to turn to the left look what\nhappens. We start rotating here, in our spine. This is the spinous process; these big, nodules\nthat come off here on the spine. You'll see that two things will happen. Number one: as I start to turn the ones at\nthe top turn first. The more I turn it starts to recruit here,\nand here, and here. The more I turn it gets into the cervical\nspine. They start to participate in the rotation. They start moving one after the next, but\nthey start up here with most of the motion. So depending upon how far you can turn that\nwill give you and indication of where you might be stuck, and where you might want to\nintervene. Okay, so you see how far you can go. The next thing you want to take note of is,\nas I turn my head to the left these are actually turning which way? They're actually moving to the right. You see that? All these, the spinous processes, are actually\nmoving in that direction as the head moves in this direction. So if you wanted to address this and try to\nhelp this out you could take a towel – and I'm going to show you one thing here on this\nchannel that a towel is actually good for, because working out ain't one of them. What you do is, you take the towel and you\nput it around your neck, and the first thing you try to do is determine where your discomfort\nis. So you can either do it with a towel where\nyou pull forward, this way, where you feel like it's stiff, or you could just use your\nfinger. You're trying to feel these boney processes,\none after the next. Down, and down, and I find where it feels\na little bit sore, okay? So again, if I've ruled out that I have a\ndisc issue, or if you've already talked to somebody and you've ruled out the disc issues,\nbut you're feeling soreness here, you probably have a little bit of spasm, or you have this,\nagain, vertebrae that's a little suck. So as you feel this stiffness, wherever I\nidentify where it is, now I want to take the towel and put it at that level. Now, all I'm doing is taking my arms and pulling\nforward on both of them equally. But if I want to turn this way, to the left,\nwe know that I can actually influence that by pulling harder on this side over here – I'll\nshow it from behind – by pulling harder here, because what I'm doing is, I'm actually\njust holding on for stability, and I'm pulling forward on this side. What I'm doing is I'm taking the towel and\nI'm – let's just take it at this level so you can see – and I'm pushing forward on\nthat side. By pushing forward here, what am I doing? I'm actually rotating the vertebrae to allow\nfor rotation to the left. So now you should instantly feel – sort\nof like what we did with our shoulders popping; if you have popping shoulders. I'll actually link that video because people\nfind it helpful. If you have shoulders that pop there's a drill\nyou can do that can actually reestablish the position of the glenoid humeral joint to allow\nthat to subside, at least for a while, until you can fix it long term. What I'm doing here is, if I have difficulty\nturning to the left, now I pull here, and I turn at the same time. I'll find that I can actually go further. Then I come back and I ease up, and then I\npull on this side – just stabilizing here – and I allow myself to turn, and I come\nback. Again, chin is tucked here. Nice, pull, turn, and I'll experience more,\nand more range of motion. Pain free range of motion. This is a mulligan technique that physical\ntherapists use a lot to try to help restore motion in a spine that's locked up, but if\nit's coming from muscles then this is not going to hurt because at least you're establishing\nfull range of motion, which might allow the muscles that were in spasm to finally let\ngo as it is. Same thing. If I'm trying to go to the other side I'd\nactually just pull harder here, which is going to then allow me to turn that way, and if\nI'm having trouble bending my head backward – which sometimes happens – then if I\npull straight on, with equal force and go back, like that; that actually feels good. That will allow me to basically take the spine\nand move it this way. Which is what happens as the head goes backward. So a quick little technique that you can use,\nand I've also broken out the band here. You can use one of the bands to do the exact\nsame thing. The nice thing about the band is, because\nof the rubber you basically get a little more traction as it pulls on your neck. It kind of sticks to your skin a little bit. You'll get a little more traction that allows\nyou to get a good glide. So guys, as I said, a lot of reasons can lead\nto this. Firstly, screen the serious stuff. But if it's from your training, maybe you're\ndigging your head into the bench during the bench press. Maybe you're moving your head in all sorts\nof ways when you're doing lat pull downs. Whatever it is, you could have thrown it off. You could also be having a spasm, or trigger\npoint in your trap that could also affect this, and that would be a different scenario. We can cover that in a different video. The fact of the matter is, stiff necks will\nscrew up your ability to train and train hard. It's not a good thing to try to go out there\nand train with a stiff neck because you could be hurting yourself in other ways, too. So now you've got, at least, a weapon in your\narsenal to address that and hopefully knock it out quickly. So if you're looking, guys, we try to put,\nnot just strength stuff on this channel, but the other stuff that goes with it. Understanding how the body moves so that we\ncan address the whole picture. We do that. We call it \"putting the science back in strength\". I hope you guys find these videos helpful. They're a little bit more 'wordy', a little\nbit more technical, but in the end it helps you to understand how the whole picture operates. If you're looking for a complete training\nprogram, head to ATHLEANX.com and get our ATHLEANX training system. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nhere, and I'll do my best to do that in the days and weeks ahead. All right, guys. See you soon."
}