{
    "id": "AgC7p14h3rY",
    "title": "How to Get “V” Cut Abs (NO BULLSH*T!)",
    "description": "If you want to get v-cut lower abs but you just can't figure out how to do it, you will definitely want to watch this video. I'm going to ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I wanted to make a video to show you\nguys how to get that more developed V cut line. At the risk of making sure this stays a \"G\"\nvideo, that line right here. We can see that leads down toward the junk. Now look; it's important that we understand\nthe anatomy, which we're going to get into because when you understand the anatomy it\nwill guide how you train. We always talk about following the fibers\nand understanding it. But it's always got to start – whenever\nwe talk about anything abdominal, in terms of revealing what we're going to see here,\nand what we're trying to get that V-cut area – it has to start with this good news, bad\nnews, good news situation. The good news is, is that you guys know on\nthis channel I'm never going to bullshit you. I’m going to give you the actual, real advice\nthat you need so you can start to make the improvements you need to make. That's the good news. The second thing is, the bad news is that\nit's going to take quite a commitment on your part through your nutrition to make this area\nvisible. Especially because we know that when men lose\nbody fat, especially from around the waist, they tend to lose the up top first and it\nstarts to come down here, and the last area to go is going to be that lower abdominal\narea. The most stubborn is going to be that lower\nabdominal area. Meaning, your level of consistency is going\nto have to be very high. You can't just do something for two weeks\n– a crash diet for two weeks – and think you're going to reveal this area down here. You're going to need to be consistent with\nyour nutrition to the point where you can lower your bodyfat levels significantly enough\nto get down where those lower abdominal areas are lower in bodyfat. So, you're going to need to make sure you\ndo that. If you're looking for something to help guide\nyou, I did a whole video on a very simple plate technique that I want you guys to use. It's going to simplify the nutrition process. Again, simplification will lead to consistency. If you'd rather have a step by step plan,\nI have my entire meal plan, exactly what I eat included in all our ATHLEANX programs\nover at ATHLEANX.com. Now, the good news – because there is good\nnews – even though you have to do that, there's no reason why you wouldn't want to\nstart training the muscles that feed this V-cut. Namely, the obliques. We know that the obliques have the visibility\nfar up the chain here. They're not just visible down here at that\nline. They're not just down in here. They're all up in here. The external oblique is feeding this area\nhere. We know, as we said, as we start to lose bodyfat\nat a higher level of the torso, so we can start to see some of the tapering benefits\nof training the obliques. So, it's good that you can start to focus\non those things now even while you're still working on the nutrition. Now lets talk about the anatomy. For the anatomy here, we're always going to\nbreak out the muscle markers. When we're talking about the V-cut, we're\nliterally talking about the obliques. I did this in the video before I showed you\nand you can see here, this is what that \"v-cut\" area looks like when covered with fat, and\nthis is the same area when the bodyfat is stripped off. What's the difference? Nothing. Just the bodyfat. The level of development of the obliques is\nwhat stands out because the bodyfat is removed. So, we want to make sure we're focusing on\nthe right area because there are two different obliques. We have the obliques that come in this direction\nhere. We know those are the external obliques. They feed through their tendinous attachment\ninto this thickened area here. It's called aponeurosis. The thickening, where the muscle leads into\na tendinous sheath. In the bottom border of that is this inguinal\nligament. Just the bottom border. That feeds that bottom border. But the bulk of this here, this whole thickening\nhere, is all coming from external oblique that's feeding down into that. Now, we also have the internal oblique that\ngoes in the opposite direction. It feeds this way. Interestingly, what it does is feeds perpendicularly\ninto that aponeurosis, that thickening that's down into that inguinal ligament. The benefit of that, and knowing that, is\nthat we talk about all time the importance of following the fibers. Shortening of fiber in that direction, along\nits direction here, is going to help to develop that muscle. We know that when a muscle contracts it transmits\nforce through the tendon that it blends into. So, if we can have an impact on the tendon\nthat it blends into, we know we can feed into this aponeurosis and start to help to develop\nthat more. How do we do that? We focus on that internal oblique. Why we can't see this – because it's deep\nto the external oblique – we can activate it fairly easily. There are three components to doing this. The first thing you want to do is lie down\non the floor like you're seeing me do and you want to flatten that belly out. More importantly, you want to activate the\ntransverse abdominus. The transverse abdominus is going to flatten\nthe entire midsection. You can see that as soon as I do this, I immediately\nsee that v-cut line pop more prominently. Why? Because the transverse abdominus has its own\ntendinous sheath that blends with the internal obliques' tendinous sheath to attach right\ninto this area that we're trying to impact. We know if we can flatten the stomach by pulling\nthe belly button down – you see me here. Again, to activate the transverse I'm here\nand I draw in. You can see, once I draw in this becomes more\nprominent. Again, out and relaxed, draw down, and in,\nand it becomes more prominent here. So, the first part is that. The second part is getting basic abdominal\nactivation. We can do that with a posterior pelvic tilt. If I'm on the ground here – you can see\nme now on my back, I get that transverse abdominus activation and I pull up with the posterior\npelvic tilt. Getting the trunk to curl, getting more abdominal\ncontraction. Now here comes the most important part. Rotation in the same direction of the side\nthat you're trying to get to contract. Why? Because if you follow those fibers, guys,\nyou realize that rotation in this direction, down in this direction following the fibers,\nis going to make that internal oblique contract. If we can get contraction through that muscle,\nrealizing that the force will transmit through that tendon, we can get and activation in\nthis exact are that we're trying to target. Now, we're going to go one side at a time. To do that, we're going to do this exercise\nhere. It's more of just a contraction drill. I'm going to do the three parts I said. I do the flattening, I do the trunk curl,\nand then I rotate in that direction. You can see and feel how intense of a contraction\nthat is right on that line. Right on that v-cut area. What I want you to do is use this as a neuromuscular\ndrill. I want you to include it with whatever ab\ntraining you're doing. If you're on our ATHLEANX programs, we train\nabs every, single day. You can incorporate the additional work just\nwith a couple extra sets of, let's say, six to seven second contractions, 10 good quality\nones. The fact is, if you do what I'm showing you\nhere in conjunction with the nutrition and getting you nutrition in check as you drop\nthose bodyfat levels; this v-cut line will become much more prominent. Again, you can see here that when I make that\nturn, in that direction – here, and then in – I get that v-cut line becoming more\nestablished, and again, more visible. That's what you're trying to do, guys. That's your attack plan for making it work. I promise you, you're going to get better\ncontrol of it. A lot of it is that guys just don’t have\ngood control over the area and don’t even know how to contract their abs, let alone\nput a more creative pelvic tilt, let alone get these areas to actually contract when\nwe're talking about the obliques. But this is your attack plan for doing that. Hopefully you've found the video helpful,\nguys. If you're looking for more science-based training\nand advice, you want to make sure you head over to ATHLEANX.com and get one of our training\nprograms. Again, we put the science back in everything\nwe do because it matters. In the meantime, if you found the video helpful\nleave your comments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you haven't already done so, make sure\nyou click 'subscribe' and turn on your notifications, so you never miss a new video when we put\none out. All right, guys. I'll see you soon."
}