{
    "id": "Aom1uaythK8",
    "title": "How to Fix a Headache in 90 Seconds Flat! (JUST DO THIS)",
    "description": "If you ever wondered how to fix a headache fast, then this is the video for you. Whether your head is throbbing right now or you ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. \nSo if you've got a headache, then you've come   to the right video because I'm going to show you \nsomething you can do right here in 90 seconds   that will get rid of the majority of headaches, \nespecially if they are tension based headaches   caused by muscle tightness, we can release \nthose. Now, this is a workout channel,   so I know that we oftentimes can have tension \nheadaches because we overdevelop muscles that   can lead to that and we don't want to miss \nworkouts because our head hurts. That being said,   people that work at a desk all day oftentimes also \nget tension headaches and I want to help everybody   with this. So, what we do is we break out one of \nthese, this is a lacrosse ball. Now, I've talked   about in past videos, I don't go around telling \nyou to stick lacrosse balls all over your body   because oftentimes it just makes it a bad \nsituation even worse, especially sciatica. But for   this application in a trigger point in the upper \ntrap, this is a godsend, and this is all you need.   So, I'm going to take Jesse here, he's going to \nbe my dummy for this. What a perfect job for you,   Jesse. I've been waiting all along to find the \nright job, a dummy. So, we're going to take   this ball and utilize Jesse to show you exactly \nwhat you have to do. It's a very easy step by step   process. So, the muscle that we're going to try to \ntarget here is this. This is the upper trapezius,   and this is where we oftentimes harbor the trigger \npoint that leads to radiating pain up the back of   the neck into your head that causes the headaches. \nSo, if we can put ourselves into a position of   relaxation on that muscle is utilizes something \ncalled the Jones Strain Counter Strain Technique.   And with this ball, what your first goal is, is to \ntake it and put it right in the area of the trap   that is most sore when you touch it.\nAll right. Now, what do you do with your   legs? Because it actually matters. The leg on the \nsame side as the trap that you're treating just   gets to kind of lay on its side off does nothing. \nThe leg on the opposite side is actually going to   post up with your foot flat on the floor because \nyou're going to need to do something with that   in a second. What happens up here at the head now \nis when you have that ball on the spot is number   one, you side bend your head, you bring the ear \non the same side as the trap that you're treating   down towards your shoulders. So, you side bend \nyour head down towards that same side shoulder   as Jesse did right there. Then we're going to get \na little bit of rotation to the opposite side. So,   all I do is I say just turn your head a little bit \nso you can look straight up at the ceiling. Okay,   so side bent, but then turn your head so \nyou can look straight at the ceiling. \n  Now, you want to get this arm up because you get \nthat trap into relaxation. So the arm goes up   over your head as far as it can, and then this arm \ncomes behind on the back of the elbow to basically   hold it there, because all of this has to happen \npassively. You're not actively holding yourself   in any position. Now, the last thing he does to \nreally drive this home is he uses this posted up   leg here. He presses down through the foot to \nbridge up, which basically angles his body now   down into that ball a little bit harder, driving \nthat ball right into that really uncomfortable   spot. You feel it? Absolutely. Oh, man. And \nthen all you're going to do is hang out for   ninety seconds and that's it. And what will happen \nis that trigger point that's being caused by who   knows, a lot of people have a lot of different \ntheories as to what's causing the trigger point.   Whether it's at the facial level, whether it's \nat the level of the muscle fibers and a cluster   of muscle fibers that are tensed up and won't \nrelease, you have to reset the mechanisms of the   stress reflex, whatever it is that's actually \ncausing it, I don't know if you really care as   much as you really want to get rid of it. Within \n90 seconds of this guy's, what will happen is you   come out of that position slowly and then you \ncome out and you move your head around just a   little bit to reprogram it, give it a minute or \ntwo. If you still have symptoms, that you would do   it to the other side. If it is possible, you could \nhave trigger points in both traps, oftentimes it's   common. So maybe the 90 second technique takes \nthree minutes instead of 90 seconds. The fact is   it's not going to take long for you to obtain the \nrelief. And I've done this before, guys, with back   pain videos, I'm going to link that one for you \nat the end of this video if you haven't seen it.   If you do the right things, you can actually \nmake an impact very quickly. This is one of   those things that leads to a quick impact. \nIf you found the video helpful, makes you first   of all, you tell me that it worked for you down \nbelow and also be on the lookout, because I'm   going to do another one on how to fix a stiff neck \nusing another location here in the same technique.   If you're looking for step by step programs, guys, \nwhere we don't overlook any of the little things,   because, as you know, a workout with a headache \nis not as good a workout as one without one.   I want to make sure you get the most out of \neverything you do. All of our plans are based   around that same putting the science back in \nstrength concept, they're over at athleanx.com.   If you have already done so, guys, make sure \nyou click subscribe, turn on your notifications,   so you never miss a new video when we put one out. \nAll right, guys see you soon. Thanks dummy."
}