{
    "id": "B3XFTkKAkac",
    "title": "How to Get Bigger Biceps (LIGHT WEIGHTS!!)",
    "description": "If you thought the only way to get bigger biceps was to lift heavy weights, then this is the video for you. Here I'm going to show you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to talk to you about how to build\nbigger biceps with lighter weights, because it can absolutely be done. As a matter of fact, it better be done if\nyou're looking for your best bicep development ever. You see, metabolic training is a component\nof your training that has to be in place if you want to see peak growth and development\nof any muscle that you're trying to develop. Not just your biceps. So let's see what it looks like in action\nso you can start to get a feel for what I'm talking about. This, right here, is a bicep curl, but it's\na little bit different than a regular bicep curl because the goal here, is to accumulate,\nnot just repetitions, but to accumulate metabolic breakdown. In other words, increase metabolite production\nfrom rep, after rep, after rep. As I start to fatigue I want to chase more\nfatigue, and chase more burn, and more burn, and I want to be able to dwell in this. You can see that I'm not just changing color,\nbut this is what I'm actually doing inside the muscle as I continue to lift. Now the weight selection: I would take what\nI would normally use for five, to eight reps, which would be about 60lbs, and I'm going\nto drop that down, in half. So here I'm using about 25lbs, or 30lbs. The goal is, you shave off the top 5%, and\nthe bottom 5% of the range of motion because I don’t want to give myself an opportunity\nto pause the momentum of this rep at any, single point. You see, if you go to the very top I can stop\nmoving the dumbbells, or I could stop at the very bottom. That tends to be where we do that, but if\nI shave that off, and I give you the main instruction of \"Move the damned weight and\nnever stop moving, keep the same tempo. Up, and down, and up, and down, and up, and\ndown.\" You will start to feel that burn, and that\nis what you should be chasing. Now I'll explain it to you in a second of\nwhy that is actually causing muscle growth, but you have to realize, this technique is\nnot one that we have to do in exclusion of everything else, but it's one that we have\nto do in inclusion to the other methods that we use, and we're used to using for training. We know we need to add weight to the bar,\nwe know we need to use heavy weights, we know we need to be able to progressively overload\n– whether via weight, or volume – but that is going to run into a wall after a point. We need to have other methods. This is going to compliment it and actually\ngive you more growth. I could apply this, as you see here, to an\nincline curl. Same thing. Just save a little bit off the bottom, a little\nbit off the top, and keep that dumbbell moving, and we'll get the same response. But there's another way that we could actually\nchase metabolic overload. That is by taking the exercise where the peak\ntension occurs in the most contracted position of that exercise. So for me, for the biceps, it's a spider curl. You can see here that via the position of\nmy body on this incline bench, the peak tension is occurring when that dumbbell is all the\nway up at the top. The key here is not to let the muscle drain. Get the metabolites to being production by\nhaving this high level of tension in that state of peaked contraction, and stay there. Go down as low as only the mid-range, and\ncome back up to the top, and now do the same thing. Rep, and rep, and rep, and rep, and rep, and\nyou'll start to feel this intense burn. But what I'm saying to you is, this is what\nyou need to chase. When you get there, you don’t stop. You dwell in it. You try to sit there and revel in that pain,\nand discomfort because, again, that is where the magic happens. You could have turned the original bicep exercise\ninto this same kind of exercise by adding a band to the dumbbells. By doing so, we've now complimented that strength\ncurve to add an additional peak tension at the top of the rep. So now, how is all this happening? Why is all this working? Well, if you look here – this is our blackboard,\nby the way, guys – when you look here – forget the white boards. They're out of style. You basically have a muscle cell, okay? I'm going to keep this really, really simple. Inside the muscle cell, the more you start\nto lift, the more you get the accumulation of all our different metabolites. I'm talking about potassium. I'm talking about lactic acid. I'm talking about hydrogen. I'm talking about chloride. All these things start to accumulate inside\nthe muscle cell. We know, from biology, that the more stuff\nthat starts to accumulate inside of a cell, the more that concentration is, the more there\nis a tendency for water to enter the cell, to try to diffuse that, and try to equalize\nthe concentration inside, and out. So if we start to increase all those metabolites\nbeing produced here – again, lactic acid, phosphate – all those things are starting\nto be produced, water wants to flow into this cell to try to diffuse this. There's too much concentration, and there's\ntoo little hydration, and water inside the cell. So all that starts to rush in. Well, what happens at that point? With all this water hydration rushing into\nthis muscle cell you start to get outward – inward, to outward pressure – on that\ncell. So it starts to push on the walls in this\ndirection. Now, this isn't true muscle growth. When this cell is starting to get pushed out\nthis way, that's not the growth that you're looking for, where you're going to walk away\nand get bigger, and feel stronger, and bigger the next day. What I'm talking about is, that is the stimulus\nbecause of the pressure on the cell that requires that cell to adapt and respond by ultimately\ngrowing bigger. So what you're chasing here, is this gradient,\nand by increasing this – the more that you can increase these metabolites, the more you\ncan resist that burn – there's more likelihood that you'll be able to drive stuff into the\ncell. The fluid is able to push out, and create\na bigger, and bigger response. Now guys, this type of training – as I said\nin the beginning – is not exclusive. If you only use this and you're using light\nweights to accomplish this where are you going to get your heavy weight training in? Because all three methods of hypertrophy have\nto be in place if you want to see your best results. However, if you're not using light weights\nbecause you were told a long time ago that it's impossible to build muscle with them,\nthat is wrong. It's actually 100% wrong and in order to see\nyour best results you need to have all those methods combined. Eccentric overload, metabolic training, and\nalso progressive overload using both volume, and additional weight on the bar as your mechanisms. Guys, if you're looking for a program that\nweaves all these in at the appropriate time so you're not missing out on any one, and\nyou're not listening to the \"Broscience\" you've heard in the past that made you run away from\nthe light weights for fear that you wouldn't build muscle with them; that program is over\nat ATHLEANX.com. All of our programs actually put the science\nback in strength. If you click the link below this video you'll\nfind our program selector tool. That will help you to find the program that\nis most aligned with your current goals. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want to see here,\nand I'll do my best to cover it for you in the days, and weeks ahead. All right, guys. See you soon."
}