{
    "id": "B_sukFC6Nn8",
    "title": "WARNING: Gym Sins You DON’T Want to Make!",
    "description": "Consider this video a public service announcement for what not to do when you are in a gym. Here we cover 11 of the most ...",
    "transcript": "JESSE: Bro, bro, bro! Yo, I just figured out how to better pullups\nfor more time. Want me to show you? JEFF: Uh, not interested. JESSE: Really? JEFF: Nah, I’m good. JESSE: All right. JEFF: You mind if I – you good? Okay. What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re going to talk about how to build\nbigger biceps in the gym. JEFF: Up. Go. All you. All you. No problem, man. Easy. That’s easy. JESSE: Yeah, all right. So, 135 for 15. 5th set, flat barbell bench-press, Friday,\nMay 25th. Do you know what the temperature is today? JEFF: It’s, like, 70. JESSE: Is it 70, or ‘like’ 70? Oh, do you know what the moon phase is? Because that’s important to me also. Oh, God! I forgot to check my- Hey, man. Are you all done here? JEFF: Yeah, all yours. JESSE: Awesome. Hey, can you do me a favor? Can you, uh, can you kind of keep the music\ndown? Just a little bit? I’m just trying to catch a few Zs, if you\nknow what I mean. Thanks, bro. JEFF: Last one. Last one, last one. Go, go, go! Yeah, there you go. Nicely done. Nicely done, man. Almost my PR. 600lbs. JESSE: 600? You want to throw some weight on the bar? JEFF: No, no, no. That’s from a while ago. JESSE: How long ago? JEFF: Like, 25 years. Knee injury playing football, but dude. Picture this. 4th and goal, state championship on the line,\nI dive for the guy. Right here. Shoe string tackle. Get him right – we’re all getting together\nFriday night with my old boys watching games tapes if you want to come. JESSE: Uh, I’m okay. I’ve got a date on Friday. JEFF: Aw, man. That’s a shame. Hey, well, it’s going to be cool Friday\nnight. If you want, I’ll actually let you borrow\nmy letter jacket. JESSE: Hey, man! So, it turns out it’s not 70. It’s 80. Would you believe it? It’s hot. But you know what? It feels really good after a cool shower. I promise you that."
}