{
    "id": "bmUMRnvAucw",
    "title": "The Best Bench Press Variation for Chest (WINNER!)",
    "description": "There are lots of different variations of the bench press; barbell, dumbbell and machine to name a few. That said, is one better ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. We have another Iron Face Off here today. This time, pitting variations of the bench-press\nup against each other to determine which one is the one. If I had to choose just one that’s going\nto give you the most bang for your buck. Now, I’ve got to say right off the bat,\nin all these Iron Face Offs I like everything we do. There’s a purpose and meaning for everything\nwe do that we’re going to cover here today. But again, gun to my head, which one am I\ngoing to pick? I’m going to have to pick one. So, we’re going to break them down one by\none. It starts here with the dumbbell variation\nof a bench-press. Now, why are we doing a dumbbell bench-press? A couple of reasons. Number one: we do know that this is an exercise\nwe can load up fairly heavy and uses a progressive overload exercise. We can get a great range of motion with the\ndumbbells because they can come down slightly lower than the chest itself. That might be stopped by the barbell. We also have the opportunity to create a bigger\nrange of motion. As I bring my arms up straight, I can also\nbring them toward each other. However, I will caution you on this. Do not think this is a resisted adduction\nexercise. It’s not because when we’re in this plane\nhere, whether we slide left or right is not really impacted by the weight that’s in\nour hands because gravity is acting downward on these weights. What you are feeling is your ability to contract\nyour chest into more adduction, but it’s not a factor of the resistance of the dumbbells\nproviding extra there. So be careful about that. But that brings us over to this. This is a standing machine press. Some guys might go “I knew it! Jeff was going to say, ‘the athletic standing\nexercise is going to be the best option’.” So, it would be something that would look\nlike this. We come out here and we press out. We get into a staggered athletic stance, we\npress out in front of us. We have more resisted adduction here, right? It is ground based. However, two things are wrong here. Number one: this requires a tremendous amount\nof core activation to put myself in position to do this properly. As I start to load up, I have to push this\nweight out toward you. As much weight as I could possibly handle,\nif I’m looking for that progressive overload. But each amount of weight that I have to push\nout toward you is going to be countered by the fact that my core has to be able to stabilize\nthat and keep me here. The weights are going to try and pull me back. I have to stay here, and I can only do that\nwith my core activation. Which means you’d better have a strong ass\ncore to overcome the fact that you’re going to want to press some heavy weights. I don’t think you’re going to be able\nto keep up in that race. So that’s the first thing. The second thing is, of course, getting into\nposition here and then having the adduction. Again, it’s not optimal when it comes to\nadduction because of the angle here of the weights. Now, you might be thinking “I knew the cables\nare still what Jeff likes.” You’re going to want to go down to a flat\nbench and do cables like this. Now, in this case, you are getting a tremendous\namount of resisted adduction at the top. You have peak resistance at the top of this\nrange of motion because of the cables, but one thing you do not have is a good opportunity\nto smoothly do this exercise. You’d better be able to curl a hell of a\nlot of weight because you’ve got to pick this cable up from this down position and\nget in position on the bench to be able to perform it. That is a struggle in itself. I can tell you this: no matter how much you\ncan bench-press, you’re never going to be able to curl that much weight to get yourself\nin place to do it. So where does that bring us? It leaves us over here with the good, old,\nbarbell bench-press. Now, what is the good advantage of the barbell\nbench-press here? Is this the winner? I’ll tell you this: the barbell bench-press\nprovides us with a slightly less amount of range of motion because you’re simply pushing\nthis up, straight overhead. But we don’t have that adduction component\nbecause our hands are fixed here by the bar. So, there’s slightly less range of motion\nin that regard. However, I minimize the contribution of that\nextra range of motion when we talked about the dumbbell bench-press. What you do have here is, because we don’t\nhave to worry about the demand of stabilization the dumbbells provide, is an opportunity to\npush more weight. So, we can get here in the barbell setup,\ncome down, and press. Not sacrificing all that much in terms of\ndepth, even though the bar is stuck, in terms of how low you can go because of your chest. But what you have is an opportunity to press\nmore weight. As anybody that’s performed this lift can\ntell you, you have a greater dispersion of the weight and a longer distance. More like a see-saw – than you do when all\nthat weight is concentrated in your hand in a dumbbell. Which makes it a little easier to press this. Sometimes in the order of 20% more weight\nhere. So, if you’re looking for an exercise that’s\ngoing to build your strength, this is the winner. We know how important, as a strength and conditioning\ncoach, strength is to the foundation of what you do. A barbell bench-press will be the winner. I will offer you one other combination, though. If you’re looking to create more hypertrophy,\nmore stress, more inefficiency as I’ve talked about in our videos before, when it comes\nto applying more stress to your chest, so you get more growth, you’d want to perform\nyour bench-press. But then you’d come right up here and perform\na standing crossover. Something that allows you to get into resisted\nadduction with a much more significant weight. The dumbbell bench-press is not applying that. There is no real resistance up top here because\nyou’re in that frontal plane. Here, I’m using all my strength to be able\nto create that adduction across the body with a much more significant amount of stress and\nweight against this adduction. So, I have the ability to overload the adduction\nand I do it in a drop set format that allows me to take that bench-press one step further. Throw in the fact that, yes, we’re again\non our feet for that athletic additional benefit that always comes from being on your feet. So, guys, if you’ve found this video helpful\nmake sure you leave your comments and thumbs up below. We have others in the Iron Face Off series\nthat you’re going to want to check out. In the meantime, let me know what else you\nwant me to cover and I’ll do my best to do that for you in the days and weeks ahead. If you haven’t already, subscribe and turn\non your notifications so you never miss a video when it’s published. And if you’re looking for programs that\nput the science back in strength head to ATHLEANX.com right now and get our ATHLEANX program. Guys, I’ll see you back here again in just\na couple of days."
}