{
    "id": "BnGvgbDzheQ",
    "title": "How Pro Athletes Lose Fat (DETAILED WORKOUT!)",
    "description": "Get ripped in 90 days - http://athleanx.com/x/pros-use-this Subscribe to this channel here - http://bit.ly/2b0coMW Losing fat is one ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Oh my God! We're outside! We're out of the gym. Yes, we do get outside. As a matter of fact we train like athletes. It's great to get outside and I wanted to\ngive you an awesome fat burning workout that's based around sprinting, running, athleticism;\nto help you to burn some fat, but give you something that you can actually do. Because a lot of us have a baseball diamond\naround us somewhere. Just a Little League park, anywhere outside\nwhen you feel like getting out. I'm going to give you an actual workout you\ncould do out here that we would use with our Major League baseball players to help them\nget in shape. Particularly in spring training. So it's just running the bases, but we have\na strategy for running the bases. As you can see we have, right here, 90 feet\nfrom home to first base. 30 yards. So what we're going to do is run singles straight\nthrough the bag. So we start off, we do four singles straight\nfrom the bag. You can see me running them right now. You try to get out there as fast as you can,\neach time trying to increase your speed, if you can, down to the baseline. Then we come back each time, our rest is our\nwalk back to home plate. Now we're going to hit some doubles. So now we're going to run and we've got a\nlittle bit of a turn. So we've got some agility built into this. So you want to make the turn on the bag. Actually, we don’t even have bags here now\nbecause we're off season, but you're going to make the turn as quickly as you can, as\nsafely as you can, down to second base; there's your double. So it's a little bit longer of a run. Obviously, a little bit more stamina needed\nto do that. From second base, each time, you're going\nto score from second. Now you simulate a hit to the outfield. You're going to make a nice turn on third\nbase and you're going to try to score. So three times from the doubles, and three\ntimes scoring from second, to get back home. Now we'll hit some triples. Triples is a little bit more difficult. We have to make two turns in there, and of\ncourse the stamina requirements are increased even more and you're probably already sucking\nwind by now, but that's exactly what we're supposed to be doing here. Increasing your endurance. So now we're going to run down three triples,\nand then from here we're going to tag up. So the cool part about tagging up, as you\ncan see, is that you have a lot of quick change of direction going on. So when the ball is hit to the outfield you're\nsimulating that. You're going to run down, halfway down the\nbaseline. Now you see the ball is caught. You've got to stop, run back, touch third\nbase, and then change direction again, and sprint as fast as you can home, to make sure\nyou beat the throw. So now you're going to do two triples, with\ntwo tag ups. Then finally, we saved the best for last. You'll have the inside the park homerun. Now this is a bitch. You've got to run all the way, as fast as\nyou can. You see this. You smell it. You can smell the score. You're going to get across home, but you've\ngot to get there before the throw beats you. So you've got to get out there as fast as\nyou possibly can. Sprint down, make the turn, make the turn,\nmake the turn, get here safely, and you've done your job. Guys, you can see there's ways that you can\ncreatively get your workouts in. you might even trick yourself into thinking\nyou're having fun. The fact of the matter is, you've got to get\nthe work done somehow or another. You might as well do it with a little bit\nof athleticism and a little bit of fun to make it more enjoyable. Guys, ATHLEANX.com. Head over there right now. Start training like and athlete so you can\nlook like an athlete. In the meantime, if you've found this video\nhelpful make sure you get out there and try it. Leave your comments and thumbs up below. Let me know what else you want me to cover\nhere on this channel and I'll do my best to do that in the days and weeks ahead. All right, guys. See ya!"
}