{
    "id": "bOJu7xi3l3Q",
    "title": "How to Get a Strong Low Back | DO THIS EVERY DAY!",
    "description": "If you have back pain, particularly if you spend a large portion of the day sitting, then you will want to watch this video. I'm going to ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I think this is going to be an incredibly\nhelpful video because I’m going to show you what you need to do every day to start\nbuilding a stronger lower back. Right away bells are probably going off saying\n“Every day? For your lower back? That’s probably not a good idea for your\nlow back.” There’s a reason why it is, because you\ndon’t do the same thing every day. But there’s one thing that’s missing from\nmost people’s training. That is any concentrically focused lower back\nwork. What I mean by that is, you need to take a\nmuscle through its range of motion and strengthen it through its range of motion and not just\nrely on isometrics. Isometrics alone don’t do it. When we do a lot of our bigger lifts, isometrics\nare mostly what are happening here. Deadlifts. A lot of guys will say “Deadlifts should\ndo it all.” We can cover our entire low back needs because\nof deadlifting. I agree, in a way, but not for most people. Why? Because they’re not deadlifting heavy enough. When we do a deadlift – which should be\na staple of everybody’s training, and it should occur on a weekly basis. You should be doing your deadlifts at least\nonce a week. What you want to see in a properly performed\ndeadlift is, you get in this position ready for your initial pull, and your low back is\nin a certain position. It should be protecting your lumbar spine. So, you should have a slight arch there. When we pull up, we’re using our legs to\nget off the ground. We’re stabilizing, getting tight up top,\nwe’re using that straight arm scapular strength to get into this position here, and as we\npull, we’re using our legs. Now, from this position here, this is hip\ndrive. This is coming from the glutes. From her, drive through extension. If you start lifting your low back from there,\nfirst of all, your legs are going to lag. They’re not going in drive with the movement. They’re lagging behind. But second, you’re loading your spine in\na way that this lift was never intended to do in the first place. It’s putting more stress on your spine that\nway. What you’re looking at is more of an isometric\nhold of the lumbar spine throughout the lift. There is a little bit of concentric shortening\nthat happens from the very top. Not talking about overextending. I’m talking about just at the very top. So, a portion of the weight that you’re\nlifting here is going toward the concentric shortening of the lumbar paraspinals. However, it’s not a high amount. Let’s call it 10%, to throw an arbitrary\nnumber on it. It’s very little. So, unless you’re deadlifting 500lbs you’re\nnot getting enough weight applied to the lumbar spine or applied to those paraspinals to help\nstrengthen them. Again, if you’re doing that, that’s a\ngood start, but it’s not enough because it’s not frequent enough. You’re not going to be deadlifting every\nday. So, we need some other options. So, what we do is, we have some other options. We have a kettle bell swing. It’s a great conditioning exercise. One of the best ways to condition. It also helps us to build, not just stamina,\nbut endurance in our lumbar paraspinals, but again, for the same idea. We’re basically coming down, right hip hiking,\nand then as we come through it’s an extension through the glutes. I’m not lifting here with my back. I’m not coming down with my leg and lifting\nwith my back. That’s not a swing. A swing is a hinge, and a hinge through. Hinge, and then back through. So, the same thing is happening here, in that\nwe’re not getting this active, concentric shortening here, but more of a stability that\nwe’re holding, and getting a small percentage that gets carried over. But now, with an 80lb kettle bell, you’re\nusing far less than you were over here. So, the trade off is volume. Your volume would have to be higher here. Thank God, it does fit in well as a conditioning\nexercise that will allow you program it for higher times in volume. But again, that works as an option that could\nfall into your conditioning days. So, we’ve got our heavy deadlifts occurring\non a pull day, or a leg day, or a back day. Then we’ve got these filling in the gaps. Now, some people would say “What about the\ngood morning, Jeff? You’ve talked about the Good Morning before. Is that a good option? Are you getting anymore concentric shortening\nthere?” There’s a big problem with the Good Morning,\nguys. Not the exercise itself, but that most bodies\naren’t capable of doing it properly. I, for one, am not capable of doing it properly. So, I don’t do it. What you do is get in position here and you\nhave to hinge. You’ve got to try and keep this bar, like\nwith a deadlift, as close to your center of gravity as possible. What most people do is, they start leaving\nforward this way. All that distance between my center of gravity,\nwhich is my hips, and this bar out in front of my body places an enormous amount of stress\non your low back. Most of which, we can’t handle. So, you need to be able to have a great hip\nhinge to sit backward as we drive down. Then we come up out of that. Now, what happens here, because the low back\nhas to be into this slightly arched position here, and we go back and sit back; you need\nto have tremendous hamstring flexibility, which is where my limitation is. I can’t get any further here without allowing\nmyself to roll forward and create some damage. So that is not one of the best exercises. We move onto the other option. The other option is one of my favorites. This is a hyperextension. It gets a bad title because it’s not a hyperextension\nif it’s done properly. This is what you can work in more on your\npush days, in addition to your leg days. So, you’re filling in the gaps to build\nout a more comprehensive volume for your low back. So, you get into the position here on the\nglute-ham, and what we’re looking at is going into a flexed position here. Allowing my low back to flex. People say these are no good. Don’t ever extend if you have stenosis in\nyour low back. That’s horrible advice. This actually opens you up. And because we’re going to do what I’m\ngoing to say next, it doesn’t place additional stress on the lower back because we’re not\ngoing from here to a hyperextended position. You never do this on this exercise. That is creating too much narrowing of the\nspace in your low back, which is something you don’t want. What you do is go from a flexed position to\nneutral. That is extending. That is concentrically shortening these muscles\nwhen they don’t get the opportunity to do this at any other point. This is your opportunity, this is your best\ntime to be able to do this and use your deadlifting to complement this, to create the ultimate\nplan for having a more stable, and strong low back. You do your hyperextension without the ‘hyper’\npart. Just to extension and down. What’s cool about this is, we can load it\nwith a plate. I talked about building up with a 500lb deadlift,\nlet’s say 50lbs of concentric action there. Now we’ve got 35lbs up, and down, up, down,\nand up. So, we’ve got that option. We can also take weights, as I’ve shown\nbefore. Down, up, and even at the top here, row. Get the spine to work together at all levels. Up, row. Up, row. It will light you up like a Christmas tree,\nbut it’s what you need. You haven’t done enough of this. You’ve been throwing away the opportunity\nto concentrically shorten the lumbar paraspinals. The last thing you can do – because you’re\nnot always lifting weights. The days that we’re off and doing our corrective\nexercises, the low-key stuff. Get on the ground. Bridging. Get to a high position here. When I go to bridge, don’t just push through\nthe heels. If we’re trying to work on our lower back\na little more, you can see we’re posteriorly rotated right now. We have our low back in flexion. We’re going to drive into extension with\nthe low back. And down, into extension with the low. The nice thing here is you’re getting your\nglutes to work with you. So, they’re complementing the entire posterior\nchain extension. Like that. You do a set of two, just to continue to keep\nthe activity and awakening the muscles in the low back that haven’t been used for\nso long. You have another option here with the Supermans. Hands down, legs down, lift up, hold, into\nthe low back, to the glutes, and down. Up, hold for a couple seconds, then down. Again, a couple sets on those non-training\ndays, more as corrective, and you put it all together, you’ve got a game plan that allows\nyour muscles in your low back to be used, maybe for the first time in a long time, and\nto be trained completely. Not just isometrically, but now adding some\nconcentric forces and stretches to complete their development and help take the stress\nof your lower back right now. Guys, I hope you’ve found the video helpful. If you’re looking for a program that maps\nout different opportunities of when the best time to do this heavy stage stuff, and what\nthe volume should be, we work them all into our training approach. I believe when you’re training like an athlete\nyou can’t afford to overlook things like this. We work them all in. All our programs are available over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Let me know when you start to incorporate\nthese, if they really start to help your low back pain go away, and your lower back itself\nto feel a lot stronger. If you haven’t already, please subscribe,\nand turn on your notifications so you never miss a new video when we publish it. I’ll be back here in just a couple of days\nwith more videos for you. See you."
}