{
    "id": "BpbZC_Pd4XU",
    "title": "Build Huge Shoulders WITHOUT Weights! (Front, Middle, Rear)",
    "description": "If you want to build huge shoulders then you need to know how to hit every head of your delts. In this video, I'm going to show you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to show you how to hit the\nfront, middle, and rear delt without having to rely on exercises like this, or this, or\neven this. As a matter of fact, we don’t have to rely\non using any weights at all. I'm going to give you three ways to hit each\none of these heads of the deltoid, without using any equipment at all. So let's first go after that front delt. We know that front delt is commonly worked\nin a lot of other exercises we do. Namely, the bench-press. But we do know if we can keep our elbows in\nfront of our body – as I've shown you here before on this channel – we can safely press\noverhead. But what if we don’t have access to something\nwe press? We can actually press our own body. So this introduces this whole concept that's\ngoing to run through this entire video, of relative motion. So when I get down on the ground here, I'm\nno longer trying to press the bar away from my body. I'm trying to press myself away from the floor. You can see I can still have the same, exact\nmechanics of the shoulder. My elbows are still staying in front of my\nbody, positioned the same way as if I was pressing dumbbells, or a barbell over my head. But by pressing my body away, I've replicated\nthe same force, and tension in the delts, which is going to allow them to grow, regardless\nof whether or not you're using dumbbells, or weights as your resistance. Your body will do just as much. Next up, this is one of my favorites because\nwe're going to hit that hard to hit middle delt, at least if you don’t have dumbbells. We think that the best way, and the only way\nto hit these is to do lots of side-lateral raises. That might be true because we don’t think\nthere's any way we can replicate this without weights; but there is. Guys, if you hit the floor, again, and realize\nthis concept of relative motion is working in your favor then you'll be able to hit,\nand target these middle delts. So what you want to do is get down to the\nground, and dig your elbow into the ground on whatever side you're going to work. What you're going to do is get up on your\ntoes – of if you're able to. If not, you can start down on your knees. From here, you're going to tuck one hand up,\nagainst your chest – the not working hand – and you're going to lower yourself down\nto the ground to get a bit of a pre-stretch on that middle delt, and then rotate your\nbody up, and away from the elbow on the floor. Up, and away. What you see here, guys, is you're getting\nthat rotation. That abduction of the arm, away from the body. The same, exact motion that you're getting\nin the side-lateral raise. But you're coming it with your own body. The difference, here, is instead of moving\nyour arm away from your body – as you would when you're lifting the dumbbell – you're\nmoving your body away from your arm. But it doesn't matter because what's going\non at the join itself is the same. You're still getting abduction at the shoulder,\nyou're still getting resistance. This time, in the form of your body. But the fact is, your moving muscle only know\nthat you've delivered tension to them, and it's enough to help them grow bigger, and\nbetter. Now finally, we've got the rear delt. Once again, we think dumbbells are our only\noption. Not so fast! If you spend all your time doing bent over\nlateral raises to hit the rear delt, not only have I shown you that's not even the best\nexercise option when you do have access to weights, but I've got a better option here\nfor when you have no access to any weights at all. This is the reverse iron cross. What you do is, you get yourself on the ground\nhere, you put your feet flat on the ground, and the goal is – all you want to try to\ndo is push through your closed fists into the ground as hard as you can, high enough\nto get your elbows cleared from the ground. You can see the extreme action of the rear\ndelts because we're getting our body into extension. We're getting those arms of ours into extension\nback, behind our bodies. The rear delts – the great thing here is\n– you can actually intensify this contraction by holding it for two, or three seconds, and\nthen lowering yourself back down. The fact is, once again, we're using relative\nmotion instead of pushing our arms back, behind our bodies while lifting a dumbbell. We can worry about pushing our body away from\nthe floor by pushing through the arms. The effect is the same. Your rear delts only know the fact that the\ntension being delivered to it is hard, it's difficult, and most of all, capable of helping\nyou add more muscle. So there you have it, guys. All three heads of the delt hit without equipment. Delivering tension is the key. Guys, no matter what you have access to there's\nnever going to be an excuse for not getting in shape. If you're looking for a program that's completely\nbodyweight, that requires no equipment at all; we have that. That's one of our programs over at ATHLEANX.com. It's ATHLEAN-0. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Make sure you watch our latest video. Subscribe if you haven't already. Turn on those notifications, and I'll see\nyou guys back here for another video in just a couple days. Later."
}