{
    "id": "BvtD3znOqao",
    "title": "The FASTEST Way to Bigger Rear Delts!",
    "description": "If you want to build bigger rear delts, the first thing you need to do is stop doing reverse dumbbell flies with light weights. In this ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to show you the fastest way\nto build your rear delts. Guess what we're not going to do? We're not going to use a light dumbbell like\nthis and do a reverse fly. There's nothing wrong with the motion because\nwe know the function of the rear delt is to get that arm back, behind our body. But if you always do it in this straight arm\nfashion, which I've talked about on this channel before, you're limiting the amount of activation\nof the rear delt. You're limiting the capacity of the rear delt\nto perform the lift. What happens is, we know extension, getting\nthat arm behind the body – if I just take my arm and I do it straight, I'm anatomically\nlimiting the amount of extension I can get of my humerus behind my body. Versus if I changed the position, bend the\nelbow, and keep going back. I get much more extension on the arm back\nbehind my body than when I go straight. So that would say this is probably a reason\nwhy you wouldn't want to do the rear delt fly. But there's another reason why you wouldn't. The rear delt, like the middle and front delt,\nhas a high capacity to handle some load. It's not the weak link that it's made out\nto be where I can only handle 5lb and 10lb dumbbells to do it. Guys, it's got a lot higher capacity for strength\nif you would allow it to. But when I take this and do a straight arm\nreverse fly, what I'm doing is, because I'm increasing the moment arm by extending the\nelbow out on the rear delt, I'm dramatically inhibiting its ability to lift any type of\nweight. It's very difficult. This 5lb weight gets heavy when I lift it\nout straight like that. So, what we do is not worry about keeping\nit straight. We want to get to a bent arm setup. The best way to do this is with the classic\nback exercise, the seated row. No doubt, this exercise will build your rear\ndelts as fast as possible because we're going to be able to load it appropriately. Now, there are a few things you're going to\nhave to do. If I were to get into a seated row setup here\n– this is different than what you might see at a gym where you have the plate and\nyou can put your feet on it. But this is what I have to do here. This is my counterforce for my feet. The fact is, we need to choose the right attachment. A lot of you will go and use this. We take this and we pull, and we might feel\na little bit the next day in the rear delt, but we're doing this as a lat exercise. And, of course, it does train your lats because\nyou're getting a good stretch on your lats out here, and then pull back, adduction of\nyour arm into your side. The issue with this is the handle. We know if I bring the handle, this is about\nas far as I can get. This is going to limit the amount of extension\nwhere I can get that arm behind my body again. Remember, just focus on here to here, how\nmuch extension can I get back? If this handle is used, we're going to get\nstuck here. Now you might say \"Just use a straight bar.\" All right. If I use a straight bar instead of being stuck\nhere, out here, now I can get to here. What this doesn't solve is the secondary issue\nhere. That's the fact that it still keeps our elbows\ntight to our side. I mentioned this being a lat exercise. The tighter to your side your elbows are,\nthe more activation of the lats in favor of the rear delt. The way we want to get our rear delt to take\nover here and do as much of the work as possible is to get those elbows out high. Get out of adduction. Get out of what the lats do. Let the rear delts to the extension of the\narm. So, what we do is add the long bar attachment. That's what's going to get us the best effect\nbecause the long bar allows us to grab out wider, which will take our arms away from\nour body, out of adduction. So, this is what it all looks like when you\nplay it out for real. We obviously have a lot heavier weight than\nanything we would handle in some rear delt fly setup. We're setup nice and tall, arms are out wide,\nand we're going to try to get this upper arm back as far behind our body as possible. Again, the elbows are high. They're not tucked in down here. They're high. We come out, we come, and drive them back. You can see that rear delt fired up. I can tell you, if you haven't done a seated\nrow in a long time if you do these your rear delts will be on fire for the next five days. Especially if you haven't done them for a\nwhile. And I'm not saying you're not working your\nback. You can see every muscle in my back working. It's just that, preferentially, because of\nthe elbow placement and because of our focus on getting the elbow back behind our body\ninto extension, we're really making the rear delts work here. And because the load is substantially higher\nthan what we've probably used on the rear delts, you're going to see some quick increases\nhere. Both in the strength of the rear delt and\nalso the size response to it because of the overload. The fact is, if you're trying to train your\nrear delts – which you should be. Just because you can't see them doesn't mean\nyou don’t need to develop them. You have the option to see a lot faster growth\nif you stop thinking about just the things that everybody else does, like those lame\nrear delt flys. There are much better options, as you've just\nseen here. Sometimes it's a classic back exercise. Guys, I hope you've found the video helpful. If you did, leave your comments and thumbs\nup below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you're looking for step by step programs\nwhere we make exercise selections by applying a level of science to what we select – there's\na reason and meaning for everything we do in the gym. You have to apply that to your programs if\nyou want to see the best results from them. All our programs do that at ATHLEANX.com. In the meantime, if you haven't already done\nso, please click 'subscribe' and turn on your notifications so you never miss a video when\nI put one out. All right, guys. See you soon."
}