{
    "id": "bXVeJaa4WcM",
    "title": "The Fastest Way to Big Biceps (WORKS EVERY TIME!)",
    "description": "If you want to build big biceps then you need to stop only focusing on doing curls. In this video, I'm going to show you how to build ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to tell you how to get your\nbiceps to start growing a lot faster. It doesn’t necessarily involve a lot of\nthis. I know you guys know I’m a fan of heavy\nbarbell curls and utilizing a cheat curl to overload the eccentric, but we know that’s\nonly one mechanism of creating overload. We know that there are a lot of other ways\nto do that. What I’m going to tell you here is, you’re\ngoing to want to trade in that bar for this bar if you’re looking for faster gains. I’m going to tell you the reason for that,\nbecause there is a very distinct reason for that, but it’s going to require that you\ndon’t just do a chin-up because there are some issues with a chin-up – my favorite\nexercise – when it comes to bicep development. There’s a way to change the chin-up if you\nwant to enhance or speed up that bicep development and it requires a few modifications. So, here’s what we do. The first thing is, obviously, with a chin-up\nwe’re going with an underhand grip. But we need to look at how wide that grip\nneeds to be and, more importantly, how wide the grip is in relation to the elbows. Anatomically we have something called the\n‘carrying angle of the elbow’. The carrying angle is in place to allow us\nto carry something at our sides and not interfere with the locomotion of the legs. So, we know that the angle, if you look at\nthe upper arm, comes down and veers a little bit to the outside. So, if we have something in our hands it wouldn’t\nhit the legs, as I’ve said. Well, when we curl our arm up when we train\nour biceps and bring our elbow into flexion here, the same thing happens here. The arm doesn’t go straight up, or even\ninward. It goes a little bit to the outside of the\nshoulder. So, what we want to do is be able to mimic\nthat so we can maximally target the biceps. So, when we get to the bar and take an underhand\ngrip, we want to make sure the elbows are more inward in relation to the hands. Hands outside the elbows. We can’t manipulate this. Once we grab a bar it’s fixed. We can’t change that. If we had a dumbbell, we could change a dumbbell\nin space as we curl it, but here we can’t. So, we have to set it up that way. The next thing we want to do is, we’ve talked\nabout this tip before, of involving the biceps more by deactivating the forearms. We can do that by bending back the wrists\na little bit. Now, be careful when you do this. You want to make sure you’re not just gripping\nthe outer fingers because that could lead to some medial elbow pain that we’ve talked\nabout before. So, you want to grip the bar, you just rotate\nbackward. Just like this. Grip it in the palm, grip it in the palm,\nrotate backward, your hands are outside your elbows. Now as you start to curl, this is where all\nthe difference is made. When I curl up to the top here you don’t\nwant to collapse yourself down. People talk about getting the chin over the\nbar, but what that’s really referencing is your chin higher than the bar. Not necessarily over the bar this was because\nwhen you close down that angle you take a lot of the stress off the bicep and that’s\nsomething that’s going to take away from the effectiveness of what we’re trying to\ndo here. We know if I took a dumbbell and curled it\nall the way to the top, all the way to where it was touching my shoulder here, I could\nstay here for a hell of a lot longer than I could if I backed it off 10 or 20 degrees,\nkept more of an angle here. And therefore, more stress from the force\nof gravity downward onto that dumbbell, onto my biceps, which is what we’re trying to\nget. So why do we do the same thing here? We want to keep that angle open. So, as we come up to the top, we keep the\ndistance. That distance is key. That distance makes a huge difference in what\nwe’re going to get from this exercise. So not closing down but keeping that distance. The fourth thing I do is start to lean my\nbody back a little bit because the motion is not even straight up and down, but it’s\nthis. Up, and towards it. Lean back a little bit, come up, and toward\nit, never closing that angle down anymore than that. But you’re basically curling your body. If had a curl bar down here I’d be going\nin an arc. If I’m taking my body here with my fixed\nhands, I have to arc my body. So, it looks like this. I’m down, in here, up, I come a little bit\ncloser. Down and away, up and closer. Sown and away, up and closer. Just like that. You can see it’s putting a number on those\nbiceps. Now why does this work so well? We talked about an alternative mechanism to\noverload. We talked about eccentric muscle damage being\none of those options, but we also talked about progressive overload. You’ll be shocked at how much this will\noverload your biceps in a novel, and unique way because if you’re used to just curling\ndumbbells or curling a barbell, you’re likely not even getting as much stress on your biceps\nas this is going to do. If you weight 180lbs, some of it’s going\nto be unweighted by your lats. We know that, but a great deal of it is going\nto be born by the biceps, especially after you make these modifications. That might equate to 120lb load and you’re\nused to curling 100lbs on a curl but are unable to curl a 120lb weight. It’s the ability to manipulate your bodyweight\nin space here that allows you to work with those strength curves and how they adjust\nalong the path of this exercise that will allow you to start performing this with a\nheavier load. And therefore start to see results you haven’t\nseen from doing the other exercises that don’t involve this. The final point I’ll make on this is, as\na progressively overloaded exercise, what you would do is add weight when able. If you can do 10 or 12 or 14 of these without\na challenge, it’s time to start adding more weight. You guys know I’m a big fan of this, even\nworking up to 3 plates on a weighted chin. The fact of the matter is, you need to make\nsure you’re always challenging yourself. But when you make these modifications, I promise\nyou, you’re going to see faster gains in your biceps than you ever have before. If you’ve found this video helpful leave\nyour comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you. If you’re looking for step by step plans\nthat, at times, we incorporate bodyweight as a resistance option because we know it’s\nthe best option for what we’re trying to accomplish. We work them all in with all our barbell and\ndumbbell exercises as well. They’re all over at ATHLEANX.com. In the meantime, if you haven’t already,\nplease subscribe and turn on your notifications so you never miss a video when we put one\nout. All right, guys. Talk to you again soon."
}