{
    "id": "c2bof21Me3I",
    "title": "When to Change Your Workout (DON’T MESS THIS UP!)",
    "description": "Knowing when to change your workout and when not to is one of the most important things you can get right when it comes to your ...",
    "transcript": "JESSIE: Hey, Jeff! JEFF: Yo?! JESSIE: Uh, I want to run something by you\nreal quick. JEFF: Sure. JESSIE: So, you know how you were saying 'keep\nthings fresh, and interesting'? I think you can do it with the YouTube intros. I think the \"What's up guys? Jeff Cavaliere\" has gotten a little stale. JEFF: Okay. Well, what have you got? JESSIE: Well, first off. JEFF: Dude. You're just staring. JESSIE: Yeah. They love that. I mean, that's what I do. They really like that. Okay, how about this? \"Jeff Cavaliere, ATHLEANX.com\"? JEFF: You want me to do jazz hands? JESSIE: Even better: \"What's up guys?! Jumpin' Jazzy Jeff, ATHLEANX.com\". Wait. You grew up in the '90s, so you like '90s\nmusic. I got it. Do it like Creed. \"What's up-a, everybody?! Jeff Cavaliere-a, ATHLEANX.com-a\". I'll keep thinking of them. I've got plenty of good ones up here, bud. JEFF: What's up guys?! Jumpin' Jazzy Jeff – ah, no. It ain't working, Jessie. I ain't changing, but I will tell you this:\nwe're going to talk today about change and change is one of the most common questions\nI get asked. That is: \"Jeff, how often should I change\nmy workout?\" First of all, we have to understand 'what\ndoes that mean?' Because there are a lot of things that you\ncan change. You can change the exercises that you're doing. You could change your training focus. You could change the way you're doing the\nexercises. You could change so many things about – the\ntime of day that you train. So many aspects and variables that you can\nchange, but the most important thing is that change, sometimes, is overdone, and other\ntimes it's not done often enough. So let me explain. If you are a beginner, one of the big problems\nwith beginners is this obsession with wanting to try all the new things. There's all the shiny objects, we try to grab\nthem all, and unfortunately it has a detriment to your workout progress because a beginner\nshould be focused on a select few exercises, and worrying about getting better at doing\nthose exercises. Now when we started with Jessie and his transformation,\nwe weren't doing all the fancy exercises. We were trying to do the basics, and stick\nwith those, and help him to learn how to perform those exercises. Within those, we do have some elements of\nchange. Here we could work on increasing the weight\nthat he's lifting on those exercises. So obviously, increasing his strength. We could alter the tempo of how he's doing\nthose exercises as he gets more comfortable with them. We can work on, most of all, trying to increase\nthe intensity that he can deliver during those exercises so with each new set, each new workout,\nhe's able to deliver more, and more tension, and intensity on the muscles he's trying to\ndevelop. But when you try to do more, and more exercises\nyou're asking yourself to learn how to do things that you're really not that good at\ndoing. The more exercises you try the more likely\nyou are to not really be good at them. So it's better to focus here, on these things,\nwith a limited number of exercises. Now, when you've become more advanced you've\nlikely done all the training variables. You've changed your rep tempo, you've increased\nyour volume, and decreased your volume, you've changed the exercises by increasing the weight\nthat you can lift on them, and you've progressed, and overloaded where you could. However, that's the key. At that point you have likely topped out in\na lot of exercises. At least the drastic changes you're going\nto be able to make in your strength. So here is what I think increasing the exercise\nvariation is one of the bigger things that you can do to start seeing continued results. So increased exercise variation. So now, if you think about that, have you\never experienced – you go to the hotel gym and they don’t have much there for you to\nwork with, and you use whatever you have at your disposal there? You're doing bench-press machines, you're\ndoing pec-deck, or something. You're doing whatever is there just because\nthat's all they have, and you still want to get in a good workout. They don’t even have heavy enough dumbbells\nfor you to really get the normal workout in that you wanted to do. So when you do this, two days later you can\nbarely move in the hotel room because you've done things you haven't done in a long time. Maybe, as an alternative, you've watched me\ndo an exercise here, on this channel – let's say a face pull, recently. You're like \"Oh, wow! I haven't done face pulls in a long time\",\nand you do the face pulls, and even though you're fine with carrying tons of weight all\nthe time, regularly, your traps, your upper back is sore as shit from doing the face pulls\nbecause you have become too efficient at the movements. That's what we're trying to get here. As you become more advanced your goals should\nbe to try and find ways to make yourself less efficient. Your bodies are masters of compensation. If you hurt yourself, if you hurt your knee,\nwhy does your back start to hurt? Because somehow, some way, your dumb ass is\nstill going to the gym and figuring out a way to hobble around on that knee in such\na way that it passes that pain onto somewhere up the chain. And you figure out a way. \"Look! I'm squatting, guys! My knee's not hurting me anymore.\" Meanwhile, my back is killing me. Our bodies will always figure out a way to\ndo what we're not really supposed to do. They're going to adapt to whatever you do. You have to figure out a way to make sure\nthat you're forcing it to get used to doing something it's not used to doing. That comes in with the next concept here of\nexerphobia. So, when we talk about change this is one\nof my big ones. How many exercises do you like? Maybe I should have said 'what is your favorite\nexercise', but how many do you like? In this case, if you can start telling me\n\"Oh, I like to do this, this, this, this, this, and this\", then likely, it's time that\nyou stop doing those exercises, or at least dial it back for a period of time. When you start to like an exercise it's because\nyou've become very efficient at doing it, and anything that becomes very efficient is\nsomething that we actually start to like. If you have a phobia of doing squats, but\nyou like doing deadlifts it might be time to start doing squats because there's a reason\nwhy you like that. Now, I'm not talking about – let's be very\nclear – I'm not talking about 'you can do squats, or you can do deadlifts, but you can't\ndo squats because something is killing you, or hurts, or your back is bothering you, or\nyour knees are bothering you'. Likely, there's something that's causing that\nto be the case and that's not the same thing. When you are picking based on the fact that\none of the exercises is difficult for you, just in terms of your effort level, but one\nof them, you're actually really good at; that is when you want to start using them. So stop fearing those exercises and instead,\nidentify the ones that you don’t like. Those are the ones I want you to start doing. Again, just take the ones you like out for\na little time, and go back to them, and you'll get that same response when you go back to\nthem – that change – that actually is good for sparking new growth, and adaptation. Finally, a comment on fat loss. Again, here, metabolically our bodies are\nalways going to try and become very efficient at what we do. If you think about the first time that you\nmaybe did a box jump, you're doing box jumps, you're using a lot of effort to get yourself\nup, on the boxes. You aren't really good at timing your jump,\nat timing your arms with your legs to get a higher jump. So all that inefficiency is causing you to\nactually burn more calories because you need to put in more effort to execute every, single\nrep. But as you become a box jump king – because\nthat's all you do over, and over, and over, and over again – well now, you're actually\nburning fewer calories doing the same activity because of that efficiency. So what should you be doing if you're trying\nto spark fat loss? Try to find some activity that you haven't\ndone in a while. You should always be trying to vary up the\nthings that you do for fat loss. Especially if you're going to be doing them\nat a higher intensity because it doesn’t take a lot of complication here to walk on\na treadmill, or to go long-distance walking 45 minutes, or an hour. I'm talking about more of your burst training,\nyour HIIT training, where you're trying to burn calories at a maximum, in a shorter period\nof time. You should constantly be trying to vary the\nexercises that you do. So for here, fat loss; always increase variety\nof your exercises. So guys, as you can see here, again, there's\na lot of parameters, and it all depends on what you're trying to train for. It also depends on where you are in the training\nstage. If you're a beginner, or if you're more advanced\nthere's things that you want to do. There are always variables that you want to\nchange. But the fact is this: remember, your bodies\nare pretty damned smart. They know how to adapt, and they're always\nlooking to get you to stay the same. You have to be smarter than it, and you have\nto force change at every opportunity, knowing exactly the right type of change to make at\nthe right time. Guys, if you're looking for a program that\nlays it out, and helps you find where you're at in that training cycle – whether it's\nbeginner, or advanced, and knows whatever it is you're trying to accomplish – I can\nhelp you meet those goals, and get there a lot faster. If you click on the link below this video\nour program selector tool will do just that. It will help you shortcut your process to\nget you to the point where the training plan sets in, and allows you to make your progress\nas you go along. That's over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. If you have any other suggestions that were\nbetter than Jessie's, as to what I should do on the intro, save them. I don’t want to hear them! I’m not changing my intro! All right, guys. I'll see you back here again soon."
}