{
    "id": "CEmHlMyz2-c",
    "title": "22 Days to Better Glutes! (GLUTE WORKOUT)",
    "description": "If you could use better glutes but you're not sure what glute workout to follow, your search ends here today. In this video, I'm going ...",
    "transcript": "What's up guys, Jeff Cavaliere, athleanx.com. \nTake a look at this picture for me and tell me,   do you look like either one of these people? \nIf you do, well, we've got our work cut out   for us. But guess what? You're in a good place \nbecause I've got a 22-day plan that's going to   kick start you and get you on the right path to \nhaving a better backside, stronger looking glutes.   And coming from a realm of athletics I will tell \nyou this, it is important, not just important,   critical that an athlete has a well-developed \nset of glutes because of the powerhouse,   the engine that drives high level performance. \nWell, ask not what I can do for you, ask what you   can do for yourself-- Actually, we're going \nto do this together because I'm going to go   step by step plan, as I said, every single \nday for 22 days exactly what you have to do,   removing all the guesswork so you \ncan get this done and get it right.   You ready? Let's start breaking down \nwhat are you going to do day by day. \n  All right, so in all fairness, I think we should \nstart with two important caveats just to make   sure we have all of our bases covered. If you \nlook in the mirror and this is what you see,   then you're really actually need to add an \nextra zero or two to the 22 days in order to   get this looking right. Because what you have \nhere is a body fat accumulation issue that is   based in poor nutrition at its roots. There's \nno way around it guys, you're going to have   to figure out a way to eat much better than you \nare right now to drop your body fat levels down,   to even see what you're working with. \nAnd of course, while you're doing that,   you can always be training, but that \nbrings us to our second caveat, and that is   if you're attempting to build up your glutes right \nnow, but you are not squatting and lifting and   they're not part of your training at all, I would \nrecommend you start there, give it a fair shot.   Some people still can't do it even after doing \nthat and this is going to be perfect for you. \n  Or if you're just looking for something to \nchange it up, this is going to be exactly   what you wanted. But I would say if you're looking \nfor a plan where we incorporate squats, deadlifts,   I have a free Push, Pull Legs that I just \nput up here. You can find it by clicking   this link up here or by clicking this link at \nthe end of the video. With that being said,   let's start breaking down the plan now for \nthose are looking for above and beyond. \n  All right, so with all of our 22-day plans, we \nstart with a schedule. I'm going to make this   really, really simple for you to follow, we've got \nday one through day 22 and both day one and day 22   were new simple test. It's just the mirror test. \nYou're going to take a look at what you're looking   like right now and make your own assessment. Do \nyou like what you see? Is it sagging? Is it flat?   Does it look a little bit, I don't know, dumpy \nfrom behind? Or maybe you have a confidant or a   friend of yours will be willing to take a picture \nand give you some feedback. Whatever it is,   just make sure you don't let those leak out. \nAt the end here, though, we're going to look for   improvement. On day 22 come back and compare. And \nwe're going to do here is we're going to build   up that backside of yours is going to improve the \nglutes by following a training plan that includes   a lot of strength training, because we know \nthat if we can build the glutes up, we can do   a better job of improving their appearance. And \nwe're going to hit them in two different ways.   In a glute focused day and a hamstring \nfocused glute day. You might be thinking,   why are we focusing on hamstrings? Because \nthe secondary function of the hamstrings is   to extend the hip, which is going to impact the \nglutes directly. And thinking that the hamstrings   job is simply to bend the knee is actually \na flaw. I'll cover it in a different video,   but in function, the hamstring is actually just \nsuccumb to gravity to bend the knee. We want to   focus on what they do in terms of working with the \nglutes to really drive better looking glutes. \n  So, we're going to break it down in those two \ntraining days and we're going to simply alternate   them throughout the training days, on every \neven day. So, on days two and four, you're   going to have your first of two glute focused and \nhamstring focused strength training workouts. And   days six and eight you're going to come in \nwith the second version of the glute focused   and hamstring focused workouts. From there, \nyou're going to simply continue to alternate   these all the way down until you've exhausted the \nremaining even days in our 22-day calendar. \n  Now, what do you do in the days in between? Either \nyou take a day off, which I'm going to recommend   if you're feeling fatigued, or you add in the \ncorrective work, the all-important corrective   work. See, I mentioned before that people that \njust do squats and dead lifts sometimes don't   get the results that they're looking for. A lot \nof times it has to do with simply training in   one point of motion, the sagittal plane. This is \nnot going to cut it when you want maximum glute   development. You have to involve the other \nplanes that the glutes prefer to work in,   which is the transverse and the frontal plane.\nSo, on these days, we're going to focus on the   smaller but yet still important muscles of the \nhip and glutes that are going to help to drive the   overall appearance and performance. We're going \nto simply alternate two versions of our corrective   exercises on days three, five, seven, nine all \nthe way until we've reached our last empty spot.   And remember, if at any time you're feeling \na little bit extra fatigue, you can simply   utilize one of these days as an off day. \nSo, in terms of commitments and what I expect   of you, very little in the way of equipment. \nSome dumbbells, something to step up, arm   your own body weight in a barbell ideally, or you \ncan simply swap those out for dumbbells as well.   In terms of time commitment, no more than 20 \nminutes is what is going to take to get the   job done here on any given training day. Now, if \nyou are training at the same time, you have leg   training as part of what you're doing, which you \nshould, I would set that aside for now and focus   on this as your leg training. Your quads are still \ngoing to get worked through some of the exercise   selections that we're using to work them alongside \nthe glues in an indirect way. No stone left   unturned here, guys. I've got you covered. Let's \nstart breaking down the workouts day-by-day. \n  All right, so let's start with those glute \ndominant days, the ones that are scheduled   for days two and day six and then repeated \nthroughout the remainder of the calendar here.   We're going to start here with our activation \ndrills. And this is, again, some of the stuff that   people don't do. They go right into glute work \nand they have something called \"glute amnesia\"   they don't even have an ability to really connect \nwith the muscle itself. And I'm sure you could do   the test yourself. If you were to stand up right \nnow and simply try to push one leg back behind   you and then push the other one really trying to \ncontract your clues, it's going to feel different   right versus left and almost 99% of you. Because \nwe don't have a good foundational connection   with our glutes in the first place, which will \noftentimes lead to a lack of development. \n  So, if we start with some activation \ndrills, we do the following: 30 seconds   each of in this case, our Toe Down our Toe Stab \nHip Lif and 30 seconds of our Toe Up Hip Lift.   And we're going to do this on each side so \nyou're looking at two minutes of committed work   just to try to engage the glute medius, the \nhip adductors, to get those glutes a little   bit more alert as to what's coming next. And then \nwe start with our basic foundation of exercise and   here is going to be the Barbell Hip Thrusts. \nAnd when I mentioned the glute driven exercises   where you can bend the knees and sort of take the \nhamstrings into this flex position, then the glues   to the majority of the hip extension work and this \nis the best exercise for doing it. It's the first   instance where I said you could use a barbell \nhere ideally, but if you don't have it, you can   simply rest a couple of dumbbells on your thighs \nand do the same exercise. Three to four sets of   10 to 12 is what we're looking for here.\nWe move into the second exercise here and   this one is done for time. This is called \nthe Long Leg March. And again, we're really   driving hip extension by getting up as high as \nwe can and trying to keep it there and hold the   glutes up high while we lift one leg off the \nground. It becomes challenging, I understand,   but it's something we could work into. If you \ncan't really extend your legs that far out,   you can only shorten them a little bit, but \nyou're doing three sets of one minute apiece.   And then we come into that quad exercise I \nmentioned before. How do we continue to give   some stimulation to the quads while still working \nthe back side? The Step Up is an amazing exercise   to do just that. But we preload it and you preload \nit by simply leaning forward a little bit. \n  As we angle our body forward, we preload \nthe glutes as they activate to sort of   counterbalance and prevent excessive \nmotion in the forward direction. So,   we can feel it right away just by doing that. \nAnd then we perform our step ups from there,   two to three sets of 10 on each leg, making sure \nto get all the way up, drive the opposite knee   through to get through full hip extension. \nWe move on to the second glute focused to the   one that's going to first appear on day \nsix and here we're just going to make a   slight difference. We're going instead go \nfor activation in the standing position.   We're going to do the Toe Up Hip Swing and \nthe Toe Down Hip Swing. And for each of these,   we're getting rotational stability, we're working \nthe upper leg and the down leg, I cover these in   this specific video. I'll think these for the end \nhere so you can see more the details on what these   will provide you. But these will actually \nhelp you to activate those groups and get   them awake for what's coming next? And that's \nthe single leg version of the hip thrust. \n  So now why are we doing this? Because we want \nto expose this right and left and imbalances.   Remember, I had to do that test where you tried \nto do that hip extension right versus left and   you likely felt the difference. Well, here we want \nto make sure that we're not hiding anything. So,   by demanding that you do this single leg \nversion of a hip thrust, we will find   where those weaknesses are and we're going to \naddress them head on. Here you're going to go   slightly lower on the reps, still three to four \nsets this time of eight reps on each leg.\n  Which brings us to the second exercise, and it's \none of my favorites, it's called the Dumbbell Frog   Press. And what you do is you take basically \nthe weight that you used on the step ups,   you combine them and that's what \nyou get to use in one dumbbell   across your hips. And the key here is the \nposition of the feet and legs in the exercise.   You're not keeping your feet flat, instead, \nyou're leaning on the outside of your foot,   externally, rotating your hips and now driving the \nmovement, not through the glute max, but through   the glute medius. And I mentioned those really \nimportant muscles that oftentimes get overlooked,   this is what I'm talking about. You want to make \nsure you're developing all the muscles of the hip   if you want to round out literally the appearance \nof your butt. So, we do this once again in three   sets, one minute a piece, really trying to \ndrive the intensity of the contraction and   make sure you're feeling it in the right place, \nwhich is more on the outside of your hips. \n  And we come into our last exercise here from \nthat quad focused exercise and we're going for   the Low Bar Squat. And we know that the position \nof the bar on your back will dictate the position   of your torso. The lower the bar gets, the more \nyou're going to have to lean your body forward.   And this will actually start to ignite and light \nup the backside for the same reason that it did   on the Leaning Forward Step Ups. Do three sets of \n10 to 12 reps to round out the second workout. \n  Which brings us now to those hamstring driven \nglute focused training days. And here we start   with our foundational exercise of the basic RDL. \nAnd we know that this is now hamstring driven   because we're getting that good pre-stretch \nthe hamstrings in every single repetition.   But if you focus closely on how this happens, you \nreally aren't trying to bend your knees very much,   you just soften your knees and drive \nthis primarily through a hip hinge. And   through hip Hinge, we get hip extension and hip \nextension we get glute development. Once again,   driven by that free stretch of the hamstrings, so \nslightly shifting the focus, but not the overall   impact of what we're trying to achieve. You \ndo three to four sets of 10 to 12 repetitions   and you move on to the next exercise. \nAnd today we're doing something called the   Prone Frog Curl. No weights are needed here. You \nsimply lay on your belly and you start by lifting   your thighs up off the ground to ignite and \nactivate those glutes again into hip extension.   And while holding this position, bend your \nknees by bringing your feet closer to your butt.   You'll start to feel this really, really light \nup and tighten up inside that glute medius in   the rotators of the hip. I want you to do this \nfor three sets of one minute apiece, resisting   the burn, really trying to make sure that you \ndon't allow the hips to lower even as you flex   the knees and bring the feet closer to your butt. \nDrive up through hip extension and maintain that   on each and every rep for the entire minute. \nWhich brings us to the third exercise of the day,   the one that's devoted to quads but has \nthat indirect glute involvement as well,   and it's a Lunge. But it's a lunge variation and \nit's all about the variation that gets this thing   to work the way we want it to. This is called a \nCurtsy Lunge. So instead of dropping straight back   and loading just the front quad up, we're going \nto step back in across, creating an imbalance that   will demand that we have control of the hips in \nthe frontal plain, side to side. We know once we   do that, we work on the control of the abductors \nof the hip, which wrap around into the glutes,   tie in perfectly and help to round out that \ndevelopment, like I said before. You're   going to do two to three sets of 10 repetitions \non each leg here to wrap up this workout. \n  Which brings us to our fourth and final workout \nin our strength base training days and this is   the second variation of our hamstring dominant \nday. This goes on day eight and then continues   to be repeated throughout the rest of the days. \nAnd here we start with the single leg version of   the RDL. So, we're still going through that same \npattern, we're still relying on the activation of   the hamstrings, which will drive hip extension, \nbut we're going to do it one leg at a time to one   more time expose any imbalances you might have. \nWe're going to do three to four sets of eight   repetitions on each leg before we transition \ninto maybe one of my favorite exercises of   all time, and you could do it with just your \nown body weight. It's called the Slick Floor   Bridge Curl. And all you have to do is get some \nsocks and a slick floor, like a hardwood or tile,   and you're off and running. You get up into this \ngood high bridge position and you try to keep it   there the entire time. As you allow your feet to \nstart drifting out and away from you, lengthening   at the hamstrings and straightening out the knee. \nYou do three sets of one minute, once again, don't   let those hips drop even for a single second. \nWhich brings us to our final exercise of the day,   and this is the Dumbbell Bulgarian Split Squat \nout of the sprinter position. What are we doing?   Again, pre-loading the glutes by not just keeping \nour torso upright, but by leaning slightly forward   to pre-reactivate the glutes and load them more \nfavorably than the quads during this exercise.   You do two to three sets of 10 on each \nleg to round out this workout. \n  And that leaves us with just our two \ncorrective workouts on each of those days,   guys, just two exercises. The keys to perform \neach and every repetition as if it's the only   one that you're doing. Remember, you're going for \nhigh quality contractions here to drive the mind   muscle connection with the glutes that's missing. \nAnd on the first day here, we have our Reverse   Hyper paired up with something called a Hip Drop. \nIn the Reverse Hyper you simply position yourself   on top of a bench and you're going to drive your \nlegs together and up into good hip extension,   focusing on that good glute contraction.\nAgain, 15 to 20 repetitions, good squeeze and   hold at the top, lower down slowly. The Hip Drop, \nyou're going to focus on one leg at a time. And   again, we're working now on that frontal plane, \nthe abduction of the hip side to side. You stand   on that foot outside the wall, you let your hips \nget lazy and just relax and drop out. Now you want   to do is slide them back towards the wall at the \nsame time, you're likely going to lift up a little   bit, so the hip that's closer to the wall will \nrise. But you get a really tight contraction in   the leg that's on the ground in the outside of the \nhip if you're doing this right. Again, 15 to 20   repetitions, high focus on quality contractions, \nnot just simply ripping them out. \n  The second corrective Day has two exercises as \nwell. The first one is the Internal Rotation   Hip Lift. And this is an awkward one because \npeople are extremely weak into internal rotation   of the hip. And the way you do this, as you get \ninto this position here, you get your back leg   at a 90-degree angle. Lean all of your body \nweight towards that front leg, and all you're   trying to do is lift your hip up off the ground. \nEven if you can get it three or four inches,   I'm happy many people will find that they can't \nlift it at all. If that's you, you need to work   on the strength here and you could actually \ncheat this a little bit by leaning more and more   towards the direction of that forward leg. \nFifteen to 20 repetitions on each leg, really   going for this high quality contractions. \nAnd then we go for that last exercise and this   is called the Fire Hydrant. You probably seen \nthis one before, but with a slight tweak to   make it even better. You get in this position, \nyou externally rotate the hip this time as we   lift up as if we're peeing on a fire hydrant, \nif you're into that sort of thing. And then   you kick your leg back into extension with the \nleg rotated. You'll feel that tight contraction   squeeze once again in your outer glutes if you're \ndoing this properly. Three sets of 15 to 20   on each leg to round out your training day.\nSo, there you have it guys, a 22-day game plan   for building that butt of yours, to getting \nbetter glute development, for either feeling   better performance or simply looking better in \nthe mirror. Remember, you're going to want to   check out those gains in the mirror on day 22 and \nthere's nothing stopping you from keeping those   improvements coming. If you're looking to take it \nto the next level guys, we have step by step plans   designed to train you like an athlete, which \nmeans a lot of focus on building, high powered,   high performing lower bodies. You can find them \nall over at athleanx.com. If you found the video   helpful, make sure you leave your comments and \nthumbs up below. What else do you want to see   me cover? I'll do my best to do that for you in \nthe days ahead. And also, if everyone does so,   make sure you click Subscribe and turn on \nyour notifications, so you never miss the   new video when we put one out. \nAll right guys, no more \"ass nots\"   not after this video. Good luck and \nlet me know how you do. See you.   "
}