{
    "id": "cfetualiJqs",
    "title": "15 Minute Fat Burning Home Workout (NO EQUIPMENT!)",
    "description": "If you have just minutes and are looking for a fat burning home workout that will get your heart pumping and have you breaking a ...",
    "transcript": "What's up, guys? Jeff Cavaliere. Athleanx.com. And \noh man, do I have a doozy for you today. You see,   that thumbnail of me, that actually was me after \ndoing exactly what you're going to do here today.   And the only thing that's negotiable, because \nyou're going to look just like that, is whether   you look like that in say, eight minutes, around \n15 minutes, or maybe even around 23 minutes.   Because this is a follow along workout that you're \ngoing to be able to do whether you're a beginner,   intermediate, or advanced that is going to knock \nyou on your ass. And I'm not ashamed to say that   it did to me. And the fact is, guys, when you're \nlooking for that good conditioning workout where   you want to break that sweat, where you want to \nfeel like your heart's pumping through your chest,   this is going to do it every single time. So what \nwe're doing is we're breaking it down into three   areas. We have our lower body, the upper body, and \nthen a core segment of this. And basically you're   going to have four exercises per segment. These \nare the ones you're going to be doing. I'm just   going to give you a little glimpse here because \nyou're going to feel the torture of them all as   you do them. When we hit the lower segment here, \nwe're going to have the split squat lateral hop,   the ratchet squat, the prisoner walk-up, and \nsomething called the side winder. Now the first   three of these exercises are going to be done \neither for 15 seconds if you're a beginner,   20 seconds if you're intermediate, or 25 seconds \nif you're advanced. And then you get to rest   the remainder of that 30 second time. So if \nyou're a beginner you're resting 15 seconds,   if you're intermediate you're resting ten seconds, \nand if you're advanced you're resting a measly   five seconds before you get into the next \nexercise. Okay, so you're going to be moving   through those exercises. The last exercise \nin that group and they're the side winder,   that's the burnout, and you've got to \ndo that for a full 30 seconds. Once you   finish that entire segment there, you take a \n30 second rest, and you move on to the next,   which is the upper body. And here, we're doing \nthese exercises. We've got the hover hop,   the step through push-up, the push-up toe tap, \nand then finally the hover pulse. And it looks   so little but it's so damn challenging because \nit's in that last spot. Again, for the first   three here, if you're doing it at the beginner \nlevel, 15 seconds a piece, with 15 seconds rest,   20 seconds a piece at ten seconds rest if you're \nintermediate, and 25 seconds a piece with five   seconds rest if you're advanced. We all do the \nfinal exercise here for 30 seconds. You get that   30 second rest and you move on one more time \nto that last segment, which is for the core.   And here the exercises are the twisting piston, \nthe black widow knee slides, lateral mountain   climbers-- changing the way we do this, always-- \nand then finally the V-sit pulse. And once again,   applying the same rules to how we do them. Now, \nhere's the cool part: if you're a beginner,   your work is done. If you're intermediate, you \ngot to go through again. And I actually made it   so simple for you because I'm going to put a \ntimestamp in my pinned comment below that you   can hit that's going to bring it right back to the \nbeginning and you go through it again. And a few   advanced guys out there, you get to go through \nit two more times. So once you're done with it,   you hit that timestamp one more time, you go \nthrough and you finish it one more time. Guys,   this is not easy, like I said, it left me up \nagainst this wall-- proudly against this wall   because I laid it all out there. You're going to \ndo the same thing here. Let's get this thing done.   So there you have it. An absolute gut-buster \nhere, guys. Like I said, this one is meant   to bring you to your knees. Don't have shame \nabout that. Just feel proud that you actually   got through it. And remember, you can always bump \nyour way up, beginners can move to intermediate,   intermediate can go up to advanced. The fact \nis always striving to get better is the key.   If you're looking to get better, guys, I have a \ncomplete program, it's called Athlean Zero. There   are no equipment requirements at all. And as we \ndid in this workout here, no equipment required,   very little space required. You can get the job \ndone if you know the right exercises to do. We   have them all step-by-step in that program. You \ncan get it at Athleanx.com. If you found the video   helpful, if you like the follow-along format, \nleave a comment below, let me know, and I'll   do more of them. In the meantime, if you haven't \nalready done so, click subscribe and turn on your   notifications so you never miss a new video when \nwe put one out. All right, guys, see you soon. "
}