{
    "id": "cqhUTj2PE1E",
    "title": "Can You “Spot” the Problem?",
    "description": "Did you ever wonder whether using a spot when lifting would have gotten you more gains in the long run than having not used ...",
    "transcript": "Good, good. One more, one more, bro, you got this, you\ngot this one more. Oh, oh, okay. Bro that's two. Dude, I have like five left, what are you\ndoing? Bro, it looked like you needed help. All right, push, push, push, push. You got, bro. You got it. You got to tell you, it's all you, bro. Just push, push, push, push, push, push, push,\npush, push, push. You got it. Oh, Jesus. All right bro, let's take these weights for\na tour around Disney World, let's go take a spin up and down the roller coaster. Make those weights, pay your mortgage. You got taxes, these weights are paying them,\nbaby. Come on, come on fuck that weight right in\nthe ass. I think I'm good man, I think I'm good. You sure? Don't ever put your balls in my face like\nthat again. Do you want to tell how many times you had\nto shoot that? Actually, I don't want to talk about that\nvideo ever again. That's fair. Never, never. What's up, guys? Jeff Cavalier, athleanx.com. Jesse Lacio, athleanx.com. Today though, we are going to talk about spotting. And, you know, it's not necessarily as cut\nand dry as some people make it out to be. And we're going to do it in the form of an\nAsk Jeff, question. That's right. In this series, if you want a question of\nyours, answer, you leave a comment below. Jesse cCombs through them, he picks the ones\nthat he wants to cover and then we go. And that brings us to today's question from\nAlbert Hansen. Jeff, what's your opinion on spotting? I'm a bit of an old school guy, and I tend\nto never want anyone to touch my bar when I'm lifting. But am I being too stubborn for my own good? Thanks for all you do. You're a national treasure. Wow. A national treasure. Albert, thank you very much. If you're a national treasure, what the hell\ndoes that make me? Soon to be fired. Please don't joke about that ever again. So, Albert, thank you for your question. So, let's talk about that, because this actually\nbrings to light some of the things that I talk about when it comes to spotting. I'm guessing that Albert is probably pretty\nexperienced, okay, because he's talking about kind of old school, he doesn't want anybody\ntouching his bar, and I respect that because that's the old school approach. But is that necessarily warranted all the\ntime? Well, if we go to the other end of the spectrum,\nthe beginner's side of experience, right? I actually have a very firm stance when it\ncomes to that. I don't believe that beginners should be employing\nspotters for anything other than safety and potentially on a bench, a lift off to get\nto a position on a bench. But they should not be touching your lift\nin the midst of your lift. And there's a big reason for that. If you're a beginner, you have to learn how\nto command your own body in space before you could even start to command your own body\nholding an implement in space, let alone letting someone else move that implement for you. I mean, listen, we've all seen the guy who\nrushes over to the bench press. Meanwhile, they can't perform a proper pushup. They lack the body mechanics and the awareness\nto do it properly. You start to add load to that body, things\nstart to go wrong. And that's oftentimes why I'll start beginners\non body weight strength training programs to learn how to command your body three dimensionally\nin space because it matters. And when I say beginners, I'm not just saying\nteenagers here, guys. I'm talking about we can have beginners in\ntheir forties who've never touched a weight before and are equally inept at handling their\nown body in space, let alone handling a bar and their body in space so I discourage that. Now, there's a difference between having someone\nthere for some of these other intangibles on a cover in a second. But I'm talking about interfering with your\nprogression of the bar from the bottom to the top or whatever exercise you're doing,\na lap pulldown even if we see them spotting everything. The thing that I would say, though, is there's\none thing that's actually worse than a beginner that's always having someone spot them. Oh, I know this one. What? A bad spot. Bad Spot Barry. Yes, Bad Spot Barry. Just like you, right? A bad spotter can be extremely dangerous. It takes a lift that could maybe become ineffective\nwith the spot and it can make it downright dangerous. And that's not limited to beginners. You can see even in a case like Chris Duffin\nhere, who's a friend of mine, this is a spot I'm not saying it was done on purpose or even\nthat the guy's a bad spotter, he just had a bad moment. Yeah. And that caused a very ugly situation. Chris was going for a double, the guy thought\nhe was going for a single, he tried to wreck the bar, it caused a disaster as you can see. Chris was very upset, and I think that's the\nlast guy I want to upset. You can see that becomes a very dangerous\nsituation. But when we talk about the benefits of spotting,\nwell, there's a lot of them. And we don't have to look too far in the past\nto see even the incident that happened with Ryan Crowley-- Oh man. -- that having spotters there took a bad,\nugly situation and saved it from being much worse, potentially even critical. Because if he didn't have those two guys on\nthe ends of the bar and by the way, I don't forget about you on the left of the bar over\nthere, because a lot of times you don't get credit. You had super spotter Larry Wheels at the\ntop there holding the bar. And by the way, if I ever needed a spotter\nto save my life, he's the guy I want. Me too. But the guys on the left there, they both\ndid a job to save that ugly situation. Safety in the assurance of safety is a big\nthing that can be gained when the load is especially high like that. A motivator. It's good to have a motivator. You know, if you're spotters there to push\nyou, not necessarily to say the things you were saying there, Bad Spot Barry. I don't know if I care about anybody paying\nmy taxes and I certainly don't care if any whatever, I won't get into that. Fuck that weight right in the ass! I think I'm good man, I think I'm good. You sure? But saying the right things at the right time\ncould actually encourage you to get the job done. Reassurance. There's nothing like the reassurance of knowing\nthat somebody's there to help you if needed. And that sometimes psychologically triggers\nsomeone to do a lot more in the gym than they're capable of. When they're wiggling their fingers under\nthe bar on the bench press, they're not touching it because they shouldn't touch it. But they're basically wiggling then there,\nyou know that they're there if you need it. Somehow, that bar sort of moves a little bit\neasier than it does when you know there's nobody behind you. And that's a big psychological edge that a\nlot of times helps you to get better results from your training. And then, of course, we have some of the actual\nthings that happen in a lift itself where I think spotters are warranted. Let's talk about that bench press the actual\nliftoff. We all know that the most important part of\nthe bench press is not the liftoff. As a matter of fact, biomechanically, we know\nthat's the most inefficient part of the lift. We're putting our arms back behind our body,\nnot in line with our forms, with our elbows. That's the most vulnerable in terms of putting\nour shoulders into a bad position. Yeah. Let someone lift that off for you, but then\nyou've got to take care of the lift from there. Now, we got to talk about the goals. So what is your goal? Because if hypertrophy is your goal of training,\nthen you need to understand that a spotter can actually provide something very valuable\nto you, and that is they can help you to do forced reps. Now, forced reps can actually serve as sort\nof drop sets without ever dropping the weight. Without ever putting the bar back because\nthey're basically unloading the weight for you. So, let's say Jesse's bench pressing and you\nstart with 200 pounds and I'm not touching the bar. But then we get to your sticking point. If I don't touch it and I stay away, you're\ndone. Yeah. Right? You can't get to the sticking point. No, it's going to fall right on top of me. If you're at that point in the set where you\ncan't make it through your sticking point anymore. But if I give you about five or 10% assistance\nthrough there and you're able to get through and perform that and you can do it again,\nI give you about 10% or 15% assistance, you can do it again. You can see that you can start to accrue some\nvolume and high effort, high intensity volume here by simply having me there to help you\nthrough. Which is going to help in your pursuit of\nhypertrophy, depending upon how much you use this technique. You want to overuse it. But essentially, without having to drop that\nway down, you're going in basically doing the equivalent of a drop set and run the rack\nwith lighter and lighter and lighter weights except that I'm doing more and more of the\nwork for you. Even though I have to strip the plates. Right, until I'm ultimately curling the bar\nup for you on a bench press. So that's an effective technique. But now, if your goal was, let's say, strength,\nI think becomes a little bit muddier here. All right. The water has become a little bit muddier. There are people that will argue that the\nspotter at the crucial moment in the lift that lets you grind doesn't just take the\nbar away from you that's a crime. You got to let the person grind. And when you do that, neurologically, you're\nallowing somebody to actually fight through those sticking points and maybe with just\na little bit of assistance and allows you to sort of build that confidence that you\ncan take with you as you build your strength. But here's why I say it's a caution and here's\nwhere the other side of the equation comes in, where people argue, \"Don't touch my freaking\nbar.\" Yeah. And that is you are ultimately going to be\nresponsible at some point, the rubber is going to hit the road and you're going to have to\nlift that weight. And if you don't have your spotter with you\nand they've always helped you through your weak spot, you're only as strong as your weakest\nlink. You are not going to lift that bar. And if that's the case, what have you really\ngained from that, other than you've gotten stronger and the other range of motion? So, what I advise in most cases is instead\nof looking for a spotter to take you through those areas of the lift that are more difficult\nfor you, think of other ways that you can improve your ability to perform that lift\nits strength is your goal. Think about what accessory exercises you can\nperform. I think about what other mechanisms you could\nuse. Could you employ chains on the bench press,\nlet's say, to allow you to get through that point and build your strength at the same\ntime without somebody interfering with your lift? Right. What are some of the other things that you\ncan do in your technique? Can you learn how to tighten up better? Can you learn how to get your shoulders back\nso that your chest the shoulders are pushing together more efficiently out of the bottom\nof that press. There are techniques, there are other methods\nyou can use that will allow you to get through this without anybody ever having to jump in\nand touch that bar. And therefore, in Albert's case, I understand\nwhat he's talking about. He's old school. But again, Albert, I would say to answer your\nquestion, you could be being a little bit too stubborn. Again, not knowing what your current goal\nis right now, there are instances where it could matter. And, of course, that comes down to goal, load\nand experience there are factors of all those things that ultimately matter. Albert, thank you for your question. Guys, if you have your question that you want\nanswered, make sure you leave it below. That's what these Ask Jeff videos are about. In the meantime if you're looking for programs\nwhere we put the science back in strength and lay out what you have to do day by day,\nstep by step, it's all over at athleanx.com. In the meantime, if you have not done so,\nguys, make sure you click subscribe, turn on your notifications so you never miss a\nnew video when we put one out. All right guys see you soon. I'm a great spotter by the way. Oh, get out of here."
}