{
    "id": "cS1PkQfsG6E",
    "title": "Add an Inch to Your Arms (ONE SINGLE PUMP!!)",
    "description": "The complete program here - http://athleanx.com/x/complete Subscribe to this channel here - http://bit.ly/2b0coMW Add up to an ...",
    "transcript": "JESSIE: What's up, guys? Jessie, ATHLEANX.com. Today I'm going to show you how to get huge\narms. Add ove ran inch. You want guns like these? You've got to pipe them up. You've\ngot to work for it, baby. You've got to work. Here's what we're going to do. Grab a 5lb\ndumbbell. Now I'm going to show you how to make the magic happen. You get down right here, warm up your arms\na little bit. You're going to do concentration curl form and just bang it out. JEFF: Did you say \"April Fools\" yet? JESSIE: Oh, thank God. This is starting to\nburn. JEFF: So yes, thank God it's April Fools day\nbecause I cannot put Jessie in charge of ATHLEANX, your videos, or your future, for crying out\nloud. What we can do is let Jessie be in the video because he wanted to be in it so bad.\nBut we're going to have him be in the video my way. Which means we're going to put you through\na workout here today. We're going to see if Jessie, our hard gainer who's not having such\na hard time gaining anymore, we're going to have him run the rack, and we're going to\nhave him roll. The rack and roll challenge here to see if he can actually add an inch\nto his arms in minutes. Let's see if it's possible. What we've got\nto do, Jessie, in order to figure that out is we've got to measure at the start. So let's\ngive the flex. Let's get closer to the camera here so everybody will get a chance to see\nthis in high def. look at that wonderful bicep. So we come here, and we'll wrap around, go\nup on top here, and basically I'm at 12-1/4 right there. You see that? Almost. Right there. 12-1/4.\nSo that's our starting point. So now what are we doing? We're going to start at your\nsix rep max on a curl. You're going to do five reps. You're going to continue to do\nfive reps, grab 5lbs and do five reps. When you get to your half the weight you started\nwith then you're going to add an additional rep until you run out of dumbbells. Then you're going to work yourself back. There's\nno rest here. You're going to work yourself all the way back. In between every time you\ndo a set of biceps you're going to drop down to the floor and do the roll portion. The\nroll is a cobra pushup where you roll your body forward and back. You're going to do\nthe same number of reps that you're doing for the bicep curl. So now, anybody at home, you round up to get\nan even number here. We're not going to start dividing 35s, or 45s, or 35s. It should be\na round number. So either 10, 20, 30, 40, 50, 60lbs; wherever you're starting for your\nfive rep max on your curls. Jessie, where are you starting? JESSIE: I'm going to start at 40s. JEFF: 40s. so Jessie is going to go 40s. He's\ngoing to go five reps with the 40s, he's going to drop down immediately five reps of cobra\npushups. He's going to come down here, five reps of 35s, and five reps of cobra pushups.\nThen five reps of 30s, five here. Five 25s, five here. When he gets to half – 20s – he's\ngoing to add a rep. six reps there, six on the bottom. Seven there, seven on the bottom. Eight, eight\non the bottom. Nine, even with the five pounders. They're going to feel heavy. Then remember,\nno rest. Then from there you're going to work your way right back up again and see if you\ncan get all the way back up here. Minutes, within minutes. Then we're going to pull out\nthe tape measure again and see if Jessie actually proved this challenge possible. JESSIE: Oh, you've got to be kidding me. JEFF: Let's go. All right, I'm going to get\nbehind the camera here to get the beauty of this from the viewer's perspective. JESSIE: Do I face you, or do I face the mirror?\nDo I look at myself, or you? JEFF: You can face the mirror if you want. JESSIE: All right. JEFF: Whenever you're ready, big boy. JESSIE: I'm nervous. JEFF: All the way down. No cheating. There\nyou go. Watch that wiggle. All right. Just that portion. Down. There you go. That's it. JESSIE: I hate you so much. JEFF: All right, stand up. Let's get you in\nthe frame here. I don’t want you  to  lose one vital second of this pump. Okay.\nTakin gout the measure again. Did we prove them? 12-1/4 is what we're beating here, right? JESSIE: Oh, it hurts to flex. JEFF: It doesn’t smell very good over here,\nJessie. JESSIE: I'm sure it doesn't. JEFF: Almost. Almost 13 right on the nose\nthere for Jessie. Almost. Nice work. ¾\". Okay, so what's the point here? Guys, when\nyou push yourself here, one of the things that we see here is that Jessie is obviously\nnot used to pushing himself this way. I always think for hard gainers, one of the things\nthey suffer from is the effort that's usually needed to cause change. It's not that you're a hard gainer. It's that\nyou maybe aren't comfortable being uncomfortable and today we made Jessie uncomfortable. JESSIE: Very uncomfortable. JEFF: April Fools or not, the fact of the\nmatter is, we gave him a good workout. I want you to try this yourself, but most of all,\nlook for things that will make you uncomfortable and then seek them out and try to do them.\nBecause if you always do the things that you think make you feel good, or give you the\npump, but just aren't challenging you along the way, they're not going to be helping you\nin the long run, or be building bigger, stronger muscles to be adapting and coming back bigger\nand stronger than the last time you worked out. That's the whole name of the game here, guys.\nSo again, if you're looking for a program that lays it out step by step head to ATHLEANX.com.\nI'm not afraid to lay the challenge down to you. We do that literally every, single week\nin our program with built-in challenges that you can score yourself against to see where\nyou rank against your peers. That's all built into our ATHLEANX program. Again, that's at\nATHLEANX.com. If you've found this video helpful, if you\nlike Jessie in here, if you think Jessie's getting a little bit bigger – pump, or not\n– let him know. Give him some props. We'll be back here again soon. See you!"
}