{
    "id": "CwogJspeuAA",
    "title": "How to Grow Bigger Muscles Fastest! (NO PLATEAUS)",
    "description": "If you want to grow bigger muscles you have to first learn the three options you have for doing it and then not get attached to any ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're talking all about how to grow\nbigger muscles, and it's right here. It's actually really simple. You've got three paths to do it, but the big\nthing is; you can't get attached to one at the exclusion of the others. I'm going to show you today how all three\nhave to be explored, and rotated if you want to see your best gains ever. If you want to reach your true, full potential\nyou have to make sure you're doing them. I'm going to cover that, and the reasons why\nthat is. Let's identify what we have as our options,\nfirst. We've got progressive overload, metabolic\nstress, and eccentric damage. These are the three main ways you can grow\nmuscle. Ironically, if you were looking at the three\nof them, only one of them would I say is going to cause a lot of muscle soreness. So right off the bat, you realize that muscle\nsoreness is not a prerequisite for growth. But it actually might be. You see, at some point – I did a whole video\non this – you're going to have to dip into the eccentric muscle damage technique as a\nway to continue to illicit new gains because these are going to dry up, if these are the\nonly two things you use. I'll get back to that in a second, but these\ntwo don’t necessarily do that. So what are we talking about? With progressive overload we're talking about\nadding weight to the bar. Getting stronger in different exercises. Have your strength gains proceed your size\ngains. The only thing you can do is increase your\nworkload. We can increase the volume of what we do inside\nof our workout. We can increase the density of a workout by\ndecreasing the time that we do the same volume that we did the last time. So we can increase workload and volume, or\nwe can increase our training frequency, taking advantage of the fact that we know muscle\nprotein synthesis peaks, and then gets back to baseline within 48 hours. So if you train a muscle more frequently you\ncan hit it more often. You can spark that stimulus for growth more\noften. Or you could do both. You could even increase exercise variety from\ntime to time because the new exercise stimulation on a muscle that you've never really felt\nbefore can be a good form of progressive overload. It's a lot more limited than these two, but\nit can be something you can rely on. Metabolically, it's kind of exciting because\nyou use lighter weight here, but what you're really relying on here is not just the tension\nof the muscles' feel, but the chemical reaction that goes on inside of a contracting muscle. As your muscles contract you produce metabolites. These metabolites start to accumulate, and\nwhat we normally do is, we stop when it starts to burn. But if we learn how to train with a purpose\nhere, train to seek out this stress, and train through it; we start to take advantage of\nthe fact that chemical reactions start to take place inside our muscles, which provide\na stimulus for growth on their own. So it is a way that we can train with lighter\nweights. There's another thing too, dispelling the\nmyth that heavy weights are the only way to do it. We've just seen we can do it with heavy weights,\nlighter weights, or again, heavy weight, but with more muscle soreness. So what happens is, if we go down this road\nand we get attached to one, single method that's when problems occur. Let's start at this end. Let's say I wanted to do my progressive overload\nusing weight. We know – if we're not newbies – that\nthis eventually becomes a problem because, yes, neurological gains are a thing of beauty\nwhen you're new to lifting because you become more efficient at the lift. If it's a multi-muscle group exercise, a compound\nmovement, you might even become more coordinated at recruiting the different muscle groups\nto contribute to that lift. So all these things start to allow you to\nincrease your strength, the strength gains help to proceed the side gains – as I've\nsaid – and you can increase muscle contractile tissue, and that's feeding into your ability\nto even lift more weight, and this whole thing is a beautiful cycle until it ends. When it ends you have to look elsewhere. What a lot of people will do now is they'll\nlook over here. They'll say \"Well, I've just got to change\nmy training volume around. If I could change my training volume then\nI'll be good. If I could increase my workload, then I'm\ngood to go.\" Well, here's the problem with that. As you increase your volume, or if you increase\nyour training frequency what happens is, we often times find ourselves derailed by that\nmethod because we s tart to get tendonitis. Overuse injuries. We're approaching this without realizing 'what\nis the actual recovery that I have in a muscle, by muscle basis?' Because some of our muscles don’t respond\nthe same way. Some muscles, we feel like we can go right\nback out there and train. Other muscles take us longer. So we're going to have a 48 hour window to\ndo so, and we think that's the magic number, we're not really doing ourselves a service\nby doing that. So we're undercutting our ability to do it\nthe right way, and more importantly, we're costing ourselves by creating overuse injuries\nthat create problems here, because this can take you out of the gym entirely. As anybody that's felt pain in their elbow\nevery time they curl, or shoulder pain every time they try to press, or knee pain every\ntime they try to bend their knees. This can become a problem. So if you rely exclusively on this, and think\nyour volume approach is going to be the answer; it's not. Even back here, if I were to point out, if\nyou think that I'm going to just keep adding weight to the bar, what happens here is less\nof an overuse injury. This can become more of an acute injury because\nyou tried to add too much weight and you can't do it, and you wind up getting hurt. Even worse, in an attempt to look like you're\nmoving more weight all you do is continue to bastardize your form to the point where\nit's not even recognizable anymore of what you were doing. Then what started off looking like a bench-press,\nor a squat now looks like a quarter rep of both. That's not helping you either. So now, if you're in this game here, and n\now you've got to go down and look for something else, we can go down this road. This is the one that I said is pretty exciting\nbecause I don’t think enough of us train this way. I don’t think enough of us rely on the lighter\nweights. We think that the lighter weights aren't capable\nof building muscle – which we've already told you is not the case – and when we do\nuse them, we don’t train hard enough with them. That's the problem. You can take light weights and train really\ndamn hard because if you can create this metabolic distress in the muscles, and push through\nit – what I like to say is \"When it starts to burn is when the exercise starts.\" Then, how far can you push through that? When you do, you create a new opportunity\nfor growth. But it is uncomfortable. You do benefit from having a knowledge of\nstrength curves here because it helps you realize where in a certain exercise you can\ndo more damage here, but the fact is; this opens up new doors, and it's something you\nshould do. But here's the problem here. If you exclusively use this method, and you're\nusing lighter weights to do so; where is the tension overload? You're using the chemical overload here, but\nwhere is the tension overload? The tension overload is coming back here. So you can't just keep doing this. You need to do more than that. So then, we always come back down to the end,\nhere. That is, you've got to start throwing in some\neccentric muscle damage, too. We definitely have tension overload. We actually have mechanical distress to the\nmuscle as you're elongating that muscle under tension, and stretch. You can cause some damage to the muscle that\nactually comes back, repairs itself, and sparks a stimulus for growth. So the eccentric training, that's pretty heavy,\nand that's pretty uncomfortable, and the people that say \"I'm going to just do that because\nI know it's hard, but it's good.\" That's a problem because what's going to happen\nto your frequency and your volume if you're always doing eccentric training? You're going to be too damn sore to ever do\nany of this. So you see where this is all going? Where this is all going is, all of these are\nnecessary. Again, the people that say \"Oh, you don’t\nneed to be sore in order to make muscle gains\", my argument was 'yes, you do', because eventually,\neven if these two methods aren't leading to much soreness, because they're going to dry\nup, and they're going to force you to go down the line, looking for another method; you're\neventually going to have to come down here, and that will cause soreness, in most cases. If you're doing it right. So ultimately, I say 'yes, you're going to\nhave to in the big picture'. But no, you don’t have to on any, single\nmethod to be making gains while using that method. So the point of this video guys, is that there\nare definitely ways you can build muscle, and attaching yourself to just one of them\nis doing yourself a disservice in the long run. You can attach yourself to all three and learn\nhow to weave them in, and out with each other so you're benefiting from all of them, without\nfacing any of the detrimental side effects from any one of them. As a matter of fact, we've been putting a\nlot of time and effort here, at ATHLEANX, to do just that. I have a brand new program coming out called\n\"ATHLEANX Breakout\" that is meant for guys that have hit a plateau in any of these areas,\nor they can't gain size anymore, they can't gain strength. They thought that they reached their true\npotential. I don’t think that's the case. I think if you learn how to do these, and\ndo all three together, at the same time, weaving them in and out at the right time, then I\nthink it's very, very possible to start seeing new gains. That new program is released tomorrow on Black\nFriday – depending on when you're watching this video. If you're watching it after Black Friday,\nit's already available over at ATHLEANX.com. If you're looking to try and break out of\na plateau I highly recommend you go over there and check that out. In the meantime, I hope you've found the video\nhelpful, guys. There's a lot to training and building muscle,\nbut the fact is, you can simplify it a lot, but more importantly, be open-minded to all\nthree of these things because that's ultimately going to hold the key for your success. All right, guys. I'll be back here again soon. See you."
}