{
    "id": "cWZRyKGL6dI",
    "title": "Can’t Lose Chest Fat? Just Do THIS!!",
    "description": "If you struggle to lose chest fat and want something you can do at home, just do this. In this video, I'm going to give you a four step ...",
    "transcript": "Boobs. Man boobs. Man cans. Maybe even bitch tits. Listen, no matter what derogatory term you\nmay have heard targeted at you, hopefully after this video today, this is the last time\nyou're ever going to hear them. What's up guys, Jeff Cavaliere, athleanx.com. So I spent a good amount of time in clubhouses\nand locker rooms, I could tell you I've heard the insults flying around. As a matter of fact, pointed at me a few times. And we all know that, especially when it's\nsomething we're self-conscious about, doesn't really feel that good. So, if you heard any of those things, hopefully,\nlike I said the last time, you ever going to hear it, because in this video, I'm going\nto try to solve your problem. And I realized that when it comes to excessive\namount of chest fat and a saggy chest, that a lot of guys don't even feel comfortable\nleaving the house, pandemic or not, to head out to the beach because of how self-conscious\nthey feel about this problem. Well, the good news is I'm going to show you\nsomething you can do without ever having to leave the house. Four things that you can do at home to start\ngetting rid of this problem today. As a matter of fact, number four is something\nyou can start doing right now to start making a noticeable improvement. So that being said, guys, let me start breaking\nthem down one by one. So, step number one is what I want you to\ndo as soon as you're done watching this video, make sure it's after you're done watching\nthe video. And that is I want you to walk over to a mirror,\ntake a good look, and then get real. And part of doing that is knowing actually\nwhat problem it is that you're facing, because not all saggy chest issues arise from the\nsame cause. See, if your chest looks like this with the\nmajority of the fat centralized around the nipple, maybe it's even a little hard or a\nlittle sore when you touch it. That's not really a chest fat problem, that's\nsomething called gynecomastia, it can come from steroid abuse, it can come from just\nsimply having the wrong genetics. But the fact is the treatment is different. You're going to need maybe surgical or at\nleast medical approaches to get to the bottom of that problem. But here's the good news. Only about two out of 10 people that have\nsaggy chest issues are actually dealing with that as the problem. More of us are dealing with this, and it's\nsimply just an abundance of fatty tissue in the breasts and that's something that men\ndon't want to have. And it can happen at any level of body fat,\nas you can see. So, if you're still with me and yours is a\nbody fat issue, let's move to step two, because that's where we start to make a really big\nimpact. So now with body fat accumulation identified\nas the root cause of your problem, we now move on to step two. And the good news here is that we're not looking\nat medical or surgical intervention to fix what ails you. Instead, we're looking at what you can do\nand solely what you can do because you have the power to make this change. But I have some bad news for you. Your diet sucks. Or at least it's not good enough. Because no matter how you're eating right\nnow, let's face it, it's not good enough to get you where you want to be. Any body fat accumulation issue is always\ngoing to come down to the fact that you're not eating healthy enough. We have to make some changes. And those changes happen in trying to cut\nback some calories to create a calorie deficit that's going to help you to start burning\nthat body fat away. You don't get a choice of where you lose this,\nand that's actually going to come and help us out in the long run here, as I'll explain\nin a second. So how much are we talking about here? Well, first, let me give you a little bit\nof uplifting news. If you were to ask me, Jeff, how difficult\nis it going to be for me through dietary changes to fix this problem? On a scale of zero to 10? I'd say this is about a three or four. Now, if you said, Jeff, I want to get this\nvein that's running right above my junk, that leads right up to my 8 pack, I'd say, okay\nnow you just asked me for about a nine or ten. So, your goal is actually very achievable\nhere, I recommend doing this: Look for about a 20% decrease in the amount of calories you're\nconsuming right now. You don't have to get there all by consuming\nless calories, if you want to supplement with a little bit of cardio, you can do that. But the fact is nutrition is going to be the\nfastest and most effective way to get there. Now, the obvious thing is to do a first round\nsweep and say, what's the obvious shit I need to take out of my diet? Am I drinking too much? Am I eating fried foods too often? Am I eating out at restaurants too often where\nI know I'm not eating well? The fact is you make the changes that, you\nknow, you can probably make without much effort. Here's the other good news. Because of the way men's store body fat, you\nactually don't have to be so damn good. Perfect is certainly not necessary when we're\ntrying to decrease body fat on our chest. And here's why. In men, we tend to store body fat centrally. So again, we store all over and we add it\nin all places, all times, but we sort of do so in a bit of an ascending way. Right. We start here most stubbornly at the lower\nbelly and then we kind of working through the abdomen and up to the love handles. And again, that kind of works its way up. Right. You've seen guys who have maybe a four pack,\nthey get a little fatter, then it becomes a two pack, they get fatter and then that\nchest that was kind of already covered in some fat gets even worse and worse. Right. It's the proportionate rate at which we add\nfat, you're adding it everywhere, but it gets worse and worse the more and more fat you\nadd to your body and the higher the body fat levels go. Well, here's some good news. When you go into reverse and you're trying\nto lose weight, you actually lose it as a last time first off scenario. So, most guys, when they start to make even\nsome minor improvements in their nutrition, start to lose fat on the way down. So, you start to see the chest look better. They start to see that two pack, they start\nto see the four pack again. You're losing it everywhere. But proportionally, you start to lose weight\na little bit faster in the places, as you put it on the most recently. And that, again, points to chest fat. So, you don't have to be so strict in what\nyou're doing. So, if you make that reduction and you start\ndoing what I'm telling you here, guys, get honest with yourself, I promise you the fat\nwill start to drop off. But then again, what happens then? What do you have underneath it? And that brings us to step number three, and\nthis is something you could actually do at the same time, you're working on improving\nnutrition. Because if you get step two right, at some\npoint, we're going to know what's going on underneath there. Because if it doesn't look good and you have\nno actual chest muscle development, then you're still going to have a problem because you're\ngoing to look like this. And that's not what you're looking for. So, you want to do is you get that body fat\ndown but now we have to make sure that we develop the muscle that's underneath. And there's a specific way that we want to\nattack this and if you're going to do it more scientifically. What do we do? Well, we have to choose the right exercise. Now, ideally, guys, I would encourage you\nto get an overall training plan. Because I know if you're adopting this as\na lifestyle, your long-term outlook is going to be better than someone that's just sort\nof intermittently hitting the gym. And when that plan consists of not just chest\nexercises, but let's say big compound lifts like deadlifts, squats, rows and the bench\npress, well you have a better ability to develop more muscle mass overall that's going to benefit\nyou metabolically in terms of the number of calories that you burn at rest, so staving\noff fat accumulation is going to be a lot easier. However, we do have some exercises that if\nyou're not going to do anything but just a few things, then let's start working on some\nof these chest exercises that incorporates a little bit more targeted effort towards\nthe lower abdominal head fibers of the pec major. We know we can do that by simply following\nthe fibers, I say it all the time. You want to take your arm from a position\nup high and move it down low because we know the fibers of the abdominal head run in this\ndirection. Well, we have some options. The first thing is to actually take a high\nto low cross over with a simple band anchor to a pull up bar in your doorway at home. And what this does is it gives us a chance\nto get a good complete chest contraction because we want to get our arm not just down, but\ndown and across midline. We could take push up variations and modify\nthem as well. And the incline push up is preferable because\nit gives us a chance to, again, take that arm from a high to low position. You can see, as I look at it from the side. Now, what we do here is add an additional\nplus to the top of this. This gives you a chance to work this serratus\nactivation into this, which is a muscle that kind of supports the chest activity from below. The third thing we could do here is take that\nsame exercise and just simply add a twist. And all this is doing is, again, incorporating\nsome more of the adduction to the exercise that we didn't have from the straight standard\nincline push up plus. And again, all we have to do here is simply\ntwist our body this time, which gives us the same relative adduction of the arm across\nthe chest. The next two exercises, well, the first one\nis just a classic. We know that the basic dip is one of the best\nways to target the lower fibers of the pec major. The problem is sometimes it's a little bit\ntoo difficult for some people because they have to command their own body weight here\nin space. And if you're at that sort of heavier weight\nin higher body fat percentage, you might find this a little bit challenging. So, you simply incorporate a band if needed,\nto unweight some your body weight and start to crank out these reps. And of course, you can always do these at\nhome and the corner of a kitchen counter and if need be, put one foot down to simply unweight\nsome of your body weight. And then finally, we have another option we\ncould do here with the band anchored to the pull up bar in your doorway in a simply call\nthe reverse lateral. Instead of taking your arm out to the side\nand raising it like you would in a lateral raise for your shoulders, you now take your\narm from the top and pull it down into your side, that's part of the exercise. At this point now we push down as hard as\nwe can, incorporating a little bit more of that plus. Any of these exercises are great options,\nguys. But again, if I had a choice, I push you in\nthe direction of making sure you start with a foundation of a good program and then sprinkle\nthese in accordingly. And that brings us to step number four. And this is the one that I said might surprise\nyou because this is something you can change right now. Like literally watching this video you can\nmake this change. You ready? Stop slumping over. If your posture sucks, I don't care what level\nof development your chest has right now, it's going to look worse. The reason for this is the chest is designed\nwith an attachment in the shoulder to be a broad muscle that stands at attention. And as soon as you allow that shoulder to\nbe brought in either chronically because you have really tight muscles in the front of\nyour body, not just the chest, but the lats can be contributing as well. That makes your shoulders round forward and\ncreates a smaller looking, saggier looking chest. Well, you need to do something about it. It could be as simple as being aware of the\nproblem. Simply standing up and rolling those shoulders\nback allows that chest to look more of what it's intended to look like. Now, I have an entire video dedicated to how\nto fix a chronically rounded shoulder posture. I'm going to link that for you in this video. But the awareness right here, right now of\nrealizing that this is contributing to your problem is important. And it's one that I don't want to miss when\nit comes to the overall attack plan for fixing your problem once and for all. And then you have a guy who's a step-by-step\ngame plan for getting rid of not only that ugly chest fat, but more importantly, those\nderogatory terms aimed at you in the process. Guys, I never want you to have to look in\nthe mirror again and not like what you see. Especially as I mentioned here before, it's\nnot as difficult as you may have thought it was if you do the right things. If you're looking to take it to another level,\nguys, you want to step-by-step plan, including a meal plan, we include them with all of our\nprograms over at athleanx.com. In the meantime, if you found the video helpful,\nmake sure you leave your comments and thumbs up below. And also, guys, if you haven't done so, make\nsure you click subscribe and turn on your notifications, so you're never miss a new\nvideo when we put one out. All right guys see you soon."
}