{
    "id": "cZiqFbsJ0yw",
    "title": "How to Increase Your Pushups by up to 30% (INSTANTLY!)",
    "description": "If you want to increase your pushups by up to 30 percent right now, then you have to watch what I am going to show you in this ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. So the secret to doing 30% more pushups today\nis to literally have somebody stand over you with a sledgehammer when you're doing your\npushups, and threaten to bash your skull in. I promise you're going to do more. I do it to Jesse all the time. That's why he's getting so big. JESSE: Stop doing that! JEFF: And that's why he has a couple concussions,\ntoo. In actuality though, I want to demonstrate\nsomething here because this is a key point, and it is going to help you do more pushups. If I wanted to exert power from my upper body\nwith a sledgehammer, then I need to have a stable base to do it. If I want to get maximum power from the top,\nbecause of the essence of our body being a kinetic chain, then I have to be able to be\ngrounded, and stable, take this, and then, bam! Deliver as much force as I can from the top\ndown. As soon as I take out my stability from down\nbelow, and I take the BOSU here, and get on top of it, I have to exert as much force as\nI can from up top. I'm already destabilized my entire body. I can't get as comfortable, and as strong\nwith this sledgehammer on the way down because the bottom is allowing the force I'm trying\nto generate from up top, to dissipate throughout these weaknesses, and these energy leaks down\nbelow. So when we do a pushup the same thing applies. This is where I see too many people do this\nwrong. I've covered this in the past, but never in\na dedicated video. If you do what I'm showing you here, it's\ngoing to work. I promise you. Today, literally the next time you do a set\nof pushups. When you get ready to do a pushup, what are\nyou doing? You're trying to exert force through your\nupper body. But because we have our feet in contact with\nthe ground we're in no different of a situation, as when I was trying to do the sledgehammer\non that unstable surface. So what you want to do is, you want to stabilize\neverything down below. It starts here. You literally get up, onto your toes. Don’t sink in because when I sink I can\nbounce. If I have loose ankles I have the same thing\ngoing on that I had in that BOSU there. The opportunity for force to be dissipated\nout the ankles. So tight ankles. Straighten out your knees by tightening up\nyour quads as hard as you can. Squeeze your butt as hard as you possibly\ncan. Get your abs tight. I've taken out all the potential areas for\nenergy leaks from here down. Which means the force I'm trying to exert\ninto the ground can now actually go right into the ground as optimally as possible,\nwithout it being lost. So now, by making those changes – when I'm\nhere, tight ankles, squeeze my butt, quads, and right now in through my core – I feel\nlike I'm floating on air and I'm doing pushups effortlessly. Now if I got loose and the low back started\nto sag here, and the ankles are rocking, and the knees are bent, and I go, you try this\nyourself and you'll instantly feel much heavier because you're not taking the force that you're\ndelivering here to the ground, and optimizing it. You're losing most of it. So you do that today and I promise you, you're\ngoing to start doing a lot more pushups. Even in your very first set. Now, if you want to try to increase overall,\nover time, the number of pushups you're doing until you're knocking out 100 in a set; here's\nmy big tip. Repetitions beget more repetitions. So you take your set, doing what I just told\nyou, to failure – whatever number that is – and as soon as you think you're done,\nyou're not. You go to an inclined surface. We know we can make it through a mechanical\ndrop set just a little bit easier. So we come up to anything that's a little\nhigher. If you're doing these at home you do it through\na couch. You're down here, and now you rep out more\nreps. So again, to failure on the ground, in the\nflat position. Then you continue to go and rep them out in\nthe inclined position. Over time, your ability to do your number\nwill go up. All right, guys. I hope you've found the video helpful. Remember, your body is a kinetic chain. You need to be able to train it like an athlete\nfrom the ground up. We do that for you in all of our training\nprograms. We train like athletes so we can look like\nathletes. They're all available over at ATHLEANX.com. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want to see here,\nor me to cover on this channel, and I'll do my best to do that for you. All right, guys. See you soon."
}