{
    "id": "D-RW-8lqtnw",
    "title": "Abs and Oblique Stretch (TIGHT ABS FIX!)",
    "description": "How to get ripped abs and obliques year round… http://athleanx.com/x/ripped-abs-and-obliques-workouts People often say that ...",
    "transcript": "What's up, guys? Jeff Cavaliere, AthleanX.com. Having tight abs is probably high up on your\nlist of priorities if you're here watching Washboard Wednesdays. But having tight abdominal muscles? That is an entirely different story. As a matter of fact, that can create a lot\nof dysfunction in your other lifts and workouts. You see, the muscles in your core, particularly\nthe internal and external obliques, and your rectus abdominus – the six pack muscle – is\nactually causing a problem for a lot of your other lifts if they're allowed to become short\nand tight. They become short and tight pretty easily\nbecause of two things. Number one: we hardly ever stretch our abs. I'm going to try to correct that for you here\ntoday, by showing you three ways you can. Secondly: we sit a lot. Either we're driving in a car on our commute\nto work, or while we're at work we're sitting. Even at night, we're sitting a lot. That allows these muscles to become a little\nbit tight. We have to realize when we look at these muscles\nthey're doing the same thing. They all have attachments, origins and attachments\nin our rib cage and then down here in our pelvis. They take those two points when they're allowed\nto get tight, and they bring them closer together. What happens when you bring your ribcage closer\nto your pelvis? You look like that. A lot of postural issues can come out of that. Actually, that can lead to other things that\nwe think might be problems that aren't. We see people and we say \"Oh, they have low\nlack of thoracic extension. They can't extend their thoracic spine.\" No, maybe they can't extend their thoracic\nspine because they can't extend the ribcage away from their pelvis because they have tight\nabs. Here's what we have to do to start addressing\nthis: I take out a physio ball, like I'm showing you here, and I lay over the top of it. A lot of you might do this instinctively because\nyou figure it feels good, or it stretches you out a little bit. The big thing you have to make sure you're\ndoing here is separating the ribcage from the pelvis. I do that by getting into a position where\nI first lay over the back of the ball, I get that ribcage expanded, I get my arms up over\nmy head, and then the key is dropping the hips. Dropping the pelvis father away from the ribcage\nso we can get that maximum stretch on the rectus abdominus. I can intensify that by just adding a nice\ndeep breath in. I'm not sure if you can see it or not while\nI'm doing it, but a nice deep breath in to expand the ribcage even more, and increase\nthat stretch being felt on the rectus. Now what I do is, again, you've got to deal\nwith the internal and external obliques, too. Those are big muscle groups that are impacting\nour posture in different ways. These are a little bit slanted compared to\nthe up and down orientation of the rectus abdominus. We can get at them, too. We can get at them by just turning ourselves\nover and getting on the side of the ball. Now we get on the side of the ball and the\nsame thing happens here. Ribcage and pelvis: separate them. Drop them as far away from each other as you\npossibly can. Now when you're leaving up over the ball,\nif you twist a little bit and lean back you can get the external obliques to be a little\nbit favorably stretched because you're taking them further away from the angle that hey\nrun into the ribcage. You're pulling that ribcage further away from\nthe pelvis where the external obliques attach. The same thing can happen here when we go\nto the internal obliques. You just want to roll yourself down a little\nbit, still maintain that side bend, because the real attachment here is the iliac crest,\nright on the side of our hips. Get that a little further away and, again,\nrotate downward and get away from, or elongate, the internal oblique a little bit more. You don’t have to do this all that often\nbecause I bet you're not doing it all at the moment. Do a little bit more and I promise, you're\ngoing to see the benefits as it overlaps into the rest of your training. I mentioned in the beginning there's some\ndysfunction that you could see. Some of your lifts – by allowing yourself\nto get tight abs – the squat is probably the best example of this. If you try to squat out of the posterior tilt\nyou're immediately putting your low back in jeopardy of injury because you're in a very\ncompromised position. That's not a very stable position at all. You want an anterior tilt out of here so as\nyou lean forward to create the right angle of the bar through the middle of your feet,\nyou're going to need to have a low back that's slightly arched to support your spine and\nkeep it in a strong position. You're only going to get that if you have\nan anterior tilt, or the ability to anterior tilt and drop that pelvis down and away from\nyour ribcage. That's something – like we just covered\n– is not possible if you allow your abs to get that tight. You want to make sure that you're not ignoring\nyour abs when it comes to stretching because stretching is important for all your muscles. Your abs are no less important, especially\nas we realize the implications it has for not doing them. I hope you've found this as an eye opener\nand you'll start to do some of the quick stretches that I've shown you. I know sometimes we get a little bit on the\nnerdy side – the PT side – to explain these things, but I think, based on the feedback\nI get from you, these are the things that help you to understand why it is you're doing\nwhat you're doing. I think if you understand what you're doing\nyou're getting a much better result from doing them. That's the whole basis of our Athlean-X training\nprograms. It's to allow you guys to understand what\nit is you're doing so you get so much better results from them. From all your workouts, all your training,\neverything you do in and outside the gym. If you're looking for those training programs,\nguys, they're over at AthleanX.com. In the meantime, if you've found this helpful\nmake sure you leave your comments and thumbs up below. Washboard Wednesdays, once a week we deal\nwith the core here and I want to make sure I'm bringing the videos that you guys want\nto see. All right. I'll see you soon."
}