{
    "id": "d08B-QJL124",
    "title": "The “Holy Trinity” of Ab Training (HIGH DEFINITION!)",
    "description": "Get high definition abs fast - http://athleanx.com/x/get-shredded Subscribe to this channel here - http://bit.ly/2b0coMW Ab training ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The Holy Trinity of ab training. Yes, trinity. Three. It's not just about the abs when you want\nthe abs to look better, certainly when you want them to perform better you've got to\nlearn to start incorporating more than just the abs. Today we're going to show you the three muscle\ngroups that want to work together and prefer to work together. So it's the rectus abdominus – the six pack\narea – the obliques, and of course the serratus anterior also, because all these muscles will\nfeed in together. The cool thing is, I can show you something\nyou can do in one sit-up that's going to cover all of these areas in one shot. Okay, now if you don’t have a captain's\nchair setup don’t worry about it. You can do it in a corner of a kitchen counter,\nwhere the counter meets. Just get in here and do exactly what I'm going\nto do here. You're going to just grab on, put one hand\non each side of the kitchen counter – or in this case, if you have access to this you\ncan use this, or a set of dip bars. Now the first thing you want to do is, positioning\nof your shoulders. You don’t want to let your shoulders sink\ndown. Yet. Not the whole time because we know that if\nwe get depression of the shoulder blades that we can get a little bit of activation of the\nserratus anterior. We're going to get to a more direct in a second\nhere, but just by holding this demands more activation of these muscles, and that's a\ngood start. So we want to start off with ab training,\nwith the ab exercise; the rectus. We know that you've seen people do this all\nthe time, but this is not what I want to see. I don’t want to see your knees, I don’t\nwant to see your toes. What I want to do – as I've mentioned this\nbefore on this channel – I kind of want to see your ass. So that means that I want to see that, okay? You want to see the bottom half facing you. The reason why that is, is because when the\nbottom half faces you, I'm flexing the spine. You can't see my bottom half – my ass – unless\nI'm flexing my spine and tucking it in. So we start off there and we rep out to failure. The next thing we want to work on is the obliques. So we know that we need to get rotation involved\nto do that. How do we do that? Come back up. Here, again, positioning. Not here, but up. Lock it in. We're going to twist our body here, and then\nfrom there twist back, and come up, and across our body. Here, boom. Here, up. Up. Up. Up. Up. Up. Of course, we go other side. Down, up. Up. Up. Twist, and come up. Last one. So we're talking about the serratus. Deep inside, up in here, feeding into the\nobliques. So all those 'obliquely oriented muscles'\nthat are arranged on a diagonal that help to streamline the appearance of your whole\ncore. So we can do that. Those muscles are most active when we get\nprotraction of the arm. I turn this way. When the arm is here then it protracts away\nfrom the body. That's when the serratus kicks in. Like if we're doing a pushup, to a pushup\nplus we push through. We can do that. Change the orientation of the body. Get up top. Now allow yourself to dip down and lean forward. From here you're going to push up, here, and\nthen lift your torso up, and down. Sink in, lean forward so we're getting that\npush more away from our body. Up, then push up. Up, push. Up, push. Up, push. Up, push. Up, push. Up, push. So down, here, and then pull the pelvis up,\nand under. So we're working on that whole area up under\nhere. Again, trying to get the muscles that prefer\nto work together to work together. I am caught. This is the Holy Trinity, guys. Not just because we want it to be, but because\nyour body actually prefers it to be that way. Stop training in isolation. Let your muscles work together at all costs. If you're looking for a program that trains\nyou like and athlete and therefore lets muscles work together that prefer to, head to ATHLEANX.com\nand get our ATHLEANX training program. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Remember, no excuses. You can do this anywhere and you don’t need\nany kind of special, fancy equipment. All right, guys. See you soon."
}