{
    "id": "d1VU0MPTq6U",
    "title": "Jesse VS. Pro Wrestler (THIS GETS UGLY!)",
    "description": "What happens when a 150lb former weakling (but still not that strong) challenges a 260lb professional wrestler face to face?",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m standing here with WWE Super Star\nSheamus. SHEAMUS: How’s it going? JEFF: We are actually here to celebrate a\ncouple of exciting things. First of all, 5 million subscribers. SHEAMUS: Yeah! JEFF: Guys, it’s taken us a while, but I\nhave to say, very sincerely; thank you for watching our channel, and supporting what\nwe do. As a matter of fact, what’s really interesting,\nand cool, and humbling to me is to find out the guys that actually follow my stuff. One of them really is Sheamus himself. He follows our workouts, he’s been following\nour videos for a long time, and it’s really an awesome thing to hear. What’s even cooler is when I get a chance\nto actually have you come in here and train. SHEAMUS: Thanks for having me. JEFF: We actually just filmed a video on Sheamus’\nchannel, a workout where I take him through my workout. Which is really what happens over there on\nhis channel. Guys, I don’t often recommend channels. I highly recommend you go over there and subscribe\nto Sheamus’ channel. It’s called Celtic Warrior Workouts. There’s a philosophy there that I find admirable. If you want to share what that is. SHEAMUS: Thanks, yes. It’s just a Brave Change of philosophy that\n– drop your ego at the door, open your mind, and all I know is I know nothing, and it’s\nfun. I’m learning so much from other people’s\nworkouts and their training philosophy, and their mentality. JEFF: Again, I like watching this channel\nmyself because I like seeing people that are able to leave their ego at the door, because\na lot of times, guys, what you see on this channel is very much the same requirement. It’s all about learning, getting better,\nand we’re going to take you through that here again, today. Before we get into that- JESSE: Yeah, no. I don’t think so. JEFF: What are you talking about. JESSE: Don’t go watch this video on his\nchannel. JEFF: What? SHEAMUS: What? JEFF: What are you thinking? He’s a guest. JESSE: I’m not even – yeah. Okay. But I’m not in the video and let’s be\nreal. JEFF: Dude, you weren’t even supposed to\nbe in the video. JESSE: Well, I should be because, guess what? Those 5 million subscribers? You’re welcome, for at least 3 million of\nthem. Yeah. You’re welcome. SHEAMUS: What’s with you? JEFF: So, hold on a second. Wait. So, you want to be in a video with Sheamus? That’s what this is about? JESSE: I want to get him 3 million more subscribers. SHEAMUS: I don’t know, I mean, that’s\nvery generous. JEFF: Let me take that. You want to be in a video with Sheamus? JESSE: Yeah. JEFF: So that’s what you were mad about? Because You weren’t in this one? JESSE: Yes. Yes. JEFF: I’ll let you be in a video with him. JESSE: Okay. JEFF: This one. JESSE: What is this one? JEFF: Wouldn’t you like to know? JESSE: Yeah, I would like to know. JEFF: I’ll tell you what. I’ll let Sheamus pick. What do you want to do with this guy? Anything\nyou got? SHEAMUS: Wait, wait, wait. How about a ladder rack in ya? JEFF: I like it. I like it. SHEAMUS: Right here? JEFF: Jesse? JESSE: That’s not – no. That doesn’t sound fun at all. JEFF: What? JESSE: Because – no. No, I have a better idea. JEFF: Dude, you’ve put on 21lbs. JESSE: I don’t care. He’s way bigger than me. I have a better idea. JEFF: What have you got? JESSE: Disney trivia. Bet you cannot name Boo’s real name in Monster’s\nInc. SHEAMUS: That’s easy. It’s Mary. She signs her name in all her pictures. JEFF: Oh, Jesse. Jesse, this isn’t starting good. JESSE: No. SHEAMUS: You came well prepared. JESSE: Clearly. JEFF: Okay, I’ve got it. I’ll settle it. I’ve got a better idea. JESSE: Okay. JEFF: I do want to see a workout challenge. A bodyweight challenge. You’re even, right? You guys have your own relative strength. JESSE: Okay. JEFF: I want to see a 400 challenge. 100 reps of four deferent exercise. SHEAMUS: All right. JEFF: Okay? But we’re doing fixed rep style. So, you have to finish all 100 reps of that\nspecific exercise before you can move onto the next one. SHEAMUS: Okay. JEFF: Fair enough? SHEAMUS: All right. JEFF: You’re going head to head. Whoever finishes first wins. JESSE: Awful. JEFF: Honestly, good form, across the board. SHEAMUS: Okay. JEFF: All right? But the exercises are inverted rows. So, we’re over here. Jesse, you’re going to be in this rack over\nhere. Sheamus you’re going to be over here. The second exercise is pushups. 100 before\nyou can move onto the next exercise. The third exercise is bodyweight squats. SHEAMUS: Right. JEFF: Okay, nice and simple. Last exercise is a hanging knee raise, right\nhere from the bar. Now Jesse, I’m throwing you a bone. JESSE: Why you throwing me a bone? JEFF: You know how much more than you he weighs? JESSE: He’s stronger than me. SHEAMUS: Considering your shorts weigh more\nthan you do, I think you definitely have a huge advantage over me on that. JESSE: All right, sorry that I have really\nskinny legs. JEFF: Well, look. Save the trash talking for actually the event. But before we get started, you know there\nare stakes, right? You know – there’s always stakes. You’ve already defined yours. If you win, you get to show up on his channel\nand do a video with him. JESSE: Yeah. JEFF: That’s what you wanted, right? JESSE: Yes. JEFF: Great. Sheamus, if he loses- SHEAMUS: What? JEFF: Yeah. SHEAMUS: Hang on, hang on. [laughs] I love it! JEFF: Right? It’s perfect, right? SHEAMUS: Yeah. JEFF: Great. So, let’s go. JESSE: No, what is it? SHEAMUS: It’s all right. Don’t worry about it, man. JESSE: No, it matters! JEFF: No, you’re going to win. SHEAMUS: All you’ve got to worry about is\nfinishing this workout before me. JESSE: Oh! All right, fine. Are you ready? JEFF: Inverted rows. Get down into position. You can bend your knees. Arms straight, pullup, chest to the bar. On three, two – let me take out the timer. One. Go. Jesse, don’t crack your sternum on that\nbar. I know it’s delicate. He’s making them look easy over here, Jesse. How many is that? JESSE: 13. JEFF: 13? SHEAMUS: 16. JEFF: Okay. JESSE: Oh, come on! Oh, this sucks. JEFF: Jesse, are you resting again? JESSE: Leave me alone! I’m not prepared. JEFF: He just – he keeps going over here,\nJesse. He hasn’t stopped yet. SHEAMUS: [laughs] JEFF: Oh my God, you’re in trouble. JESSE: I’m in serious trouble. JEFF: He’s cranking out pushups down here\nlike they’re nothing. Disney trivia, Jesse? Couldn’t you come up with anything else? JESSE: What’s he at? What’s he at? JEFF: He’s about to finish. He’s at his 100. How many pushups? SHEAMUS: 20. JEFF: 20. SHEAMUS: 21, 22. JEFF: Come on, Jesse! Catch up! You might be able to catch up. SHEAMUS: 23, 24, 25. 91, 92. JEFF: I don’t know, Jesse. He looks strong. You look pretty weak over there. SHEAMUS: 96. JEFF: Four more. Jesse, how many? JESSE: 12. JEFF: 12? All right. Closer. Bodyweight squats. There we go. I like it. It’s competitive. This is where those stick legs are going to\nbetray you, Jesse. JESSE: Yeah, I know. JEFF: I think Sheamus’ legs are a little\nbigger than you. I’m not sure, but I think they’re a little\nbit bigger. JESSE: They might be? JEFF: They might be a little bit bigger. They might be a little stronger. See, he kind of isn’t stopping, Jesse. This looks kind of easy for him. Well, wait. What are you doing? JESSE: I can’t. JEFF: What? Why are you stopping? JESSE: I need to. JEFF: Don’t skip leg day, Jesse. Don’t skip leg day. How many is that? What have you got there? SHEAMUS: 55. JEFF: 55. Jesse, you’re in trouble. JESSE: I know. JEFF: You’ve got to get down. JESSE: Is he on squats now? JEFF: Uh, he’s actually moving onto- JESSE: Are you joking? JEFF: Yes, he is. No, I’m not joking, unfortunately. JESSE: Oh my God! JEFF: I don’t know. If you keep going really fast you might be\nable to catch up. JESSE: No. JEFF: I’m not sure. I think he’s almost done though. How many you got? SHEAMUS: Yes! Yeah! JEFF: Jesse! No, no. JESSE: No! SHEAMUS: Come on! JESSE: No! JEFF: Jesse…he’s done. SHEAMUS: Thank you. Thank you. Keep going! Keep going! Keep going! Come on! Come one! JEFF: How many more do you have? JESSE: Uh… SHEAMUS: There’s no shame in second. JEFF: Come on! SHEAMUS: There’s no shame in second. Come on! JEFF: Let’s go, Jesse. SHEAMUS: Come one, Jess. JESSE: One more. JEFF: Oh, boy. Jesse, nice job. SHEAMUS: Good job, fella. JEFF: Nice job. SHEAMUS: Good job. You know, that’s the whole point of the\nbrave change philosophy that I had talked about on my channel. The only bad workout is no workout. There’s no shame in failure. The fact that you’re in there, working it\nout, learning something new, having fun, putting your body through its paces is really all\nthat matters. JEFF: I’ve got to give him credit. I like to break Jesse, but you know what? You hang with him. You hung with him. SHEAMUS: Yeah. You did a great job, man. JEFF: I’ve got some bad news, though. SHEAMUS: Yeah? JEFF: He did – he definitely lost. SHEAMUS: He did lose. JEFF: There’s always got to be a loser. You know that, right Jesse? SHEAMUS: Well, let’s say ‘second’. JEFF: Right. Second. Really, you’re in second place. But there are stakes too, we decided. JESSE: Please tell me it has to do with my\nbeard again, because I can handle that this time. JEFF: Um… SHEAMUS: No, I don’t think so. It took him five years to grow it, so… JEFF: Yeah. SHEAMUS: Maybe that’s a… JEFF: No, I think what we said in the beginning\nis good. Why don’t we- SHEAMUS: Yeah. JEFF: We’ll take care of that for you, and\nwe’ll- SHEAMUS: Yeah. This is going to be good. Think of it as a life changing experience,\nyou know what I mean? Just think of it that way. It’s all about the positive thinking. A life-changing, a new, improved Jesse. Jesse 2.0. Yeah? JEFF: I like it. I like it. Let’s go do it. Let’s do it. SHEAMUS: Come on, man. It’s going to be fun. JESSE: Is it really? SHEAMUS: Your aunt’s going to love it, your\ngranny’s going to love it. Everybody’s going to love it. I don’t know, Jeff. What do you think? JEFF: Nah, dude. I love it. SHEAMUS: Yeah. JEFF: Yeah, I think it looks great. I really do. I think it’s- SHEAMUS: I think it’s – I actually think\nit’s some of my best work. JEFF: Really? SHEAMUS: Yeah. JEFF: I think it looks great. Yeah. No, that’s actually good. SHEAMUS: Yeah. JEFF: Yeah, perfect. SHEAMUS: Yeah, man. JEFF: Yeah. Good. All right, I love it. Jesse, it looks great. It really does. Thanks, by the way. Good effort with Sheamus. SHEAMUS: Good sport. Good sport. I like it. It’s different. JEFF: It looks good."
}