{
    "id": "d2s5pCQKBRU",
    "title": "The Best Triceps Exercise for Mass (WINNER!)",
    "description": "If you could only do one triceps exercise for muscle mass, this video will show you which one. The best triceps exercise for mass is ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. We’ve got to pick one here, today, and this\nis going to be tough. Which tricep exercise is the best for adding\nmass to the back of your arms? We have to do an Iron Face-Off here, and we’re\ngoing to pit three exercises against each other. I said it’s tough because I actually like\nall three of these exercises. But if you’re going to put the science back\nin strength like we commit to here on this channel, you’re going to sometimes have\nto make some tough decisions. So I’m going to give you the facts about\neach of these to help you see why I’m arriving at my choice for the best. Okay, let’s start it with one of the classic\nexercises here that seems to make its way into all of our tricep routines. It’s the pushdown. I’m demonstrating with a rope, but the same\ncould apply here whether you’re using a straight bar, or a rope. The fact is this, guys: I like this exercise,\nlike I said. What I do like about it is that you can load\nit up. You can do progressive overload – which\nis a key for building more muscle – because this allows you to do that. you can load the whole damn stack, in some\ncases. I also like that it’s easier on your elbows\nthan some of the other exercises that I might even show in this video later on. That’s because of the cables, and the fact\nthat this pully machine makes it easy on our joints. But at the same time it’s doing that it’s\nalso compromising the strength curves throughout the exercise. So if you look at me doing this exercise here,\nwe know the idea that the line of resistance is through the cable. If it’s perpendicular to my forearm – like\nit is in the beginning of the rep – then we’re going to have maximum tension on the\ntriceps at that point. But if at any point it gets parallel to that\nforearm then we know we’re taking some of the tension away. That’s happening with this exercise at the\npoint that it matters the most; down there in peak contraction. Now I’ve discussed in the past here how\nmy rocking tricep pushdown will help obliterate that and we can actually get tension both\nin the beginning, and at the end. But that was covered in a completely separate\nvideo. I’ll show you how to do that in depth in\nthat video. I’ll link that for you there. But we also don’t get that all-important\nstretch on the long head, here on the tricep. Realizing guys, the longhead of the tricep\nis making up the most mass in your tricep. Of the three heads, it’s going to be where\nyou can bank on getting the most size. We don’t ever have our arms over our head\nat any point in this exercise to put a stretch on that longhead. So here again, it’s failing. So for both of those reasons, it’s a great\nexercise, but just not my single, sole choice if I can only pick one. Next up is another classic exercise for the\ntriceps. This one is the close grip bench-press. Now, this one actually offers a versatility\nthat even the pushdown did not. That is, you can either do this with dumbbells,\nor you can do it with the barbell. Whereas, with that pushdown, you’re kind\nof limited to either a cable, or maybe a band setup. But we know the band is a little inferior,\neven with the strength curves. There’s not enough resistance until the\nvery end. So I like that this brings this to the table,\nbut it also allows us to do progressive overlay, because we can really load this one up. That leads immediately into the question of\n“What are we loading?” Are we really loading the triceps here? Just because we have a narrower grip we are\ndefinitely hitting them a bit better, but we’re not going to ever take out the shoulders\nand chest from this movement. Especially if you’re already dominant there,\nthey’re going to want to dominate that exercise every, single time you do it. Beyond that, if you do not lock out every,\nsingle rep here, you’re then going to be throwing out the remainder of the benefits\nfor this exercise because that’s when the triceps become most active. That last quarter of the range of motion to\nget to full lockout. I’m not saying ‘Jam your elbows into extension’. That’s never advisable. I’m saying just get to full extension, with\na steady load here, as you pressed up to the top. But make sure you do because if you don’t\nyou’re missing out on the main benefit of the triceps in this exercise. Not to mention that at no point in this exercise\ndo my elbows ever go back up, over my head to put that longhead of the triceps on a stretch. Finally, can this be a little bit difficult\nfor available joints? It can, just because the weight bearing down\nstraight through the elbow is different than when you were doing the tricep pushdown. So for somebody that has orthopedic issues\nin their elbows, this one could be a little bit challenging. So once again, while I like the exercise,\nbecause of the few detriments that there are to it, it can’t be my number one choice. Which brings me to exercise number three. You know I save the winner for last here,\nguys. If you’ve watched my channel for any length\nof time you probably could have seen this one coming, but once again, it’s for all\nthe right reasons. That is the dumbbell tricep extension, or\nthe barbell tricep extension. Right away we have the versatility built right\ninto the exercise. Both of them are going to effectively work\nthe same way. We’re going to also be able to overload\nthis exercise to create that progressive overload that we need to lift those heavier weights,\nto help the triceps actually respond to that load with growth. Also, because of the fact that we can use\nan easy curl bar when we do it we can not only be kind here, obviously, to the wrists,\nbut back to what I was saying before; the elbows can actually benefit here as well,\nif you make this one important tweak. That is, try to keep your elbows back. Angle backward instead of vertical at the\ntop of this exercise. Why? Number one, we don’t have that compressive\nload coming down through the elbows, underneath that weight at the time of peak contraction. But number two, we actually can keep the tension\non the triceps – because that’s where we want it, right? Instead of on the joints themselves, but just\nshifting our arms back a little bit. I’ve demonstrated this before, and why this\nis some important, but I will tell you this: it’s the key to the effectiveness of this\nentire exercise. You want that tension on the triceps, in that\npeak contracted position, and you can only do it by angling your arms back about 20,\nor 30 degrees here as you see in the end portion of this exercise. Now, beyond that, why is this going to get\nthe winner status? Because it gives me that all-important stretch\nin the longhead down, in that bottom position. You can see every time I bottom out I can\neven raise back a little bit more to get that extra stretch in the longhead, and then come\nback out of that position every, single time. So I have the benefit of the stretch reflex. I have the benefit of the peak contraction. I have the benefit of all the strength curves\nworking in my favor. And of course, I have the benefit of being\na little bit easier on those joints. So guys, for all those reasons – and we\ncan load it up, too. It’s a mass builder. For all those reason, if I had to choose one,\nthis would be the choice. But guys, as we always say here, it’s never\nall about one exercise. As a matter of fact, exercises themselves\nnever make the workout program effective. It’s how you do them that makes them effective\nand we always pay attention to the details, no matter what it is we’re doing. Not just breaking down these exercises, but\nwith every, single workout that I prescribe to you guys in all of our programs. If you haven’t already started one of our\nprograms, head to ATHLEANX.com right now and get our ATHLEANX training system. In the meantime, if you’ve found this video\nhelpful leave your comments and thumbs up below. If you want to see more Iron Face-Offs let\nme know what you want me to over and I’ll do my best to pit them head to head, and tell\nyou guys what I really think is the best of the best. All right, guys. I’ll see you soon."
}