{
    "id": "deggbGFZBgA",
    "title": "7 Subtle Exercise Fixes for BETTER Gains (WORK INSTANTLY!)",
    "description": "Whether you're trying to gain size, strength or both there are a few tried and true exercises that will get you there. Any coach worth ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The only thing that could kill a great exercise\nis making a big mistake while performing these great exercises. Today I want to cover seven of the best exercises\nthat you could be doing and should be doing but show you how to make sure you’re not\nmaking these common mistakes along the way. What are we talking about? Guys, the exercises that work. The squat, the deadlift, a lined tricep extension,\na barbell row, an overhead press, an ab wheel rollout, and a lateral raise for your shoulders. All these are common exercises that you’re\ngoing to see if you go into any gym today. Lot of people are doing them. However, you’re likely to see the very same\nmistakes I’m going to show you here today. I’m going to knock them out one by one and\nshow you what you should be doing instead, and make sure you’re avoiding these common\npitfalls. Let’s kick it off with one of the bigger\nlower body exercises. That is the squat. As a matter of fact, it’s going to have\nsomething very much in common with the other big, lower body exercise the deadlift, which\nI’ll follow this up with. With the squat, see if you can notice a difference\nbetween these two squats. One of them may look right to you and one\nof them may not. If you think the one where I’m overextending\nis right, then you need to fix that. A lot of people think when they get to the\ntop of the squat, especially when they want to get over activation of the glutes, or feel\na really good squeeze in their glutes, they really try to get into hip extension. But what you’re doing there is really not\nproviding any additional benefits for the squat. If you think about how your body is loaded,\nit’s loaded from the top down. We call it axial loading. What you’re doing there is a translation\nmove, side to side. So, you’re not effecting the fact that the\nweight on your body is loading you downward and you’re just carrying that weight side\nto side. You’re not loading that additional extension. However, what you are doing is placing additional\nshear stress on your lumbar spine that’s not necessary. When you do the squat what you want to do\nis what I showed you on the other side. You want to make sure you come straight up\nand down. Not only are you going to be saving your back,\nbut at the same time you’ll have a more efficient movement pattern because a squat\nshould be executed on a straight bar path, up and down. You can see that’s possible when I’m not\nmoving my body and translating it front to back. So, become more efficient in the movement,\nsave your back at the same time, and you’re making sure you’re getting this right every,\nsingle time. Next up is the deadlift and as I mentioned,\nit’s the same problem happening here. We tend to try and overextend the lift at\nthe top of the movement, with very little extra benefit for the exact reasons I just\nlaid out on the squat. Your loading is still up and down. The bar is subject to gravity, and the forces\nare acting straight downward. having this translation force front to back\nis not giving us any extra benefit. As a matter of fact, once we lifted the weight\nup out of the hinge and got into a straight, vertical position here, leaning back more\nis not getting us any benefit. It’s giving us the same detrimental effects\nthat the squat was, in terms of shearing on the spine. What we want to do is get to vertical. A lot of times what people will do is try\nand trick themselves into thinking they’ve completed a rep. They’ll take it from here, they’ll get\nup, they’re not even there, they’re still in that cat-back posture, and then they do\nthis, and they come underneath, which is a posterior pelvic tilt. But they’re still not even in full hip extension. They’re deceiving themselves by leaning\nbackward to think they’re lifting the bar up even more, thinking they’re completing\nthe rep. That’s not the case. Make sure you finish the rep by going into\nfull hip extension, completely vertical, stop there, and go back down for your next rep. Exercise number three is not a big lift, but\nit’s no less popular as you see people using this every day in the gym. It’s the ab wheel rollout. However, they’re turning this move into\nsomething it’s not supposed to be. They’re turning it into a hip flexion and\nextension movement. We’re not trying to train the hip flexors\nhere, guys. We’re not trying to train the hips at all. As a matter of fact, what I want to do is\ntake my hips out of the movement. This is and anti-extension ab movement. I’m trying to prevent the overextension\nof my spine as I lengthen my body out because we know as I lengthen the moment arm I’m\ngoing to be more subject to the force of gravity, more subject to its wanting to cave in my\nlower back, letting my abs give out, and bring me down to the ground. That’s what we’re trying to fight. So, it doesn’t have anything to do with\nour hip flexors. As a matter of fact, we’re going to get\nour body out there, lock it in, and then try to curl in through flexion of the spine, and\nthen back out to a neutral position to avoid overextension. So, take your hips out of it. If you find yourself rocking back and forth,\nyou’re doing it wrong. Get your butt in one position. Try to keep it in one position and let the\nupper body do the rest of the movement out and in the entire time. Exercise number four is one of the better\ntricep exercises you could do, as long as you’re doing it right. It’s the tricep extension. You can do this either with an easy curl bar,\nor you could do it with dumbbells, as I’m showing you here. The key is how you’re performing the lift. The key is where you’re starting and stopping\nthe movement from. I feel like a broken record when I talk about\nthe force of gravity, but when we’re lifting dumbbells and lifting weights in general,\nmost often we are fighting the force of gravity. Which is what makes it so damn difficult. What we have to understand though, is when\nour arms, or whatever the moving part, is parallel to that force of gravity we don’t\nhave nearly the work being done in those muscles anymore, and we’re not subjecting our body\nto the same amount of stress. When we’re trying to build muscle, we want\nto subject ourselves to stress. That’s why it’s so uncomfortable. However, you can see in this first version\nof the tricep extension here, when I extend my arms all the way straight up over my body\nlike many, many people do it’s very easy at the start and stop of the exercise. I could stay here for a long period of time\nif I wanted to. Not in the case where I make this slight shift\non the elbows backward. Start and stop all your reps on this exercise\nwith your elbows angled backward from vertical by about 20 to 30 degrees. Instantly, I now have to fight to hold those\ndumbbells up against the force of gravity because it’s no longer acting straight down\non my arm. It’s acting down on my arm at an angle,\nas you can see here. That makes all the difference. Subjecting the triceps to a lot more tension\non every, single rep over time, set after set is going to have a bigger benefit to you,\nand a better benefit on your triceps in the long run. Make sure you get this right, guys. It’s a very quick and easy change to make. Moving on here, I always say it’s impossible\nfor me to separate the physical therapist from the strength coach when we look at exercises\nbecause we know if we do them incorrectly the repercussions will mount up quickly. So, what we’re looking at here is a popular\nshoulder exercise that is done wrong so often. Probably because it even has its own catch\nphrase. That is ‘pour the pitcher’, when you do\nthe exercise. You do not want to pour anything, guys. If anything, you want to try and un-pour what\nyou’re pouring. Why? Because when we get to the top of a lateral\nraise, if we’re letting our pinky get higher than our thumb, i.e. pouring an imaginary\npitcher of water, what we’re doing is putting our shoulder into internal rotation with elevation\nat the worst time possible. Especially realizing you don’t need to do\nthat to adequately stimulate the shoulders. What you want to do instead is the opposite. As your arm comes up to the side, you want\nto make sure your thumb stays higher than your pinky. It’s not a dramatic move, but what we’re\ndoing is taking inside the shoulder joint, an internal rotation moment, and we’re turning\nit into an external rotation moment. That is something that’s critical because\nthat little extra amount of space clears room for the glenoid humeral head inside the socket\nto get up there without likelihood of impingement. You don’t want to risk impingement. I know there are different types of acromions,\nthere are different types of bone structures that would allow some to get away with it\nmore than others. However, when you’re going to rack up rep,\nafter rep, after rep hopefully year, after year in the gym make this small change, guys. I promise you, the benefits will be well worth\nthe change in slight positioning here. Moving on, we’re back to the bigger lifts. In this case, the overhead shoulder press. Once again, guess what? I care about your shoulders. Why? Because we can make one, small change on this\nexercise and reap all the benefits that this exercise provides, as one of the best upper\nbody exercises we can do without the detrimental effects that come to the shoulder joint by\ndoing it incorrectly. How are we going to do this incorrectly? How are we going to screw up our shoulder\njoints here? By going too wide on the bar. What do we that have to do – it’s not\nnecessarily more than anything of what the implications are on the shoulder joint by\ngoing that wide. When I take my hands out like this, what it\ndoes is takes my elbows out with it. If I go wide on the bar the elbows go out\nwith it. The further back my elbows get, to the point\nwhere we could exaggerate it to do the overhead press behind the neck, we know we’re fighting\nthe natural angle of our shoulder joint, called the scapular plane, which angles forward about\n45 degrees. To get optimal desired movement in your shoulder\nyou want to have your arm angled forward about 45 degrees from straight horizontal here. So, we could do that, just by narrowing up\nour grip on the bar. You might find that you’re even a little\nbit stronger in here because your body is tighter, you have more core strength and stability\nfrom below, and you get some tricep activation and assistance as well. So, we want to make sure we’re narrowing\nup that grip. What it does is takes those elbows from that\nwide position, putting them out in front of the body, mirrors that scapular plane, and\nallows us to press up nice, and strong. Guys, it’s not going to sacrifice your form,\nit’s not going to sacrifice the way you can press, but it’s going to save you in\nthe long run. So, make the switch. And last, but not least, we get into the barbell\nrow. Another great compound movement here, and\na great pulling exercise if done correctly. Once again, we’re caring about those shoulders\nand we’re talking about elevation here. You’re probably thinking ‘elevation? But you’re bent over here.” Guys, it’s not about the position of your\nbody in space, necessarily. It’s more about the position of your joints,\nin relation to other parts of your body, regardless of your position in space. The barbell row is a perfect example here. If I go extra wide and pull up on the bar,\nI’m limiting a couple of things. Number one: I’m limiting the amount of adduction\nthat my arms could get to my sides. How close I can get my arms to my sides for\nbetter lat activation. We know that the best lat activation is going\nto come from having our arms in tight. Not only that, we know the best carry over\neffect to some of the other big exercises, like the deadlift, is when we can get our\narms adducted tightly into our sides. Which is why concentrate so much in ATHLEANX\non straight arm pushdowns. Regardless, better lat activation is going\nto come from having your elbows in. The way we can do that is have our grip narrower,\nonce again. Not only that, we look at that position. If I’m up here doing the row – I mentioned\nelevation before – you can see it. Just because I’m bent over doesn’t mean\nthat I don’t have elevation of the shoulder here and, once again, with internal rotation\nwith the weight being pulled downward, and my hands and shoulders being pulled downward\ninto internal rotation. We can get our arms in here, a little bit\ntighter, elbows closer to the sides, and pull. If anything, our arms are now traveling with\nmore desire to be externally rotated as I pull up into extension this way and open my\nchest up. Again, one, small change might make a world\nof difference for you and it’s not going to compromise the results you see from this\npowerful exercise. There you have it, guys. Seven exercises that are being done everywhere\nand now being done by you. Hopefully right every, single time. Guys, I say it all the time. You’ve got to train hard, you’ve got to\ntrain smart, and if you do, you’ll train forever. If you’re looking for programs that do that\nfor you, laying it out step by step, all our ATHLEANX programs are available over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the day, and weeks ahead. And if you haven’t already, guys, please\nclick the subscribe button and turn on your notifications, so you never miss a video when\nit’s published. All right, guys. I’ll see you again soon."
}