{
    "id": "DHD1-2P94DI",
    "title": "Intense Ab Workout | 7 Minutes (FOLLOW ALONG!)",
    "description": "If you want to develop six pack abs you may think that you have to spend hours a day trying to get one. That is not the case at all.",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. If you want to get a six pack, you’ve got\nto give me seven minutes. Not once. Repeatedly. Here’s the thing. Seven minutes makes it very, very doable. It makes it something you can stick to. I will tell you the biggest secret for me,\nthat allowed me to get abs from the time I had none up until now is consistency. If it wasn’t something I could do quickly\nthen I didn’t want to do it. I know you can do this. This is exactly what I did. Here’s how I’m going to prove it. I’m going to go through this workout with\nout today. I want to prove to you that I’m not going\nto ask you to do something that I wouldn’t do myself. So, we’re all going to go through this. I’ve shown you this before. I did a seven-minute workout for you before. If you haven’t seen it, I’ll link it at\nthe end of the video as well. But if you choose the right exercises you\ncan get the job done quickly. It’s going to take its toll, but fast. We have our six-pack-shuffle here. That comes with a lot of our programs. All we have to do is hit the shuffle button\nhere, and what’s great is it kicks up the option for us to choose the different types\nof equipment we want to use. For this workout I want to make it something\nwe can all do, no excuses. So, we need to use bodyweight only. Then we can choose the difficulty level. I’m going to choose a moderate level here. Not a beginner, but not really hard. A moderate level. Again, it’s consistency that matters most. So, we’re all going to be able to do this. Now we kick up the workout here. You can see what I’ve got here is a seven-minute\nworkout, like I said, that starts off with a lower ab movement here called the seated\nab circle. You can see I’m going to take it all one\ndirection here. For the entire 60 seconds we’re going to\nwork our lower abs. Then we’re going to move. We’ve got to hit the other side, too. So, for the next 60 seconds we’re going\nto spend going the opposite direction. Then we’ve got to get a little bottom-up\nrotation because that’s one of the main functions of the abs. The drunken mountain climber allows us to\ndo that. Not just driving our knees straight in but\nallowing for rotation as we do them. We finally get this much needed 30 second\nrest period. Then we come out of that and go onto our marching\nplank. Again, I don’t like standard planks. I don’t like to just stay there. I like to do something our planks and this\nis one thing we can do here as we march throughout the entire 60 seconds. We then move onto a scissor. With the scissor we’re getting some rotation\nat the bottom of our torso here that will put some extra stress on the obliques. But if that wasn’t enough, I’ve always\ngot to throw in my starfish crunch because you guys hate that. I mean, you love that. It’s the starfish crunch. It’s a brutal exercise. We’re getting obliques, we’re getting\ntop-down, bottom-up, and we only have to do it for 30 seconds. You do get your 30 second rest period, but\nyou’re not done yet. You’ve got to come out of that and finish\nwith our Russian V-tuck twist, just for 30 seconds to wrap this all up in seven minutes. Now I’ll have a little emcee go here through\nthe workout, take us through it, but you’ve got me too, all right? We’re all going through this together. So, we’re going to start with that seated\nab circle. You ready? I’ll get ahead this way to start. So, lift the leg up and make big circles up,\nand to the left. The key here – two things. Whenever you do your ab training you want\nto try and put yourself into a little bit of a zone because it’s going to start to\nburn and you don’t want to think about it. You don’t want to feel it every, single\nsecond, or you’re going to want to quit. You’ve got to put yourself in that little\nplace – that little, quiet place – where your abs just keep cranking out reps and you’re\nnot thinking about how much it’s burning. I’ll tell you this, if it makes you feel\nany better, mine already are. So, you’re not alone. Oh, shut up, Jesse. He’s going to torment me, I think. So, I keep going. All the way around. Up and to the left. 3 seconds. We get a little, 5 second reprieve. Now I’ve got to head the opposite way. Up, and to the right. Here’s the key: if you’re using your hip\nflexors too much they’re going to burn so much that you may find you can’t complete\nthis. What you want to do is squeeze with the abs. Let the abs do the work. Can I tell them, Jesse, how you screwed up\nwhen we did this workout a few minutes ago with the camera? And I’ve actually had to do this now twice. Can I tell them that? JESSE: No. It’ll make me look bad. JEFF: So, it’s doubly hard for me because\nI’m not actually doing seven minutes. I’m doing 14 right here. Just to remind you. We’ll do it though, guys. We’ll do it. We’ll do it. Despite Jesse trying to sabotage me. Up and to the right. Again, use the abs, not the hip flexors. Okay. 60 seconds. Get the rotation. See, regular mountain climbers right here? We’re going to rotate. Drive it in with the abs. Don’t actually get drunk to do these, guys. That’s going to make it a whole hell of\na lot harder. Actually, it might come as a little bit of\na surprise and you’ll puke all over the place. 30 seconds. I heard her say it. I swear. I believe I’ll get my rest after this, too. I heard that. 10 seconds. We need it, guys. Good job. So far, good job. See? I told you. I do this every day. Every day. It doesn’t get easier, right? But the thing is, when it’s short you know\nyou can stick to it. Anybody can stick to and go through some discomfort\nwhen you can see the other side of the finish line. All right. That rest is over. Too fast. Here we go. Marching planks. 60 seconds. Nice control. Tighten your glutes here. Most of all, tighten your abs. Remember that little happy place I said? This is exactly where you want to be right\nnow. JESSE: Full of carrot cake? JEFF: Oh, yeah. Dancing little carrot cakes in my head. Get into a rhythm. Before you know it, she’s going to say “10\nsecond”. Like that. 60 second scissors. All right. Here’s one of my better exercises. I could do these for an hour. Well, maybe not. JESSE: Feeling the burn yet? JEFF: Nope. It’s like I’m lying on the beach right\nnow. Oh, that’s what it is? Oh, I thought that was a sunburn. That’s my abs that are killing me. About 15 seconds. Use those abs. Starfish crunch. 30 seconds. One, two. Arms out. Out and touch your toe. Toward your toe. JESSE: That’s everybody’s favorite, right? JEFF: That’s everybody’s favorite. Mine right now. Oh, yeah. Lost my mic. Just in time. 30 second rest. Oh, you need it after those. People are saying right now – they’re\nsaying, “If this is this hard for Jeff, how am I going to do it?” Guys, do as much as you can. Even if you have to bail halfway through the\n30 seconds there. So, what? Go for 20 and then rest the extra 10 seconds\nand then keep working up to it. Last one. I  feel fresh as a daisy. Grab one knee in, touch the opposite side. Legs off the ground. Last 10 seconds. Guys, good job. Good job. All seriousness, like I said, six pack abs\nare built just seven minutes at a time. Six minutes, five minutes, six minutes, eight\nminutes; in that range. The idea is that you don’t have to devote\na half hour every day to train your abs. The key is short, intense workouts that get\nthe job done and stay consistent with it. If it’s something you can do with no equipment\nat all, that’s going to make it that much easier for you to do. If you’re looking for step by step programs,\nguys, I walk you through everything. I never let you do it on your own. As a coach I’m going to walk you through\neverything you do. Those are all available at ATHLEANX.com. If you haven’t already, guys, subscribe. Get more of the torture. Make sure you turn on your notifications as\nwell, so you never miss a video. Let me know what you want me to cover, guys. This channel is for you. Whatever you want me to do, I’ll make sure\nI do that for you. Just leave them in the comments below. All right, guys. See you soon. Jesse, you’re up next. Let’s go. JESSE: No, dude."
}