{
    "id": "dhn5lND_Dfs",
    "title": "Chinups vs. Pullups for Bigger Arms (THE VERDICT!)",
    "description": "Should you do chinups or pullups if you want to build bigger arms. This video is finally here to answer the question for you and ...",
    "transcript": "What s up guys, Jeff Cavaliere, Athleanx.com. \nSo, if I had to limit you to just one exercise   to build bigger arms and your choice was \na pull up as shown here. I m going to let   you see it from every angle front and \nback or a chin-up, as shown here again,   front and back. Which one of them would you do if \nyou wanted to build bigger arms? As always, guys   are going to do what we do here are going to put \nthe science back in strength and going to break   out a muscle marker to help us to make the right \ndecision. Now, I'm going to start with one of the   exercises. Which one should we do, Jesse? \nChin-ups!\n  Chin-ups. Okay, with the chin-up guys, \nwe re talking about that underhand grip   variation where you pull yourself up to the bar. \nWell, what do we get instantly? We know that we   get better bicep activation, right? Because if I \ntake my arm just like this and I turn this form   over into the supinated position, you can see the \nbiceps work just by doing that. So, we know we're   going to get better engagement of the biceps \nfor doing that. But before you rush and say,   well, there's the one, that's the one that's \ngoing to build the bigger biceps, better arms,   here we go. Hold on a second because we don't \njust do this, in order to get the chin-up into   position, we have to do this too.\nYou can see that when I bring my arm   into this position, I instantly do something \nelse. I get a better activation of the lats.   The reason for that is that I'm getting more of \na stretch placed on the lats by taking the two   attachment points further away from each other. \nThis can tend to give people better recruitment   of the lats and actually, sometimes, dominate \nthe contribution of the biceps. How do we fix   that? If we're going to do an underhand chin-up \nwe want to make sure that we give ourselves a   chance to actually curl ourselves up to the \nbar as opposed to just pulling ourselves   directly up. When you pull yourself directly \nup you re going to favor more of the lats. \n  If you want to use this as an arm builder, \nyou're going to want to do this instead.   You pretend like you're curling your body to \nthe bar the same way that you would curl a bar   up to your body in a traditional barbell curl. \nAnd when we do that, you can see that we get   better activation and recruitment of the biceps, \nwhich turns us into a tremendous biceps builder.   But we're not done yet, and I haven't even used \nthe muscle marker yet because there's another   muscle in your arm that you're going to want \nto build up if you want to have bigger arms.\n  And no, it's not the triceps, it doesn't \nwork the triceps. We're talking about   this muscle right here, and it's the brachialis. \nYou can see that when I go like this and I pull   my arm in as I'm pulling up into a pull up, \nyou can see that this muscle here pops out.   That is what the muscle marker here is for. \nYou can see right in this area here, right?   That muscle in there, which crosses the elbow, is \ncalled the brachialis. That is going to give us a   lot of width on the arm, which is going to fill \nup those shirtsleeves, making it a tremendous   arm builder. But you have to do this right too. \nYou don't do a typical wide grip pull up. \n  Instead, what you do is you want to narrow up \nthat grip because you can see if the brachialis   is a flexor of the elbow and my arms are wide \nlike that and I pull down, I only get a limited   amount of flexion at the elbow. But if I were to \ngo narrower, look at how much more flexion I get   in the elbow. Therefore, the narrow grip is going \nto set us up for more success in terms of building   the brachialis. Now how do we pull up to the bar? \nThat matters too. You don't want to close down and   go all the way up tight to the bar when you do \nthis if it s your brachialis is that you want   to build. You want to maintain a little bit of \ndistance so you could keep this 90 degree angle   because you can see once again that when I \ncome in here in this position and I have my   brachialis engaged, if I were to go and continue \nto pull it close, close down this angle, I start   to lose some of that activation, right? \nI got good activation there and as I get   a little bit closer, I lose it. You want to \nmaintain that distance relationship from the bar   if you want to get the brachialis to be built up \nbigger and stronger. So, what's the answer? Well,   the answer is, good thing we have to choose \none thing, the answer is both of them. How   would you do both of them, no matter what split \nyour following right now? If you're following a   bro split, I would consider the brachialis \nexercise to be more of the pull up. Okay,   and that would go on our back day, and I consider \nthe chin-up to be the better bicep exercise if   you performed it the way that I showed you and \nthat would sort of go on bicep or arm day. \n  Now, if we're doing a traditional pull workout, \nthen of course you can put them either in   alternating workouts to one day you're working the \nchin-up, and the next time you do your workout,   you're working the pull up. Or you can actually \nuse them together in the same workout, with one   being the focus of the strength lift, meaning, \nlet's say, a weighted pull up. And then you use   your chin-up as a higher rep accessory exercise \nprovided you actually can bang out quite a few   reps with chin-ups. You can actually use a \nband if needed for some assistance there.   Or you can certainly fit this in in a total \nbody workout scheme where you're doing this   every single time you're training, either \nthe pull up or the chin-up. Again optimally   kind of waiting there so you can help with \nthat progressive overload to build either   of those muscles you're trying to grow. \nThe fact is, guys, both of them are great   exercises. How you do what you do always matters. \nNow you know how to do that. If you're looking for   a complete plan, guys head over to Athleanx.com, \nwe have all of our plans available to you,   including our meal plan, everything laid out \nstep by step. If you found the video helpful,   make sure you leave your comments and thumbs \nup below. Which exercise do you prefer and why?   Leave that in the Comments below. And also, if you \nhaven t done so, click Subscribe and turn on your   Notifications so you never miss a new video when \nwe put one out. All right guys see you soon."
}