{
    "id": "dHPEzjF6Qnw",
    "title": "Working Out with Biceps Tendonitis (DON’T SKIP BICEPS!)",
    "description": "Make gains without pain with this - http://athleanx.com/x/make-gains Subscribe to our youtube channel - http://bit.ly/2b0coMW ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Is biceps tendonitis knocking you out of the\ngame, as far as you training goes? Well, I'm going to tell you today, first of\nall, you're probably not alone because it's one of the most common things that will take\ntime away from your ability to train in the gym. Number two, the good news maybe, is that it\nactually has nothing to do with your biceps, for the most part. You see, your bicep train is not what's putting\nyou in the predicament that you are in right now. It's really what's going on in the shoulder\nbecause I you look at the anatomy and the biceps the first thing you have to look at\nis – as I come around the other side – we have two heads of the biceps. That's why we call it the \"biceps\". One is the short head that attaches here to\nthe corpora process, and then one that attaches to the top of the ball and socket, which would\nbe the socket portion here on the shoulder joint. Okay, so the very, very top. What you have there – as you can see the\ndifference – this is the long head. It's higher than this one over here, thus,\nit's longer. It's the long head versus the short head. The long head is always the thing that gives\nus all the problems because the position of it, in relation to the shoulder joint, is\nwhat's problematic. You can see here, I've got this dislocated\narm, but you can see right on top where this rubber band is running, this is the groove\nfor the bicep tendon. So the bicep tendon for the long head sits\nright in that groove. Then it actually gets put inside the socket,\nand this little metal piece here, I'm going to show you, is actually kind of beneficial\nto what I'm going to show you in a second. You see, I'm flicking it. What happens is, just like the fraying of\na rope over metal, if I were to take this band and just keep rubbing it over this metal,\nwhat do you think is going to happen over time? Over time it's going to start to fray, break\ndown, and cause pain, and become inflamed. Well, the same thing is happening here with\nbicep tendonitis. It's not anything you're doing with curls. If you look at the position of the bicep tendon\nduring a curl it's actually non-problematic. There's not either a lot of stretch going\non here, there's not a lot of compression going on of the bicep tendon here because\nyou don't have any elevation of the shoulder. The only thing that would cause a problem\nis if you were to go into an incline curl, in which case the arm would come way back\nhere behind the body. You can see how that is going to place a lot\nmore stretch on that tendon, which could possibly already be inflamed, but generally that doesn’t\nbecome a problem until after it's already inflamed. It's not causing the inflammation in the first\nplace. So what's really at the root of your problem? Probably a lot of your other exercises that\ninvolve anything with your shoulder over your head. Particularly those that have elements of bicep\ncontribution, too. So things like a chin-up. If you're doing a chin-up your arms are going\nto be up here, elevated, over shoulder height, and then you're going to have the supination\nhere of your wrists, so you're going to have to be up here in this position. Now that you've already got the activation\nof the biceps, but with a compression here of the bicep tendon – because guess what\nhappened when you lifted this up and lifted your arm up? You compressed it. You left not much space here inside for the\ntendon to actually exist without banging up against the other bone up above it. Okay? The acromion, namely. So what you need to do is consider what other\nexercises could do that. Well, a bench press could do the same thing. If your elbows are out here to the side you\nhave that elevation, and even a squat could do the same thing because you've got this\nexternal rotation with an elevated arm that's putting you back in that position. So it doesn't necessarily have to do anything\nwith your bicep exercise, but more so with the health of your shoulder. So how do you fix it, or how do you combat\nit? You've got to start looking at your shoulders. The only thing that's going to help you to\nkeep the position of this shoulder in place without allowing it to migrate too far off\nto pinch this tendon every single time, is the strength of your rotator cuff. Now, I've talked about it so many times on\nthis channel. There's many videos I've done dedicated to\nthe rotator cuff and how to train the rotator cuff that allows this head of the humerus\nhere to stay down. Enough space here so that when I elevate it,\nit’s not banging up against the roof here causing the pinching of this rotator – this\nlong head of the biceps and causing it to fray over time as I go back and forth, back\nand forth, back and forth. I have to be able to keep this depressed as\nI elevate so that bicep tendon isn't getting abraded and sort of worn down every time I\nraise my arm up over my head. Scapular work is going to be just as important\nas well. Like I said, I have lots of videos devoted\nto 'how to strengthen the rotator cuff' on this channel. You could link to those and find those as\nwell. But the idea here is, you can't always look\nat the source of pain and say \"Hey, this is what the problem is.\" As a matter of fact, you would not stop training\nyour biceps if you had a bicep tendonitis, as long as you were keeping your arm down\nhere in a regular, traditional curl position. So, you want to start looking elsewhere and\nunderstanding how the body works and intertwines together. I try to do that in our ATHLEANX training\nsystem by putting the science back in strength. We've been doing this for a long time, guys,\nand I break out the visuals for you to help you to understand why something is happening. So you're not just doing things because someone\ntells you to do it, but you're doing it because you understand why you're doing it. That's all over at ATHLEANX.com, our whole\nATHLEANX training system, like I said, breaks it all down, day by day, workout by workout. In the meantime, if you've found this video\nhelpful make sure to leave your comments and thumbs up below. And if you're suffering from bicep tendonitis\nyou can probably get back to training those biceps a little bit more, but have an eye\ntoward what you're doing to try to fix your shoulder in the process. All right, guys. I'll be back here again real soon."
}