{
    "id": "dHWsiBOV2oQ",
    "title": "ATHLEAN-X Workout Video Shoot (BEHIND THE SCENES!)",
    "description": "Get your complete ATHLEAN-X Training System here http://athleanx.com/x/complete-ax-workout-and-nutrition-plan Ever wonder ...",
    "transcript": "What's up, guys? Jeff Cavaliere, AthleanX.com. This is a much different setting than you\nguys probably have seen me in here, but it was a choice I had of either no video, or\ndoing a video a little bit behind the scenes. You guys have asked for some of the \"behind\nthe scenes\" videos before, you've liked them; this is behind the scenes. You can look, literally, behind my shoulder\nhere and maybe see way in the background that we've got a shoot going on here. We have Melissa from our Athlean-XX for Women\nchannel. A lot of guys don't even realize we have a\nwoman's channel here. I'll put a link in the description below. It's late at night here. I don’t even know what time it is, but I\nknow it's dark, and we've been doing this all day. A lot of planning going into today's stuff. We're actually working on some hip mobility\ndrills, we're working on some hip stability stuff; again, I always think the two go together. We are working on all new exercises, we never\nsleep here. People accuse me of not sleeping, that I come\nup with this shit in my sleep, and they're pretty much right, except I don’t sleep. I come up with it all day long and it makes\nits way into our videos, it makes its way onto our programs. The level of planning that goes into what\nwe do, the hours of dedication that it takes; I can tell you that's the only reason why\nI've gotten as far as I have in my life because I was never the most talented, I was never\nthe biggest, certainly not the strongest; but the level of dedication I have, I would\nput it up against anybody, anywhere, in any field of expertise. That's why I think Athlean-X excels at what\nwe do. We're here demonstrating that again and hopefully\nyou guys are all been fitting from it. I've got to get back to work because they're\nwaiting for me in the other room, but I'll see you guys back here in a couple days with\nsome more results from the stuff that you've already been working on in there. All right. See you soon. What we could do is, we could do the single\nleg plow out of the bridge. You have to ride up by lifting through here\n– put your hands together on the ground – in order to slow it down. Essentially, your hands would be where you're\nat, but you're literally going to find yourself pushing up and then that's where I push down. Keep me up there, slow. Otherwise, if I don’t have my hands down,\nI'm going to come crashing down. Cool. Why do you want to see the 'behind the scenes'? What makes Athlean-X tick? This is it. We've got our film crew here getting ready. Yes, we use cheat sheets at times because\nit's a little hard sometimes. We've going through all \nthe exercises and now what we're going to do, I'm going to show a lot of new things\nin our workouts and exercise style and programs. If it gets hard to remember you guys have\nthe luxury of – the customers – you can actually read it in a report. For us, doing it live we sometimes have trouble\nwith that. Yeah, one of the rules with the Xbox is you\nhave to bring two pairs of shoes. Few people know this. One shoe is for outside, and then you need\nan indoor pair. You've got to respect the bottom. Those have never seen the light of day. The floors have to remain spotless. If you forget your second pair of shoes… What's good about this, guys, is obviously,\nlateral stability is extremely important, especially when it comes to our hips and when\nwe're ready in this position – which we're always in when we're doing anything athletic\n– lateral stability becomes that much more important. So let's test it out and see what you've got\nby actually doing it in that position. Side, you'll want to fall over. Then side, you'll really want to fall over\nbecause the weight of my leg is already over here. So that's a challenge. [inaudible 0:04:08-0:04:10]. Cool. So let's get that going. You guys just do that to completion. [inaudible 0:04:30] exercises, then you have… So, today's workout, we're going to do an\n8 legged torture of a workout. Here we're doing eight exercises, eight reps,\neight rounds. Are you ready? We're going to jump, go to the side, like\nthat. That's one. It's a quick movement. It's one, two, and three. Once you go really fast. Can I stop you? Stay right where you are. You forgot one of the touchdowns. We'll swap them out on the board, but the\nnext couple of eight are touchdowns. Kevin, we've got to figure out … Cut?"
}