{
    "id": "DjLCSPDNoB0",
    "title": "Eat This EVERY Day! (WORKOUT OR NOT)",
    "description": "If you could eat just one additional thing each day for better muscle gains, this would be it. In this video, I'm going to show you how ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So, they say “An apple a day keeps the doctor\naway”. But that’s not what my recommendation is\nhere. I am going to show you today a food that I\nbelieve you should try to incorporate every, single day into your diet. Especially as it relates to your ability to\nsee consistent muscle gains in two mechanisms. Number one: by decreasing the soreness you\nexperience in your workouts from day to day, workout to workout. Number two: by keeping you healthier. Boosting your immunity so you can actually\nstay in the gym more consistently. Instead of registering all those off days\nbecause you’re sick. What I’m talking about here is not an apple,\nbut ginger. This is a shaved ginger. This is pickled ginger. They shave the root and put it in a vinegar\nbrine, and they soak it. This is what you’d be familiar with. This is a little bit white, but you can see\nthe pink stuff you get when you go for sushi. This is so powerful that I’m now a big believer\nin it. I’ve actually incorporated this every, single\nmorning into my breakfast. I put it on my egg whites. I know that sounds a little bit gross, but\nI promise you, it’s actually really, really good. It’s not a great taste for some people. It’s an acquired taste because it is a little\nbitter. But if you can stomach it – well, the good\nnews is, your stomach will thank you too because what it does is also helps with digestion,\nhelps with nausea, and you go back to mom’s old recommendation to have ginger ale when\nyou’re not feeling good. Well, I can tell you this; there’s really\nnot that much ginger in ginger ale. So, it’s not going to do a damn for helping\nyou feel less nauseous. But she had good intentions. Let’s just leave it at that. I will also recommend that you don’t eat\nthe candied form of ginger. Again, you’re basically taking something\nthat’s good and making it really bad because you’re getting less and less ginger, and\nyou’re getting more and more sugar and all the things that aren’t going to help you\nwith what we’re trying to do. But when it comes to the gym, one of the most\nimportant properties of ginger is its ability to help with inflammation and delayed onset\nmuscle soreness. So now, look at the scenario that we face\nthese days. We have a lot of guys preaching ‘volume,\nvolume, volume’, less eccentric training, less induced muscle damage because that’s\ngoing to prevent you from being able to get back to the gym and train again. And it’s going to cut down the number of\nsessions you’re going to log over the course of a year because you’re delayed onset muscle\nsoreness is interfering with your ability to perform. So that makes sense, but if you had a way\nto control your muscle soreness and still be able to train at a high intensity level\n– and yes, include some induced muscle damage from eccentric training – and take care\nof a lot of that delayed onset muscle soreness because you’ve taken just a little bit of\nginger; it only takes about that much a day. A little pinch of ginger every day. I think that gives you all new options for\nattacking this. So, what I’m recommending is to figure out\na way that you can get some pickled ginger and incorporate it in some place in your meals\nevery, single day. Not just beside that. We talked about the other obvious benefits. We talked about the benefits for digestion. We talked about the benefits of just using\nsome acknowledgment. We also know that it can decrease your cholesterol\nand it’s also shown to help with suppression of appetite. So, if you’re having difficulties getting\na hold on the amount of food that you’re eating in a day, and it’s still a challenge,\nand you’re still having issues with your weight; maybe incorporating some ginger here\nwill help to suppress your appetite. Or at least control your appetite between\nmeals to allow you to be a little more routine. We always talk about it, guys. Consistency with a nutrition plan is the number\none requirement. Also, you’ve got to like what you’re eating. So, if you really, really hate ginger, maybe\nthis video is not for you. But if you give it a try there will be a lot\nof benefits that are going to carry over and help your overall workout plan. Not just from workout within on workout, but\nfrom day to day, week to week consistency. We’ve preached that all the time here, guys. Not just with your nutrition, but it’s with\nyour ability to show up at the gym. This is going to help you do that. Guys, I hope you’ve found the video helpful. If you’re looking for a complete day by\nday plan that expects you to show up when you’re supposed to show up to get the workout\nin; that’s all laid out over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Let me know if you’re going to go out and\nget some ginger yourself. You’d better start stocking up, guys, because\nwith the amount of people that tend to watch our videos, I have a feeling that ginger consumption\nis going to go up a little bit. All right, I’ll talk to you soon. See you."
}