{
    "id": "DqXReXD_wZc",
    "title": "Jeff Cavaliere - ATHLEAN-X - Full Day of Eating (REVEALED!)",
    "description": "What does Jeff Cavaliere eat in a day? In this video, I'm going to reveal what I eat at every single meal; breakfast, lunch, and ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to answer a question that's\nbeen asked of me at least 10,000 times. That is, \"Jeff, what is it that you eat? Show us what you eat in a day. Everything you eat in a day. I want to know.\" I have to say, there's been some hesitation\nto make the video. The reason why is because I understand that\nthe topic of nutrition is something that leads to a lot of dogmatic beliefs in nutrition. When you think about it, people can become\nvery emphatic about what they recommend for eating. I empathize with that because I understand\nwhere the root of it is. The root of it is that a lot of times people\nwill struggle with nutrition. They will have huge emotional struggles with\nnutrition. So, when they finally figure out an approach\nthat works for them, they want others to know about it. Sometimes, a little too strongly. But I believe if you can find an approach\nthat works for you, that you can stay consistent with, that won't sacrifice your health in\nthe process; I'm all on board for it. With that being said, I'm going to share my\napproach with you, with the understanding – and giving you fair warning – that there\nmight be some triggers in this video. Triggers in the case of the use of a microwave. I understand that some people are against\nthe use of microwaves. I use it as a tool of convenience. As a matter of fact, I lost a mother at the\nage of 53 to a rare abdominal cancer. She happened to sit in close proximity in\nthe kitchen to a microwave oven. I'm not saying there was a connection there,\nbut I have that in the back in my mind. But I still use a microwave. There's also going to be the inclusion of\ncarbohydrates. I do not avoid carbohydrates. There are some that do. I'm just showing and sharing with you what\nI eat. There is also the use of animal proteins here. Again, I understand the ethical belief behind\navoiding animal proteins in a diet. I am not one of them that does that, but I\ncan certainly empathize with the belief system. I understand where it comes from. I also use sugar substitutes. I know a lot of people are very much against\nsugar substitutes. I am not necessarily one of them, but I'm\nnot relying on them. It's just a tool of convenience. One that allows me to get to where I want\nto be when used sparingly. Lastly, even the cinnamon I use has been questioned\nin the past and I'm glad to tell you guys that's I've switched from the cassia cinnamon\nto Ceylon cinnamon. If you want to look that up yourself you can\nfind out why, but apparently Ceylon cinnamon is much healthier for the liver than cassia\ncinnamon. That being said, with all those triggers out\nof the way, I want to break down my meals. This is what it looks like for me. My breakfast. I've covered this in the past. I have oatmeal, egg whites, and skim milk. Before you say \"Oh my god. It's a boring as I thought it was going to\nbe\", I wouldn't be able to eat just plain oatmeal for as long as I have and still enjoy\nit. The key for me is, you'd better enjoy the\nfood that you're eating, or you're not going to be able to stay consistent. If you can't stay consistent it's going to\nturn into what I hate. Which is a short-term diet plan that you won't\nbe able to stick to. I have to make these foods taste better. What I do is create something called pumpkin\nwalnut oatmeal. I’m going to show you guys all the brands\nhere, too. I'm not going to announce them, but I'm going\nto point them out so you can see exactly what I'm using. In this case, I'm showing you that I have\na cup of oatmeal. That's about 300 calories of dry oats. I will give you some estimates at the bottom\nof each of these foods here, so you have an estimate of the caloric consumption here. I include some Ceylon cinnamon, as I've talked\nabout. Some pumpkin pie spices. I add in a little bit of maple syrup, add\nin one round trip around the container, and then I add in some skim milk to cover the\noats. Probably about 4oz. Then I put it in the microwave for three minutes. While that's going, I go back and start to\nprepare my egg whites. Again, I do not have anything against the\nyolk in an egg. It's just a matter of convenience. I buy these egg whites in these cartons and\nI'm able to just use these egg whites as a tool of convenience. I have about 7 to 10 of them in one morning. I fill up this fairly large microwave safe\nbowl and I put it in the microwave itself for 2:20. There's the use of the microwave. Now, when the oatmeal comes out, here's the\nsecret. I put in my favorite ingredient which is pumpkin. Before you guys run and buy the wrong kind,\nmake sure you're buying canned pumpkin. Not canned pumpkin pie mix, which is loaded\nwith sugar. It tastes really good, but it's loaded with\nsugar. Instead, I have plain canned pumpkin, one\nof the healthiest things you can put in your body. It does two things. Number one: it adds some real nice texture\nand flavor, but at the same time it helps to cool off that really hot oatmeal when it\ncomes out of the microwave, so it makes it edible at a faster pace. Something that's very convenient for me. Now I add in my sweetener. In this case, it's Splenda brown sugar. I realize, if you're not into the sweetener,\nI take a pinch of Splenda brown sugar, sprinkle it on top, add in a few handfuls of walnuts\n– my healthy fats – and then I add a little bit of dried oats for texture. Then I'm almost done. One thing that catches people by surprise\nis that I also include a bit of whipped cream here. I love whipped cream. Guys, calorically it's adding minimally to\nthe overall impact of the meal. It adds a little more enjoyment to the meal\nitself. This is a great tasting oatmeal. I promise, if you try it, you're going to\nlove it. Now you can see when the egg whites come out,\nI add something I've talked about before. I add pickled ginger. I put it on top of them. Believe me, it's not gross. It's actually really, really good. Some pickled ginger on top of the egg whites\nand then I put some salsa on top of that. As I mentioned earlier, my glass of skim milk\nand I'm ready to go. That's my breakfast, I'm ready to go. If you total this up with these estimates,\nyou're going to get to about 850 calories. Now we move on – I'm going to cover the\nmajor meals and I'll get back to what happens in between. Next up is lunch. When it comes to lunch, one of my favorite\nthings to eat is a grilled chicken wrap. But on this grilled chicken wrap, I'm not\njust getting a lot of chicken. I'm also getting a lot of grilled vegetables. In this case it was zucchini and eggplant\nand a little bit of onion. That's all grilled up in olive oil and I add\nhot sauce in here for some moisture and I also have some pesto. That is my grilled chicken wrap, contributing\nabout 575 calories. Again, depending upon what you put on these\nthings and how big they are – this is a big one – they can vary pretty greatly. The fact is, this one is about 575 calories. Then as you'll see here, I have a whole-fat\nyogurt with whipped cream. That comes out to be about 755 calories. We move on. For dinner I start out with a soup. In this case it was a tomato orzo soup. Just an orzo and it has some chicken in this\nas well. I put some of these crackers here on top and\nwe're looking at about 225 calories. This is how I like to start my meal. Pretty much a variation of a soup or stew\nto start my meal. Then for the dinner itself, you're probably\npretty familiar with the meal. I've shown it to you. If you haven't already seen it, the video\nwhere I break down how I divide my plate because there's a rationale behind the division of\nthe plate. I think you should watch that video so you\ncan understand the concept. It's plated out in fourths here on this plate. This is my grilled chicken occupying a large\nportion of my plate. Not quite done yet. I'm going to make it taste a little bit better. I could eat plain grilled chicken. Again, consistency. You have to like what you're eating. Then I have two sources of my starchy carbohydrates. I have some pasta and I have my mashed sweet\npotatoes with a little bit of cinnamon and butter in it as well. Then as my main vegetable I have my fiber\nvegetable for the night. I have corn. A lot of times this could be broccoli, this\ncould be brussel sprouts, this could be asparagus, this could be anything. I have a large portion of the plate covered\nby this other fibrous vegetable. As I mentioned, I'm not quite done. I'll take something and put it on top of my\nchicken. Tonight, it happens to be a mango ginger salsa\nthat I put on top. Again, ginger making its way into my meal\nplan, as I've recommended to you strongly in a video in the past for all the benefits\nit provides. Of course, I have this meal with some seltzer\nwater. I love seltzer. It's more interesting than regular water for\nme. It allows me to be a bit more consistent with\nthe intake and consumption of my liquids and keeping hydrated throughout the day. So, even though I didn't show it at my other\nmeals, I have it there as well. Now, that meal there totals 975 calories. But I'm not quite done. I know the running joke is that I have my\ncarrot cake once a year, but I have dessert every, single night. I have it in the form of yogurt. Frozen yogurt. In this case, a fat-free vanilla ice cream. Again, I'm not hung up on the fat free nature\nof it. I'm just trying to pick something a little\nslimmer, in terms of, I'm not looking for a rocky road-marshmallow sundae. I'm looking for something a little more 'bare\nbones' because I enjoy it. If it's not something you enjoy, I'd recommend\nnot having this. But this is something I enjoy. Once again, some whipped cream on top and\nwe're looking at about 280 calories for this. And yes, it is every, single night. Now, if you were to total all that up, you're\nlooking at a total caloric intake of 2860 calories. This is a very rough estimate, but it gives\nyou a guideline. I'm not eating 1400 calories a day. I'm not eating 1800 calories a day. I'm also not eating 5000 or 6000 calories\na day. I'm eating right about the range I should\nfor my body type. Again, I carry a lot of lean mass so I'm able\nto support this. The fact is, I'm also pretty damn active,\nas you can imagine, from my job. I do active things for a living. So, this particular calorie amount is what\nallows me to stay right about where I need to be. It could be different for you. So, going and copying this entire meal plan,\nmeal by meal, may not be the secret to your success. But it at least gives you an idea of what\nit is that I'm taking in and how I break it down. Not shown in this video is what happens in\nbetween these meals. Do I snack? Do I have anything? I do. As a matter of fact, I left out the details\nhere because I didn’t want to make it into a supplement commercial. I don’t want to force you guys to feel that\nyou need to use my supplements. It's what I use. I believe that I have the best supplements\nout there and I know what's going into every, single bottle. So, I trust them. But if you want to know, full disclosure,\nwhat I use on a given day, I have my protein shake, my RX-2 every, single day. Whether I train or not. At the end of the day I always have my RX-3\nmuscle recovery. Again, it's not highly caloric, it's 20 calories. It's just there to help support my hard efforts\nearlier in the day in the gym to help me complete the picture. But that would make up the entire consumption\nfor me in a day. My recommendation to you is, number one: the\nconcept of 'you versus me' is incredibly important. If you were to look at this and say, \"I don’t\nlike any of that\", or \"Those triggers do set me off, I don’t really agree with something\nin that meal plan\", then don’t eat it. Don’t force yourself to eat it because I\nguarantee you one thing. You will not be able to stay consistent with\nthis. Consistency is the key, when it comes to nutrition. You have to be able to like what you eat,\nso you can consistently eat what you eat, to get where you want to be. Second point. This is one represented day. I do not eat the same, exact thing every,\nsingle day. The principles around each of these meals\nare applied across the board, but I don’t eat the same, exact thing every, single day. There are a lot of similarities, but I vary\nwhere I can vary, and I suggest you guys do the same thing as well. Don’t lock yourself in. Don’t allow yourself to become dogmatic\nabout nutrition. Allow yourself to become a little more varied\nand I promise you'll have better success in doing it. There was a time in my life where I avoided\nevery plan with fat in the day because I was told to believe that was not good for me. Thank god I was able to release that dogma\nto become more accepting of it because my result improved tremendously when I did it. Guys, I'll leave you with this last note. When you're looking at this meal plan, looking\nat the viability for you, you have to ask yourself what is most important to you. I think there are three variables we can choose\nfrom. Only two of which can we actually have. Fast, good, and cheap. I've covered this in a video before. If you want fast and good, you're probably\ngoing to have to go out and buy your food. It ain't going to be cheap, but you can go\nto a catering department of any of the local super markets, which they have – if you're\nnot aware – a bar lined with food in bulk, which is going to speed up the process of\npreparing this for the week ahead. If you want good and cheap, that means you're\nprobably going to have to sacrifice fast. It means you're going to have to buy these\nand make them yourself, which is going to take a lot more time. You can't really have all three unless you're\nlucky enough to have somebody who's going to prepare all these meals for you and take\nthat burden off your back, so you can get all of them. Fast, good, and cheap. The fact is, you have to determine what is\nmost important to you. When you do, you'll unlock an empowerment\nof your own nutrition that's going to allow this whole process to become so much easier\nthan it may have been until now. Again, forget if it looks like this or not. It may look completely different to you. All that matters to me is that you find a\nsystem that works for you. Find a nutrition plan and style and approach\nthat works for you, that you can consistently stay with and enjoy; I'm on board with you. I promise. If you're looking for my meal plans in a step\nby step, day by day fashion; they're all available over at ATHLEANX.com in all our programs. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. If you are one that requested this for years,\nand years, and years; I hope you're happy with the answer. In the meantime, if you haven't already done\nso, click 'subscribe' and turn on your notifications so you never miss a video when I put one out. All right, guys. See you soon."
}