{
    "id": "drJ-D_uURIc",
    "title": "The &quot;Hour a Week&quot; Ab Workout (FOLLOW ALONG!)",
    "description": "An ab workout doesn't have to be long to be effective, but it should be more frequent. In this video, I'm going to give you the exact ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So here's the good news and the bad news when\nit comes to ab training. The bad news is: I don’t think you're likely\ntraining your abs enough. I say it all the time. \"Your abs require, and respond best to regular\ntraining of them.\" But here's the good news: if you do that you\ndon’t have to train them long. So I have a proposition for you. One hour a week, okay? Six days, one 10 minute routine, and guess\nwhat we're going to do? We're going to actually lay it all out for\nyou. I'm going to show you exactly what to do. So here's the deal. I've got Jessie standing here with me because\nI'm going to give you two levels of ability. You either follow along with me, or you follow\nalong with Jessie. Jessie will be doing slightly easier versions\nof the workout. So here's your exercises. You have eight total exercises and you get\nto pick five of them. Any five. You can vary throughout the entire week. The exercises are: the figure 8. The side step through. The starfish crunch. The serratus side crunch. Chainsaws. Twisting pistons. V-up Russian twists. And the triple crunch. Now, Jessie has another set of exercises. Again, if you want to follow along at a little\nbit of an easier level, then here's yours. Canoes. Reverse corkscrews. Upper circle crunch. Side crunch. The X-Man plank. Heels to the heavens. Frog crunches. And pendulum planks. Now here are the rules: it's a 10 minute workout. You're going to take any of those five exercises,\nas I said, and you're going to perform them for one minute a piece. You're going to go 50 seconds on, 10 seconds\noff. Then repeat them one more time through for\n40 seconds on, 20 seconds off. You know you're going to start to get fatigued. I'm building in a little extra rest at the\nend, but your goal is to see if you can make it all the way through to the end without\nmissing any of your prescribed time. So again, I'm taking you through my workout. You can follow along with me. Jessie is actually going to be going side\nby side with me. You can follow whomever you want, but the\nkey is, let's make it all to the end. So there you have it, guys. No matter what path you decide to go down\nI can pretty much guarantee you're going to wind up in this position. That's the point of it, guys. If you're going to train then you can either\ntrain hard, or you can train long. But you don’t do both. When it comes to ab training, the most important\nthing is the consistency and regularity. So get that consistency and frequency up,\nbut get the intensity up as well so you don’t have to do it for that long. 10 minutes, 6 times a week. It's just one hour. I'm sure you've wasted – I know he wastes\nplenty of hours in a week. Devote one to bettering yourself and I promise\nyou it's going to help. Guys, if you're looking for complete ab workouts,\ncomplete workouts for the rest of your body head to ATHLEANX.com. Get any of our ATHLEANX training systems. In the meantime, if you've found this video\nhelpful, remember, bookmark this one and do it over, and over again. I promise you, you'll see results at the end\nof the day. Look, he's even getting them himself, here. All right, guys. I'll be back here again soon. See you."
}