{
    "id": "DUxd5EoiY4s",
    "title": "How to Get Bigger Forearms (CRAZIEST PUMP EVER!)",
    "description": "Build ripped arms from your forearms to your shoulders here http://athleanx.com/x/get-ripped-athletic-arms-here If you want to get ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. Today we're going to use an old Baseball exercise. One that I used to use with one of the guys\nmost famous for their Forearms in Baseball, Carlos Beltron, back with the New York Mets. One thing that we did almost daily, and remember\nguys Forearm work you can do more frequently because we're talking about postural muscles\nhere that are used to firing all day long. We used to do it with a simple PVC pipe. You just took the PVC pipe out and we used\na wider piece of PVC so you'd engage more of your grip strength as well. And basically we would hold the ends, or one\nguy would hold the ends, in this case if it was me, I would hold the end and Carlos would\ngrab in between and literally just keep rotating working his\nextensors of his Forearms or working the flexors of his Forearms, ok. Depending upon what direction his was doing. Well we could do the same thing here. You don't need to have a PVC pipe or even\nbetter you don't need to have a partner. You just need a Barbell here. Or you could use a bat if you're a Baseball\nplayer. But the advantage of using a Barbell is that\nyou get the added weight of the bar, 45 pounds. So you can see just from grabbing the bar\nthat I've already engaged my Forearms, ok. So what you do is you get in this position\nhere and all you do is let the bar hang and now you're just trying to rotate it backwards. So you're going to use the extensors of your\nleft Forearm and then your right Forearm to rotate the bar backwards. And you're going to do this for time. So all you do is just keep rotating back,\ndoing this motion again, just like that, ok. But you're doing it for time and you'll see\nthat your Forearms will start to burn pretty quickly. But that's when you're just starting to get\ngoing. What you want to do is keep it going. So as that burn really starts to sink in,\nyou want to ask yourself, how much you're going to be able to tolerate. And in Carlos' case, he kept going long after\nI could even hold the PVC pipe and that's why he had such big strong Forearms. So what you do is you keep twisting, you keep\ntwisting until you can't take it anymore. Usually it's going to be a minute to a minute\nand a half if you're really strong. Now without resting much, going to switch\nthe grip around, now we're going to work the flexors, the underside of our Forearm. And you're going to do this now, so what you're\ntrying to do is again, this motion to rotate the bar. So in this position now you just keep rotating\ntowards you, towards the camera trying to twist it. Ok, so I'm spinning the bar in my hands, the\nbar is actually spinning in my hands. And I just keep it going and going again that\nintense burn really sets in. There's one last thing that you can do if\nyou're looking for even a bigger challenge, and you sort of use one side to spot the other or make it more difficult for the other. So you can make it more resistance based and\nthe thing is, you're still going to work both flexors at\nthe same time, or both extensors but you're going to use a Switch Grip. So you've got one under, one over. Now I'm going to try to turn this one down. So the left one is trying to turn the bar\ntowards me. The right ones going to try to resist it by\nturning away. But again, flexor this way, flexor this way,\nthe hands are facing opposite directions, so we're good. So now when I try to turn down, I'm using\nthis one to counteract to give me some more resistance. And now it's almost like, instead of doing\nthis for time, you're doing this more for repetitions because you really can't get that\nmany of them. So now I'm twisting at the same time, trying\nto simultaneously turn one in one direction and the other in the other direction. You can see just after a couple rounds of\nthat my Forearms are really blown up and again it's pretty effective and it's something you\ncan do anywhere. If you don't have a bar, like I said use a\nbat and the cool thing is you don't need a partner. Guys, this is Baseball based but at ATHLEANX\nwe're about training you like an Athlete, your whole body. If you're looking for a way to develop, not\njust Forearm strength but impressive Athletic muscle throughout your whole body, head to ATHLEANX.COM right now and get our\nATHLEANX Training Program. In the meantime, if you found this video helpful,\nmake sure you leave your comments and thumbs up below and I'll make more videos, just tell me what\nyou guys want to see and I'll make sure I do my best to get them\nto you in the days and weeks ahead. See you guys."
}