{
    "id": "DWmGArQBtFI",
    "title": "How to Fix “Low Back” Pain (INSTANTLY!)",
    "description": "Low back pain is by far the most common source of discomfort we deal with. The irony is, a lot of times what we feel is rooted in the ...",
    "transcript": "JEFF: If you've got back pain that you can\nliterally put your thumbs right on, I'm going to show you how to get rid of that today,\nand more importantly give you a strategy for making sure it does not come back ever again. What's up, guys? Jeff Cavaliere, ATHLEANX.com. Here with Jessie and Raymond. If you're looking for a way to get rid of\nthat back pain – and I'm talking about the type that you can literally put your finger\nright on, where you can feel it, and sometimes even by putting your finger there, it shoots\npain down, into your butt. There's something you could do about it. You need to, first of all, start by identifying\nwhat it is properly because it really isn't low back pain. We're not talking about the muscles here,\nin the low back, even though you might feel some of that pain up there. Really, what we're talking about is a glute\nmedias. This is a rampant problem, and one that is\ncaused by a lot of sitting, and a lot of things that we're possibly even doing wrong in the\nweight room. First of all we want to make sure we're all\ntalking about the same thing. Right here, if you look on Raymond, the glute\nmedias is this muscle that runs right up under here. It's actually underneath the glute max, and\nit attaches just on the inside of this bony area here that we're going to call the PSIS. Now, why does that matter? Because big, bony areas make it really easy\nto feel, and find out, and make sure that you're on the same spot. So if you look here on Jessie, if you lean\nforward you can rub your hands across the low back, and you should instantly be able\nto feel two spots where the bones are sticking out. That is exactly that same are that I just\nshowed you on the skeleton. If you run your fingers just to the outside\n– where you get all the increase in pain, and tension – then we are talking about\nthe same thing, and this is what we're going to be able to take care of right now. So what's the muscle supposed to do for you\nanyway? Two things. The first is: you should be able to use it\nto abduct your hip. Meaning, to lift your hip up, and out to the\nside. The other thing that's even more important\nis that, with every step you take its job is to make sure that your pelvis stays level. We know when we lift one leg the body wants\nto fall in that direction. Meaning, the hip on this side wants to fall\nout this way. So it wants to, instead, if the muscles were\nworking right, keep your pelvis level so it's not doing this. There's something called a Trendelenburg Gait\nwhere, when your hips can't do this you start to look like – show them, Jessie. Yeah. Sort of like that. It starts to drop on every step. You don’t want that to happen. But here's what's even bigger. If you lift weights and you squat, the problem\nis, I can almost guarantee you that when you start to get this pain, at some point, it's\nbecause you don't have an equal distribution of weight through both of your legs. We can test that very, very easily. You're probably going to be very shocked by\nwhat you see. Just stand with your feet shoulder width apart. Like here. Now, when you go, all you'll want to do is\njust lift one leg up, off the ground. If I lift the left leg I can do that. Not a problem. If I have to lift my right leg I have to shift\nmy weight too much. A lot more significantly than I did on the\nother side. If you have to shift your weight, or if you\nsee that your shoulders move a lot to one side in order to get your weight off that\nfoot; then you don't have an equal distribution. What's going to happen there is, it's going\nto cause imbalances that will start to rear their ugly head in the form of this more frequent\nback pain, and we can eliminate that. When you squat you want to have equal distribution. So now, the most important thing is fixing\nthe damned thing, right? So if you come down on the ground, I'm going\nto show you exactly how we can do this, and get rid of it right now. More importantly, some exercises you can do\nto strengthen it so it doesn't come back again. So the fix for this is actually pretty easy\nto do, and most importantly, quick. If you find this and you do it right you're\ngoing to feel relief right away. So you take your finger and your thumb, you\nput it right up on that spot. JESSIE: You going to draw me like one of your\nFrench girls, Jeff? JEFF: I can't draw, dude. Let's go. So you put your – what an idiot. You put your thumb right on that spot. From here, now all you're going to do is use\nyour own pressure from your hand, and then move your leg in a certain direction. What you don’t want to do is, you don’t\nwant to start reaching for a lacrosse ball and putting it underneath you because when\nyou're in pain, you're already inflamed, you're putting too much pressure on this area that's\nlikely to resist what you're trying to do, and not help to fix it. In this case you want to use the top down\npressure that you can control. So once your finger is on that spot you're\ngoing to take your leg through the same direction right here. You're going to come down until your knee\ntouches the ground. Once it touches the ground it's going to kick\nback, behind you, into extension. It's key that you get past the midline of\nyour body here, and then when you do, you're going to lift up. You toes should be pointing a little bit down\ntoward the ground when you do. So when we make sure that we're getting a\nlot of hip abduction here. So then the thumb pushes in and holds this\nback. Now, I don’t have to do any of this. This is going to be done all by you and Jessie. You're pushing as hard as you can to that\nspot, he comes up, he lifts, goes down, touches down nice, and slow, back into extension,\nlifts up, toes pointing down, and every time you feel that. Right, Jessie? You can feel it flossing through there. You do this about 10 times. Once you're done with those you rest for about\n10 seconds. Now we want to try and fatigue out this muscle\nspasm here; this trigger point. Try to see if you can burn it out. You hold that spot one more time, you get\nright back into this position. So the leg is getting back into extension,\ntoes pointed down, abduct it, and hold it, and squeeze it as hard as you can. In other words, lift this up, squeeze it as\nhard as you can. Now, one of the interesting things – he's\ngroaning over here – one of the interesting things that you're going to notice is, when\nyou have issues here, and you get this frequent low back pain, this muscle is probably really,\nreally damn weak. This alone feels like agony. You can't even hold it up, even though – I\nknow people that can squat hundreds, and hundreds of pounds that really can't do this exercise\nvery well. That shows how much pain and weakness there\nis, right? So once we've done that, now when you stand\nup you should notice an immediate relief. Go ahead and stand up, Jessie. You should notice an immediate relief in the\namount of discomfort that you feel in that spot. We've actually gotten rid of that pain for\nthe short term. More importantly now, how do we keep it away? That's what I want to show you next. Okay, so here's what you're going to want\nto do to get rid of this pain once, and for all. One exercise here is, you're just going to\nuse a wall. You put one arm up, just like that – that's\nnot meant to push against the wall with. It's just meant for support, and balance. You take the leg that's on the inside and\nyou lift it up. Now, what they did is, it should let this\nhip just drop out to the side casually, this way. But the glute medias, remember, it wants to\nmake sure that it doesn't drop. So it's going to drive it back in until that\nleg touches the wall. Then you let it drop out again, and then it\ndrives up, and across. So we're actually working this outside hip\n– the one with the leg on the ground – and you want to do this for about 10, or 12, or\n15 reps. But most importantly, make sure you get really\ngood, solid contractions here so you're teaching it to get stronger. How many times? You want to do this at least 3, 4, 5 times\na week. Maybe even just once a day if you have the\nback pain right now. You want to get into the routine of doing\nmore of this, especially if you're sitting a lot. We have another exercise here that you can\ndo and this is a little bit odd, but I promise you, it's going to work. Okay, so this one's a little bit elaborate,\nand yes, it's definitely weird. We actually call it what it looks like. It's a sac swinger. You'll see in a second. You just basically take a dog leash and you\ntake a kettle bell – any kind of weight here. Of course, this could be a dip belt, too. but if you don’t have a dip belt, you put\nit right around here, and then what you're going to do is, you're going to step in. so Jessie's going to step into it, and then\nhe's going to hook it around his waist. Just from there. Now, it's hanging in between him. Now you know the name – why it got the name. Now he's going to turn around this way and\nall he's going to do is, he's just going to start walking and try to maintain a nice,\nslow, normal gait. And you can see every time he lifts one foot\nit's challenging now. Not just to try and hold up the weight of\nthat leg that's in the air, but now he's got to control the weight that's hanging beneath\nhis legs, too. So this is a more advanced version of what\nwe just showed you, but this is going to really start to free up those hips, teach those muscles\nto be a lot stronger than they are, and more importantly, you do this as a little bit of\na warmup and you can feel that, and your low back pain should start to be a thing – he's\nalready burning. Just from one, little walk down, and back. Just do it – again, you want to do this\nin the privacy of your own house? That's fine, but I can promise you that this\nlow back pain is going to become a thing of the past. Finally, the other exercise is the treatment. Remember when we had you lay on the ground\nand put your finger there? Well, just the movement itself – bringing\nyour leg back behind your body, lifting up, toe down, coming forward, touch the ground,\ncome back, and do those leg lifts – you do as many of those as you can until you build\nup your tolerance, and your endurance there, and you make sure you do it on both sides. That exercise, from the treatment standpoint,\nbecomes a thing that you actually want to do to make sure it stays away long term. Guys, low back pain is one of the most common\nthings that we all deal with and it can undermine any of your workouts. As anybody who knows, when your low back is\nhumming it's really difficult to even get yourself in the gym, let alone to lift anything\nof significance. We want to make sure we have that fixed. Guys, if you're looking for a program that\nputs the science back in strength – as a physical therapist everything I do has both\nthings in mind. Not just getting you to look better, but to\nfeel good, too. All of our programs are available at ATHLEANX.com. If you're looking for our latest video we're\nalways going to link one up here for you. If you haven't subscribed already, make sure\nyou do. And click on the notifications. Turn them on so you never miss a video from\nATHLEANX. All right, guys. I hope you get rid of this pain once, and\nfor all. I'll see you guys back here soon."
}