{
    "id": "DYswqh7FmBg",
    "title": "How to Get a Bigger Chest (LIGHT WEIGHTS!!)",
    "description": "If you want to build a bigger chest you are going to have to lift lighter weights. Wait, what was that? That's right. While heavy lifting ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to show you how to build a bigger\nchest with lighter weights. As a matter of fact, it becomes incredibly\nimportant, especially here in chest training, because we tend to focus on wanting to rule\nout weights. Through exercises like bench-press, inclined\nbench-press. However, if you're not getting the focus,\nand that attention through your chest, you're not getting optimal contraction, and activation\nof your chest. Which means you're going to hold yourself\nback. That's when light weights actually become\ncritical, and they actually become really, really effective because you're not used to\nusing them. You've got to back off on the ego a little\nbit here, but it actually works. So here's what we have to do: you take a much\nlighter set of dumbbells than you're used to. Especially to try this. What we want to do is a couple things. First, and foremost, you have to pre-activate\nyour chest. There are two ways we could do it. Posturally – I've shown you how to do this\nbefore. We're in the bottom position here, you pre-activate\nby getting your chest to be proud of the shoulder, in other words, a lot of times our shoulders\ntend to dominate because we let them round in at the bottom. So the shoulder is ahead of the chest. Jessie, we come all the way down below on\nthe side here. You can see that the shoulder is more prominent\nthan the chest. But I can get the chest to be more prominent\nthan the shoulder by getting my shoulders back. From here, now with the chest being active\nhere, in the front of this, when I go to initiate a contraction the likelihood that it's going\nto lead the way is higher. That's what we want. The second thing about activation is actually\ntrying to activate. So when I'm down here what I'm going to do\nis I'm going to actually try to tighten my armpits. From here, tighten my armpits. Here, tighten my armpits. Get a little bit of that chest pre-activation. I'm going to show you here in a second as\nI stand up what this does. What we're trying to do is that. I'm not moving my arms. I'm just trying to tighten my armpits and\nget more activation here of the chest. We could do that in this bottom position just\nby tightening. Now, with this pre-contracted, when I go to\ninitiate the contraction there will be a lot more work being done by the chest because\nyou activated it first. But that's just the beginning because now\nit's how you do this exercise that matters. We tend to have it fall apart in this place,\ntoo. What happens is, at the bottom, whether we\npre-contract, or we don't we tend to focus on the dumbbell as the item that we want to\nmove up, and down. This is what it looks like. Now the problem with this is, you're forgetting\nthe major function of the chest. The thing that differentiates it from the\ntriceps and from the shoulders that are also helping out with this exercise. That is the adduction component of your upper\narm in the exercise. So the chest wants to bring the upper arm. Forget this. Forget all of this. The upper arm, from here to here, it wants\nto bring this across your body. That's what it's trying to do. That's what differentiates it from those other\ntwo muscle groups. So if you want to have the chest do the work,\nthen this needs to happen. When we do this you're not getting much of\nthat. You're starting out down here, and you're\nbringing it to, about, here. Down here, to here. When we have so much more room to go. We can adduct it from here, all the way across. There are two things that will help with that. One: changing the direction of the dumbbells\nas you come up. Because, if we come to the top we run out\nof room. It's better than this, but you still run out\nof room. So if you were to turn them, now you've got\nthat extra range of motion. But more important than that – because many\npeople can bench just like this and get great results – more important than that is, again,\nnot focusing on these dumbbells. People will bring them up and think that they're\ngetting them closer, but the elbows are staying out. So what you want to do is, you want to focus\non your biceps because your biceps are attached to that important part of the arm that we\njust talked about. So as I come up the biceps lead the way. Here. Get your biceps to come together. You're never going to make it – I hope,\nunless you have some really bad anomaly of your anatomy – but you want to get them\ntogether, as far as they can. Elbows go out on the way down, pre-activate\nwith a little bit of a contraction here, and then drive the biceps together. Down, and out with the elbows, drive the biceps\ntogether. It's so damned hard to do it this way because\nmy chest is working so much harder than it normally is. Down, drive the biceps together. And you can see that, yeah, I'm only using\n30lbs here, and I'm used to using a lot more. However, I'll be damned if my chest ever worked\nthat hard. So do you abandon your heavy training? No. You want to use that to create tension, and\noverload. However, if you want to get a more focused\noverload on your chest from the very first time ever, then you need to start incorporating\nsome sets that are lighter, but done with a lot more focus. I promise you, you will have a much bigger\nimpact on how big your chest will ultimately be. They will be more effective than your heavy\ntraining alone if you combine them with your heavy training. This is the perfect complement and t's the\none that, yes, requires you to check that ego at the gym door. But I promise you much, much better results\nin doing by incorporating it. Guys, if you're looking for a program that\nputs the importance where it needs to be – it's not just the exercises, it's how you do the\nexercises. That's what matters the most. I try to coach you through everything we do\nin our programs to make sure you're getting the most out of them. Use the program selector in the link below\nthis video to find the program that's best, and most suited to your current goals, and\nform there I'll take over the rest. I will coach you through, give you my best,\nand show you how to do everything the best way to get the best results for your time. If you've found the video helpful leave your\ncomments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you in the days, and weeks ahead. All right, guys. See you soon."
}