{
    "id": "e-5gz5ITx9Y",
    "title": "How To Do A ONE ARM PUSHUP in Minutes!",
    "description": "http://athleanx.com/x/onearmpushup From the time I was a kid watching Sylvester Stallone tear up the big screen in Rocky and ...",
    "transcript": "What's up, guys? It's Jeff from ATHLEAN-X.com Ever since the\ndays of Rocky, when I was a kid, I think he inspired so many guys to be able to do the\none arm pushup, because really it's like the ultimate feature strength. Can you support your whole body with one arm\nand be able to press down on the ground? Now I didn't just wake up and be able to do\nthe one arm pushup. It took years of training and coming up with\na system that would train my body to not only be able to do things like the one-arm pushup,\nbut to get a lean, athletic physique that's capable of doing a lot of functional things\nlike that and the ability to do things that you never thought possible. However, I know some of you guys wanna do\none tomorrow. You might want to do one tonight, after you\nwatch this video, so I'm going to show you a real quick and easy way, using the band\nI like to use all the time here... ...a good jump stretch band... ...of how you can start\ndoing the one arm pushups and train your body to be able to do it if you can't get yourself\noff the ground without help. All you have to do is take this band, put\nit through your non-working arm, put it underneath...come down on the ground, put your arm behind your\nback, spread your feet out, lower yourself down and now come up. Obviously, you see...it's much easier, 'cause\nI have the weight of the band kind of assisting me and bringing me back to the top. So come down... So here I could probably get in about 15-20\nif I had to and start building up my strength, but that's it... The other point is you've gotta get a nice,\nwide base with your feet, because that gives you a little more support with your legs,\nso you're not tittering on one arm. But I don't want you to have to use this band,\nI don't want you to have to need this to do something like that, to do a one-arm pushup\nor to do any other feature strength that you want to be able to do. I want you to go to athleanx.com right now,\ngrab the training system that's gonna utilize all the kind of unique techniques, the different\nways of matching up your reps and sets to be able to produce the ability of your muscles\nto genuinely be able to do these one-arm pushups without the extra help. Go to athleanx.com right now, pick up my system,\nlearn how to train your body to be athletic, train your body to look athletic, to be ATHLEAN\nin the next 90 days. Guys, thanks for watching! We'll be back here again real soon with some\nmore great workouts and tips."
}