{
    "id": "ebqgIOiYGEY",
    "title": "Concentration Curls Aren&#39;t Working for You (HERE&#39;S WHY!)",
    "description": "Concentration curls are one of the most popular isolation exercises for building bigger biceps but that doesn't mean they are the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So do me a favor, check out this clip of me\ndoing a concentration curl and see if you can spot what I'm doing wrong. Now guys, if you're somebody that has watched\nmy 24 second fixed video, you might be thinking \"He's going too fast on the eccentric portion\nof the lift.\" I'm going to tell you right now, that's actually\nnot what it is. Some people might say \"I've been following\nthis channel long enough. I know Jeff doesn't even like the concentration\ncurl.\" We're going to get to that in a minute. I'm talking about the curl itself. Can you spot what I'm doing wrong? So, if you can't, I'm going to show what you\nneed to do when you're doing concentration curls. If you're going to do them. Again, we're going to address that in a second. When we talk about the concertation curl people\nwill do exactly what I was showing you here. They'll curl here, and then down, and they'll\ncome up here, and then down. Now, the purpose of doing the concentration\ncurl is what? People argue that it's to get a complete contraction\nof the biceps. To feel the biceps contracting. To give you better mind-muscle connection,\nif you have a problem with your biceps in that way. And a lot of people do, actually. So if that's the argument I'm going to show\nyou where some of the major flaws are with that. First of all, if they're doing them like this\n– which I see a lot of people do – that's a major mistake because the position of the\nelbow is the first thing you want to concentrate on. You can't be resting your elbow here, on your\nthigh, and going down like this. You're literally creating a see-saw effect. When the weight comes down on this side it\nalmost brings the weight back up again. The see-saw effect, back and forth, over the\nthigh. So whatever weight you think you're lifting\nhere, you're actually lifting a lot less because of that mechanical advantage. Speaking of 'mechanical advantage', if you're\ngoing to do it the proper way, you think you're going to take your elbow and you're going\nto put it on the inside of your leg. You know better. You're not going to rest it on top. So you know better. You put it right here, and now you start curling. I'm going to raise my arm up here you can\nsee something very important. They're going to do this. Now, the reason why that's a problem, firstly,\nis because they're now taking that elbow and they're using it for leverage. The elbow is actually pushing into the thigh,\nand by pushing into the thigh, it's giving me leverage to lift this weight. Now, if you don’t believe that's actually\nhappening, all you have to do is look at the involvement here of the side, and front delt\nwhen I get to the hardest part in the range of motion here. Which is the midpoint. Why does that happen? Because when it's most difficult – which\nis right here – then my delt has to kick in to help me push this up. The delts are becoming active because I'm\npushing my arm into an immoveable object – which is my leg – and that's helping to get some\nleverage in the opposite direction. The same concept as when we're doing a lat\npulldown, and you're pulling down, but pulling up with your legs. Pull your legs up, into the seat, and pull\ndown. That's good because you're using your legs\nfor a muscle group in your upper body, but when we're using leverage here of a muscle\nthat's right here, and often times too involved in a curl, that becomes a problem. They're right next to each other. So it's a different scenario than that lat\npulldown. So then what you would say is \"Well, then\nI can't do that. I've got to get my elbow off my thigh, put\nthe back of my arm – the tricep – up here against the inside of the thigh, and then\ncurl from there. Now I'm doing the right thing.\" But we've got to go back to what we said in\nthe beginning. What was the purpose? To get a complete bicep contraction and to\nhave the most tension in that contracted state. Well, if you get the elbow flexion, and you\nget the supination here, and you come to the top, look. The dumbbell is actually this line here, this\nforearm, is almost parallel with the downward force of gravity that's acting on this dumbbell. Meaning, I could get it – if I got completely\nparallel – I could stay here for a very long period of time. So even though I'm in a more contracted state\nof the biceps I don’t have as much tension here because, again, the forces are parallel\nto each other. The forearm here, and the force of gravity\ncoming straight down. So what we want to do is, we want to have\nit to where we're in this fully contracted state, and we have gravity acting as much\ndown on our perpendicular forearm as possible. We can do that by changing where we put our\narm. So instead of having it down in the thigh\nhere – I'll tell you right out – you've got to take your junk, move it a little bit\nthis way, guys, so you can clear some room right down in the middle. Really, in this really high up, inner groin\narea. So again, whatever you've got to do to do\nit. Jesse just blows and it all goes over that\nway. Some guys have to forcefully move a little\nbit more. Whatever you have to do, take care of it,\nand then put your arm right here, deep inside your groin. So now, when I curl up and I go to complete\ncontraction here – Jesse, come around this side, actually. You can see that the angle is a lot less vertical,\nand more horizontal, which is more toward allowing the dumbbell to be acted upon by\ngravity. But I can do better than that because if I\ntake it from here, and I know I've got to get a little bit more parallel to the ground,\nI just lean forward a little bit more. Now I have complete elbow flexion and complete\nsupination here, and I can really, really feel this thing a lot more than I could, and\nI've even minimized the contribution of that delt, even though it's always going to pop\nout because I'm, again, using the back of my arm here. Not the point of my elbow to drive in. Now, let's go to the people that say \"Jeff,\nI remember you said you didn't like the concertation curl. That it wasn't the best thing to do.\" No. For a few reasons. Number one: I like more athletic exercises\nat any opportunity I can. We train athletes here, so I try to get more\nathletic. Which means, if I can be on my feet I like\nthat better. But more importantly, if you're going to go\nfor complete contraction of the biceps, where was the flexion of the shoulder? Because we know by virtue of the connection\nof the longhead of the biceps, past the shoulder joint, to the upper portion of our glenohumeral\njoint here, we have room for shoulder flexion here. It has to be part of the complete contraction. So I want my arms up. If we're down here we're not getting that. So what I opt for – whether you do it with\nthe cable machine, or you do it with bands – it's something that gets your arms up\nin this position, allows for the supination, and allows for the elbow flexion. So we do this. We come here, and we curl up, and in this\nway. I've demonstrated variations of this before,\nwhich you can see now I've got all three components. I've got the flexion, the supination, and\nthen the shoulder flexion as well. So I can really get a complete bicep contraction. I can feel this thing balling up on me. You want to make this cooler? You do this. You come up here. Why is it athletic? The only thing holding me in this position\nis the strength of my posterior chain. My glutes and my low back. Because if I let go my whole body wants to\nfold that way. So all the muscles on the posterior chain\nhave to contract here to allow me to be in this position here. If you want to overload it, from here you\nstep back, and you step back, you come in, and you come in, and down. Pull it up, back, back, nice and tight on\nthe lower half, and in. Up, back, back, in, and in one more time. Up, back. Again, you've got this isometric component\nin the middle by prolonging it with the stepping. Guys, it's important to put the science into\nwhat you do in the weight room because it matters. If you're going for that intended purpose\nof trying to get the full contraction, and that's what you're going to use to activate\nyour biceps – whatever the reason why – that could be a good, valid reason. But if you're not backing it up with the true\nscience it's not going to matter. Here, we just did that. Again, if you want to make the tweak over\nthere you can do it there, too. The position of your arm matters, just like\neverything else, guys. We put out a step by step program where I\npay close attention to detail on everything we do, in every workout, in every exercise. I think that's what gives us the advantage\nand makes our programs as effective as they are. They're all available over at ATHLEANX.com. You can get yours today. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover in a\nfuture video and I'll do that for you. No doubt about it, guys. I'm always glad to read your comments and\nsuggestions below. All right, see you soon."
}