{
    "id": "eE7dzM0iexc",
    "title": "The PERFECT Back Workout (Sets and Reps Included)",
    "description": "The perfect back workout should consist of exercises for not just the lats and traps but other important muscles of the back as well.",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m bringing you the perfect back\nworkout, continuing the perfect series here. We have to face the facts right away. The back is not a single muscle group. We know the back is made up of many, many\nmuscles. Which is a lot more difficult to piece together\na workout that is going to hit all these areas. Remember, it’s not just the lats we’re\nworried about. It’s all the other things we often times\ncan’t even see unless we know we have to train them and focus on them. With that in mind we’re going to piece together\na game plan. A plan of attack. To do that we want to make sure we hit the\ndifferent areas. Number one: let’s address the lats. We know we’re going to need to hit them. We can do that with specific exercises that\ndo that well. We also know that the traps take up a major\nportion of our back. Both the upper traps and lower traps. One of the most important parts, I think,\nfor posture and for the proper function of your shoulder, we’re going to have to hit\nthose as well. So, low back, again, no less crucial, guys. It’s very, very important to how we feel,\nto how we function, and to making the entire kinetic chain work well, we need to make sure\nwe’re addressing that as well. We have other muscles, too. Like the rotator cuff. Yes, those muscles all reside on the back\nof our shoulder in our upper back. Which means, if you’re going to develop\nyour back entirely you need to focus on those, too. Even something like the terres major. We want to make sure that muscle – because\nwe can hit that preferentially a little bit more by altering the way we perform a popular\nexercise. That’s something that we’re going to want\nto address, too. But of course, we’ve got to make sure we\ndo this within a reasonable amount of time. To do that we always start with a big, compound\nmovement that’s going to accomplish and hit a lot of these areas at once. With that being said, let’s get started. Let’s kick off the perfect back workout. So, we kick off the perfect back workout here\nwith a compound lift, like I said. The deadlift. A great foundational exercise that’s chosen\nbecause it hits a lot of those areas that we mentioned in the opening. We’re going to hit the traps, we’re really\ngoing to work the spinal erectors, it’s going to help us train the lats, it’s going\nto help us train the scapular strength. Something we’re going to get into specifically\nhere in a second. More importantly, what we can do is realize\nthere are some compressive effects on the spine when doing the deadlift. We can pair this up with another great compound\nmovement, the weighted chin-up, and allow us to get a decompressive effect when paired\nup together. The way we break it down is, two sets of the\ndeadlift paired up with the weighted chin. Two sets of a deadlift paired up with a bodyweight,\nwide grip pullup for a different purpose. Let’s get to the deadlift first. What we want to do is, as we work our way\nup – because we’re working with heavier weights here today. 8, 6, 4, and 4 for our four deadlift sets. What we want to do is make sure that we’re\nadequately warming up. So, we’re going to have to perform a few\nsubmaximal, light warmup sets along the way. Do this one thing for me as you do. Incorporate a straight arm pushdown when you\ndo. Why? I love the straight arm pushdown. I think it’s one of the most underutilized\nback exercises. It’s one of the ones most helpful to ingraining\none of the most critical elements of the deadlift and that’s the ability to perform straight\narm scapular strength work, to provide and reinforce the stability of your shoulder blades,\nto keep that upper body tightness when you do the lift. Do one set here. Not to failure. Each time you do a warmup set. Now when you’re ready to go and your first\nset is 8 reps on the deadlift, you want to make sure you pair it up, as I said in the\nbeginning, with a weighted chin-up. We’re going to do that compressive and decompressive\neffect. As we do that, we do 2-minute reps after the\nfirst set. We go over and perform the weighted chin-up\nhere. I’m trying to go on the heavier side. So, for me, I’m looking for about 4 reps. Then we go back to the deadlift once again,\nincreasing the weight a little bit to 6 reps. Here, we go back to the weighted chin. What I’ve done is tried to cut the weight\nin half so now I can get about 8 to 10 reps. For me, again, I’ll strip one plate and\nkeep going. Now we come back, we go back to the deadlift\nagain for our two heaviest sets. A 4 rep and a 4 rep. The rest time, however, is going to continue\nto decrease. Here, I’m going straight bodyweight up to\nthe bar with the wide grip pullups. Why are we doing this? Because the wide grip will allow us to hit\nthe terres major a little more than it will the lats. We’ve already hit the lats really well with\nthe underhand chin-up because it points to the lats on greater stretch based on their\nattachment. Out in front of the body gives us a better\nstretch at the top, than it would with our arms out to the side. We shift the focus now to the terres major\nfor these last two sets. Again, the rest time is decreased because\nwe’re going to straight bodyweight here on those wide grip pullups. From here we go and make sure we train something\nexplosively. One of the rules of training athletes is,\nwhat you slow down, you should speed up. So, if we can do something explosively for\nthe back, we want to take all opportunities to do that. For me, my favorite exercise for this is the\nbarbell dead row. It builds off the same movement pattern used\nfor the deadlift, allowing you to train explosively, priming the performance on this move because\nit shares similar biomechanics, and we stop there at the knees, continuing to drive up,\nand perform the rest of the row. It’s an explosive movement. Again, we don’t go to failure here. We’re looking for ‘how quickly can we\nexplode this off the ground?’ You’re not going light, and you’re not\ngoing super, super heavy. Choose about a 10 to 12 rep max, and perform\n8 to 10 reps. The next exercise is an opportunity to create\nsomething I believe is incredibly important, and sometimes overlooked. That is the value of focused tension. I just laid this out in a video on biceps\nand how you want to compliment your heavier compound training with focused tension and\noverload on the muscle you’re trying to develop. Then we go back to the lats here with two\nexercise options. They’re two of my favorite. You get a choice between the two. What you want to do if focus on how you do\nthem. The first one is a one-armed alternating high\ncable row. I do it in an alternating fashion to keep\nthis workout moving along. So, I can go right to left and save an additional\nset in the process. The point here is, this exercise is perfect\nfor taking the lats through their entire range of motion. I’m able to get my arm out in front of my\nbody, like I just said, on the chin-ups and why that’s a superior exercise. It gets my lat out in full stretch and still\ngets it all the way back behind my body, into extension, but also adducted tightly to my\nside, hitting all the major functions of the lats. Even getting a little bit of rotation on the\nback to really get into more extension. I could do that here as my exercise option,\nor I could choose to do this variation of the pulldown that I covered before, which\nis probably the best way to do a pulldown. It’s the rocking pulldown. What we’re getting here is the same idea. We’re not just staying here in this frontal\nplane and getting our arms adducted and limited to how much we can adduct them into our side. We’re getting down and then because of the\nrock, we’re getting it down closer to our sides, more adduction, and also back behind\nour body, more into extension. A better lat contraction. If you haven’t tried this, all you have\nto do is give it a try and I promise you, you’re going to see the results. And you won’t have to sacrifice the weight\nyou’re using to do this. You can use the same type of weights, maybe\ndropping down just a plate or two. But you’ll be able to get a much better\ncontraction. Again, this focused tension has a place. Especially when you’re looking for more\nof the aesthetic benefit on top of the athletic performance you’re already building on,\nand the strength we’ve already built on in the workout. Moving on from here, you know that no perfect\nback workout for me would be complete without addressing the smaller muscles. The ones that people don’t really care about. The corrective exercises, as some would say. They always have a place in here because we\nknow that we’re only as strong as our weakest link. If we can fill in the gaps with our corrective\nexercises, hitting the areas that don’t get hit enough, you know we can fortify the\nentire area much better. We do that here with our hyper Y-W combo. What’s the purpose here? You can do this in a glute-ham raise, or you\ncould do this on a physio ball like I’m showing you. The purpose is, I really want to work my lower\ntraps. I realize and understand the importance of\nthe lower traps. Especially when it relates to shoulder stability\nand proper mobility and function of the shoulder. Especially as I raise my arm overhead. So, the lower trap’s function is to make\nsure that happens right. We do this with our Y. When I get my arms up and over my body in\nthis Y position, I’m really activating the lower traps and training them how to fire\nproperly, and in the right sequence. But we can go right from there into a W. The action of the W is to create external\nrotation at the shoulder, which is going to incorporate the muscles of the rotator cuff. Again, if you’re not doing rotator cuff\nat least two to three times a week you’re not doing it enough. We can build it right into our workout, again,\ntraining the muscles that are int eh same location and area, working with other muscles\nthey prefer to work with. So, get the external rotation from the W,\nget the Y for the lower traps. Alternate them one by one, from 14 to 20 reps\nhere, alternating every, single rep. Finally, talking about the traps, we’re\ngoing to finish this workout with the area you probably focus on more often. That is the upper trap. We can do that with a standard barbell shrug. You can take a slightly wider grip that puts\nthe angle of the arm more in alignment with the orientation of the fibers of the upper\ntraps, or you can go more narrow if it’s more comfortable for you. But it’s the performance of this and how\nyou do this that makes all the difference. What we’re doing here is a finisher. It’s a ladder. We’re going to work our way up from 1 to\n10. For the sickos out there, I’m going to give\nyou guys a way to work your way back down from 10 to 1. But you perform a single rep, then you perform\na contraction at the top of the shrug for a second. Then you perform 2 reps and perform a 2 second\nshrug at the top and hold. Perform 3 reps, and then a 3 second shrug,\nand hold. If, at any time, you can’t perform the hold,\nor you can’t perform the rest of your reps, you put the bar down and rest momentarily. Pick it back up again and work your way through. It’s a burner. It’s a killer, but it’s going to give\nyou just enough work and volume in addition to what you’ve already done here with the\ndeadlifts to finish off the traps the right way. So, there you have it, guys. There is the perfect back workout. I’m laying it all out for you here, step\nby step. All sets, all reps for you guys to follow,\ncopy down, and try yourself. I promise you, you’re going to see and feel\nthe difference. When we put together the workout you have\nto realize there’s a lot of stuff going on here. There are a lot of things we can do differently\nhere, but if you could only do one, this is what I think you should invest your time into\nand try because I think you’re going to see the most results from that. In the meantime, if you’re looking for other\nworkouts in the perfect workout series make sure you check them out here on our channel. If you haven’t already done so, click the\nsubscribe button and the notification bell so you never miss a video when it’s published. And if you’re looking for step by step programs,\nevery day, laid out for you, rep by rep, set by set, I have them all laid out for you,\nall selected and chosen by putting the science back in strength. We have those for you over at ATHLEANX.com. All right, guys. I’ll be back here again in just a few days\nwith another video. See you."
}