{
    "id": "Ej4WzltO1DA",
    "title": "Ripped Forearms Workout (SORE IN 6 MINUTES!!)",
    "description": "If you want to build ripped, huge forearms you don't have to do long forearm workouts to get the job done. In this video, I'm going ...",
    "transcript": "What's up, guys?! Jeff Cavaliere, ATHLEANX.com. You asked for it, you got it. Sore in Six Minutes forearms. Guys, we're using an empty bar here, today. But by the time you're done you're going\nto be screaming at me \"Jeff, it's too damned heavy.\"  I know. It's six minutes of condensed work. Here's all you have to do: you grab this\nbar, and what you're going to do is, you're going to do a reversed wrist curl. So you're doing wrist extension here. In order to roll the bar backward, you're\ndoing repetitive wrist extension. So you're working the back side here of\nyour forearm. You do that, now, for one straight minute\nand even if you start to abbreviate the range of motion that you can get as you fatigue,\nI still want you to try to crank out another rep, and another rep, right and left, right\nand left for the entire minute. As soon as you put that down we're just\ngoing to hang for a little while. Literally, we're going to go right to the\npull-up bar and we're going to try to do a dead hang. Obviously, this is taxing on your grip. That's okay. That's what we're trying to do. We're trying to fatigue you quickly here,\nin just these six minutes. As soon as you can't hold on anymore, or\nif you can make it the entire minute, you drop down, and you go right back to that bar\nagain, and this time, instead of bending your wrist backward to roll the bar, you bend your\nwrist down, toward your thighs. So what you're doing now is, you're working\nthe flexors here in the forearm. So now, on the other side of the forearm you're\ngetting the same activity. Roll it, roll it, roll it, roll it. You want to see if you can do this for and\nentire minute. Now when we're done with this, instead of\ngoing back up to the bar just yet, we're going to grab a pair of dumbbells here and\nwe're going to start to walk it out. So instead of hanging, we're walking. Nice, and easy. we're going to do a Farmer's Carry. Again, here the goal is to just walk back\nand forth and I don't care if you don't even have any room to walk back and forth in. you can certainly walk in place. Once again, these dumbbells are taxing your\ngrip, and forearm, just by the virtue of holding them. Don't go very light here, or you won't\nfeel the stress. I've got 70s here. Not overly difficult. However, when you pair it up with the exercises\nI've already done it becomes pretty damn hard. Again, if you can make it the entire minute\nthat is your goal. If you can't, you put them down, and you\ncome back to the bar once again. This time we're going to go 30 seconds of\nrolling it backward, and then 30 seconds of rolling it forward. So you're going to get, again, the backside\nof the forearm, and the front side of the forearm divided amongst this one minute time\nperiod. Then finally, we've got to go back up there\nand hang. This is where separate the men from the boys. How long can you hang from this bar? Can you make it the final, last minute? I'm telling you, by this point it's brutal. The burning of your forearms is tremendous. Your fingers won't even feel like they work\nanymore. But that's good. That's what we're looking for. We want to see if you can grit it out, grind\nit out, and hang up there for that last, final minute. So there you have it, guys. The Sore in Six Minutes: Forearm workout in\nthe books, and proving once again that you don't need to work long in order to get an\neffect in your muscles. What you need to do is, you need to work hard. Here again, we're putting condensed effort\ninto a short period of time to illicit a better training effect. The ATHLEANX program is founded around these\nvery same principles. If you're looking to trade in some workout\nlength for workout intensity, but at the end of the day, a better result; head to ATHLEANX.com\nright now. Click the link below the video. Use our program selector to find the program\nof ours that best aligns with your goals, while understanding the fact that you're\ngoing to work hard in all of them because the principle of hard training and effort\nwill never go away. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. The other Sore in Six Minute workouts are\nall here, on this channel. Make sure you subscribe so you don't miss\na single one. All right, guys. I'll be back here again soon. See you."
}