{
    "id": "ejNkNHes4LY",
    "title": "Best LOWER ABS Exercise You’ve NEVER Tried!",
    "description": "There are a lot of exercises for hitting your lower abs, all of which involve some bottom up movement of the pelvis towards your ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to bring you something different. I promised you an ab exercise, in particular\nfor the lower abs, as you’ve never tried before. I’m going to take it a step further than\nthat. I think what I’m going to show you here\ntoday is going to be the best lower ab exercise you’ve done for a lot of reasons because\nit’s going to be able to challenge, and help a lot of different people, no matter\nwhat ability level you’re at right now. We know when we’re training lower abs you\nwant to pick some movement that moves the pelvis up, toward the shoulders. Curls from the bottom, up. We might try lots of different exercises to\ndo this. Like, hanging ab exercises. Hanging knee raises. Hanging leg raises. But there’s a problem with these exercises. A couple, actually. Number one: beginners sometimes find it very\nchallenging to hang out and hold themselves up on the bar for any meaningful amount of\ntime to be able to get enough reps in to challenge themselves. The second thing is, these exercises – if\nnot cued properly – can become over reliant on the hip flexors to do the movement. I’ve talked before about the key in showing\nyour ass. Meaning, show your ass and curl your pelvis\nup while you do these exercises. But sometimes, because of weakness in the\nlower abs, people aren’t able to do that, and they tend to just use the hip flexors\nto lift the legs. We could also do a ton of exercises on the\nground to hit the lower abs with the same concept being ‘pull the legs up’, or ‘move\nthe pelvis backward’. But again, the same things apply here, too. In that, you’re actually using your hip\nflexors far too much, shutting down the lower ab activation, and defeating the entire purpose. What we can do is this exercise right here. This is called a screwdriver. Guys, you set yourself up into a dip station. The key to this exercise here is, you really\ndon’t have to worry too much about curling the pelvis up. This makes it a lot more tolerable for beginners\nbecause all you have to do is learn how to posteriorly tilt and lift yourself up. For those who have watched this channel for\nany length of time, you say “But Jeff, that’s your gymnast ab exercise. I have tried it before because I’ve watched\nyou before.” Well, it’s actually a little different. All you have to do now is hold yourself in\nthis position – which, by the way, is a lot easier and a lot more helpful for those\nwho have any kind of shoulder problems because this compression of the joint provides more\nstability in the shoulder than that distraction does when you hang from a bar. It’s actually a lot easier. So, what we do for the exercise is, we come\ndown, we screw drive ourselves down to the ground, and we pull up, and then down, and\npull up. You’ll see, I’m trying to keep my elbows\nrelatively straight, so all the work is being done by the abs and the obliques. That’s one of those added benefits here. It’s why I love it so much. Any time we can take muscles that prefer to\nwork together and get them to work together, like the abs and obliques, then we’ve got\na winner. We just do this for time. The other benefit to this, and why I really\nlike this, is what happens when we have an overreliance on those hip flexors? We tend to get tight hip flexors, which will\ncause low back pain. So, anyone that gets low back pain from doing\nab exercises runs out of options and things to do to hit your lower abs. This actually gives us an opposite effect. We get decompression of the spine because\nonce we let our arms post us up here, and let our pelvis drop, we have decompression\nof the spine. You can literally feel your pelvis drop and\nopen up some nice room in your low back. So, it should feel pretty good, in terms of\nthat. It’s like a distraction. So, from there, again, just up, and down,\nand that’s it. Again, I actually have had to move to these\nkinds of exercises over the years because of the issue I had with my shoulder. I’ve found that the added benefits of getting\nthat compression were helping that out, while at the same time, working together in a way\nthat it hasn’t been working before. So, give this one a try, guys. It’s the screwdriver. I promise you, even the beginners, to do this\nas long as you can hold yourself up – which shouldn’t be that much work because you\ndon’t want to sit here with bent elbows the whole time. Let your joints hold you up there. It’s going to work for you, guys. I promise. If you’re looking for a program that puts\nthe science back in strength, has lots of criteria of how we arrive at the exercises\nthat we use in our program – because they have to work. They have to be safe. We have them all put together already for\nyou in our step by step program. That’s over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the days, and weeks ahead. See you soon."
}