{
    "id": "ejQEdiZ0aS0",
    "title": "22 Days to “BIGGER” Muscles (GUARANTEED!)",
    "description": "It doesn't take long to get “bigger” muscles if you know how to improve the muscularity of your physique. In this video, I'm going to ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to show you how to grow bigger\nmuscles in just 22 days. I guarantee what I'm going to show you here\nis going to work. The cool thing is, it doesn't really matter\nwhat you're training next because you can apply the four training strategies here, I'll\ntell you and it's going to work no matter what you're doing. Here's the thing, guys. I throw these quotes up around bigger because\nyou don’t have to grow bigger muscles for them to look bigger. That's due to a difference between muscles\nsize and the muscularity of a muscle. I'll get to that in a second. That's good news because we know it would\nbe pretty damn challenging to try to grow bigger muscles that quickly. In 22 days, especially if you have a lot of\ntraining experience. The longer you've been training, the slower\nthose gains are to come. Even in the case of Jesse who's certainly\nmake some impressive gains. No matter how many gains he makes he's never\ngoing to look like Thor Bjornsson. We're not talking about the same genetic makeup. That's okay because we love Jesse. There's nothing wrong with that, but it gives\nus some optimism that we do have some strategies that will allow us to overcome the fact that\nthose might be difficult to come by. Those strict size gains. We can rely on those difference sizes in muscularity. So, what are we talking about? Well, we're talking about the difference between\nhere, the size being the overall circumference, and then the resting tone and what it looks\nlike when it's really not even flexed or contracted. You can see that my arm has some good tone\nto it – resting tone – even when I just stand. That has to do with the excitation of a muscle. How much nervous system activation there is\nof a muscle at rest. We see this, unfortunately, in the world of\nPT in hypertonic states when we talk about kids with cerebral palsy. They're hypertonic. Their muscles are firing too much without\nthe ability to relax. We're talking about degrees of that. How much excitement is there in your muscles\nwhen they're at rest? You see, this is not just about body fat and\ndifferences in body fat. Some people say \"No, it's just that one guy's\nleaner, or you're leaner than somebody else.\" No, you can see here in a comparison of my\npictures over the course of 10 years, I didn't change that much in terms of bodyweight. I'm talking about a pound or two up or down. The same thing with my body fat. My body fat has always been consistently pretty\nlow. It's the fact that the same strategy that\nI'm going to show you here today, out of necessity a lot of times, were implemented into my training\nthat have made a lot of the differences that you see. They're very, very helpful when you apply\nthem to the right series of exercises. The accessory movements while you're still\nworking on your foundational training. What are we talking about here? We're talking about applying some principles. The very first principle is one that literally\ndid come out of necessity because of the issues I had with my shoulder dating back to my Met\ndays. You have to make sure you're muscling up the\nweight and not momentum-ing up the weight. We know that's not a word, but it fits. The fact is, what do you do when you lift. You can see me doing shoulder raises here. I could tell you that back then, when my shoulders\nwere this size, all I was focused on was trying to progressively overload, do my overhead\ntraining, and even when I was doing some of my accessory lifts like the shoulder raises,\njust swing the weights as much as I could just to get them up. I learned a very important lesson here. That was, out of necessity I had to lighten\nthe weights. But because I lightened the weights I went\nslower. I took away the momentum. I was no longer swinging the weights up. I was no longer using bouncing at the bottom. What happened was pretty interesting. My delts grew and they grew pretty significantly\nand that's because the muscles probably, for the first time in their lives, were undergoing\na lot more attention than they ever had. Even if I was using heavier weights the delts\nthemselves were being shut out of the equation by the momentum. So, if you can start to take the exercises\nthat you're using and try to eliminate momentum as often as possible, you're going to see\nmuscularity increase dramatically and it doesn't take that long to happen. Again, this is a neurological thing. We can neurologically awaken this connection\nthat we have with our muscle to become more heightened at rest. That's a good thing. We move on here because there are more principles. The second thing I want you to do is not just\nconcentrate on moving the weight from A to Z, but instead, enjoy that journey from B\nthrough Y. That's a big difference. You see, even if you look at something like\nthe crossover here, horizontal adduction – as we've covered here many times – is a key\ncomponent of a full chest contraction. But if I just focused on going from here to\nhere, I'm missing out on all the things I can do all the way through. I know that another accessory motion to horizontal\nadduction that's going to increase the activation on the chest is going to be internal rotation\nof the shoulder. This is good internal rotation because it's\nhappening on a level below the shoulder height here, parallel to the floor. So, if I internally rotate, dive that thumb\ndown toward the opposite pocket as I go, you'll feel an increased contraction of the chest. In addition, if I were to take my shoulders\nand keep them back with my chest more pronounced out in front, I also know I can make the demands\nbe placed a little more highly on the chest here. Once again, getting more from it. Even by going slower through the repetition,\nI'm able to get better at recruiting muscle fibers to the task. If you just rush your way through A to Z,\nA to Z you don’t have the same opportunity to build that mind-muscle connection to bring\nmore of the muscle fibers into play here to help you achieve what you're doing. Another key way to increase the muscularity\nof a muscle. The third thing I want you to do here that\nI guarantee is going to work, and work quickly; I want you to squeeze every, single repetition\nlike it's the last one you're going to do. Don’t worry about all the ones leading up\nto it. We tend to fall into this trap all too often. I covered this concept in my \"Three Sets of\n12 Is Killing Your Gains\" video. That showed we do tend to focus on a number. But if you look at how I'm doing this lat\npulldown, I'm not really worried about numbers. I'm worried about the quality of every, single\nrepetition. It doesn't matter if the number I had in mind\nis not the number that I reach, as long as I give my all to every, single repetition. You can see, as I hold these contractions,\nas I take my time, additional muscle fibers are recruited. You can see the upper traps and mid traps\nbecoming more recruited as this repetition prolongs. You could do this. The reason why a lot of us don’t do it is\nbecause it is a little more difficult. The tradeoff here is that you do happen to\nbecome more focused on what you're doing. You can't be thinking about 50 other things\nand the repetition you're doing being the last thing on your mind. Instead, you've got to bump that up to a priority. What you're doing at that moment is what matters\nthe most. If you do that here, you can see much better\ngains and it doesn't have to be on a lat pulldown. It can be on any exercise. Which brings me to my last point. That is: sometimes you don’t want to just\nthink about the moving muscle, but if there are other muscles that can work, that will\nhelp the moving muscle do its job better, then you should take advantage of that. That's exactly what I do in this bicep curl. Here, I'm not just worried about the biceps. Why? Because I know that I can get much better\nactivation, and control, and production from the biceps if I heavily engage the core. We've talked about this concept before because\nwe know if the weights are coming up in this direction toward my back, if I can get my\ncore to be more engaged, and keep these stabilized here, and grounded, then the biceps will be\nable to do a better job. They'll have more leverage. I can ground myself as well by really tightening\nup my hips and my glutes. Even as I bring these dumbbells up, I can\nactivate the chest and the lats as well to keep these arms tightly adducted into my sides\nto prevent that drift and flow that would normally happen when the biceps are trying\nto get some additional help. Maybe sometimes from the delts to cheat that\nway up into the curl. We don’t want that. What we want is more effort from the muscles\nwe're trying to use, but at the same time taking advantage of the fact that other muscles\ncan help that happen. The fact is, all these techniques can be applied\nto a lot of different exercises. But yes, they do require a little more focus. And yes, they require a little more work. But guess what? They work. And they work every, single time. When that muscularity increases, the appearance\nof the muscle will dramatically change. It doesn't have to grow in size to have a\nchange in appearance. You probably have friends who have these differences\nand you're always wondering \"Why do my muscles feel soft and theirs always feel like a rock?\" The fact is, we can increase and change the\nresting tension of our muscle. We just have to be more focused on doing that. It works in perfectly without having to sacrifice\nyour overall strength training and the goals that come from your foundational lifting. Guys, I hope you've found this video helpful. If you did, make sure you leave your comments\nand thumbs up and let me know what else you want me to cover and I'll do my best to do\nthat for you. If you haven't already done so, make sure\nyou subscribe and turn on your notifications. If you're looking for programs where we lay\nthis all out and I show you important these concepts are – this is part of putting the\nscience back in strength to the complete picture of training. It's not always just about pushing weight. Sometimes it's about controlling it as well\nand we need to have the perfect blend and mix of all of them. All of our programs demonstrate that and they're\nall available over at ATHLEANX.com. All right, guys. I'll see you back here again in just a few\ndays."
}