{
    "id": "ENsp0DEryrM",
    "title": "Which Raise is BEST for Bigger Shoulders (THIS ONE!)",
    "description": "Have you ever wondered which raise is best for bigger shoulders? In this video I am going to show you 4 different versions of the ...",
    "transcript": "What's up, guys, Jeff Cavaliere, Athleanx.com. So, \nI talked about the Side Lateral Raise before. I   said never pour the pitchers when you're doing \nit. Why? Because you're wasting a good bottle   of water. But also, you might be damaging your \nshoulder because we don't like this internal   rotation with elevation that we get from the \nexercise, especially when we can do it a different   way. But maybe you're asking another question, Is \nthat the best way to do a lateral raise? Because   I see people do a whole bunch of different \nways. Bent arm, straight arm. Let's cover   the side range first with the straight arm. \nThe first thing that's going to happen is you're   going to have to use a lighter weight. \nWhy? Because as the moment arm increases,   the length of the arm increases than the weight in \nyour hand is going to have to decrease in order to   be able to handle it. But don't be discouraged \nbecause your shoulders can't read what this   number is on the side of the dumbbell. They only \nfeel the tension in the muscle that's working,   and as long as the tension is high enough, you're \ngoing to grow even if you're using something   towards the lighter end of the rack. \nHowever, you can do something that makes   this exercise even more effective, and it starts \nwith understanding how the dumbbell variation of   it actually affects the shoulder. Because we know \nthat when you do it with a dumbbell, the easiest   part of the exercise is going to be the bottom \npart here because we're not subjected to gravity   fully like we are at the top. Well, if we had to \nchoose a weight for the exercise that's something   we can handle up here. We know it's going to \nbe far too light and not challenging enough   in the bottom part of the range of motion. \nBut this is where people confuse the range of   motion of an exercise that's effective versus \nthe range of motion of a joint. And sometimes   the motion should be abbreviated to remain in \nthe effective range. So, I've talked about if   you were going to do the straight arm raise, limit \nthe range of motion to the top half because this   is going to remain challenging no matter where or \nwhat light type of weight you put in your hand.   You can go all the way down if you want, come up \nand do it in a one- and one-half style. But again,   try to perform the majority of the \nwork in that abbreviated range. \n  Now, if you're going to do the bent arm lateral \nraise, first thing you want to do is increase the   weight. Because we know mathematically through \nphysics that if that moment arm is shortened,   you're going to effectively be able to handle \na heavier weight to make that tension feel the   same in the working muscle. And in this case, \nyou're only going to want to take about half   the weight of the weight you were using and \nadd that to that weight, to get the weight,   you should be able to handle with a bent arm. \nSo, if I was eating a 20-pound dumbbell to perform   a straight raise, add half of that 10 additional \npounds, it's going to give you about 30 pounds.   So now I should be able to feel about the same \ntension in the muscle with a 30-pound dumbbell   done with the arm in this bent position. \nBut a couple of things happen here that   you need to be aware of. First of all, you're \nintroducing another lever arm. This time is not   just the arm length from here to here, but \nnot even introduce a lever arm from here to   here that goes in this direction anteriorly. \nAnd two things happen because of that. When I have   a weight in my hand here, it's going to want \nto pull me down in this direction. And that's   something you want to be careful of, because if \nwe pull down, this is still internal rotation,   the same way it was when I was doing the \npour of the pitcher from the top. So,   I want to make sure I always have my wrist \nin hand above my elbow. Meaning I don't want   to have the pinkies high and thumbs down, but \nthe thumbs high and the pinkies down and again,   wrist above elbow. That's the first thing. \nThe second thing is when you have that anterior   displacement through a bent arm lateral raise, \nit can tend to not only push this down but make   the front delts want to do more of the work to \nget that weight back up, which is defeating the   purpose of trying to build that middle delt. So, \nif you're going to do that Bent Arm Lateral Raise,   you're going to want to have the weight staying \nrelatively in line with your torso, so not out   in front of you. So, when you do that, you just \nlet the elbow drift back behind you and keep that   dumbbell pretty much in line with the body. \nAnd again, tension wise, it should feel pretty   similar because the adaptation was made by \nincreasing the dumbbell weight to just keep   that tension high inside of the delt. But it \nstill has the same issues as the dumbbell did   in terms of the resistance curve and strength \ncurve. So how can we maybe fix that? Well,   that's where you have to look at something like a \nCable Lateral Raise, because the cable now becomes   a line of resistance. And if the cable can remain \nperpendicular to in the straight arm version here,   the forearm, then we're going to have tension \nright from the very beginning exercise where   it's pretty much absent in the other version \nof the lateral raise, the dumbbell.\n  Right off the bat we've got tension here because \nit's perpendicular to that forearm. So, we're   going to have a really nicely loaded exercise when \nthe shoulders are at their strongest and even at   the top when they're not so strong, there's still \nsome tension here, but it's less right, because   we've got this less degree of perpendicular \nof this line of force to the forearm. So,   this is a great way to do the exercise. However, I \nthink you have to look at that one last variation   and that is, what if I was going to take the arm \nand bend it again and still do it with the cable?   And this is where I think you get the best of \nall worlds, because now I can not only bring   it across my body to get more of a stretch at the \nbeginning. But now when I come up to the top, I've   got more perpendicularly still remaining because \nthe arm, the lever arm is now existing in this   plane that was not there when we were straight.\nRight now, I'm still in this position, so there's   more tension even at the top. So, I'm down across \nmy body, I get that stretch and it can come up and   it crossed. So, I kind of have the best of all \nworlds here. And what I like to do is take the   opportunity again to load this heavier because we \nknow we can because of the bent arm position to   allow me to cheat it up, still have to control it \nand then control that eccentric on the way down.   So, introducing another stimulus for growth with \nthe controlled eccentric across your body. So, if   I had to give one the title of the best, I would \nsay it's the Cable Bent Arm Lateral Raise. But   every single version of the exercise can be done \nto your benefit and can certainly be done to grow   bigger shoulders if you know how to use them. \nGuys, if you're looking for programs where we put   them all together at different points of times \nwhen they're most appropriate, you can find them   in Athleanx.com. If you're looking for a complete \nshoulder workout, check out the perfect shoulder   workout over here. And also, guys, make sure \nyou click Subscribe, turn on your notification   so you never miss a new video when we put \none out. All right guys, see you soon."
}