{
    "id": "eqYNJLbxRkk",
    "title": "All About Traps (COMPLETE GROWTH GUIDE!)",
    "description": "If you want bigger traps, then you will want to watch this video as it will guide you to more growth in every area of your trapezius ...",
    "transcript": "What's up, guys? Jeff Cavaliere. Athleanx.com. \nToday we're talking all about the traps. A new   series here we're going to break down \nthe anatomy, the function of the traps,   and most importantly, all the exercises-- \nJeff, Jeff, Jeff! You forgot my intro. But   you're not even in this video. Well that's \nwhy I'm here now. I'm in the video. Run it.   Jesse. Ooh. Jesse. How is that any different \nfrom the last one? Clearly you didn't hear   the explosion then. Of course this is spoken by \nsomeone that doesn't understand the nuances of   introduction creation. Yeah, I just heard \na lot of noise, that's it. You know what?   You're a lot of noise, dude. A distraction. \nCan you just get out of here? All right,   fine. But the next introduction is going to \nbe even better, I promise. Back to the regular   scheduled programming here, guys, the traps. \nToday I want to show you what to do, how to   hit these muscles the best. Let's get it started \nguys. A lot of information to cover. So when it   comes to the anatomy of the traps, like any other \nmuscle, it's important to look at the orientation   of the fibers within that muscle. I say it all the \ntime, if you want to see how a muscle functions,   then follow the fibers. And with the traps having \nthree different zones and areas really, we know   that there's three different orientations of the \nfibers that we're talking about. In the upper area   of the traps we're talking about an orientation \nthat runs down and out, starting at the back of   your skull on that bump that you can feel back \nthere, and running out towards the tip of your   shoulder. And because we know that they're running \nup in this direction, some type of elevation of   the shoulder girdle is a dead giveaway. But \nbeyond that, take advantage of the fact that   these things do run this way and not just straight \nup and down, it's going to give us an indication   of something we might want to include when we \ntalk about upper trap training that I'm going   to show you in a second. When we move down, \nwe start to work towards the attachments on   the thoracic spine. We see that it becomes more \nof a parallel orientation, just east and west,   and that's going to give us an idea that they're \nnot necessarily responsible for shrugging up and   down in the middle trap area, but they're actually \nresponsible for retracting the shoulder blades and   bringing them and pinching them back together. So \nexercises that favor this motion are going to be   able to hit these fibers more appropriately. And \nwe work ourselves down to the bottom in the lower   traps and we realize that the fibers now start \nto go down in this direction. Now we're looking   at something that wants to pull the shoulder blade \ndown and back help to depress them particularly as   we raise our arm up overhead for stability, and \nwe realize that the exercise options available   to us there are going to once again reinforce \nthat function. So with that being said, guys,   let's start breaking them down zone by zone, \nupper, middle, and lower traps to really find   out not just how these things work the best, but \nmost importantly, what exercises work these areas   the best. All right, so when we start with the \nupper traps, the thing I want to jump out at you   more than anything else is because these fibers \nare doing this and running in this direction,   they're the ones most responsible for everything \nthat gravity is trying to make more difficult for   you. Meaning that this area of the traps is the \none that bears the greatest load on a day in,   day out basis. Meaning that it is the one that \nresponds best to higher tension loads. So as we   talk about when it comes to any muscle function, \nthere's a couple ways to do this. Number one,   we could do it for more duration, and the traps \nhappen to be a good, long duration muscle because   of the responsibilities of carrying your arms in \nthe proper position day in and day out. But again,   beyond that, they have a much higher capacity \nfor load. So here I want to go long duration,   I'm looking at exercises like the carry. And I'm \ntalking about either done with dumbbells. Right,   you could use up any pair of dumbbells and walk \naround your living room if you're training at   home, or walk around the gym, obviously. Or you \ncould use a trap bar, which makes it a little bit   more challenging to balance this for a little bit \nmore stability of the upper traps. Or you could   hold a pair of kettle bells as well. Again, all \nof them reinforcing the same function, and do it   for time. See, these long duration exercises are \nbest performed for time when we're talking about   at least 60 seconds and upwards of two minutes. \nIf you want to go for a high tension load where   we want to do it for more of a short duration to \ntry to create more strength in this muscle group,   then the thing we should be looking to do here \nis some version of a shrug. Right, the shrugs   are not necessarily measured in time, but in \nreps. So here we talk about loading up a bar,   and again, performing this upward shrug of the \nshoulders, just pulling them up towards your   ears. We know that's one of the main functions of \nthe muscle. Hold on for a second for a variation   that could be even slightly better. The same \nthing here could be done obviously with a trap   bar as well. The difference though, as I want you \nto see, is that the angle of the arms becomes not   just completely vertical, but angled outwards, \nand that should jump out at you as well. That   means it's reflecting more of the orientation that \nthe fibers are following in the first place. Where   we talked about how they don't just go up and \ndown, but down and out. So the trap bar shrug   gives us a little bit better angle to mimic \nand mirror that so it's a great way to do the   exercise. But I've been talking about that other \nvariation. And this is the one I like to do with   a cable. And now I'm doing that shrug and pulling \nmy shoulder up towards the back of my head here,   right towards the origin, except this time I'm \ndoing it directly in the same orientation as   those upper trap fibers, giving me a better angle \nof pull, giving me a chance to really overload and   create significant tension here, especially if I'm \ntrying to build this muscle up for more strength   and size. So instead of working our way down to \nthe middle traps, I want to skip that zone for now   and go down to the lower traps. Because, see, if \nthe upper traps are responsible for high tension,   then the lower traps are responsible for focused \ntension. Meaning that their job is really more   about stability than necessarily providing \noverload. But we can do the same thing here, we   can apply more of a long duration load or a short \nduration load, depending upon the exercises that   we pick. If we're talking about long duration, \nthen the exercises that I like here are number   one: the Y press. We know that the lower trap's \njob is to provide that depression of the shoulder   blade and the stability of the rotation of the \nshoulder blade as our arms raise up overhead.   Well, the Y gives a sort of an on ramp to rotation \noverhead. Right, because we don't go all the way   straight out overhead, we're just going up at an \nangle of about 45 degrees. So it's a good place   to start, but again, the key here is not to rush \nthrough this or to try to load this up, the key is   to provide a good solid contraction. If you're not \nfeeling it, then you're wasting your time. Quad   repetitions is the only thing that matters here. \nBut if you're looking for that next step, then   instead of just going at that Y angle, go for it \nup overhead. This is called the prone press. And   once again, the load is sort of irrelevant here. \nYou don't even really need to use any weights at   all if you don't have the ability to use them. \nBut the point is that you keep yourself in this   slightly retracted position to get a little bit \nof that middle trap engagement, but most of all,   it's about raising your arms fully up overhead as \nmuch as you can and providing that stability from   the lower traps to make that work as smooth as \npossible. That said, if we shift the focus away   from the long duration to the short duration \nrep measured way to train this area, then the   first exercise here that I want you to do is the \nplate raise. As you raise your arms up overhead,   the lower traps now have to fire and engage. Make \nsure those lower trap fibers are doing their job   to stabilize your arm in the overhead position. \nYou slowly lower it down to work on the eccentric   component of that muscle, and again, you raise \nit back up again. This is not going to go on for   a long period of time here, guys. You're looking \nfor that 12 to 15 repetitions always high quality.   And then of course, you know I had to cover the \nface pull. But this is a variation of the face   pull that I've showed you more recently that I \nlove even more than the face pull. Because it's   got all the elements of the perfect face pull with \nthe additional arm reach that we get here with   this overhead press. And we know, once again, that \nas I press up overhead, as lower trap fibers are   going to be recruited quickly to make sure they \ndo what they always do to provide that stability   as those arms go up overhead. But it's got all the \ncomponents here, even has the retraction component   that we get for those middle traps too that makes \nthis just a winner exercise every single time,   no matter which way you look at it. And now having \ncovered the upper fibers and the lower fibers,   I saved the middle fibers for last for a couple \nreasons. Number one: they usually get relegated   to last place because nobody ever really trains \nthem. That's going to change right here today.   And secondly, they kind of have a hybrid function. \nYou could hear that I've already mentioned that   they want to kick in while we're doing some of \nthe upper trap work, and even some of the lower   trap work. So their function is a combination of \nhigh tension, high-low capabilities, and focused   tension capabilities that we get from the lower \ntraps. Well, I've got two exercise options for   you. Number one: a body weight one, and this \nis called the back widow. And the back widow is   key to hitting this area because we're driving \nthe elbows into the ground. You see, if I were   to take my elbows out the ground and drive with my \nhands, I get more extension of the arm back behind   my body, but this is going to shift the focus more \ntowards the rear delt, and even the triceps as I   extend my elbows. We don't want that. To really \nget to those middle traps, which are a harder   to hit area, we want to make sure that we drive \nwith the elbows. But from there, we could actually   go into a long duration hold. And that's just by \nsimply getting in the position, and like I said,   holding it. So we have the ability to do the \nsame exercise in two different ways just by   simply either getting there and staying there or \ndoing this more as a repetition focused exercise.   Which gives me that second option here, which is \none of my favorite ways to train the middle traps,   and it's the wrap around row. And once again, we \ncould do this in two ways. We could do this either   as a long duration hold or as a short duration rep \nfocused exercise. And the key here though is the   set-up. You can see that I have my cable machine \nset wide. Why are we doing this? Because we're   actually trying to get a good pre-stretch here on \nthe middle traps. And I could do that here because   by getting my arms across my body, I've opened \nup my shoulder blades as much as I possibly can.   I've protracted them around my body as much as \nI possibly can. This sets the stage for a better   recruitment of these harder to reach fibers right \nfrom the get-go. The fact is, this is one of the   best ways to overload this area if you want to \nload the weight up, or decrease the load a little   bit more, and focus more on that high tension. \nRemember, this area is capable of both, which you   do is up to you. So there you have it, guys, all \nabout the traps, breaking it down scientifically,   and most importantly, showing you what you need \nto do to train this area and to train it right.   Remember, guys, there's no unimportant muscles \nhere. You got to make sure you train them all.   When it comes to muscles in the back you got to \nmake sure you train them even all more. Because   those areas tend to get neglected, but not after \nthis guys, remember we're going to hit all three   areas-- upper, middle, and lower, and now you've \ngot the attack plan to do that. If you're looking   for a program that builds in all of the muscles \nwhen we need to train them, and how we need   to train them, for most of the efficacy in your \nworkouts, head to Athleanx.com right now and check   out our programs. In the meantime, if you found \nthis video helpful, if you like this series, leave   your comments below, let me know what else you \nwant me to cover, I'll do my best to do that for   you. And if you haven't already done so, make sure \nyou click subscribe and turn on your notifications   so you never miss a new video when we put \none out. All right, guys, see you soon."
}