{
    "id": "esdQSIxteQg",
    "title": "Do This EVERY Day for Bigger Calves! (ONE MOVE)",
    "description": "If you want to build bigger calves and feel like you have tried everything without success, you are going to want to watch this video ...",
    "transcript": "What s up guys, Jeff Cavaliere, athleanx.com. \nSo if you're looking to get bigger calves,   I'm going to show you what you can do here today. \nNow, I've shown you something in the past as a   good calf exercise to do. However, some either \ndon't have the set up to be able to do it or   they feel a little bit too much in the hamstring. \nWell, that is one of those exercises that delivers   its gains through the overload and tension that \nyou get from it. But if you're going to go on   the easier end here, you're going to have to \nincrease the volume. And one of the best ways   to increase the volume is to do a simple standing \ncalf raise, but do it every single day. And it's   not going to take you a long period of time \nhere, but you do have to make a couple of very   important changes to how you do these if \nyou want to do it right. So, Jesse here--\n  Hey guys.\n--our local calf not. I talk about you re either   a calf or a calf not. I happen to be somewhat of \na calf not, Jesse is definitely a calf not. Which,   by the way, isn t necessarily his fault or \nyour fault if you re in the same situation,   since we know calf size is largely determined by \ngenetics. But nonetheless, improvable with smart,   consistent training, like I'm going to show you \nhere. What you want to do is evaluate how you do   your calf raises. Because doing the standard high \nrep, low weight, bounce your way through your sets   approach is really doing nothing more than feeding \ninto the ballistic way that your Achilles tendon   prefers to function to the detriment of your calf \ndevelopment, as you can see here in a second.\n  So, first thing, you want to go one leg at a \ntime, right? You're going to be able to deliver   more tension into that calf and more focused \ntension than doing a simple barbell calf raise   with both legs at a time or dumbbell calf raise, \nboth legs at a time where you can sort of hide   your imbalances in strength. The second thing you \nwant to do is change the tempo that we do this.   Why? The Achilles tendon is one of the strongest \ntendons in your entire body. This is a ballistic   tendon. It transfers quickly between plantar \nflection and dorsiflexion on every step we take   because it has a high capacity for force. \nBut what happens is it also robs the calf muscle   itself of a lot of the tension that it can help \nout and deliver as well. Why? Because it's the   first line of defense. It's the most proximal \nto the ground, and it takes those forces, and it   prevents them from being transmitted up the chain \ninto this calf muscle. So, this is one of those   instances where the Achilles is actually being \nfunctionally efficient and making, let's say,   running easier, but preventing the muscular \ninefficiency that I talk about all the time   that we need to seek when we're trying \nto force a stubborn muscle to grow.\n  So how can we change that? Slow down the cadence. \nJesse pick up your dumbbell for a second. So,   what you re going to do is you're going to get \ninto this position, and we want to try to remove   the ballistic capacity of the Achilles tendon. \nRight? So, we get down into the stretch position   and I'm saying all the way down to where you \nfeel a real stretch on the bottom of this rep.   And then from there, we come up after \nfour seconds and we get to the top here.   And now you don't just stay there, \nonce you there, you go up even higher   all the way to the peak there for four \nseconds. And we slowly come back down again,   and we get all the way to the bottom four \nseconds. There is no bouncing back and forth.   This is truly from dorsiflexion here, slowly back \nup to the top into planar reflection. And again,   by removing that, the calf itself has to do \nway more of the work. How are you feeling? \n  Oh, it sucks. \nSo two reps in and he's already starting   to feel it. I don't care how many reps you get. I \ntalk about in the past, you either make the reps   count or you count the reps. This is where you re \ngoing to want to make the reps count. You cannot   care about counting here. You just have to make \nthem count by going all the way to the bottom   and removing this distribution of force that gets \nusually robbed by the Achilles tendon. And that's   it, guys. Basically, if you take this exercise \nand you do it each side, three sets, per side,   forget about the number of reps that you're using. \nWhen you can exceed, let's say, 10 reps per side,   you've got to increase the weight. You don't need \nto go any more than three sets. You increase the   weight, so you continue to create more overload \nas the muscle gets stronger. And while getting   stronger it can also help you to offload some of \nthe high force that the Achilles itself takes on   that could lead to some of those tears. \nSo, guys, make sure you leave your comments and   thumbs up below. Let me know how it works for you. \nJesse himself is actually going to incorporate   this for the next few weeks. We'll give you \nan update on how it goes. If you're looking   for programs guys where we put the science back in \nstrength. You can head to athleanx.com. And also,   if you find the video helpful, make sure click \nsubscribe and turn on your notifications so   you never miss a new video when we put \nout. All right guys see you soon."
}