{
    "id": "evxA_FjDK1k",
    "title": "How to Get Bigger Quads FAST!",
    "description": "If you want to get bigger quads fast, then you have to watch this video and find out the one simple change you can make to your ...",
    "transcript": "What's up guys, Jeff Cavaliere, \nAthleanx.com. Today I want to   show you how to grow bigger quads fast.  \nWhoa! Whoa! Whoa! Whoa! Whoa! Whoa! Whoa! \n  You understand that if you \ndo this every single video,   it's no longer an interruptions, \nit's actually part of the video. \n  Well, you're welcome for me being here. \nCan I talk about quads here, please? \n  Well you can't talk about quads without \ntalking about the King of Quads.\n  I'm going to mention the king, \nTom Plats is the Kinde. \n  No, no, no, no, no. Not Tom \nPlats. Jesse Laico. Run it.\n  You didn't just seriously bring \nthe just the Jesse intro back?\n  Of course, I did. It's 2020, I \ngot to bring the intro back. \n  2020 is a shit year and that's a shit into. \nDamn.  \n  Listen, I'm going to talk about the \nsquat, though. I'm going to show you   how squatting differently than you are right \nnow is actually where the real secret lies   to building up your quads faster. So, if you want \nto see that me and Jesse at the squat rack.\n  Wait Jeff, we're in the squat rack right now. \nIt's just something I could say to   get us to the next part.\nOkay, here we are, the rack. This   is actually still Jesse, not Tom Platts, don't \nbe confused. But I want you to notice one thing,   look at the width of his stance. \nDoes it look anything like yours?   And it's actually pretty traditional feet outside \nof shoulder width. Go ahead and do a squat, Jesse.   Straight down and straight up. Now, the point \nof this is, if you squat this way all the time,   then what I'm suggesting you do is change \nit up. Because neurologically you're going   to benefit from this because the recruitment \npattern that you've developed from this squat,   more time, is going to be much different than \nwhat I'm going to suggest you do next. And   that is narrow up your squat considerably. \nThis is the Tom Platt style, a narrow stance,   squat. You put your feet in here and when you come \ndown, a couple of things happen. First of all,   your range of motion on the squat increases a lot. \nWhy? Instead of having your knees in this plane,   the frontal plane, when viewed from the side \ntraveling outward, now with them narrow, they   have to travel in the sagittal plane, which means \nthat you have to get lower through more of that   deeper hip flexion and of course at the ankles \nthrough more dorsiflexion. Well, if you don't have   the mobility through your ankles, you're going \nto get stopped about halfway down on this.\n  But the way around that is to simply put a couple \nof plates under your heels like this. By getting   into this position here of more point of flexion, \nwe relieve some of that top end dorsiflexion range   of motion that we need. So now when we come down, \nwe can comfortably get down to this position.   At this point, this is going to more \nfavorably recruit the quads because, again,   we don't have that stretch that happens when \nthe knees travel out on the adductors. Again,   changing and reprogramming the recruitment \npattern at the bottom of the squat. \n  This is not something you're going to go do Max \nsquat with, you're going to dramatically lighten   the weights, which brings me to the next point. \nIf you really want to turn on the gas in terms of   increasing the size of your quads with focused \nhypertrophy work, don't just do this for a few   reps. Grind them out again Tom Platt style for 20 \nreps. A 20 rep quads set done with a narrow stance   is an absolute grinder. And the point of it is you \ndon't just do it where the 20th rep is difficult   and you get tired on that 20th rep, you're \ngoing to likely get tired around the teens, 13,   14, 15th rep. You then rest, pause briefly \nand grind out another and rest, pause   briefly until you grind out your 20th rep.\nAnd the good news is, even if you're concerned   that you're going to lose strength because you're \ngoing to drop those weights, trust me, guys,   if you can better recruit your quads at the bottom \nof the lift, you're going--what are you doing? \n  Showing off my quads. \nOh. You're going to be able to have   a stronger squat when you go back to traditional \nwith squatting because you're going to have   the additional benefits of stronger quads at \nthe bottom where we already know you have the   adductors, we already know you have the strength \nto drive you out of the bottom of the rep. So   that being said, guys, give it a try. Don't \nbe afraid to change it up every once in a   while. Work this into your squat regimen and I \npromise. You guys, better games await you. \n  In the meantime, if you thought this is the most \npathetic of all of Jesse's intros, make sure you   leave a comment and thumbs up below. And also, \nif looking for programs, guys, when we put the   science back in strength in everything we do, \nyou can find them all over at Athleanx.com. \n  Make sure you also click, subscribe \nand turn on your notifications so you   never miss a new video when we put one \nout. All right guys, see you soon. \n  Wait, Jeff, we're in the squat rack, \nshouldn't you be curling or something?\n  Wow, wow have you changed. I'm called \nBrolin, where's Josh Brolin? \n "
}