{
    "id": "eZsE_TTrQBA",
    "title": "Knee Exercises for Pain Free Leg Workouts (NO MORE PAIN!)",
    "description": "Build ripped, athletic legs without knee pain with this workout… http://athleanx.com/x/build-ripped-athletic-legs-without-joint-pain ...",
    "transcript": "What's up guys? Jeff Cavaliere, AthleanX.com. Today I'm going to show you how to never skip\nleg day ever again because your knees are hurting you. This is a very common thing. I know full well myself that bad knees could\nreally interfere with your leg training unless you have a game plan. Unless you have a couple big points of understanding\nhere, and I'm going to try to get them across right now. First of all, what could be going on in your\nknees? Remember, it's a very common thing that everybody\ndeals with in some way or another. One: you could have an ACL tear, or you could\nhave torn your ACL in the past and had it repaired, or maybe you never had it repaired. That's going to have an implication on your\nleg training. Two: you could have arthritis. Especially the older you get, the more likely\nyou're going to get arthritis that comes up, especially in the knee. Third thing: you could have a meniscus problem. If you tore your meniscus at some point, if\nit's not repaired and it's causing you problems, it causes big problems with training in your\nlegs. Finally: you could have patellar tendonitis,\nwhich is one of the things I deal with in a very significant way because my feet are\nso damn flat there's a lot of causes for it, or whatever it is; if you have it you know\nwhat it feels like. That knife stabbing feeling in your knees\nevery time you try to step underneath the squat bar. So, what is the big issue that you need to\nunderstand to be able to start training around these pains? You can do it. You have to think \"What is the position of\nyou shin?\" This is my leg bone here below my knee. What is the position of your shin during the\nleg exercises that you're doing? What I want to do is show you what happens\nto the shin during the different leg exercises so you could get a better understanding of\nwhich ones might be better for you. The second thing you want to consider is:\nwhat is the depth of flexion? How much flexion are you getting? If my leg straight, when I go down to a squat,\nam I stopping at 90? Am I going all the way down? What is the depth of the exercise you're doing? That, too, could have an implication depending\non what is wrong with your knee. So, let's start looking at a couple of the\nexercises. First off, we have a common exercise that\ndoes tend to cause knee pain in people that have it. It's the lunge, but there's two ways you could\ndo. There's a lot of ways you could do a lunge,\nbut there's two sagittal plane ways that you could do the lunge. You could either do them forward as I'm demonstrating\nhere for you, or you could do them backwards, as I'm demonstrating here for you. Now, the movement is the same in terms of\nwhat happens in you quads and your glutes. You get a little bit more loading on your\nglutes when you step forward. However, if you look at the movement itself\nwhat is the position of the shin? The shin on the forward lunge is really far\nforward. It's angling a lot further forward from vertical\nthan it is here, when I show you on a reverse lunge. On the reverse lunge I'm taking a lot of the\nstress away from the front of the knee, or the kneecap, especially if I had that patellar\ntendonitis, or patella femoral syndrome. What is the knee depth? The knee depth is actually pretty fixed. It's fixed, especially on the reverse lunge\nbecause when that back knee comes really close or touches the floor I'm done with the movement. So, if you're somebody that has arthritis,\nor somebody that has meniscus problems, we know that the depth – a lot of flexion of\nthe knees – is going to cause a problem. Especially with meniscus tears. You're going to get a lot of pain and discomfort\nwhen you go to really deep flexion of the knee. So, this is a great exercise for you because\nof that, but the people that have the issues with the vertical displacement of the tibia\n– like an ACL. When we lose our ACL the tibia is no longer\nreally controlled on the femur; it can go too far forward. Same thing with patellar femoral syndrome,\nor patellar tendon inflammation. You're going to get less of that stretching\nover the kneecap if that shin stays more vertical than it does when it goes past vertical. Next exercise: we'll go to a common one. The squat. Here's another two pronged issue. You can see in a squat my shin does go pretty\nfar forward and it also creates a great degree of knee flexion if you go ass to grass, which\nis great if you have the ability to do that. If your knees are free of discomfort. If I go with deadlift – which is another\ngreat power exercise for the legs – look at the difference. Watch how much more vertical my shin is during\na dead lift, and it still allows me to load up. It still allows me to lift a lot of weight\nand train my legs heavy without having to have all that vertical displacement; that\nforward displacement of the shin that I would get with a squat. You do have another option though. If you're trying to avoid some of that displacement\nforward and keep that knee feeling a little bit better you could do a box squat, like\nI'll show you here. What we're doing with the box squat, not only\nare we getting a much more vertical shin at the bottom, taking a lot of that stress off\nthe knee, we're also controlling the depth. Again, depth issues are going to be a problem\nfor people that have arthritis, or meniscus tears. A box squat will be a great way for you to\ncontrol that and also keep your knee in that more vertical position. Another alternative all together, and still\na version of a squat that's my favorite, is the dumbbell Bulgaria split squat. With a Bulgarian split squat, again, now I\ncan load up the weight. I can load even up to 95 pounds, or 100 pounds\non each hand, get my knee farther out – the further out that I jump my knee, when I go\nstraight down I'm going to have a vertical shin. If I keep my knee too close to the bench – as\nI'm showing you here – even this great exercise can become more problematic for those like\nthe ACL tears, like the patellar tendon problems, when I go down. You can see that shin is no longer remaining\nvertical. Even how I setup here for this exercise is\ngoing to make a big difference. I get good depth at the bottom, I do get control\nof it because my dumbbells are going to hit the floor before I can get all too low, and\nof course I've got that whole problem fixed as far as how far forward the shin goes. I love this exercise. This is actually one of my favorite ways to\ntrain legs. Not to mention the fact that I could do it\nunilaterally, which is more athletic. Finally, another great option for you when\nyou're trying to train like an athlete especially – we talked about unilateral. It's great to train your legs unilaterally\nbecause we're usually on one leg or the other when we're functioning. When we're running, jumping, or again, being\nan athlete. So I like the step up. The step up is another great exercise that\nallows us to – look at it. I'm showing you here. Again, keep that shin pretty damn vertical\nas opposed to really driving that knee forward and causing some pain and discomfort in the\nfront, or medial part of your knee. It even allows me to get really explosive\nif I want because I can be explosive still out of that same safe position of the tibia. See? I can just explode up off the bench, do this\nplyometric version of it, but I'm still doing it out of a good position here of my knee. So there's really no excuses when it comes\nto training legs. You never have to skip a leg day. Athlean-X is all about that. I work with professional athletes who deal\nwith knee problems all the time. Some NFL players who've had 60 surgeries on\ntheir knees. They'd better find a way, or they're going\nto have to retire. It's my job to help find ways and find solutions. We do that all the time. As a matter of fact, like I said, ass to grass\nmight be great for you if you can do it and you don't have pain and problems in your knees. Again, there's a lot of reasons. Don’t let somebody tell you that ass to\ngrass is the best thing for your knees if you've got knee problems. No. It depends on what's wrong with your knees\nin the first place. So, one size doesn't fit all. Again, that's my job as a PT, to make sure\nthat I get you guys the training exercises that you need to allow you to keep training,\nget yourself in the gym, and continue to get leg gains. I hope you've found this video helpful. If you're looking for a complete training\nsystem where I put the PT and the science back in what we do, then I invite you to head\nto AthleanX.com and get our Athlean-X training system. No, we don't skip leg days. We train you pretty intensely and we get damn\ngood gains as anybody that's done our program can tell you. If you found this video helpful leave your\ncomments and thumbs up below. Let me know what else you want to see and\nI will do my best to do that for you here on our channel each and every week. I'll see you guys back here again, real soon."
}