{
    "id": "F1i2bjq9vUI",
    "title": "Build Twice the Muscle with 1/2 the Weight!",
    "description": "If you want to build twice the muscle, you need to start including elements in your training where you use half the weight. In this ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So if you're ready to start lifting lighter\nweight and build twice the muscle, then I'm ready to help you. And it starts by watching me do this overhead\npress. See if you can spot how lifting the weights,\nthe way I am right now, is going to help to unlock more muscle for you. It's just an overhead press. Did you spot it? If you didn’t; look again. Here, you can see that in one hand I have\na 50lb weight, and in the other hand I have a 25lb weight. Now, this is called \"Offset Loading\". Besides the obvious increase of core activation\n– because my body is going to have to stabilize and prevent the heavier side from tilting\ndown – we have a lot of other ways we can utilize these two dumbbells, and the pace\nin which we move them to create an increase in muscle mass. Now, I don’t care which exercise you apply\nthis to. I'm going to show you a number of ways to\ndo that here. But if we look at, even our first exercise\n– we'll take the side lateral raise for your shoulders. I can show you what you're really trying to\nfocus on. You have three options. The first is: you can take the light weight\nand try to slow it down, and move it at the pace of the heavier weight. Here, you're looking for muscular control. Let's face it, when we lift weights in the\ngym many, many times we're swinging the damned things all over the place. But if you force yourself to slow that down,\nthat lighter weight is now going to have to add some muscular control – the manual muscular\ncontrol from you – which is going to lead to more muscle hypertrophy in the long run. Think about it. Gymnasts, ballet dancers, all the people that\nimpeccable body control, and muscle control; they usually have pretty big muscles where\nthey do have that control. You want the same thing. You can opt instead to move the heavier weight\nat the pace of the lighter weight. Meaning, you're going to speed that damned\nthing up. We know if you take a weight that's heavy\nand you add the factor, and the element of speed you're going to increase your power. The more powerful you become, the more hypertrophy\nyou're going to build. Why? Because you're tapping into the type II muscle\nfibers that are capable of providing you with this increased size. So you want to make sure you do that. However, we have one other option. I've covered this before as part of our metabolic\ntraining. That is: you can take both of the weights\nand slow them down, as I'm doing here, for the ultimate muscle control. You see, we want to eliminate all momentum\nhere. In this particular exercise I'm literally\njust forcing the middle delt to do the work of lifting that dumbbell up. Even 10lbs here feels incredibly heavy. But here's the cool part. Because of the way our bodies are wired, if\nyou can elicit that type of control on one side of your body you can let the other side\ngo along for the ride. So now you're doubling the weight. It's half of what you would normally use for\nyour \"heavy weight\", but the fact is, this is still quite a challenge, realizing how\nhard it is for that light dumbbell – that 10 pounder – to even do what I'm showing\nyou here. But neurologically, we're wired to have one\nside help out the other. This is actually a principle that we use in\nstroke rehab to help bring about any kind of movement in a paralyzed side of the body. We can elicit that form using the ability\nof the side that can move, and this is what you're doing here. Now again, it doesn't just apply to the delt. You can apply it to a lot of other exercises. If you look at the chest here, we can do it\nwith the bench-press. You offset load. Take a heavy weight, take half, and you start\npressing. Again, the obvious; we're hitting the core\nhere on the lighter dumbbell side because you're trying to prevent your body from falling\noff to the heavy side. But you can see here, no matter how you decide\nto do it, you want to focus on one of those three techniques. And again, you always have the option of dropping\nthe weight down entirely and going for that ultimate muscle control, and that really great\nactivation of the chest. Again, it would carry over here to a dumbbell\ncurl as well. Look, the core obviously has to work, and\ncontrol this, but just forcing yourself to sometimes slow down, or sometimes speed up,\nand become more explosive is going to provide a stimulus for growth. Anything that you're not used to doing, or\ntraining right now is going to provide you with the overload that you need to cause that\nresponse. You want to do leg work? You do lunges. Getting offset loading n lunges is incredibly\ndifficult. Why? Because our core, again, wants to tilt our\nbody to one side. You want to train your hips, and your legs,\nand your entire lower body to be stable no matter what position your body is in. Here, in this functional split position, is\na great way to train your body. Finally, you can do your triceps. Same thing in a tricep extension here. Utilize the same principle. You pick the speed, you pick what your goal\nis, but all three of them will ultimately lead you to more muscle growth. Guys, science is what guides what we do here\nat ATHLEANX, and it's what guides us in all of our programs. If you haven't already started training like\nan athlete, head over to ATHLEANX.com, get one of our training programs, and do that. And if you haven't subscribed to our channel\nhere, guys, it's what we try to deliver to you week after week, every, single time we\npost a video here. It's something that's going to help you to\nget better gains. Make sure you subscribe to the channel, and\nof course, check out one of our latest videos over here. All right, guys. I'll see you back here soon."
}