{
    "id": "f3eo2MOqbfE",
    "title": "Full or Partial Range of Motion Reps (WHICH IS BEST?)",
    "description": "When trying to build muscle is it better to use full range of motion or partials in your workouts. Today we are going to pit the two ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re going to talk about partial\nrange of motion versus full range of motion. Which one is better? I’m going to tell you right off the bat,\nguys, you’re going to say, “As a physical therapist I know Jeff’s answer. He always wants full range of motion.” But you’re going to be surprised here because\nthe fact of the matter is, we have to make one very important distinction right off that\nbat. That is, are we talking about a joint, or\nare we talking about an exercise? Let me give you an example. A bench-press. We know that the full range of motion on a\nbench-press should look like this. We should have the bar fully extended out\nover our chest, we should lower the bar down, touch the chest, and then push that bar back\nup overhead to full extension. That is full range of motion on the bench-press. However, is that full range of motion for\nthe chest? The answer is, no. We know that the chest muscles attach to our\narm here, which means it crosses the shoulder joint, and it can do more than just this. It can take our arm across our body. Something I’ve talked about a lot on this\nchannel, which is full adduction. That is full joint range of motion for the\nchest, but it’s not being explored here on full range of motion of an exercise. Now, there are instances where the two will\nmatch up. Like on a bicep curl. We take our elbow, we know that it can fully\nextend, and we know that the elbow can fully flex. So, we do that on every repetition of a curl. So sometimes they overlap, but if you don’t\nmake that distinction you could wind up leaving a lot on the table, in terms of your training\nand the effect that you’re after in your training. In this case, I will say right off the bat\nthere are some very good applications and reasons why you should be doing partial range\nof motion. Here’s one of those examples. If I’m training for hypertrophy, I know\nthere’s one thing that can really, really help me in my pursuit of that. Especially if I’ve run up against the wall,\nin terms of progressive overload, or I don’t want to incur the effects of soreness from\neccentric overload. That is exploring metabolic training. We know that metabolic training is something\nthat requires a lot of fortitude, number one, the ability to withstand that burn as I go\nrep, after rep, after rep. But we can do that even more effectively when\nwe shorten the range of motion on particular exercises. When we take an exercise back like the curl,\nif I were to drop off most of the range of motion there, keeping it in the top 30 degrees,\nwhat I’ve done is shifted most of the focus of that exercise into the contracted position. In here as well, I’ve also created a bit\nof an inclusion effect. I’m not allowing that blood to escape that\nmuscle. I’m in that contracted range and I’m repetitively\nexploring that range without ever going into full extension at that joint. So, I get more of this metabolic buildup. It becomes a lot harder to resist that burn. It becomes even more effective if I can resist\nthat burn. It becomes a great exercise for creating hypertrophy. We can do it on other exercises as well. We can do it on a side lateral raise. I get the elbow up to the side here and I\ndon’t go all the way down. I keep it to that upper portion. The same thing could be done here with a crossover,\nwhich is great because it’s filling in the gaps of what was missing, in terms of that\njoint range of motion for the chest crossing the shoulder on a bench-press. But what’s in common with all these is that\nthese are single joint exercises. The application of this shortened range of\nmotion, or partial range of motion, is great here when we talk about these single joint\nexercises because I can really focus on obtaining that burn and keeping that burn going. Why wouldn’t we want to do that in other\nplaces? I’ll talk about that in a second, how compound\nlifts wouldn’t really fit that mode and why we wouldn’t want to do that. But I’ll give you another application here. Anybody ever have to recover from an injury? Partial range of motion is a godsend for getting\nthrough that. How do we do that? Well, let’s pretend you can’t get your\narm overhead for whatever reason. Rotator cuff issue. Labrum issue. Would you want to forego all overhead activities? Would you want to never try and lift your\narm up overhead until you were fully recovered? No. That would be a major mistake. You could go into a different movement pattern. You could take a high to low row and what\nI’m getting is cutting the distance in half with my overhead needs. Instead of having to get all the way overhead\nI could be out here at 45 degrees. And what’s more important is that I’m\nrowing down and extending up the front of me. I’m getting motion in this joint. I’m allowing the synovial fluid to bathe\nthis joint to bring blood to the joint, to enhance, and speed up recovery. So, we know that employing partial range of\nmotion, in terms of getting back from an injury, is a crucial aspect of not having to avoid\ntraining altogether. But I mentioned the compound lifts. I mentioned the full range of motion. This is where I like to use it. Why? Because it’s really important to achieve\nwhat we’re trying to achieve, I think, with the bigger compound lifts. That is stacking joints and letting them work\ntogether. Take, for example, the squat. If I were to do a quarter squat is there any\nreal benefit to that? You should probably know the answer is ‘no’,\nbut why? That’s what’s more important. What’s going on here at the ankle in a quarter\nsquat? Really, nothing. That’s the problem. If you want more dorsiflexion, we’re going\nto have to get down lower. What about the knee? Are we getting anywhere near the flexion that\nwe need in our knee to realize our full knee flexion and range of motion? No, because we’re not getting down low enough. And it goes down the chain, guys. It goes into your hips. It goes into your thoracic spine. In order to get this to operate correctly\nand get those joints to operate together correctly we need to explore full range of motion. This is where it’s best. This is where allowing all those muscles that\ncross those joints to work together in one, coordinated effort. This is what’s functional. This is what’s necessary. We want to make sure we do that. So, when we’re training for strength on\nthese big compound lifts, full range of motion is where you want to be. 99% of the time because there’s always that\n1%. What is that 1%? Well, if you get to the point where you’re\nbecoming competitive like a power lifter, and you’re utilizing the bench-press as\none of your examples here, of where you want to excel, you might use partial range of motion. Why? We’ve had one of our very own in this gym\nhere, Casey Mitchell, an incredibly accomplished power lift who uses his accessory lifts. Namely, the floor press as a way to enhance\nhis bench-press. How is that possible? Because he knows the lockout portion is difficult. The lockout requires more tricep contribution. If he feels he’s lacking there and it’s\nhindering his ability to do the press as a whole, utilizing partial range of motion floor\npress is going to help him build up his strength which will help him carry over when he goes\nback to the full bench-press. That’s exactly what he said. He spends more time on his accessory lifts\nthan he does on his regular compound lifts because he knows how important they are. Anyone who would discount this and call themselves\na strength coach doesn’t understand it. They don’t. We know range of motion and the value of range\nof motion at a joint and how it contributes to an exercise. So, what I’m telling you guys is you need\nt make sure you have your mind open to both. Know when you want to use full range of motion. Know when you might need to explore partial\nrange of motion. Know that not one of them is exclusively great\nand the other one bad, or something to avoid. I hope this video opened your eyes to that. In the meantime, if you’re looking for programs\nthat understand this and realize that there is going to be a need for both, putting them\ntogether does require a scientific approach, and that’s what we always try to do on this\nchannel. That’s why I take all the time to explain\nit to you guys, so you understand why we do what we do. Not just saying ‘do this’. Those programs are all available at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you. And if you haven’t already done so, please\nsubscribe and click on those notifications so you never miss a new video when it’s\npublished. All right, guys. I’ll see you again soon."
}