{
    "id": "F80okOYVaVY",
    "title": "Shoulder Exercise | Get Big Shoulders (SIDE AND REAR DELTS!)",
    "description": "If you need a shoulder exercise to help you build bigger side delts and rear delts without having to use the same weights that you ...",
    "transcript": "What's up guys, Jeff Cavaliere, athleanx.com. \nIf you struggle to build your delts,   and I'm talking specifically about your middle and \nrear delts, you know that width of your shoulder,   then you're going to want to try this exercise. As \na matter of fact, you're going to want to try it   today, because it's going to be that \nsignificant of a change for you when you do.   Now, I've always talked about this thing, No \nMan's Land Mistake, what a lot of people do,   even if they're doing a lot of overhead pressing, \nthey still can't build the delts because when they   do the other exercises, the lateral raises, \nthe front raises, even the rear delt raises,   if you don't forget to do them. You stick around \nthis area of the rack, this is No Man's Land. And,   stop me if I'm wrong, but when you do these \nexercises, are you grabbing, let's say 15s   or 20s, maybe 25s, maybe, at most 30s. You're sort \nof in this range for all of those exercises. \n  Well, I've talked about how there are benefits to \nbe had when you go down that end of the rack, the   light side. Because we know that we can actually \nget the delt to initiate the contraction, actually   do more of the work, even at lighter loads and get \nmore stimulation from them. So, we don't want to   ignore that, but a lot of us never go down that \nend of the rack. But that's where you need to be   if you're having a problem building the middle \nand rear delts. So, let's take a trip together   down to this side. Now, maybe if you watched my \nvideos before, you have grabbed some of these   heavier dumbbells for something called a Cheat \nLateral. But the thing with the Cheat Lateral is,   if you're doing it as one of the final exercises \non, let's say, Push Day or Shoulder Day or   whatever it is how you're breaking up your program \nright now, you might be a little bit drained   by the time you're grabbing the heavier weights \nbecause it is another push dominated exercise. \n  I'm going to give you the tip to sort of drive \nyour arm away from your body when you're doing a   lateral raise. I want to show you something that's \nactually posterior chain pulling dominating,   which gives us the same chance to really go \nheavy here regardless of the push muscle fatigue   you might have leading up to that point. So, we \ncall it the Abduction Row, and again it's a row,   because that's what we're going to actually do in \nterms of the motion to take that load off the push   side and move it more to the pull. We just angle \nour body forward at about 30 degrees like this.   We have the heavier dumbbell in our hand. We \nknow that in order to hit the middle delt,   the main job is to abduct the shoulder. \nIt's to get the arm away from the body.   We don't have to do that through pushing, we \ncould do that through rowing. When we row, we know   we instantly ignite the rear delt as well. \nWatch what happens. If we get in this position   here and we have the dumbbell hanging down \nright in front of us, in front of our thigh,   you row it up and abduct the arm at the same \ntime. Row and abduct. Row and abduct away from   you. What you see is that middle delt is really \ngetting subjected to a much heavier load than   what you were doing down there in No Man's Land, \nbut it's capable of handling these. Because again,   you're getting the assistance from the rear \ndelt, a little bit of the back musculature,   but we're minimizing lat contribution because \nwe have the arm drifting far away from us.   It's not staying nice and tight in here where \nthe lats would tend to dominate, it's getting   out away from us, which gives us the chance \nto work the entire shoulder in this area. \n  Again, you perform it like you would any heavier \nexercise, more in the six to eight rep range.   Now Jesse's actually been doing this exercise as \nwell since I showed it to him but has given us a   chance to really overload it. And you can see \nhere it's given Jesse quite a few gains. So,   that being said guys, if you're looking for--\nHey, what's going on man. \n  When I mention your name, you just \ncome out and magically appear.   You here to show off your delts. \nGrrrrr. Just like that. But I'm not here   to show off my delts, I'm here to show \noff my new outro and my deadlift. \n  Oh my God, an outro?\nAn outro. Ready? Run it. \n  Oh my God. I've created a monster. \nThat's right, a monster. \n  Guys, if you're looking for the programs, \nthey're over at athleanx.com. If you   haven't done so make sure you leave a comment \nbelow. Try it out and let me know let me know   it works for you. And also guys, make sure you \nhit subscribe and turn on your notifications so   you never miss a new video when we put \none out. See you monster. Bye guys. "
}