{
    "id": "FLmgF9if_pc",
    "title": "The Best Dumbbell Exercises for Building Muscle (GET JACKED!)",
    "description": "The best dumbbell exercises for building muscle could entail a lot of movements, but which ones are the best? In this video, I am ...",
    "transcript": "And so what I hold before me is \nthe official list. That's right,   the greatest dumbbell exercises of all \ntime when it comes to building muscle.   So with that said, guys, we had a lot to cover \nhere, let's start revealing them one by one. \n  What s up guys, Jeff Cavaliere, athleanx.com. Did \nyou ever wonder what the best dumbbell exercises   you could possibly do if your goal was to build \nmuscle? Don't worry about it because as I said,   I put together a list that I'm going to reveal \nhere for you today. But before we even get started   guys, this is a participation opportunity here. \nIf you could only have five dumbbell exercises   that you could do, list them for me below in the \ncomments. Tell me what your five favorite are of   all time. That being said, I've gone a little bit \nmore comprehensive than that 30 in total, breaking   them down muscle group by muscle group to help you \nso that you know what places to focus your efforts   on and maybe what exercises not to. Now this is \nnot an all-encompassing list, of course, there's   more exercises than just these 30. But I believe \nthese are the ones that hold the best opportunity   to help you grow. So that being said, guys, \nlet's start breaking them down one by one.\n  Now, I m going to kick off the list with where I \nalways like to kick off my list and that's biceps.   And the easy thing here is you're going to \nbe looking at a bunch of curl variations, but   specific reasons why some rank better than others. \nAnd I say rank, there is no ranking between the   exercise in terms of this one is better than that \nor this one is better than that. If you want to   know that information, guys, make sure you check \nour exercises ranked series videos. I'll link   those for you at the end of this one. \nThat being said, let's start looking at the   curls. And the first thing for me is the Standing \nAlternating Dumbbell Curl. And I've mentioned   before, when I'm looking to build my biceps, \nI don't want to be undermined by a weakness in   the core, so I'm not going to move both dumbbells \nat the same time. I'm going to focus on one at a   time, and this gives me the opportunity to do \njust that. Of course, the Waiter s Curl is my   favorite exercise for creating that contraction \non the biceps in the peak contracted state.   This kneeling option is actually one that \nhelps those that find it uncomfortable   with the dumbbell hitting into their junk at the \ntop of a standing variation here. The Cross Body   Hammer Curl now shifts the focus to the brachialis \nrather than the biceps. And because we're able to   get into this pronated position and keep the arm \nclose to the body, we can handle heavier weights   and really overload this important muscle.\nThe Dumbbell Drag Curl gives us a chance to   hit the biceps long head, and we do that by \nkeeping that arm back into extension. Oftentimes,   we never even think about doing this unless \nwe're doing a Dumbbell Incline Curl. This is a   great way to overload that long head and get some \nadditional growth. And of course, the Dumbbell   weighted Chinup has always been one of my favorite \nexercises for building bigger biceps. You take a   classic calisthenic exercise that's difficult \nfor many, you add additional load because of the   dumbbell in between your feet, and you've got now \none very capable of helping you to build out those   biceps and stretch out those short sleeves. \nAnd so now we move around to the other side of   the arms, are talking about the triceps. And for \nme, there's four exercises here I want you to   focus on. First and foremost is the Lying Tricep \nExtension, I ve mentioned many times before that   this is the exercise when it comes to building big \ntriceps because it has that important component   of placing a stretch on the long head that a \nlot of tricep exercises like the Push Down say   do not. The next one is the Dumbbell JM \nPress and unlike the tricep extension,   this one actually doesn't have that long head \nstretch. But what it does do is it gives you a   chance to load the exercise up. And when we're \ntalking about building bigger triceps without   machines and without barbells, this is going \nto give you the chance to actually use heavier   dumbbells and get the overload that's going to be \nable to create the size you're looking for. \n  Of course, we keep it going here with something \ncompletely on the light end of the spectrum,   it's the Dumbbell Kickback. And I know a lot of \npeople are like, there's no way that that's one   of the best exercises of all time. But yes, it \nis, because it is actually one of the very few   exercises that would place that long head of the \ntriceps in its peak contracted state. So while the   stretch exercises do a great job of putting it in \nthat stretch position, the peak contracted state   is one we don't want to ignore either and the \nDumbbell Kickback does that phenomenally. \n  The last exercise that's going to be the Dumbbell \nIncline Powerbomb when we do it in the incline sit   up like I show here, I'm clearing all \nof the problems with the shoulders. I   have my elbows facing forward, I get plenty of \nclearance of the dumbbell back behind my head,   so I don't have to worry about it hitting me. And \nI get once again that stretch on the long head.   That makes this the great exercise that it is.\nAnd so now let's go back to something else like   the back. My favorite back exercises with \ndumbbells are going to lead off with a Row.   But you know, I don't like the kneeling One \nArm Row on a bench because I talk about the   increased hernia risk by doing that. But we do \nhave the Dumbbell Tripod Row and when we get from,   this is the opportunity to keep our feet in \ncontact with the ground without changing the   mechanics of the exercise in terms of its \nability to grow the lats. This is a safer   alternative and still allows you to do everything \nyou would want to do with a Dumbbell Row. \n  Next on here is the Dumbbell Pullover, and we talk \nabout this one actually being multidimensional,   you're going to hear it again later on. But \nfor now, when we're trying to build the lats,   you keep those elbows flared out. You get \nthat nice, good stretch reflex on the lats   in the bottom position. You don't have to go \ndown incredibly low if you have a problem with   your shoulders. You can still get an amazing lat \nstretch, especially if you drop your hips on this.   It's one of my favorite exercises when \nyou're trying to build bigger lats. \n  Then we go into the next exercise here, \nwhich is the Dumbbell High Pull. And this   is definitely one of my favorite exercises \nbecause it's the Anti-Upright Row. You see,   instead of having those wrists trailing \nthose elbows as you would on an upright row,   I talked about the importance of just flipping \nthat orientation around and getting those elbows   underneath the wrist. And it's an all-important \ndifference because external rotation is replacing   internal rotation. And of course, just like with \nthe chin up, you can't forget the Weighted Pullup   when it comes to building bigger lats.\nAnd that brings us to the legs. And guys,   people think that you can't really build your \nlegs without a barbell. That's not true. You   can take the right dumbbell exercises and load \nthem up and actually start building your legs   pretty damn well. And the first exercise here that \nproves that is the Dumbbell Bulgarian Split Squat.   It happens to be my all-time favorite leg exercise \nwhen it comes to utilizing just dumbbells. It's a   multidimensional exercise, but importantly, it's \none that can be overloaded very successfully with   just dumbbells and still create the muscle growth \nyou're looking for. But of course, a bench is not   required to make an effective exercise for your \nlegs. I can stand up and do a Reverse Lunge.   And I mentioned here before it's my favorite way \nto do a lunge because by stepping back where I   could take away some of that anterior stress on \nthe knee and still cause the overloading growth   that they need to create new size in their legs. \nI could also do something called the Dumbbell   Offset Lunge because what I can do is challenge \nthe body in a little bit different plane.\n  The frontal plane allows me to now have some more \nhip involvement and again controlling this lunge   through more control of the abductors of the hip. \nAnd for that, it's going to belong here as its   own entry into the best exercises. And of course, \nthe last exercise here will be the Dumbbell RDL.   And when it comes to training the hamstrings, \nthis one gives us a chance to get that same   stretch benefit that we would from let's say, \nthe pullover applied here to the hamstrings,   giving us the chance to tie them in also \nto glute function through hip extension.   Another great exercise here and all these \nround out the best selections for legs. \n  And that brings us to the chest here, guys. When \nwe're talking about chest, there are definitely a   lot of dumbbell exercises at your disposal. \nBut what are the best ones? In my opinion,   here they are. Right up off the bat here, guys it \ndoesn't get any more basic than the Dumbbell Bench   Press. And while of course you can increase the \nintensity via a bunch of different intensifying   techniques at its root level, doing this exercise \nhas got to be one of the staple in your arsenal   when you're trying to build a bigger chest.\nAnd of course, we could add some weight to another   classic exercise too, to increase its benefits, \nand we're talking about the Weighted Dip. This   is one of my favorite exercises, particularly \nif I get the mechanics right by leaning my body   more forward and allow this to help me build a \nbigger, lower chest. The Dumbbell Floor Fly is the   only fly endorsed here by Athlete-X and for good \nreason. Because I just don't see the value in the   benefit of doing the exercise unsupported. Not to \nmention the fact that it's oftentimes compromised   in terms of the weight that you can use. When \nwe utilize the floor, as we do in a Floor Fly,   I'm able to increase the load that I have \nin my hands here. That's going to actually   more effectively overload the eccentric and \ngive me a better muscle building option. \n  The Dumbbell Squeeze Press is going to introduce \nan additional stress of the isometric adduction.   And we're talking about the best of the best \nin trying to eke out more muscle gains from the   exercises you're doing, this is a great option for \nyou to do that. And of course, it doesn't end here   without including that Pullover again. Yes, the \nPullover, because, you know, as I said before,   the way you do the exercise matters and when \nyou incorporate a much tighter arm position   and squeeze your arms together adduct them as hard \nas you can at the top of the exercise, you can   shift the focus from the lats to the upper chest, \nmaking this another option, particularly for those   that don't have access to an incline bench.\nAnd moving on here, we now have to talk about our   shoulders and of course, we have three different \nheads of the shoulders, and we're going to have to   pick some exercises to get the job done across the \nentire shoulder. But let's start with one of my   favorites, it's called the Dumbbell Scoop Press. \nAnd what the Scoop Press does, it almost starts as   a front delt exercise that then transitions \ninto a front delt, middle delt press overhead.   So of course, I love the pressing exercises for \nshoulders. They're the best of the best and we   always have to do them. But this one just \ngives me an option to get that front delt a   little additional work before it enters into that \nmiddle delt, front delt combination press. \n  The next exercise is called the Dumbbell Hip \nHugger, which does a great job of actually placing   both the rear delt and the middle delt in that \ncontracted state. And you'll notice as I'm pulling   the dumbbells up, as if I'm trying to almost \npull up a pair of pants that have fallen too low,   I'm getting a bit of abduction at the shoulder \nas my arm drifts away from me. And again getting   the arm into extension, which is going to light \nup that rear delt. When it comes to the middle   delt though, there is no exercise for me that I \nlike better than the Dumbbell Cheat Lateral. I've   talked about before the benefits of sometimes just \ngoing a lot heavier than usual and swinging the   weight around a little bit. With the idea being \nnot to have the prettiest looking concentric part   of the exercise, but to have the most effective \neccentric part of the exercise, which is a great   driver of growth when we're looking for new \ndrivers of muscle size in the shoulders. \n  Keeping with that same theme there, if I pick up \nthose heavy dumbbells, I can move them a lot more   effectively, if I use some of that momentum \nin this case with a push press instead of,   let's say, a regular press. When it's the front \ndoor specifically that I'm trying to target,   there's nothing better than the classic Dumbbell \nFront Raise. There's nothing pretty about it, but   what I do try to do is split this up into one side \nat a time so I could focus on driving that arm   out in front of my body and not rely on too, too \nmuch momentum because here I'm trying to make that   front delta the work and not necessarily have it \nbleed over into the other heads of the Delts.\n  And the same thing would go here when we're \ntalking about the rear delt. I want to do   something that I can effectively target the rear \ndelt as much as possible. This is the Dumbbell   Rear Delt Row. The key here again, is to get that \narm back into extension behind the body. The main   driver of getting the rear delta activation \nthat we're looking for and besides that,   we're looking for in that rear head. Of course, we \nhave one of my favorite move the dumbbell around   exercises and it s the Dumbbell Over and Back. \nI like to load this one up, just simply pull   it from one shoulder up and overhead to the other \nshoulder. It's a variation, obviously, of a press,   but it's something unique if you haven't \ndone it before, and it is a great overload   exercise and one capable of packing on some \nadditional size to those delts of yours. \n  And then it seems like with every single list we \nhave, there's always that one thing that sort of   falls as an outlier, it doesn't \nreally fit in any one category.   Well, it doesn't mean that we don't do it and \nfor me, that's the Dumbbell Carry. And again,   there's a lot of different ways we can do this \nexercise, and it does a lot of different things.   It tests not only your fortitude, but it tests \nyour grip, strength and test your stamina   and test your ability to kind of grind out a \nfew extra steps when you don't want to grind   out any more steps. Guys, I love the exercise \nis definitely one that's going to help you to   bulk up your forearms and your traps. Make \nsure you do it if you're looking to round   out the development of your entire body and \nyou only have dumbbells at your disposal. \n  And so now I have a very important question \nfor you, now that you have seen this list   of 30 exercises, I want to know what are your \nopinions? What are your thoughts? What are your   favorite exercises, guys? If you could only \ndo those five, would you change them now? If   you did leave another comment and tell me what \nyou want to do now? We're looking for programs,   guys, when we put the science back in strength \nand in the exercise selection we make,   you can find them over at athleanx.com. In fact, \nan entire dumbbell only training program called   Jacked is waiting for you over there as well. \nIf you found the video helpful make sure you leave   your comments two thumbs up below. If you're \nlooking for more exercises, guys, I have them   all broken down in a categorized list. The best \nchest exercises, the best shoulder exercises,   I'll write those over here for you. And don't \nforget to subscribe at turn on your notifications   so you never miss a new video when we put \none out. All right guys, see you soon."
}