{
    "id": "FpE7TbADcYs",
    "title": "Fat Loss Workout - USED BY PRO ATHLETES!!",
    "description": "More fat loss workouts you can do anywhere - http://athleanx.com/x/homefatloss One of the most effective ways to burn fat at home ...",
    "transcript": "Alright. So now we're back. We're in this mid-week break, we like to call\nit, which is another Athlean Burst Conditioning Workout. As I said, yesterday that we have to focus\non something that's athletic when we do our Burst Conditioning and in this case, one of\nthe cheapest and old fashioned training equipment there is, is a jump rope. And I think it's probably one of the most\nunderutilized because you can get a fast, effective workout and we're building up our\nagility and quickness in our feet which again, crucial to being a good athlete. So, what I want to do with David is, we're\ngoing to put him through 3 rounds of torture, I mean, 3 rounds of exercises, where he's\ngoing to go through a variation of jumps. I'm going to step off camera so I don't get\nhit by the rope when we do it. The jumps will be things like Single Leg Jumps,\nDouble Leg Jumps. Different kinds of hops, Double Unders, High\nKnees. I'll explain them. Dave will demonstrate them. What the idea here is, he's got to make it\nthrough this first round. We call it the Frozen Rope Workout because\nwe don't want this thing to freeze which means to stop moving. If it stops moving because a) he gets tired\nor b) his feet hit the rope, then there's a penalty, and you guys have to do the penalty,\nnot just him. You're going to have to drop down and do 10\nPlyo Push-Ups. You want to come up and jump or you come up\nand clap, it's up to you. As soon as you're done, you come back up. Let's say he hit it, he had 50 jumps to do\nand he hit it at #32. He comes back up, he resumes at #33. He doesn't have to start at 1 again. Alright? So, I'll step off camera. I'll let David kind of get situated. I'll call it out from here, I just want to\nmake sure that I don't get hit. He starts off this first round , he's going\n2 foot hops for 50. And he's demonstrating the 2 Foot Hop. This is a nice, gentle jump. He gets through his 50. He goes to the Single Leg Jump, there you\ngo for 50 on that leg. He goes 50 on the other leg. And then he goes and finishes the Two-Foot\nHop, side to side hop, just like that. Good. He makes it all the way through. So, so far the supreme athlete is living up\nto his billing as a Supreme Athlete. He gets through it. [David laughing] Next, Round 2. Next what he's doing is Two-Foot Hops for\n50. He's going to go Single Leg side to side on\nthe right, Single Leg side to side on the left, and then High Knees for 50 at the end. Ok. So, he goes here, side to side, just like\nthat on the right. He does his 50 here. Obviously, again, he is abbreviating this. And then, High Knees, just like that, pumping\nhis knees up. Good. Now, 2 for 2. That's true. He's going to actually have to fail here because\nI want to demonstrate, I'm going to force him to, and he might actually on this last\ncombo. We call it Double Under, Boxer Shuffle, Double\nUnder, and Boxer Shuffle again. And we go 20-50-20-50. The Double Under is really explosive. He's got to get up 1, 2. Now he hits the rope. Ok. So he hits the rope. He's got to come down, he does his Plyo Push-Ups. Just like that. He does 10. And he comes back up. He had 3 Double Unders done. He'd pick up and resume, and he'd be on Double\nUnder number 4. Then we move over to his Boxer Shuffles. So, for here, it's really just a casual, it's\njust a bounce really heel toe heel toe. Nice and casual. Good. Back up to the Double Under. Can he actually get 3? The Supreme Athlete gets 4! Alright!! And he goes right back into his Boxer Shuffle\nwith again, no hiccup because the guy's an animal. So, that's what we're talking about here. I mean, honestly....[to David] Come in here. Where you going? He's breathing heavy. You know, you can actually hear it, and he\ndidn't even do all 50, all 10, all 20. It's a great way to condition yourself. And it's a great way to get in a great workout,\nget your heart rate up, and you know, he's not just isolating his conditioning in his\nlegs. There's a lot of forearm work going on and\ninvolved in actually rotating that rope. And because of the position of your elbows,\ngood work for your rotator cuffs as well. So, nice job! Hey Guys. This is David Wright, 3rd Baseman for the\nNew York Mets. I'm a workout fiend. I love spending time in the gym. I've worked with Jeff for...I can't even count\nhow many years now. And each year he just comes up with new, great\nmaterial that enhances my workouts which translates into not only keeping me healthy on the field,\nbut you know, being able to perform at a level that I expect to perform at. I just can't say enough nice things not only\nabout Jeff as a trainer but also about the workout. Most importantly, it helps me with my preparation\nand my performance on the field. I use it on a weekly basis. I wouldn't put my name to something I didn't\nbelieve in, and not only do I believe in Jeff and his workout techniques, I believe in AthleanX\nand the program."
}