{
    "id": "FpnB7x7OjCM",
    "title": "4 Steps to Awesome LOWER ABS! (Works Every Time)",
    "description": "If you want to get awesome lower abs then you need to start by avoiding the common mistakes people make when training this ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re talking about the lower abs. Definitely the area that guys tend to want\nto have. They don’t want to just have a two-pack. If they want to have a six-pack you’re going\nto have to your lower abs show as well. I’ll tell you this: it’s not as easy as\nit sounds. Especially when you look at the fact that\na lot of us are being fed misinformation and I want to clear that up today because I followed\nthe same misinformation. I learned a lot over the years as I went to\nschool and became a professional. I started training people and realized our\nabs are actually a little different than we thought they were. I suffered from not having the right information. So, we’re going to clear that all up today. We’re going to cover four myths in the process\nand tell you how you can overcome them and get it right. First and foremost, we’ve got to talk about\nnutrition. When you’re looking to get a six-pack, and\nmost importantly your lower abs, there is a myth out there that just having a decent\ndiet is good enough. Guys, I’m going to tell you this: if you\nhave a decent diet you’re probably going to see that much of your abs right there. Maybe the top two. The rest of it is going to be pretty flat. If you want to get middle abs to show you\nneed to be a little more serious about your nutrition. You start following a good diet. I will tell you this right now, no BS, if\nyou want to have your lower abs show you’re going to have to have a great diet. That means you’re going to have to have\na solid nutrient plan that you are very consistent with. I’m not going to sit here and say which\none is exactly the perfect nutrition plan, because there are a lot of people that will\nswear by the way they eat, and how it works for them. And that’s great, but it had better work\nforever. If you have a plan that allows you to eat\nfoods that you actually enjoy, and you can stay consistent with it, then yes; it will\nhelp you get that six-pack and keep it. For me, that’s where it all matters. It comes down to the fact that you’re not\njust getting your abs, but you’re able to keep them. That relies on longevity and consistency. Most importantly, on a really dialed in nutrition\nplan. Number two: my approach to ab training changed\nover the years because I thought that all ab training was ab training. There was a point where I thought that sit-ups\nwere all we needed to do. A lot of people actually approach ab training\nthat way. “I’m going to do “x” amount of sit-ups\nevery, single day”. The sit-ups alone, in a top-down movement\nare not going to cut it. If you really want to get your lower abs to\nshow, then you’re going to have to train them a little differently. Meaning, bottom-up movements. Now, why is that? We know that the science of it, that the rectus\nabdominus is one muscle that contracts all, or none, no matter how we move it from the\ntop down, or bottom-up. Here’s the reality, guys. When you move from the bottom up you’re\nmoving your legs along with your pelvis. That immediately makes the exercise become\nmore of a weighted ab exercise. It is a loaded exercise, and we know how much\nmore difficult it is to do lower ab movements, moving the legs on our upper body, by either\nhanging, or doing them on the ground like you see me doing in these variations of clips\nhere. That’s adding weight. What it’s doing is, it’s actually activating\ntype II fibers more than it is the type I fibers in your abs. That’s because we’re adding an overload. So, when you say you don’t need lower ab\nmovements, guys, the lower ab movements themselves, by virtue of having to carry the extra load,\nare going to activate different fibers. Even the angle of activation is different\nbecause of this bottom-up approach, versus top-down. So, you can’t just think regular sit-ups\nare enough. You’ve got to start incorporating specific\nlower ab movements if you really want to get your lower abs to pop. Which leads us to the third area here that\nyou’re going to have to tighten up. That is how you’re performing your lower\nab movements. You see, I just talked about the value of\nusing those legs for the added resistance here, and what impact that has on your lower\nab training. The thing is, don’t mistake the fact that\njust because your legs are moving that you’re training your lower abs. As a matter of fact, I would argue that the\nbiggest mistake I made through a lot of years of my early ab training is, all I did was\nswing my legs and activate my hip flexors and let everything else go along for the ride. What you want to do instead is let the pelvis\ntake the legs along for the ride during all of your activities. Here’s the difference: if you see me on\nthe ground here, this is a version where I’m pulling my legs straight up. But you don’t see there’s very minimal\nactivity of the pelvis. We know if we want to contract the abs what\nwe need to do is take the pelvis and turn it into a posterior tilt. We need to get it off the ground and rolled\nback. So, if I’m just moving my legs here, what\nwork am I really doing with my abs? Very little. So instead, what I’d rather do is focus\nsolely on what’s going on with your pelvis. Take it down until it’s in contact with\nthe ground, and then initiate the moves so the pelvis is coming off the floor first. Regardless, the legs are going to come along\nfor the ride. They’re connected at the hip, guys. So, they’re going to come along. You just have to make sure you’re not focusing\non just moving your legs. No matter what exercise you’re doing, even\nif you’re hanging from a bar like you see me doing here, the action is always happening\nat the pelvis. Forget the legs, guys. Use the pelvis as your moving point, and focus\non what it’s doing, not necessarily what your legs are doing. Last, but not least, guys; we have to change\nour conception of what core training is. People always say, “I’m training my core”. Really, what they’re doing is working their\nabs. There’s a lot more to your core than just\nyour abs. But when we talk about the lower abs we have\nto expand a little bit lower. What I’m talking about is, if we’re concentrating\nso much on the pelvis. And we realize the importance the pelvis has\non lower ab training because of the attachment of the rectus right into the pelvis, then\nwe also have to realize other muscles attach to the pelvis from below. Involving them, or contracting them, is going\nto have an impact on that very same pelvis that we’re focusing on moving with our lower\nab movements. So, there’s a great opportunity here. The adductors are one of the key areas you\nwant to do that with. When I approach any lower ab movement, if\nit provides the opportunity for me to do so, what I want you to do is start crossing your\nlegs and at least squeezing your adductors. What that does is creates stability of the\npelvis from below. Any time we want to generate force from above,\nif we have a stable base from down below, we’re going to be able to do that better. It’s the same idea I always talk about. If we’re going to try and jump, and I give\nyou one opportunity to jump as high as you possibly could, would you rather jump off\nthis solid box here, or would you rather jump off sand? If you try to jump off sand, when you try\nto exert force and push down, all that force will be dispersed into he sand. No stability from below. If you tried to push off this box all that\nstability is going to provide you the opportunity to jump your highest. The same thing happens when we do our ab training. If I’m trying to generate force and tension\nfrom above with the rectus feeding down into the pelvis, I can grab and tighten the pelvis\nfrom below because the abductors have not got a better opportunity to do that. Guys, any opportunity you have, whether it\nbe a hanging leg exercise here, or a leg exercise down on the ground; if you can squeeze your\nlegs together and push, and squeeze those adductors you’re going to get much more\nactivation out of your lower abs with every rep. And at the end of the day, that’s what matters\nmost. So, there you have it, guys. Hopefully lessons learned here so you don’t\nhave to make the same mistakes. A lot of times it’s not mistakes. It’s the information that we’re fed. We simply take it and run with it. And when we get frustrated with it when it’s\nnot working we sometimes blame ourselves. I’m here to tell you that I’ve made the\nsame mistakes myself, guys. I’ve learned from them. Over the years I’ve perfected what it is\nwe do here. To the point where we say we put the science\nback in strength and incorporate into all of our programs. It’s why our programs work as well as they\ndo. It’s why they’ve become as effective as\nthey have because we put that science back in what we do. Hopefully these are just four examples that\nyou can take right now and incorporate into your lower ab training and start seeing better\nresults. If you’re looking for a step by step program,\nguys, head to ATHLEANX.com. Get one of our ATHLEANX training programs. In the meantime, if you’ve found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the days and weeks ahead. All right, guys. See you soon."
}