{
    "id": "Fq67opsS_hc",
    "title": "World’s Most Dangerous Exercises! (UPRIGHT ROWS)",
    "description": "All gains, no pain, one program - http://athleanx.com/x/the-plan Subscribe to this channel here - http://bit.ly/2b0coMW Years back I ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. We're headed back to the iron graveyard today. No, not to resurrect, but to throw another\npile of dirt. This time, on top of the upright row exercise. Why? Because it's a bad exercise. I'm telling you guys, I'm not here to pick\non these. I have no bias from one exercise to the next. As a physical therapist I have to look at\nit objectively and tell you why this is no good. I know there are some that say \"But there's\nvariations that you can do to make it better.\" There really aren't. So what we're going to do is show you exactly\nwhy that is and get you doing the right things and have an understanding of why you're doing\nthe right things in the first place. So when we look at the exercise, the upright\nrow, let's go back to the version that we all learned from Arnold and the classic bodybuilders. They grabbed the barbell, generally they were\nabout shoulder width, or a little bit narrower on the bar, and they literally lift it up. Up, up, up, up, up, until their bar was in\nfront of their face, and their elbows were up near their ears. So it looked like that. That's how we all learned it. Then people came out and said \"Maybe this\nis not a good exercise,\" because it didn't feel really good for some people. Then they said \"No, all you have to do\" – they\nsaid even me, Jeff – \"What you need to do is you need to just take it a lot shallower. Don’t bring it up so high. Take it to here, to chest height until your\nelbows are at your shoulder height.\" The problem is you're not really changing\nany of the mechanics of the exercise. You're limiting the degree to which you're\nmoving through them, but you're not changing them at all. So why is that? What's the problem? When you look at the upright row the problem\nis elevation of the shoulder – meaning lifting this up, overhead – with internal rotation\nof the shoulder. So the internal rotation component is this. Let me get a little bit closer here. When your arm is elevated, when you do this\nyou internally rotate. When you do this you externally rotate, okay? Internal rotation, external rotating. By virtue of having a bar that cannot pass\nthrough my body that must stay in front of me, by having weight on that bar I'm holding\nthe bar and it's internally rotating my shoulder just as is. So right off the bat we're getting internal\nrotation. Now your goal is to lift the bar. So you've got elevation with internal rotation. That is a bad combination. I said before in another video, when we test\nsomebody for impingement and try to see if they have it we take their arm, put it like\nthis, we internally rotate it, and we lift it up. And they go \"OH! That's hurts!\" It should because you're creating impingement. That is exactly the position that's being\ncreated by this exercise. So what can you do? You can't just use and easy bar. People say \"Jeff, use an easy bar.\" What is that doing? What that does is you're taking your hands\nand instead of being fixed on a bar this way, you're now tilting your hands up a little\nbit, okay? You're supinating a little bit, but you're\nstill – by virtue of having a bar – having to keep it in front of your body, you're still\nelevating, and because the weight's in front of you, you're still getting internal rotation\nhere at the arms. You would need to have something that allowed\nyou to be able to get behind the body so we couldn't stay in internal rotation, but external\nrotation. So we talk about having the option of doing\na dumbbell high pull. So with a dumbbell high pull I can do the\nexercise where I'm pulling up, but I'm externally rotating the arm along the way, as I elevate\nit. So coming back that way. Here, coming back that way. So at the top I'm externally rotated and the\narm is behind my body because the dumbbell allows me to get back there. That is a much different exercise. Here we're still getting the activation of\nthe delts and those that say it works the traps too, you're getting the traps. I think there are far better trap exercises\nanyway, but the fact is that the dumbbells allow us to externally rotate completely,\n100% opposite than any barbell version will allow you to do at the shoulder. I'll show you one more thing here on our skeleton,\nto why this is actually the case. So if you look at it anatomically what you\nhave is, when your arm sits in the socket like this, you have this big bump on the outside\nof your bone here. He lets me dislocate it for the purpose of\neducation. You see this big bump here? This bump is what's causing the lack of space\nwhen you internally rotate. Anatomically we all have this bump on the\noutside of our bone here. So when I go to elevate, and bring this up,\nif I internally rotate like this – like this – you see this bump? It's not squarely right in the middle of that\njoint. There is now less space because this is occupying\nmore space inside this joint when I lift it up into that internal rotation. So now, anything that runs under here – underneath\nthe acromion here, this bone, including the rotator cuff tendons, including the bursae\nin your shoulder, including your bicep tendon inside the joint here – anything that's\ninside this joint can get pinched. And over time – I talked about it in the\npast, that these shoulder injuries are not like \"Oh, my God! I feel it.\" And it's done. It's over time wearing and tearing, wearing\nand tearing. It's like a rope that gets frayed over and\nover, and over again. Ultimately it winds up giving out. So you may not have any pain right now, but\nyou will over time if you continue to do the exercise and you don’t mix it up with better\nalternatives. The second thing that could help you – while\nyou might be one of the ones that says \"Look, I don’t really have that much pain when\nI do it\", or \"I don't have any pain when I do this exercise\", the acromion type that\nyou have could matter. There's an acromion that sits up nice and\nhigh like this that leaves a lot of room under here like that. Then there's acromions that start to hook\ndown a little bit more, and a little bit lower, which leaves less room in here. But again, you could do something as simple\nas train your biceps the day before and then go do an upright row and be in much worse\nshape with the exercise because of the fact that the bicep tendon that had blood flow\nto the sheath around it, when you trained it, it's now still a little inflamed, creating\nless space inside this joint. So now with the internal rotation you go and\nstart creating problems. So it doesn't always have to be in the form\nof a shoulder injury. It could be in the form of a bicep tendon\ninjury because of the upright row. The bottom line is – okay, Raymond. Thank you. The bottom line is that this exercise belongs\nin the iron graveyard with a few extra shovels of dirt on top of it because it's just not\ngood. Again, I'm not trying to pick on it. I'm trying to inform you guys and who you\nwhy that's the case. If you're finding these videos helpful there\nare other exercises that belong here that I'll cover in more depth. Just let me know below if you want me to do\nthat for you and I will. In the meantime, if you're looking for a program\nthat puts the science back in strength objectively, allows you to train at a higher level by letting\nyour body function and move the way it should; head to ATHLEANX.com and get our ATHLEANX\ntraining program. In the meantime, I hope you've found this\nhelpful. Again, let me know what you want to see in\nother videos and I'll do my best to cover those topics, too. All right, guys. See you soon."
}