{
    "id": "frrk0VynJLg",
    "title": "Can&#39;t Get Big Quads? Just Do THIS!!",
    "description": "If you have skinny legs and can't seem to get them to grow, I have good news for you. In this video, I am going to give you a simple ...",
    "transcript": "JESSE: Okay, I know what you’re thinking. “Jesse, big legs; they don’t go together.” However, if you follow this one tip that Jeff’s\ngoing to give you in this video it’s going to make a difference. How do I know? Here’s me before. And here’s me after. This is not that long ago. If nothing else, if you think the tip sucks\nand you don’t like it, you’re getting a fantastic new intro from me. Your boy, Jesse. JEFF: What’s up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re going to talk about- JESSE: Whoa, whoa, whoa. No intro? JEFF: Okay. What’s up, guys? Jeff Cavaliere, ATHLEANX.com. Jesse- JESSE: No. We’re going to do – wait, that’s it? JEFF: That’s it. No intro. We don’t need the intro. JESSE: No. THEY want the intro. Run it. JEFF: Thanks, guys. Thanks a lot. Appreciate that. All right, can we talk about- JESSE: How about that? That was good, right? JEFF: Yeah, that was good. All right, let’s talk about you. JESSE: Yes, me. JEFF: Let’s talk about your legs. JESSE: Okay. JEFF: Today’s video is about building bigger\nlegs. We talk about it in “Just Do THIS”. It really is about just doing something and\nit doesn’t have to be complex. Jesse is somebody that had some pretty thin\nlegs. You can see the early version of Jesse here. JESSE: Yeah. JEFF: You guys watched. You were watching as he was in this position,\nbut that’s the part that makes him all so relatable because a lot of people have legs\nlike this and now we see Jesse and some of the leg gains he’s made. Which are definitely impressive. It’s something I can relate to because I\ngrew up, at Jesse’s age, also having a bit of struggle in putting on some size in my\nlegs. But because of understanding the anatomy of\nthe legs and understanding the quads and their relationship to the adductors, and how all\nthis plays together; I learned, as a physical therapist, where our quads tend to look for\nhelp. Why they tend to bail out and look for other\nmuscles to do their job. As soon as we understand that we can intervene,\nmake the quads do the work, and get so much more out of it. JESSE: Right. JEFF: So, what we did with Jesse is something\nreally simple. The first thing is, we loaded the quads. What I mean by that is you peek at Jesse here\nsquatting. There’s a big reason why people talk about\nsquatting to parallel. When you get to a depth of parallel it’s\nthe only time that you’re placing the quads under the maximum amount of tension. We know that only when the downward force\nof gravity is perpendicular to the femur, is when that quad is maximumly challenged. If we do any variation of shortchanging the\nparallel squat – if we’re two, three, eight inches above- JESSE: Quarter squats! JEFF: Quarter squats! Parallel, we’re not challenging the quads. In order to challenge the quads and make them\ngrow you need to learn how to get down to parallel. We do that. Of course, we have some things we can incorporate\nto make us do that better. The next thing comes in play. Knee travel. JESSE: Yep. JEFF: A lot of people talk about, when you\ndo your squats, you have to have a pretty wide stance, and your knees need to stay in\nline with your feet. Meaning, the knee travel is not necessarily\nstraight ahead in the sagittal plane, but it’s a little more of an angle. I say, more often, the frontal plane. What that does is incorporates the adductors\nto a much greater degree than you want if you’re someone struggling with quad development. Why? If you look at this from the top angle here,\nyou can see as the legs travel outward, yes, we’re getting a good degree of knee bend,\nbut we’re often going to be limited to the depth that we can get to because the stretch\non the adductors is too great. Try it yourself. Take a wide stance, try to really start letting\nyour legs go out as you go down, and you’re likely going to feel a really intense stretch\nright up in the groin, under the pelvis, because those adductors are being pulled on to their\ngreatest degree. JESSE: I’ll save you the trouble. Don’t do it. It sucks. JEFF: What happens is, when a muscle is stretched\nlike that it automatically wants to unload that stretch. Meaning, it wants to go back to its shorter\nposition. To do that you really get this stretch-reflex\ncontraction. Unfortunately, out of the adductors as opposed\nto the quads. So, the best way to do this is to fix your\nstance. Narrow it up. Take a narrower stance here. You can still have your knees travel outward\nover your toes. Your toes can still be pointed slightly outward,\nbut you want to have that narrower stance so you’re relieving the adductors of that\noverstretch and allowing the quads to do the work. When you get to the bottom of this position\nhere, the bottom of a squat, you can see the quads are much more active. They’re much more the initiators of the\nupward ascent of the squat. That’s what you want. When you can place all that tension on the\nquads, you’re going to get much more development on the quads. Now, what’s the last thing we can do? What do we break out? JESSE: We break out a box. JEFF: Back to the box. Jesse is a little bit – his parallel point. The point that was the sweet spot for him\nneeded to be just a touch higher. Some people are always at a loss. “What box should I use if it’s too high?” Just take a plate, like he’s doing here,\nand put it down to match the depth that you need to get to. By putting that there you’ve done two things. Number one: you’ve allowed yourself a target\nand the target is behind you. Meaning, you’re going to have to sit down. JESSE: Yep. JEFF: You’re going to have to create some\nmore depth to get down there. Second, when you’re there it gives you that\nmomentary biofeedback to know that you’ve gotten down to that endpoint. You’re at parallel. The last thing, we don’t just have you come\nup. If you want to place more tension on the quads,\nyou stay there. JESSE: You pause. JEFF: You pause. You hang out for a little bit. JESSE: My favorite thing. Pause squats. JEFF: But you kiss the box. You don’t go down there and sit your ass\ndown and hang out down there. You kiss it. You go down and just barely graze it. You pause there for two or three seconds. If you are ever trying to get your quads to\ngrow and they couldn’t do it, this is going to do it every, single time. JESSE: Yeah. JEFF: The slightly narrower stance, pausing\nand hanging out down there at maximum tension, and applying maximum tension because you’re\ngetting to that proper depth to do it; this is the magic formula. There’s nothing secretive about it, but\nit works. I guarantee you. It works every, single time. Again, check out the before and after here. It’s working for Jesse and it’s something\nthat I promise will work for you as well. Hopefully you’ve found this video helpful. If you’re looking for more step by step\nadvice where I build in the nuances of how you perform the lifts, not just what you do,\nbut it’s how you do it because that matters so much; we’ve built them into all our programs\nover at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. For all you encouragers of those stupid ass\nintros- JESSE: They’re not stupid! They’re wonderful! Everyone loves them. JEFF: I don’t know what to say for you guys. Other than ‘subscribe’. JESSE: Thank you. JEFF: Turn on your notifications. And I guess you have your ability to express\nyour free will and demand more Jesse intros, at the very least. But only if you subscribe and turn on your\nnotifications. JESSE: That’s fair. JEFF: All right, guys. I’ll see you guys in a few days. See ya."
}