{
    "id": "frXIADJcYQA",
    "title": "Tricep Workout Finisher!! (WORKS EVERY TIME)",
    "description": "Build incredible triceps and biceps in just 6 weeks here http://athleanx.com/x/the-ultimate-arms-program If you want to build bigger ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.COM. If you're doing a workout with the intent\nto try to build muscle, then you better be prepared to bring a stimulus that your muscles\nare not familiar with. And I'm going to show you today when it comes\nto triceps, how you can really, really top off a really intense workout by adding a finisher\nto the workout. We covered a few weeks back, a shoulder workout\nfinisher that you were to perform at the end of your shoulder workout to ensure that you got every ounce of effort\nyou had in your muscles that day. Well, today the triceps are on tap. Your goal here is to perform the finishing\nmove that I am showing you here exactly as performed to try to push yourself through\nfailure. Yeah, you may think you're close to being\ndone with your workout, but when you add a finisher to the end, you can ensure yourself\nthat you've got nothing left. So, what do I do? First I pick up a pair of dumbbells that will\nbe challenging for me in the weakest part of this combo. And that's going to start right off with a\nTricep Kick Back. You guys know how much I like this exercise. You position yourself inverted on an Incline\nBench. For me, I grab 30 pounds. Now, when you see, these dumbbells will likely\nbecome, or feel like they might be a little bit easy\nfor the subsequent exercises, but not after you've already reached failure on the initial\nexercises in the combo. So, we choose the weakest part for that very\nreason. I perform this set to failure. Here I get about 12 reps. And at this point, I then go right into an\nIncline Dumbbell Tricep Extension. So now we're going to get the long head of\nthe triceps. Get those elbows up over my body, or over\nmy head and behind my body, and here I try to rep out again to failure, 30 pounds on\nthis exercise generally wouldn't be that much. But that's the catch. Generally wouldn't be that much. Today, it's already starting to hurt me and\nI've got to fight my way through as many reps as I can until I reach failure. And as soon as I do that, my work is not done. I'm actually half done. I now then take my elbows, I tuck them into\nmy body, and we're going to do sort of a French Press variation here where I'm going to allow the ends of the dumbbells\nto touch my shoulders, my elbows to be nice and tight to my body, and I press straight\nup overhead. We're doing basically a closed grip bench\nvariation where the triceps are doing 99 percent of the work here but we are getting some of\nthe help from the accessory muscles here in our chest and anterior shoulders. So, we're able to push ourselves even a little\nbit more through failure while our triceps are still getting torched along the way. And then finally, I drop these dumbbells. I'm exhausted as I already am, but I'm still\nnot done. I've got to go rep out with my bodyweight\nexercise. I hit the ground, and I do our Cobra Push\nUps. This is by far my favorite way to hit my triceps\npredominantly when I'm doing Push Ups. And because we're doing a Push Up, and it's\na bodyweight move, I'm able to crank out even a few more reps maybe when I thought that\nI had nothing left in the tank. And that's why it's a perfect way to finish\nour finisher. So, there you go guys. Our finisher is the way to end our perfect\nworkout. Now, if you don't know what your perfect workout\nshould be for triceps, guys, I invite you to head to ATHLEANX.COM\nand get our ultimate arms program. We cover the best ways for you to build the\nbiggest arms possible in just 6 weeks. That program is available at ATHLEANX.COM. In the meantime, you've got to make sure that\nwhen you're using the finisher, the whole purpose of it is to push yourself like never\nbefore. A finisher is to ensure that you eek out every\nsingle ounce of energy that you had when you hit the gym because otherwise, why did you\ngo in the first place? If you found this video helpful, make sure\nyou leave your comments and thumb's up below. Try the finisher out. I guarantee you that you will be surprised\neven by that second and third exercise those light weights are going to feel real damn\nheavy, real fast. Alright guys, we'll be back here in a couple\ndays. Tell me what you want to see in this channel. Make sure you leave your comments below. And I will make sure I listen and bring those\nvideos to you. See you back here soon."
}