{
    "id": "G2997nwEZ1o",
    "title": "Add 40 LBS to Your Bench Press (NEXT WORKOUT!)",
    "description": "If you want to increase your bench press by as much as 40 pounds the very next time you perform the exercise, then you will want ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Little bit of a lost voice, here. Fresh off our ATHLEANX Live conference. Once again, we have KC Mitchell, the one-legged\nmonster, in town. We always have to get together, though. KC: Yeah. JEFF: Off the scene and, of course, bring\nanother video back. Last time we got together a lot of guys found\nsome useful information. KC: Yeah. We did 'how to help three big lifts'. Bench, squat, and deadlift. We did that. JEFF: And accessories. KC: Yeah, and accessories and they really\nseemed to enjoy that. JEFF: So, what I want to do this time is go\nmore on the tip side. KC: Yeah. JEFF: Obviously, you're benching has been\nsuccessful for you, but what is it that helps you most? I want to dig down into the biggest tips,\nwhen it comes to your bench, that you've had, and I want to share that with them. So, we'll break them down one by one. KC: Okay. JEFF: All right, so we're going to kick it\noff with our first tip. Our first key for you is, what? KC: Leg drive. JEFF: Leg drive. Leg drive is definitely one of those things\nI think is misunderstood. People don’t realize the importance of their\nlegs when it comes to the bench-press. KC: The legs are very, very powerful and they\ncreate a lot of energy. It's like the very point of where the energy\nis going to generate. JEFF: Right. KC: To get this whole bar moving. So, leg drive is very important. You could literally be missing out on 20lb,\n30lb, 40lb jumps in weigh in your max bench-press by adding in- JEFF: So, show them, because there are a lot\nof key points when it comes to the leg drive. KC: Yeah. JEFF: Especially even in direction, right? KC: Right. JEFF: People screw that up all the time. KC: So, I would get myself up on the bench\na little bit, scooted out a little bit. Then I sit back on the bar and, me, I look\nto get right under the bar first to make sure the bar is lined up and right down the center\nwhere I'm going to be. It's not going to be off a little bit. I try to get my hands placed where I feel\ncomfortable. Everybody is going to be a little different,\ndepending on your arm length. I like to be about right here. Just a little shoulder width apart. Then once I get to here, I pull myself under\nand I dig my legs underneath the bench. The key here is, you're not pushing straight\ndown. You're pushing – right. I'm pushing – my whole goal is to push this\nway. JEFF: That way. That's going to tie into our bar path. KC: Into our bar path, absolutely. So, once you're set in here, legs are really,\nreally tight. You should feel a lot of tension in your legs. JEFF: Through your quads. KC: Through your quads. You should also be squeezing your glutes. A lot of people get so hung up on the legs\nand the quads and they're not squeezing their glutes. Glutes are going to allow you to stay down\non the bench. So, when you go to do your leg drive you're\nnot popping up. So, legs dug in deep, squeezing really hard,\nhold. Two, three. Bar's out, comes down, and then when you get\nto this point, this is when this motion – you can see my legs right now, they're starting\nto – the bar wants to go this way. So then – we'll do one quick one. One more. JEFF: Come on. KC: One, two, three. One more time. Ready? One, two, three. Then the legs are really pushing a lot of\nthat weight back toward the bar. A lot of people get into the habit of – which\nwe'll talk about – bar path going up this way, but if you get that leg drive in, it's\nreally going to help that bar path get a lot better. JEFF: Right. KC: Which is the next, main tip. JEFF: Right. The bar path, because of how key that is to\nexecute that lift. We're even going to talk about why, from a\nphysics standpoint, you're creating less work for your body by being able to utilize a better\nbar path. KC: Mm-hmm. JEFF: All right, so let's talk about that\naspect. So, the second thing is, the top tip, is bar\npath, right? KC: Right. JEFF: It seems simple, but people literally\nget this wrong all the time. KC: That's one of the bigger things that a\nlot of people get wrong. Even as elite power lifters, we miss groove,\nand our bar path's wrong, bar comes this way, you're more likely going to miss a good lift. JEFF: Yeah. Like you said, a mountain. If you trying to climb a mountain that was\nstraight up, or if it had some angle to it, it's going to be easier to go up that mountain. KC: Right. JEFF: And when it comes to strength, I talk\nabout it all the time. Strength is about efficiency. It's not about being inefficient. You're going to be more efficient to be able\nto go in this angled path because the resistance factor is different than it is to have to\ngo straight up against gravity. KC: Absolutely. JEFF: So, you're making your job easier and\nyou're able to be more explosive and powerful by having the right bar path. Which is going to be at the angle. But I want Casey to show you what it is and\nwhy he thinks the way he does, when he does it. KC: Right. JEFF: What are some of the tips that you use? KC: I'll do it – I'll show you a bad bar\npath and then I'll show you the actual bar path. JEFF: Right, okay. KC: And more than likely, you're going to\nbe able to see the difference in the speed. Just because of how much easy it is for me\nto generate that power from the leg drive that we talked about, and then to get that\ngood bar path going out of – basically, toward your spotter is where you want to go. JEFF: So, you're going 'bad' first? KC: Yeah, we'll go bad. I'll show you guys a bad one first. One, two, three. So, this is what most people do. They come down and they're even here, low\non their chests. JEFF: Right above the nipple line. KC: Right. Then when they go to press- JEFF: Right. KC: That's the basic mistake right there. JEFF: It's also worse on your shoulders. KC: It's worse on your shoulders. Even your chest because your extending your\nchest the opposite way that it's supposed to be going down here. JEFF: More importantly, we're completely nullifying\nwhat we talked about when it comes to leg drive. KC: Absolutely. JEFF: The leg drive was, remember, coming\nin this direction. KC: Right. JEFF: You're pushing in this direction to\nsupport that push. If you're going straight up, you're fighting\nthe purpose and intent of leg drive. KC: Absolutely. So, now I'll show you the right way. You can see here, it's a little bit higher\non my chest and it goes back. So, I'll do it really fast for you. That's a lot simpler to move a lot of weight. JEFF: So, another place people screw it up\nis their setup. Even a lot of newbies will get in there and\nthey don’t know how to set up. They set really close underneath here to lift\nit because they need that help and they're afraid to ask for a spotter. They're sitting there saying 205lb on the\nbench and they're afraid to ask for a spot because they feel self-conscious about it. But if you setup underneath the bar so you\ncan get leverage to lift it off, you're never going to be able to follow that bar. KC: Right. Not at all. So, with that it's – have some damn confidence\nin yourself and go ask somebody for a little help. You've got to think, the most elite powerlifters\nat competitions have somebody get the bar off to them so they can get that leg drive\nthat generates that great bar path, so they aren't under here. Not only that, if you get under and you try\nto lift that off yourself, the amount of damage it could do to your shoulder- JEFF: You're in such a vulnerable position. KC: Very vulnerable. So, it's really not worth it. So, if you're really – if you guys really\nwant to get stronger, and you're trying to go for some heavy sets, really want to get\nthat leg drive, really want to get that good bar path; grab somebody. And it doesn't matter what weight it is that\nyou're going to lift. To you, it's 135lbs and you want to ask a\nguy that looks like he probably does 400lbs. That's okay. At one point he was doing 135lbs, too. JEFF: Exactly. KC: And the goal, at the end of the day, is\nto get stronger, and to be efficient, and not get injured. If that's what it takes, that's what it takes. JEFF: So guys, if you're looking for programs\nwhere we put the science back in strength, they're all over at ATHLEANX.com. Our TOTAL BEAXT program has Casey in it, right? KC: Yeah. JEFF: Because you're a beast. KC: I'm in it. JEFF: You're in it and you're showing us some\nof the same principles here. It's available at ATHLEANX.com. In the meantime, if you haven't already done\nso, make sure you subscribe and turn on your notifications, so you never miss a video when\nwe put one out. Make sure and leave a comment below so you\ncan let me know what else you want to see here – more stuff you want me and Casey\nto cover – and we'll do that for you guys. All right, see you soon."
}