{
    "id": "G_L4oai_ivY",
    "title": "Back Workout to Gain Muscle (SKINNY GUYS!)",
    "description": "If you have been looking for a full back workout to gain muscle and build a bigger wider back, especially if you are a skinny guy, ...",
    "transcript": "Go ahead, hot shot. Oh, I'm back, baby. Run \nit. Jesse. Ooh. Jesse. Are you serious? Oh,   I'm dead serious. That's the best one \nyet. Look, guys, it's Jeff Cavaliere,   Athleanx.com. And he is back. Anybody that was \nworried out there that he was actually gone, no,   Jesse's still here. And by the way, who filmed \nthat last video? My replacement. Oh my God. You   got to keep the head in the frame. Oh, yeah, I \nknow, you missed me. I'm actually glad Jesse's   back. But it's actually more than just Jesse \nbeing back. Today we're talking about Jesse's   back. Right, we're talking about from a hard \ngainer perspective, a skinny guy, what can you do   to build your back? Because I think what happens a \nlot of times with skinnier guys is that they don't   oftentimes focus on building it back. The first \nthing they do is they try to focus on what they   see in the mirror-- bigger chest, bigger biceps, \nwhatever it is, and they're not really focusing on   building a bigger back. But we know how important \na bigger back is, especially when we talk about   what Jesse was dealing with. And that was Postural \nissues. Bad postural issues, right? Really like   that. And a lot of times, people will develop \nthat if you're a skinnier guy because if you're   self-conscious at all, and you sort of adopt this \nposture, right? A lot of insecurities. Like Jesse,   you could see him right here, in the three sets \nof 12 video. Staring right into your soul. And   staring into the soul. Now he's overconfident, \nwhich is why he got thrown into the quantum realm   in the first place. No, for real, he's actually \nbuilt confidence as he's built the back. Right,   so what I want to do is go through what you do to \nbuild your back. Right. Right, specifically what   are you doing? So, in a particular workout, either \nwhether you're doing a bro split, whether you're   doing a push-pull leg split, which is really more \noften what you're doing, what's your mindset when   you do your back training? So, my mindset is that \nI always have a stable exercise, and that's the   dead lift. I always dead lift no matter what \nkind of back day I'm doing whether it's a pull   or whether it is a straight back or whatever. I \nfind that it's great for increasing strength and   it's also, again, allowed me to work on my posture \nand it strengthens my lower back, which is really   important because, as you know. Yeah, he had a \nweak low back, which I think was actually some   of the root of his problems, starting down low, \ncarrying right up the kinetic chain. Yeah. So,   all right, so the dead lift staple of the workout. \nNext thing you got a choice, right? Yes, there's   always a choice on this one. I either like to \ndo a bar bell row or a seated cable row. So for   a horizontal pulling movement, working more on \nthat depth, right? The front to back thickness   here. Yes. Is more of that row. So now the seated \nrow. Seated row I love because it allowed me to   get into that stretch because as we have the cable \ndown lower it allows me to get into that stretch   and really feel it in my lats. But when I pull \nback, not only do I feel it in my upper back,   but I feel it in my rear delts as well, which I \nthink is really important because that's a muscle   that's often overlooked. Yeah, so you could see \nwith that low cable set up like Jesse referred to,   it brings your arms out in front of your body, \nseparating the attachments of the lat so you get   a better stretch, which allows you to get a more \npowerful contraction on every single rep, but it's   just a good way to do the seated row. Yeah. Okay, \nas opposed to just doing it at the same level   of your hands. Right, get them out a little bit \nlower than you. If you don't do the seated row,   what do you do instead? I do the bar bell row. \nOkay. So I like the bar bell row. Obviously,   it's another staple kind of classic exercise \nfor your back. But I like that it reinforces   the strength of the lower back because you have \nto sit back. And with a weak low back you're not   going to be able to handle that position really \nwell while you're pulling the weight up. So I   talked about when it comes to the bar bell row, \nhow important it is to actually as an exercise to   learn the hinge. Yeah. Right, because if you \nhinge properly, then you're going to be able   to carry that bar bell in the right position to \nbring it up towards your chest without being too   far in front of you. Because when the bar bell \ngets out in front of you, that's when it starts   to put extra strain on your low back. But if you \ncan learn how to hinge and sit back into that row,   that's when you actually start to see the proper \nmechanics pay off in terms of being able to do the   exercise without any of the negative side effects. \nCorrect. And again, I like to alternate when I'm   doing these. I don't do them on the same day. I \nlike to alternate. Right, it's one or the other   there. Yeah, it's one or the other, and then I go \nback and forth. Thirdly now, you went horizontal,   now you're working vertical. So you have a choice \nthere too. Another stable exercise is the pull-up,   obviously. It's always great to be pulling your \nown body weight up. But, the other choice is a   lat pull down, but not just any lat pull down, \nit's the rocking lat pull down that you taught   me a long time ago you showed on this channel. \nWhere I thought when I was doing lat pull downs   originally, I felt like I was pulling a lot with \nmy forearms, a lot with my biceps. Allowing my   lats to really take over on that movement I think \nhas made a whole bunch of difference in the size   of my lats and the width of them as well as just \ngetting that mind-muscle connection. You have   to actually use the muscle it is that you're \ntrying to grow. And I say that a lot of times,   if you focus on initiating the move with the \nmuscle you're trying to grow, you'll actually be   surprised at how much you can make it grow. And \nwith Jesse, again, he mentions sort of pulling   more from here, pulling with his forearms, pulling \nwith his biceps, not necessarily pulling with his   back. Then when you do that rotational pull down \nhere, down in one side, you're actually able to   get an elbow not just inducted, which is one of \nthe main functions of the lats, but you can get   it back behind your body into more extension, \nwhich is going to allow a lot of the people out   there that can't feel this mind-muscle connection \nto feel a lot better. All right, so that covers   the vertical, the horizontal, your main staple \nexercise. This is the part where I think things   start to fall off the rails for a lot of people \nand instead they don't focus on the correctives.   Right. And in Jesse's case, when it was a postural \nimbalance that was sort of setting off the whole   cascade of negative side effects about with all of \nhis lifting, that was a staple exercise too. And   those actually all are done in every time that \nyou're training. Every single time I train. So the   first one up is the carry. Carry, I like to grab \na pair of heavy dumb bells, sometimes a trap bar,   sometimes kettle bells. And, honestly, even plates \nwhen I'm moving them to and from the bar. I just   try to get as many carries in and I take a couple \nlaps around the gym because I know it's good for   my grip, but it's also even better for my upper \ntraps. And something you've been actually doing   all the time now almost every day. Yes. And \nhonestly, I mean, definitely starting to pay off   more in the overall thickness of your upper torso \nhere. So carries, that's upper traps. Yup. Lower   traps. Lower traps is always that plate raise. \nI like getting the overhead and then tilting   it forward. It's almost like peeking through the \nwindow. I think that's been great for lighting up   my low traps and just made me a little bit more \nstrong in the rest of my lifts. So lower traps,   for those of you who haven't been doing enough \nlower trap work, crucial for establishing good   posture and good biomechanics of the shoulder \nwhenever your arm goes up overhead. So the trap   raised does that and you can see the lower traps. \nRemember, they're a kite-shaped muscle, guys. So   we're not just working on the top part here, but \nyou got to work on the lower part here, too. And   again, the benefits that they provide in terms \nof the structural integrity and stability of your   shoulder are so important that you can't overlook \nthem. So the trap raise is what Jesse uses. Then   you have one last one here to focus on your low \nback, because again, some of your root issues   were at low back weakness. Yeah, this is the hyper \nrow. This is great for my low back. Has made it   a lot stronger. And as you've told me before, a \nstrong low back equals a strong upper back. Well,   so the point here and why I think this is a good \nexercise, the low back doesn't just feed up to   the thoracic spine, and posture, and everything \nelse. But the back sets the stage. You even hear   guys like Greg Jennings say, I put the team on \nmy back. When you got a strong back, everything   else sort of starts to fall in line. Yeah. And I \nthink that if a hard gainer, someone who's skinny,   maybe even dealing with some confidence issues, \ngoes and they start to train their back just   because they can't see it directly in the mirror \nand start to train their back, a whole cascade of   good things start to happen. It's true. Right. And \nif you're ever worried about seeing what your back   looks like, just stick your phone out, hold it out \nin front of the mirror, you'll be able to see it.   Jesse's so experienced in shooting selfies in the \nmirror. I'm so vain these days. So arrogant. So   arrogant. I'm looking for Josh Brolin to come \nback again and snap his ass right out of here   again. He's already annoying me. All right, look, \nI'm glad you're back. Thank you. And I'm glad that   this video actually looks like it's filmed with \nus in it. Yes. So, guys, if you're looking for   programs that will help you not just build the \nconfidence, but build the body most importantly,   you could head over to Athleanx.com, realize that \nyou're going to do it the right way. You're going   to build not just your body but you're going \nto learn how to do it with our corrective   exercises worked in to make sure that nothing gets \noverlooked. They're all available at Athleanx.com.   In the meantime, if you found the video \nhelpful, if you're glad he's back, leave your   comments and thumbs up. If you liked his intro. \nOh, if you loved the intro Leave your comments   and thumbs up below. In the meantime, if you \nhaven't already clicked subscribe and turn on your   notifications so you never miss a new video when \nwe put one out. All right, guys, see you soon."
}