{
    "id": "gdDtoy0k8As",
    "title": "How to Burn Fat for 23 HRS Straight! (NO BULL)",
    "description": "If you ever wondered how to burn fat for 23 hours straight or even just how to see fast fat loss, then you are going to want to watch ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. \nWhat I hold in my hands here today is the secret   for you to burn fat for 23 hours straight every \nsingle day that you apply this. The fact is, guys,   it's a lot easier than you may have thought \nso. The point, however, is that you have to   do exactly what I tell you, that's our deal. So, \nwhat I want you to do is before I reveal this,   I want you to take out a pen and paper and copy \ndown exactly what I tell you to do. It starts   with a quick workout, just five exercises. \nThe first thing up is this one right here, three   sets of 10 of Table Push Aways. Now, guys, this \nis an incredibly effective move for your triceps.   As a matter of fact, it works incredibly well as \na superset with something called jaw clenching.   If you just keep your mouth closed around food, it \nwill work really, really well. The next exercise   is actually just eight repetitions, but still \nthree sets is called the Refrigerator Row.   And once again, here, this works \nincredibly well. Now is based on   the weight of your refrigerator door, so \nit depends on how strong you are and how   many of these you're going to be able to do. But \ngenerally, three sets of eight is the best. \n  The next exercise is actually programmed to be \nexplosive. If you find yourself around soda,   we call these Soda Spit Outs. As you \ncan see here, just one done explosively.   The next exercise is something we call the \nPantry Put Away. Now, if you already have   learned to put the foods, you shouldn't have \nall the way on the top shelf, do you actually   experience the benefits of this exercise? But \nfor those that have it, it's a great total   body move. It works your core, your balance, your \nshoulders, and don't forget your calves, too. \n  And then finally, guys, we have this one, no \ngood workout should end without this exercise,   it's called the Spoon Drop. And of \ncourse, the only way to really do this one   is one set to failure. And with that, if you \njust follow that for 23 hours straight, guys,   you will have success if you believe in that. \nSee, guys, I've said it before, I'll say it again.   If you want to actually lose weight, if you want \nto burn fat, you're going to have to find a way   to be hypercaloric. That means nutrition. \nIt has nothing to do with your workout. \n  And oftentimes people will focus on their ability \nto get to the gym and be proud of themselves,   as you should be, for commitment you've made to \nget to the gym and do your workout. But one hour   is not enough because when you realize how much \nis left in the rest of the day to screw this up,   that's where the problem comes. Now, if you're a \nvisual learner, let me show to you in a different   way. These bars here on the screen, these blue \nbars are 24 of them, those represent the number of   hours in a day. This little white bar right here, \nthat's your workout. Congratulations. Like I said,   it's a big achievement to be able to \ndo that and be consistent with it.\n  But look at what's left here -- a fuck ton of blue \nbars. This is the problem. You could do everything   right in that white bar and screw everything up \nfor the rest of the day. You're not going to be   where you want to be. Now, I realize that some \nof that's going to be occupied by sleep. So,   let's say eight hours of sleep. There are your \neight bars and there's a white bar still for   your workout. What's left now? A little bit less \nthan a fuck ton of blue bars, but it's still a lot   of blue bars. So, what I'm going to do is going to \nmake sure that you do nail this every single time,   because in reality, guys, I'm going to give \nyou the truth here. And we call them realities.   There's three realities that you get these right. \nYou're going to make sure that you set off on a   path that you're never going to turn back from \nand you're going be able to do this with ease. \n  The first reality is that not all \nhealthy foods are low calorie foods. Now,   I know this comes in sometimes is a \nshock because people will say, listen,   I have changed the way I'm eating. I have salad \nevery day, I have olive oil, I have avocados,   I have nuts, I have all-natural peanut butter, \nI have granola. Yeah, great. You've chosen a   whole bunch of calorie dense foods. Though they're \nhealthy, maybe not granola, but they're healthy.   The fact is, you're not making any wiser choices. \nYour ability to become hypercaloric, to actually   lose fat or lose weight is pretty much not \ngoing to happen there because you haven't chosen   properly. You need to choose beyond just good \nfoods to choose foods that are smarter in terms   of their calorie density. Choose foods that are \nless calorie dense to be able to make these actual   leaps in terms of cutting your calories down. \nBut it doesn't end there because we could talk   about the opposite to that. Not all low-calorie \nfoods are healthy. However, don't use that one   on me. Don't use that on me because I have \na real bugaboo about this. While I agree   that foods that are laden with sugar substitutes \nor artificial flavorings and things like that are   not necessarily long-term healthy food options, \nthere are a very important bridge for people that   are making that transition from eating totally \nunhealthy to eating healthier. Just think about   it yourself. If you wanted to go from that Whopper \nthat you have all the time down to chicken breast,   if you tried to make that change like that, your \nchances of success are pretty much zero. \n  Why is that? Because it's too big of a leap. So, \nif you wanted to make that sort of midway jump,   you went down to a turkey burger, it's a step in \nthe right direction. Maybe that turkey burgers got   all. Is the stuff synthetically injected into \nit, but again, we're talking short term use,   short term use, so that you can use that time \nto make the change, to start to see the results   that motivate you to continue down that path, to \neventually get to the chicken breast. But if you   try to go to the chicken breast too soon \nand you fall off the wagon because you   hate the way it tastes and it's too \nbig of a departure from your Whopper,   then you're setting yourself up for failure. \nAnd you can take it a step further, too, because   you can take the Coca-Cola and go from Coke to \nDiet Coke. And a lot of people I will never have   a Diet Coke because of the artificial sweeteners \nin it. Again, guess what? Your transition is going   to be ultimately towards water, but you can't get \nthere from coke to water, but you can probably get   there from Coke to Diet Coke down to water. And \nI'll tell you one thing that you need to remember,   you know what's the only thing more \nunhealthy than the artificial sweeteners?   Its remaining overweight or even worse, obese. \nThat's the number one thing that's going to   damage you in the long run. \nSo, you've got to do something.   And it's a reality that you have to face. And if \nyou do it, I promise you there will be success   on the other side of it. Which puts you in a \nreality number three, and this is a good one,   because this is where we actually get to \nlevel the playing field for everybody and   make sure that this works for everybody, because \nI promise you, this will work every single time.   And that is not all 23 hours have \nto look the same from day to day,   and they certainly don't have to look the same \nfrom person to person. You're 23 hours and what   you do with them certainly does not have to look \nlike my 23 hours and what I do with mine. \n  Because I'll tell you this, my 23 hours, whether \nyou look at them on January 2nd, on February 20th   or on June 19th, are going to look the same every \nsingle time. But it comes down to goals. What are   your goals? Maybe you don't want to walk around \nat almost cadaver level body fat levels like me   year-round. That's what I do, this is what my \nchannel is, I'm Athlean-X, this is what I do.   But you don't have to do that because I'm telling \nyou right now, 10% body fat is going to make you   look so damn good. And depending upon where you \nare right now, how far away from that you can look   really, really good from what you look like right \nnow. And it doesn't require that you get this   right all the time. I always say you don't have \nto be perfect to be great. If anybody out there   follows the NBA, you know, Steph Curry is pretty \ndamn great. Well, Steph Curry is third all-time   and three point shot percentage, he shoots \n43%. That means he misses six out of every   10 shots he takes. He misses more than he makes, \nbut it doesn't prevent him from being great. \n  Well, guess what, if you apply this same thought \nprocess to how you eat, it can go a long, long way   to you being great. Because if you realize that \nyou're, let's say, eat four or five times a day,   that means there's 28 to 35 meals that you're \ngoing to have in a given week. You do not need   to go 35 for 35 or 28 for 28 to be great. Now \nyou can't go and bat 400 because that means you   can be messing up a lot more, when it comes to \nnutrition it's going to matter a lot more. But   you don't have to be perfect. You can mix in the \ncheat meal from time to time. As a matter of fact,   you can actually string them together four or \nfive and a week, go 30 for 35 and string them   together in a day and make it a cheat day. \nBut I'm going to give you a word of caution on   this, because I talked about this before. Your \nability to rebound from a cheat day and get back   on track and remain perfect for the rest of \nthe week, because that's what we have to do,   is actually sort of a long shot, especially if \nyou're struggling with your nutrition right now.   I don't advise people to use it as a cheat day. \nIf you want sprinkling a cheat meal here or there,   that's a better option. But the reality is that \nthe long-term success never did and never will   rely on you being perfect. And when you let go of \nthat, you realize that damn good doesn't require   perfection or even near perfection, then that's \nwhen it all starts to become a lot more exciting.   And that's what becomes a lot more doable because \nyou have an end goal. You know how to get there   and you actually start to work towards it. \nAnd the other reality is that I share with you,   yes, guys, your food choice matters and how \nyou get there. You've got to become a little   bit more educated about it because that holds \nthe key to your success. But with this video,   guys, I hope you have both the motivation \nand now a little bit of that knowledge to   make that next step, make that good next \nstep, that right next step to put you on   the path to getting where I know you're going \nto be. The 23 hours is what matters guys. \n  I congratulate you on the other hour, keep working \nat that, but work more diligently on getting the   other twenty three hours right and I promise \nyou, that's where the long term success will be.   If you're looking guys for programs, we map out \nall of it, the workouts and the other 23 hours,   what you're supposed to do and what you're \nsupposed to eat. I've got it all mapped out in all   of our programs it's over at Athleanx.com. \nIf you found the video helpful and hopefully   truthful, guys, make sure you leave your \ncomments and thumbs up below. Let me know   what you struggle with and maybe we can do \nfuture videos on those as well. And if you   haven't already done so guys, make sure you \nclick subscribe, turn on your notifications   so you never miss a new video when we put \none out. All right guys, see you soon.   "
}