{
    "id": "GGwCzBFsG3I",
    "title": "Triceps Exercise Myth Buster (GET BIGGER TRICEPS!)",
    "description": "Build huge ripped triceps with the Ultimate Arms program here http://athleanx.com/x/bigger-arms-in-6-weeks The best tricep ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're busting some tricep training myths. Or are we? You see, the tricep push is one of the most\npopular exercises you can do and a lot of people argue that they feel it differently\nwhether they do it with a palm down – this position – or a reverse grip, underhand,\npalm up position. They'll argue until the day's end and say\n\"No, I definitely feel a difference there.\" Now, if you rely on the anatomy alone you\nwould say that they're all full of it because, guys, you have to understand that the triceps\ndo not have an attachment that crosses the elbow to the radius. The radius is what the bicep connects to that\nhas an impact on supination. We know that if I just turn my hand here we\ncan see that my bicep contracts because we're just supinating. With no attachment there, the triceps don’t\nhave that same ability to do that. So theoretically, anatomically Wikipedia will\ntell the keyboard scientist \"There's no way in hell that changing your grip on the tricep\npush down has any impact at all on the different heads of your tricep that are working, or\nthat you're feeling.\" Guys, you've got to look a little bit beyond\nthat. See, here at ATHLEANX we do put the science\nback in strength, but we put real world science back in strength. If you look at what we're talking about, when\nwe do the exercise – whether it's palm down or pronating grip – we're not just doing\na palm down isolated pronation because pronation is not a wrist movement. It's an elbow movement and if you were to\nlook at isolated pronation it would look like this. Ignore the fact that the wrist is turning. That's just a result of the fact that we're\nactually doing a pronation here at the forearm. As we turn over it's isolated, but that's\nnot what happens on this exercise. That's what I'm talking about 'real world'. When we do a palm down grip, look what's happening\nto the shoulder. We get an internal rotation here at the shoulder. Keep that in mind. When we look at the underhand grip – or\nthe supinated grip – when the guy does the exercises you see them doing this all the\ntime; underhand grip. There's also a lot of external rotation at\nthe shoulder and it's the movement at the shoulder that's placing the heads of the tricep\nat a better mechanical advantage – a better line of pull – in order to exert a little\nbit more force. We've talked about this before in our bicep\ntraining video. How the short head and the long head, based\non the width of your grip could have an impact on which head you impact more. I'll link that video here if you haven't seen\nthat. If we wanted to try to have a better impact\nwith the internal rotation here at the shoulder, with the pronated grip coming along as an\nauxiliary motion here; we're going to get more of the lateral head of the tricep here. On the contrary, if we go to the underhand\ngrip with the external rotation of the shoulders that we normally get, you can see that the\nlong head of the tricep in the pec – the meatier area – is what is getting more of\nthe impact. Yeah, what you're feeling is there for a reason,\nbut it wasn't for the reason you though. Science would have said \"no\", but the real\nworld science would say \"yes\". As I said, guys, ATHLEANX and here at this\nchannel I'm trying to help you put the real world science to practice for yourself so\nyou can get way more out of your workouts, cut the time that you have to train down because\nyou're going to get more efficient training in the time that you have. If you're looking for a training program that\nputs the real world science back in what we do, head to ATHLEANX.com right now and get\nour ATHLEANX training system. In the meantime, if you've found this video\nhelpful, if it helps you to settle an argument you've been having with your gym buddies for\nyears now; make sure you forward it to them as well. If there's other things you want me to cover\nhere on this channel just make sure you leave them in the comments below, guys. I read them, I look through them, and I use\nthem to help me make the videos you guys want to see. All right, I'll be back here in just a couple\nof days."
}