{
    "id": "gozU3CUIizs",
    "title": "The PERFECT Biceps Workout (Sets and Reps Included)",
    "description": "The perfect biceps workout should consist of exercises that not only hit the long and short head but also the brachialis, a totally ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to put together what I would\ncall the perfect bicep workout. Continuing the series. We’re going to put heavy science into what\nwe do, as we always do. As a matter of fact, we’re going to break\nout, as always, the muscle markers to show you why this becomes a perfect bicep workout. In order to be called that, I feel there are\nsix requirements that we have to make sure we nail to be sure we’re covering all aspects\nof bicep training. So, let’s get through those one by one. We’re going to use these muscle markers\nto help us do that. Right off the bat, we understand that the\nbicep is a two-headed muscle. That means we a shorter head here and a longhead,\nwhich is the inner bicep and the outer bicep. There’s more to it than that. First of all, the muscle marker helps us determine\nwhere that is. You can see on bicep here, right about here,\nhow the bicep turns a corner and comes up here. If you follow that line you can see a little\nbit of that split. So, if I were to draw it out I would follow\nthis line here. So, what we have to do is understand that\nthere are ways to hit the shorthead of the bicep a bit more preferentially. That is because the attachment is different\nthan the longhead. The longhead has an attachment in the shoulder\nwhich enables us to do some different things to influence it over the shorthead. Not isolate, but influence. Again, I would trace that out by going down,\nright along here, and around, and up right here. Again, this has its attachment up in the shoulder. In general, we’ve said if we want to train\nthe longhead of the bicep we could do two things. Number one: we could take it into more of\na stretch by bringing our arm back behind our body in exercises like a drag curl, like\nyou see here. Or we could use rotation, a different function\nof the shoulder, to allow us to work either the short or longhead more. That is because when we have the outer portion\nof our bicep more visible to you in the mirror, you’ll be working more of the longhead of\nthe bicep. Whereas if we were doing exercises here, the\nno money curl, where you can see more of the inside of my biceps, we would be favoring\nthe shorthead. We’re going to do that, but we also have\nto talk about the functions of the bicep because in order to have a complete, perfect bicep\nworkout we have to acknowledge the different functions of the bicep. So, we know it’s an elbow flexor, right? That’s obvious. But we should also know that it’s a supinator. The reason why it supinates the forearm is\nbecause of its connection. All you have to do is take your finger and\nrun it right off the bottom of your bicep. You should feel a big, thick tendon right\nin here. If you follow that tendon – you can grab\nit – follow it all the way around, it inserts all the way down here into the radius. So, if I were to put a mark right there, we’ll\ncall that ‘number one’. The first thing is to supinate that forearm. The second thing, as we talked about, was\nto bend the elbow, or flex the elbow. So, we could put a number two right here. Then number three, we know is to get a full\ncontraction of the bicep, we know that because it crosses the shoulder, it can flex the shoulder. So, we would put a three up here. But we know if we want to get the most out\nof the biceps, we’re going to want to have certain exercises that are going to do all\nthis. They’re going to have supination, elbow\nflexion, and shoulder flexion. Not just that, potentially put all these in\nproper alignment with each other so the line of pull is optimal. If I take a forearm that’s pronated, we\nshould see that the one and two aren’t lined up. Whereas if I supinate it here, you can now\nsee that the one, the two, and three can potentially work together. We’re going to do that with certain exercises\nas well. The next thing we’re going to do is realize\nthat different exercises influence and have an effect on the strength curve of the biceps. Meaning, certain exercises can influence a\nstronger contraction. Either in the beginning, middle, or end of\nthe biceps’ range of motion. I’m going to use my forearm here as a whiteboard\n– first time ever – with the muscle markers. We know if we do a regular barbell curl, as\nyou see me doing here, that the strength curve is pretty easy in the beginning, it gets most\ndifficult in the middle, and it gets easiest at the end. Just like if I were to get into this position\nin a curl, that’s the most difficult part. But this is pretty simple. Well, we also know that we can take a band\n– a resistance band – and do curls. It wouldn’t be that difficult in the beginning,\nbut it would start to get hard, and be most difficult at the end because we know when\nthe bands are maximally stretched that will cause peak tension. But we also know that certain exercises – like\nyou see me doing here, the incline curl – would make the exercise most difficult in the early\nportion of the range of motion. So, it peaks high, and then it drops off. You can see what I’ve accomplished here\nwith the right selection of exercises that we’re going to put into the perfect workout. We’re going to have the representation of\nthe most tension being directed to the biceps in the beginning, middle, and the end, across\nthe entire workout. Which is something we want to strive for. What else do we have? Guys, we know that there’s another muscle\nhere that’s not the bicep, but it’s called the brachialis. You can see I’ve already outlined the bicep\nmuscle here. That leaves me with this area here. That’s not the bicep, guys. That’s actually the brachialis. I’ve talked about this in another video. The brachialis is very influential in terms\nof the width of your overall bicep when viewed from the front because it has a critical role\nit plays along with your biceps. We want to make sure we’re choosing exercises\nthat influence that while we can. We’re going to do that, too. Then we have to acknowledge two other things,\nguys. We’re going to incorporate these into the\nworkouts, too. We know that there is some limitation on which\nexercises we can do with the biceps because we’re talking about a hinge joint. While it does cross the shoulder and the longhead,\nthe hinge joint is going to ultimately make everything we do look like some variation\nof a curl. No matter what we do. So, you really have to rely on intensity techniques\nmore than any other muscle group to heighten the overall intensity and effect of the workout. We’re going to do that, and I’ll show\nyou many of them that you can incorporate right away into those. Finally, you never forget the big exercises. Just like we did when we did the chest workout. We still did the bench-press, we still did\nthe dips, but we have to accept that they have limitations. If you can take those limitations and plug\nthem in with other exercises within the workout, now you have the perfect workout. With that said, guys, it’s time we actually\nput this all together and look at what the perfect bicep looks like rep by rep, exercise\nby exercise. You ready? So, we start the perfect bicep workout off\nwith the big exercise, like I said. This is a different variation though. It’s a cheat curl, and it’s not just a\ncheat curl. It goes into a drop set for a barbell drag\ncurl. Let me explain. When we start with a cheat curl we’re giving\nourselves an opportunity to create great overload. That’s why these big exercises work so well. Not just overload, but a great eccentric overload\nbecause we’re cheating a bit through the concentric. When we do that, we’ve also setup a bit\nof a mechanical drop set. So, it’s not just a regular drop set, but\nwe know that we can take the same weight we’ve just used, and by shortening that moment arm\nby taking our elbows from this position out in front of our body, back here into a drag\ncurl we’re still able to keep the reps coming. By doing that, remember, the position of the\nelbow is back behind the body and we’re achieving another one of our goals. That is to now hit the longhead a bit more\npreferentially. So, in that first combo we take the first\nexercise to failure, immediately go into the second portion of it – the drag curl – and\ntake that to failure as well. Rest and then come back and try to do three\ntotal sets. We move onto the next combo here and it’s\nanother one of those heavy exercises that gives us the option to overload the biceps. Probably my favorite of all time. I’ve talked about it before. It’s the weighted chin-up. Again, it’s not just doing that. It’s doing something else that’s very\nimportant. We’ve already talked about how it’s hitting\nall three functions of the bicep. We know that in order to grab the bar and\npull we’re going to be flexing the elbow. We also know that in order to get into this\nchin-up position we have to have a supinated forearm. So, we’re getting there and having that\naction of the bicep as well. We also get the action at the shoulder. The one that helps us get the peak contraction\nof the biceps because we have our arm out in front of our body to grab the bar. So, we’re hitting all three functions. That’s good. What we can do is load it up here – I’ve\ngot 90lbs, I’m doing heavy, maybe four, or five, or six reps. I take it to failure and I immediately strip\nthe weight off and go into a drop set. Now we jump back up. We talked about intensity techniques. We could do that here as well. This is the peak contraction chin-up. What we’re doing here is using this as a\nburnout to the previous set, where we’re only going to focus on repping out in that\nfinal, contracted state of the biceps. We know that we already have all three components\nin place. So, let’s linger there and do as many as\nwe can to failure. Again, an intensity technique that takes the\nnormal training to another level because we realize that we’re limited by options for\nthe bicep training. While we’re talking about limitations, remember\nwhen I told you that the benefits of those big exercises like the barbell curl, and the\nweighted chin-up can’t be ignored, and we have to include them? Well, we also have to be willing to accept\nthat there are some limitations. To me, that’s the fact that in both exercises\nthere’s no active supination being resisted. Meaning, in both exercises I’m isometrically\ngrabbing in a supinated position, but I’m not going through the act of supination against\nresistance. Which means, we have to address that. We can do that with the exercise I’m going\nto show you here, called the banded dumbbell curl. What’s even better is, I don’t have to\nstop there. We can take advantage of this right here. Those strength curves. Remember when I drew on my forearm like a\nwhiteboard? We can do that again. We can take the dumbbell curl that peaks and\nthen dives off, and we can add a band to it that picks up right where it dies off and\nit continues. We can have the benefit of having an exercise\nthat’s more difficult, place some more tension on the biceps throughout the range of motion. So, here’s what we do: we grab a band, we\ngrab the dumbbells, and we curl them together. I’ve demonstrated this for you here before. It’s an amazing exercise. If you haven’t tried it, you’re going\nto want to do it. If you do this perfect workout you’re going\nto be doing it. You’re going to be doing it three sets to\nfailure. Again, I don’t know how much that is, but\nyou’re not going to want to go and grab lightweights here. You’re going to want to grab something that\nwill make you fail in the 10 to 12 rep range, and back off a little bit from there, realizing\nthat now adding the band to this will make this exercise more difficult. Of course, we’re wouldn’t want to leave\none-third of that range of motion unaddressed. We can choose an exercise that is going to\nimpact and overload that front side. That beginning portion of the range of motion,\nto compliment this entire sequence. We can do that with the incline dumbbell curl. One thing I want you to notice here is it’s\nnot just serving one purpose. Now, because of the position of the arm back\nbehind the body, we’ve just placed a little more stress on the longhead of the bicep because\nit’s on more stretch. Now, we can take that even further with another\nintensity technique, like I’ve mentioned all along here. That is actively contracting the triceps because\nwe know when we do that we can antagonistically shut off, or at least allow for a greater\nstretch of the biceps. Therefore, a stronger contraction coming out\nof the bottom of the dumbbell curl. So, you do three more sets of this until failure\nand move onto the last combo, so we can round out this entire workout. So, we wrap it all up here with our dumbbell\nbicep curl combo. It’s a trifecta. It’s three exercises and it’s going to\ndo three different things for us. Number one: we keep the set going. So, we’re definitely going to have intensification\nof what we normally do with a straight 12 reps and be done. Number two: we’re going to work the rotation\nof the shoulder to take advantage of what we talked about in the very beginning, whether\nwe’re going to more heavily influence the longhead or shorthead of the biceps by what\nwe’re looking at. Finally, we’re going to hit that all-important\nbrachialis that we haven’t addressed yet. The first thing we do is the supinated cross-body\ncurl. You can see as I supinate and come across\nthe body, what are we looking square at right here? The longhead, the outer head of the bicep. You can feel that contraction as you squeeze\nand supinate, right here, how it’s more heavily influencing that outer portion of\nthe bicep. What we do now is, we don’t stop there. Instead we go for our second rep and now we\npronate and lift up this way. When we pronate we’ve taken away the one\naction of the bicep. Which now shifts the load to the elbow flexor,\nwhich is the brachialis. Of course, we can feel that right here more\nthan ever. Now, we do that, and we don’t stop there. Why? We want to intensify this and make it more\ndifficult. We now want to take the opposite rotation\nof the shoulder. Instead of coming and rotating in, now we\nrotate out. External rotation of the shoulder, but it\ndoes something else. What is it doing? It’s squarely revealing the inner head of\nthe bicep, which is the shorthead. You can feel that contraction more on the\ninside here. Again, not isolating, but influencing. You can feel that here. So now, you take it up and alternate these\npositions from one to the other, and to the other. So, 24 total reps. You do this two times, guys. I promise it’s the perfect way to finish\nout the workout. more importantly, we’ve addresses every\none of the concerns that we had in the beginning to make sure we can call this the perfect\nbicep workout. So, there you have it, guys. There’s a workout that I want you to try. You should feel your biceps like never before\nbecause we’ve addressed every, single component of bicep training, all in one selection of\nexercises. That’s the thing. You don’t have to sit here and bang out\nyour workouts for hours and hours at a time. If you choose the right exercises and apply\nthe right techniques you can get a hell of a lot from your workouts in a much shorter\nperiod of time. That’s what we always stress here at ATHLEANX. And of course, we always put the science back\nin strength to do so. If you’re looking for a complete program,\nhead to ATHLEANX.com and get one of our ATHLEANX training programs. In the meantime, if you like the muscle marker\nvideos, as always, make sure you let me know. Leave your comments and thumbs up below. If you haven’t already, subscribe and turn\non your notifications so you never miss one of our videos here. Especially as we cover more of these perfect\nworkouts in these series. All right, guys. I’ll talk to you again soon. See you."
}