{
    "id": "gvCLoR_349M",
    "title": "Fix Back Pain by Doing This (EASY!)",
    "description": "If you want to fix back pain that you get on a regular basis, then this might be one of the most important videos on lower back pain ...",
    "transcript": "So you got some low back pain they want \nto fix? Well, do me a favor and break out   a notepad and a pen and then drop them on the \nfloor. I promise you, it's going to work. \n  What's up guys, Jeff Cavaliere, athleanx.com. So \nwhat happened? Did you actually bend over and pick   it up or is it still on the floor? Well, I will \nbreak out my muscle marker because this is a kind   of pen that I use and I'll drop it right here \non the floor and I'm going to pick it up. But   I want you to notice the difference here. When \nyou did yours, did you look like this when you   picked it up? Or did you look like this when we \npicked it up? Now, if you didn't even notice the   difference there that's a little bit scary. But \nyou know what, you're in the right spot here,   I'm going to take care of you in this video. \nEveryone knows who's ever had to deal with back   pain or maybe they're dealing with back pain right \nnow, whether it's disc related or muscle spasms   in your low back, is a little bit uncomfortable \nto be bending forward to do anything. However,   I'm telling you right now, bending forward and \nlearning how to do it the right way is going to   be the key to unlocking your long-term permanent \nsolution to your back pain. So that being said,   instead of drawing all over myself with a muscle \nmarker in this video to help you fix your problem,   I'm going to take it to the next level, I'll \nmeet you over at the board, the telestrator.\n  That's now. Before we look at shirtless Jeff \nhere, let's take a look back at shirted Jeff   in these two versions of the pickup. So if you \nlook at them side by side now, it should become   very apparent very quickly what the difference \nwas. In one of them I was just simply bending   forward at the waist and picking up what's on the \nfloor. And in the other one, I'm doing something   a little bit prettier. Or at least it looks \nbiomechanically prettier because I'm actually   doing the direct opposite. The low back is maybe \nwhat's sticking out to you. It's flexing forward   in this one here and it's actually just staying \nstraight and this one here. But that's not really   what's happening. Look below that at the hips. At \nthe hips, I'm simply flexing forward or allowing   gravity to flex me forward in this one. But I'm \nhinging backwards in the other one. And that's the   key. You need to learn the proper biomechanics \nof your hip joint in order to get your back   in the right position to perform time, over time, \nover time without becoming injured. So what better   way to learn how to do this properly than with \nan exercise that we can all do? This is an RDL,   you don't have to have a heavy weight to do this, \nbut having a bar in your hand or even a dowel   will allow you to feel what I'm talking about, \nbecause the biofeedback you get from the bar   riding up and down your legs is going to make \nyou know that you're in the right position.\n  So we have a comparison here, an improperly \nperformed one in a properly performed. Let's   start with the properly performed one. You can see \nhere that the initiation of getting that bar down   to the floor had nothing to do with me bending \nat the waist, bending forward. It has everything   to do with right there the hips traveling back \nin this direction. What I want you to focus on   is making sure it goes straight back and forth. \nIf you imagine that there's a dresser behind you   with a drawer that's been left open, you want to \nbe able to allow your butt to close that drawer.   Right. It's one of the best analogies out there \ngets you to realize that is simply just a straight   back and forth motion that drives your ability \nto get down lower to the ground. Most of us think   that to get low, we have to get our head lower \nto the ground because that's where our eyes are.   Really, what we need to do is just simply get the \nhips back and that will bring the head with it.   So if we watch what this does, we see that getting \nthe butt straight back, yes, it closes that drawer   and it gets me all the way down to the ground. \nNow, the bar travel, what's going on there? Unlike   what's happening over here, the bar is going to \nstay directly in contact with my legs and you see   all the way down, all the way down past the knees, \nthe knees don't have to bend very much to get out   of the way, they stay right there. The bar has \ntraveled straight up and down. Okay, now what's   driving the bar back up? The same thing that \ngot it down to the ground you're going to now,   instead of bringing the hips backwards, you're \ngoing to bring the hips forward and you'll see   that that will bring that bar straight up again, \nstraight up by letting the butt come this way. \n  Now, what's improper? What's improper \nis allowing this to bend forward.   Why does that cause back pain? Just like when you \ndid the incorrect version, we bent over to pick up   the pen. Well, two things happen. Number one, \nyou're putting way too much stress on the low   back muscles because the glutes don't want to do \ntheir job. Right there, look it, there hasn't been   any real posterior motion here of the hips. It's \nall occurring by leaning forward with the back.   When that happens, we get the muscles of the \nlow back that act like the reins on a horse.   As the horse starts to get in front of you, \nyou want to pull back to control the horse,   well the same things happening here. As that \nweight starts to get down or worse, as you'll   see here out in front of you, the low back \nmuscles are saying, hold on and they're trying   to grab netcentric hold on to pull you back.\nWell, at some point they're going to be overtaxed.   They're going to come to a point where they're \njust over fatigued and they say that's enough.   They become strained. You have a spasm, whatever \nit is, but you get a lot of discomfort. It might   be a position you find yourself in right now. The \nfact is it's not that one time that caused it,   though it's what you felt was the leading cause of \nit. It's what led to that over the period of many,   many, many, many days, weeks and months is that \ndoing the improper mechanics on the forward bend   is what caused that to become fatigued to the \npoint where it gives out on that one single time.   So understand that we want to fix this, fix \nit every single time you pick something up,   not just with a barbell in your hand, but we are \npicking something off the floor. So if I go back   here and I let it play out, if I let that bar \ndrift, that's just increased that moment arm and   causing more strain on those low back muscles to \nhave to do more work to control that weight as it   drifts out longer, longer away from my hips. \nSo the fact is, guys, you have to learn how to   do this properly, dragging that bar straight up \nand down is a good feedback to know that you're   doing this right. But most importantly, it's \nthe motion simply back and forth of the hips   that drives proper hip extension and that gets \nyou in position to do this right every single time   and saves you back in the process. \nSo there you have it, guys, with the   remedial task of simply learning how to bend \nforward and maybe even tie your shoelaces,   you've now learned how to bulletproof your back \nto preventing back pain in the future. Guys,   listen, it's all about learning how to create a \nformidable body, not just a strong one, but one   that is resilient to injury in the long run. Guys, \nif you're looking for our step-by-step plans,   we have all laid out for you over athleanx.com. \nIn the meantime, if you found the video helpful,   leave your comments and thumbs up below. Let me \nknow what else I can cover for you. As a physical   therapist I like to dive into these topics from \ntime to time. You let me know what I can help   you with and I ll do just that. Also, make sure \nyou hit subscribe and turn on your notifications,   so you never miss a new video when we \nput one out. Okay guys, see you soon. "
}