{
    "id": "gXPDhggbWfM",
    "title": "5 Red Flags for Weak Glutes (FIX THIS!)",
    "description": "Weak glutes are one of the most common muscle weaknesses exhibited. The irony is, the muscles of the hips and glutes are ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Kicking off a new series here today. We’re talking about Red Flags. Today we’re covering five red flags that\nyour glutes are pretty weak. As a matter of fact, damn weak, and you need\nto do something about it. To make sure that you don’t miss this or\nany other video in this series, you’ve got to get off your ass and make sure you hit\nsubscribe and turn on the notifications as well, so you never miss a video from this\nchannel. Guys, one by one I’m going to knock out\nfive things that you should be able to do if you have adequate strength in your glutes. If you do not, then you need to do something\nabout it. First off, you might be asking yourself “Why\nshould I even care?” Besides the fact that most of us would probably\nlike to look good from behind, I’m telling you that the glutes are designed to be the\nmost powerful muscles in your entire body. Ironically, they tend to be the weakest because\nwe don’t train them effectively. Squats, deadlifts; they’re not doing enough,\nguys. It’s a single plane motion working the sagittal\nplane and our glutes are three dimensional and work in all three planes. We need to make sure we’re addressing them\nindividually. If you don’t, you’re going to have bad\nposture. You could have anterior pelvic tilt. I made a whole video on this before. You could have a weakness in your big lifts. You’re not lifting as much, nearly as much\nas you could on your deadlift and squat because of a weakness in your glutes. You’re not getting as much power, or speed\nif you’re athlete. Everything comes down to the powerhouse of\nyour entire body, your center of mass, and it’s all centered right around your pelvis,\nand you need to focus on this. So, let’s get going. So, let’s look for that first red flag here. It’s really simple to do. You get down on the floor, no equipment required. You come down to the ground, hands and knees. This is a two-part sequence here. You’re not out of the woods if you can do\nthe first one. What you want to do is get your leg back behind\nyou, start with either one, and you want your knee straight. You don’t want to cheat it and roll the\npelvis out. You want to try and keep that parallel to\nthe floor. From here you’re going to squeeze your leg\nup toward the ceiling by activating the glute. Hopefully. So that means you should be able to feel this\nintense contraction right here in this cheek. If you don’t, I’m already starting to\nget a little concerned because we need to know that you have that mind-muscle control\nover the glute. These small motions are what will reveal whether\nyou do or not. But let’s say you do there. You’re not out of the woods. What you need to do now is bend the knee and\nrepeat the same procedures because by bending the knee here, we’re shortening the hamstring. We’re contracting the hamstring a little\nbit. Meaning, we’re taking its contribution out\nof the equation. The hamstring is capable of extending the\nhip as well as flexing the knee. So, when we have this here, now when we try\nto lift up toward the ceiling, can you still do that? And can you still feel any contraction in\nthe glute? A lot of us will find that we lose that ability. We don’t feel it squeezing anymore. We don’t feel that cramping in here. That means your hamstrings were doing more\nof the work and the glutes aren’t as strong as you think they are. Which means they’re going to need work. You want to make sure you test this on both\nsides because there can always be discrepancies. As a matter of fact, it’s a common occurrence\nto have a discrepancy in your strength from right side to left. Our next red flag here just requires a couple\nof dumbbells and an exercise you’ve probably done a whole lot of reps on. That’s the lunge. Now, take whatever you’d use on a 12 to\n15 rep lunge. I just have 25lbs in each hand here. Remember, when you lunge out you’re not\njust trying to see whether you can get out here and then come back up to the top. You want to be able to do that with stability\nthrough your pelvis. Meaning, you don’t want a lot of shakiness,\nor wobbling through the pelvis because you want to know that your glutes are doing their\njob. Remember, the muscles of the glutes are not\nsingle plane. I said that in the beginning. They actually control motion in all three\nplanes. In this case, we’re looking for their ability\nto control the frontal plane. So, you take whatever that weight is – 25lbs\nin each hand – combine it for 50lbs, now take a 50lb dumbbell, and here’s the test. You hold it on one side only. So, I have it on my left side. I’m going to step out with the opposite\nleg. As I step out here, the opposite leg down. What I’m looking for is that same stability. I’ve got a lot of weight over here that’s\nprobably going to make this hip kick out if the glutes are weak on this side. So, you want to make sure you can get out\nhere with that double weight straight down, and straight back, nice and controlled, for\nabout three to four reps. And back, nice and controlled. You’re not looking – you want to make\nsure you’re not doing that. Fall into that side and let that hip kick\nout on you. Remember, test both sides here again. Number three is another one we can do down\nhere on the ground, no equipment at all. Again, red flag. You’ve got make sure that we at least reveal\nthese, so we know what we’re dealing with. I want you to get down on your ground, get\non your back, and we’re going to form a bridge. When you do the bridge with both feet on the\nground and lift your hips up as high as you can. Now, a lot of people will shortchange the\nbridge. They stop here. That’s not full hip extension. To get the full hip extension you’ve got\nto lift until you’ve basically drawn a straight line between your quads and your torso. If you’re going to roll something it will\nroll right down. It’s not going to get caught in the middle\nhere. Some people, right there, are going to already\nstart to feel cramping. It’s where you feel the cramping that’s\none of the biggest problems. If you’re cramping in the hamstrings at\nall you’re in trouble. It’s going to get worse because what I want\nyou to do is to, in this position, test the right side. You’re going to get right there and lift\nthe left leg off the ground. Two things you’re looking for. If I lift the left leg off the ground do I\nimmediately start to drop here? Do I start to sag? If you do it’s because you don’t have\nstrong enough glutes on this side. We should all be able to perform a single\nleg bridge with our own bodyweight. But if you start to drop that’s sign number\none. Number two: you’ll also start to rotate. Same deal. Weakness in the glute. But more importantly, when you get in that\nposition here and you lift, if you can even stay up but you start getting cramping in\nthis hamstring, then you have assigned here that your glutes are weak. Why? Because your glutes are what should be driving\nhip extension. Not your hamstrings. Although, they are capable of contributing\nto hip extension, that’s not their main focus. So, if they start cramping that means they’re\ntrying to do as much of the work as possible because the glutes don’t want to do the\nwork. That’s a great sign that says “Hey! Wake up, you lazy ass (literally) and start\ndoing some of the work, and don’t make me – the hamstrings – do everything that\nyou’re supposed to be doing.” It’s a great sign, guys. Remember, test both sides, right and left\nto find out where you stand. Number four, and this is one of the big, red\nflags that’s going to remind you every, single day that there’s something wrong. The thing is, you usually don’t understand\nthat the source is your glutes, once again. That is low back pain. In this case, I like to call it ‘pseudo\nlow back pain’. I made a whole video on this. I’m going to show you what it looks like\nhere and I’ll link it down in the description below. You want to watch that if you have what I’m\nshowing you here because I promise it’s going to fix it. Even as I promised in that video, instantly;\nyou’re going to feel instant relief. Watch. This is what we’re talking about. This area right here – I’m going to get\na little naughty here – but we’ve got, basically, if I were to rub my hand over the\nupper portion of my glutes I would feel a bone right here. It’s in my pelvis. If you can just roll your fingers just to\nthe outside of that bone – so roll it over until it sits on the outside. Right in here, if you have pain right in that\nspot, and when you press it, it can radiate around, down your leg a little bit, up into\nyour low back, and starts to feel like “Wow, that is exactly – I can pinpoint where that\nis”, then my friend; you’ve got some issues with your glute medias. Likely, it’s really, really weak. That’s what’s causing your pain. What you need to do is watch the video I just\nshowed you because I’m going to show you in there exactly how to treat that. But for now, the presence of this pain alone\nin this pinpointed spot – either on the right side or left – is enough to tell me\nthat I know where the source of your issues lie. It is your glute medias, and it’s weak,\nand you need to fix it. That video will help you to do that. Our fifth and final red flag is an ab exercise. Again, you guys have got to see this by now,\nthat all these muscles are connected. Especially if they have common attachments\nto the pelvis. Of course, one is going to influence the other. We know that the abs are controlling the pelvis\nand the glutes as well. So why are they not impacting each other? This is the thing, we’re going to jump to\none of the hardest exercises there are when it comes to the abs. That’s the dragonfly. But don’t worry. You might not be able to do the dragonfly,\nbut even if you can do some version of it, you’re going to see that it’s probably\nyour glutes causing the problem, less than your overall ab strength. So, we get in this position, you grab onto\nsomething you can anchor your upper body to, and then you go in and start to do your dragonfly. Which is going to be this. Up here, and then drop it down. Right, under control. So now, where is the weakness? I’m going to tell you that your abs are\na hell of a lot stronger than you think they are. The problem is your glutes. If you can’t perform this exercise, do this\ninstead. See how strong your glutes really are by focusing\non how much they’re activated during that exercise. So, when I come out, what’s happening is,\npeople’s hips are dropping here. So, the abs have to take on a lot more of\nthe work because the hips and glutes are not contracted. If instead I squeeze into extension, all of\na sudden, my abs become a lot stronger here to be able to hold that position. If you can’t start there, it’s the same\nprinciple applied at a higher angle. So instead of having my legs out, beginners\ncan be up here and see how much they can hold with their abs. Remember, I have sunken hips here. What I have to do is squeeze into full extension\nand stay there. So, you’re testing your ability. If you just can’t get your hips up and you\ncan’t keep them up, you don’t have enough hip extension strength, and that’s just\nagainst the force of gravity. Imagine what happens when you actually start\nto apply weighted exercises where they need to be like that, or you try to get into a\nbarbell hip thrust and you don’t have nearly the strength in your glutes to do them properly. Guys, there are a lot of red flags when it\ncomes to a lot of different muscles groups that you have, but none probably more overlooked\nthan your glutes. They’re geared to be powerhouses. They’re probably not doing anywhere near\nthe full capacity of what they’re capable of for you, and that’s a problem. We need to fix it. So, guys, if you’re looking for a program\nthat puts the science back in strength, step by step, we show you how to do these things\nbecause it all matters; all of our programs are available over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Remember, if you haven’t already, subscribe\nand turn on those notifications. You need to do both steps in order to get\nnotified every time I run a new video. All right, guys. See you soon."
}