{
    "id": "H21MYZsw_2A",
    "title": "7 Beginner Workout Mistakes You MUST Avoid!!",
    "description": "Beginner workout mistakes aren't always so easy to avoid. Often times, it is the beginner that makes the most workout slip ups ...",
    "transcript": "What's up, guys, Jeff Cavaliere, athleanx.com. \nSo, I remember 30 years ago, the very first time   I picked up a weight, I actually hated it. \nI did not want to lift weights whatsoever. I   wanted to look bigger, I even dressed the part to \nlook bigger. Yes, that's actually me. But I didn't   want to put the work in to get there. Thankfully, \nI learned how to love the process and I'm going to   make sure you do today because I'm going to show \nyou the seven biggest mistakes that beginners make   that oftentimes gets them off track before they \neven get started. If you follow these pieces of   advice, we're going to make sure that you don't \ntrip up the same way I did. With that being said,   guys, let's start breaking them down one by \none. So right off the bat, I don't want to   break anybody's heart, but I've got to give you \nthe truth here, you see you can't get around,   and I mean literally get around nutrition. And I'm \ntalking about either overeating the wrong foods   or undereating the right foods. There is no \nmagic exercise plan, there's no great ab routine,   none of those things will overcome the fact that \nyou're not eating properly. So, let's say you're   a guy that's overweight right now and you decide \nto lift weights. Yes, you're going to be bigger,   but you're going to be a bigger fat guy.\nOr let's say you're a skinny guy who doesn't eat   nearly enough and you lift some weights, yeah, you \nmight get some results, but they won't be anywhere   near what you could get if you actually supported \nyour efforts and your training in the gym with   proper nutrition. Think of it this way, guys, i's \nthe perfect two-man team, you have to have both of   them working towards that end, goal nutrition and \ntraining if you want to look your best. Mistake   number two is actually picking up the weights too \nsoon. You see if you don't learn how to command   your own body and space then are probably going \nto look a bit ugly when you grab the weights.   And that's because you haven't learned proper \njoint stability in any of your exercises. So,   what I'm asking you to do is rewind it a little \nbit, start in the beginning and learn how to   master the basic body weight movements like a push \nup and like a pull up. And when you do, you'll   see that your task gets infinitely easier when you \nactually go back to pick up the weights. And don't   be discouraged here, guys the body weight training \nis not going away forever. As a matter of fact,   it's going to come back and compliment the perfect \ntraining routine because that's where some of the   most difficult calisthenic exercises can be \nperformed. But not before you learn how to   build that base of strength and stability with \nthe proper execution of the basic movements.\n  So, let's stay on that idea here for a \nsecond for mistake number three, and that is   you're forgetting to address your mobility and \nflexibility issues early. You see, before you   make or even as you make that transition to \nthe weights, if you're not looking yourself   in the mirror and I mean literally looking at \nyourself and seeing all the posture of flaws   and mobility issues that you have in addressing \nthem, that you're setting yourself up for long   term failure. Look, there are people out there \nthat will tell you you can work through these   things if you just pick up the weights and start \nworking on perfecting your mechanics. But what   I'm telling you is you're actually going to work \nthem in to improper mechanics and make it a hell   of a lot harder to correct these things down the \nroad once you've built your strength around these   imperfections. If you get them out of the way \nearly, guys, you're going to be able to build   a better foundation free from the cracks that are \ngoing to ultimately take you down in the long run.   Beginner mistake number four is forgetting to \nlose the \"routine\" part of your workout routine.   What I mean is once you've adopted a habit of \ntraining, then you want to try to get out of the   \"routine\" of training as quickly as possible.\nLook, does this seem familiar to you? You kind of   knock out the same amount of pushups every time \nyou do them and you move on. And you knock out   the same amount of sit ups and then you move on. \nOr maybe the same amount of air squats and you   move on. There's no challenge in that, guys. And \nin order to change yourself beyond that beginner   newbie phase, you're going to need to challenge \nyourself. And that's where you need to incorporate   a new exercise, a new stress of the exercise, \nmake it difficult in some way, shape or form. Add   weight to the exercise and once you start to learn \nhow to properly overload, then the changes will   continue to come. But if you just get comfortable \nin that \"routine\" of doing the same thing over   and over again, which a lot of beginners will, \nyou'll lose not only the enthusiasm for training,   but the gains that come along with it. Mistake \nnumber five for beginners is taking rep counts   too seriously. Now, look, I create programs and \nI know how effective programs can be for guiding   someone from point A to point Z. But what happens \nwith beginners oftentimes is they're so focused   on counting their reps that they stop making the \nreps count. What I mean by that is it affects you   in two different ways. Let's say you're doing \na set here and you know that you're supposed   to get ten repetitions on the first two they're \nactually harder than what you thought they were   going to be. You might decide to sort of back off \na little bit and just quick wrap yourself through   three, four, five, six and seven only to rejoin \nthe effective reps again to get to your magic   number of ten. Well, guess what? You've wasted \nhalf of the set and the effort there just isn't   good enough to take you to that next level. On \nthe other hand, if you're so fixated on getting to   that number and you're going to do so, come hell \nor high water, even if it means sacrificing not   just your form, but your safety in the process, \nthat's never going to be a recommendation that   I'm going to tell you you should do. You need to \nbe able to do the reps that can as effectively   as you can and get rewarded for doing that. \nSkipping around and playing with the numbers   just to get to that number is never going to \nbe the most effective way to get you gains.   Building off of some of the early mistakes, \nmistake number six requires that you learn   what failure looks like and more importantly, \nfeels like. You see a lot of beginners don't   really ever grasp what this is, and it holds them \nback from making significant progress. If you just   move through your sets without any real discomfort \nand looking like you're maybe on a Sunday drive as   opposed to training to build muscle, you're likely \nnever going to be satisfied with the results you   get. You have to push your body to the point of \nchallenge in order to create that change. So, when   I mentioned failure and recommend failure to even \nbeginners, I'm trying to get you to understand   what it feels like on a given set. You want to \nbe able to push and each repetition becomes more   and more difficult. However, when you reach a \npoint of form failure, we're done. We don't want   to sacrifice our safety in the process of trying \nto get out that other rep. We talked about that.   But you do have to be able to push and grind your \nway through repetition. And don't get caught up   in some of the new phrases like RPE and other \nmethods of measuring your exertion levels because   you probably don't have a good enough appreciation \nfor what that even means. To you a 7.5 versus an   8 will mean no difference because you don't \ntruly know what it means to take yourself   to that point of failure. You can back yourself \noff once you've determined what failure feels   and looks like, but you need to feel it first \nin order to be able to program around it. \n  So, you better deliver point number seven on \nbeginner mistakes, then meet the perpetual   hard gainer. Realize that it takes time and \nthat you need to enjoy the journey. Listen,   it's been a long time for me and you know some of \nmy critics out there would say I've made no gains   except for on my beard. Now take a look back at \nwhen I started, and you'll see, yes, I've made   gains over the years and my journey has become \nmuch more enjoyable because I learned to enjoy   that process. We're always learning something new \nfor me, I'm learning how to eat better. You know,   I ditched the gummy bears, but I'm still trying \nto eat more and more nutritious foods. It's those   little victories that mean the most. For me, it \nwas setting a new PR, looking in the mirror and   seeing some new gains, some size on my muscles \nand it's going to work for you as well. It's   not something that's going to happen overnight, \nbut in the end, it's going to be worth it.\n  Remember, guys, we're all beginners at some \npoint. And I remember exactly what I felt when   I was going through that stage and recommending \nto you guys that if you avoid these mistakes   that we covered here, your journey will be \na lot faster, despite what Jesse just said,   because you can cut out a lot of the things \nthat hold beginners back. Not anymore. If   you're looking for programs, guys, where we \ntake you through step by step and make sure you   don't make these mistakes, they're all available \nover at athleanx.com. We even included nutrition   plan that Jesse's trying to follow to get those \ngains coming. If you found the video helpful,   make sure you leave your comments and thumbs up \nbelow. And also, if you haven't already done so,   make sure you click subscribe and turn on your \nnotifications so you never missing a video when we   put one out. All right guys see you soon. I'm \ngoing to go eat some, uh, some good food."
}