{
    "id": "H60A3ev7pr0",
    "title": "Bench Press Heavier Dumbbells (GUARANTEED!)",
    "description": "If you want to bench press heavier dumbbells but seem to be stuck at whatever weight you're lifting right now, you're going to want ...",
    "transcript": "What s up guys, Jeff Cavaliere, Athleanx.com. \nToday, I'm going to show you a magic trick.   I'm going to make this dumbbell and this arm \ndisappear before your very eyes. You ready? \n  Okay, that's not the trick. But I promise you, \nit's going to feel like a trick, because the next   time you do a dumbbell bench, press is literally \ngoing to work that very next set. Okay, but it   has to do now with how you grip the dumbbell. But \nbefore I show, you want to ask you a question. How   are you benching right now? Do you look like \nthis when you perform a dumbbell bench press?   Or do you look like this? Now, let me give \nyou another shot. Go back to the first clip.   Look at the wrist, do you look like this \nwhen you do it? Or do you look like this?   See, the wrist position is entirely different. \nBut what the wrist position does is it changes   what's happening at the end of your wrist and \nmore importantly, setting up the biomechanics of   the press to become more efficient and stronger \nin that press. Why is that? Well, first of all,   we want to look at what we're going to do. In this \ngrip here instead of gripping it, traditionally   right down the middle of the dumbbell, I want to \nshift my grip just a little bit to the end. And   then I want to focus my squeeze through these two \nfingers. Now, wrapping it over that four finger,   but this is not a hook grip guys we re not pulling \nanything. I'm just squeezing as hard as I can   through those at the thumb side and of the \ndumbbell. These get wrapped around for support.\n  And what it does, you can see is it just starts to \nposition this side of the hand a little bit higher   than this side. Okay? And that's important. \nAnd why is that important? We break out Raymond   here, or at least part of Raymond, to show you \nwhy that's important. You can see if my wrist   was this way that the radius, the bone on the top \nside of the forearm here is longer at the end,   than the ulna is. And that's by design of our \nbodies here, we have a longer radius than ulna.   So, you can see that if I had the dumbbell on my \nhand, and I put the weight in the hand like this,   it can cause compression at that portion of the \nwrist where the radius meets the wrist itself. \n  That's not good, especially if you have wrist \npain that's going to feel very uncomfortable   for people. The wrist pain alone is enough to take \naway some of the weight that you can press there,   but more importantly, what it's doing is actually \ntaking this wrist out of biomechanical alignment.   Because believe it or not, the best way to do \nthis is to get a little bit of that gapping here   by letting the thumb tilt up just a little bit. \nAnd again, the carpal bones will sit down on   the base of support here through the radius and \nthe ulna, but it's better mechanically aligned   because we have a little bit of space here \nand we don t get that compression. All right.   So that's why that tip will work for you.\nNow, the best thing about the squeeze part of it   is that when I'm squeezing through here, you can \ntry this yourself right now. If you have your hand   here and you squeeze those two fingers as hard as \nyou possibly can squeeze here, you'll feel your   chest actually activate a little bit. You'll \nfeel your arms tighten up against your body.   And the reason for that actually goes back to a \nshared neurological lateral cord from the brachial   plexus that actually feeds the muscles that do \nthis and also feed the muscles that do this.   That gives a little bit of the heady side \nof things. But again, you can feel it   right now just by doing it and will actually \nreinforce itself when you do that now. \n  Let me show you one thing. I \nknow there's a dumbbell video,   but how would this apply to a barbell? If I got \ndown on the bench here, obviously I m restricted   to what I could do because my hands are fixed on \na barbell and they re not on a dumbbell. But there   is one modification you can make to give yourself \na little bit better shot of feeling less pain   through your wrist and being able to press more. \nAnd that is you want to go a little bit narrower   on your grip rather than wider. So to exaggerate \nthis, so you could see what I'm talking about very   clearly. If I took a really, really wide grip, \nthe wider I go, the more compression I get on the   radial side of the wrist. Right. You can see that \nthe wider I go, the more compression I get.\n  So, if I wanted to get off of that radial side, \nI'd want to go more narrow. And you could see as   I go more and more and more and more narrow, \nI actually have very little compression on   that radial side. So, I'm not suggesting you \nclose group bench press all the time when you   want to bench press. What I'm suggesting is you \nfind the typical width that's good for you on a   bench press and then just go a little narrower \nthan that to help offload some of that strain   and compression on that radial side. \nThe fact is, guys, if you try this,   I promise you go grab a set of dumbbells \nand do this is going to work on whether   or not you're using lighter weights, you ll \nbe able to do more. Or whether you start to   tap into those heavier weights, you re going to \nbe able to do more weight there, too. I promise   you guys, give it a shot, it will work. \nIn the meantime, if you found the video helpful   and you try it out, it works for you make sure you \nleave your comment below. If you're looking for   programs where we put the science back in strength \nalways you can head to athleanx.com. And finally,   guys, if you haven t done so, make sure you \nclick Subscribe and turn on your Notifications,   so you never miss a new video when we put \none out. All right guys see you soon."
}