{
    "id": "h63JTsVdntw",
    "title": "How to Perform Reps for Most Muscle Growth",
    "description": "Should you be lifting heavy weights as fast as possible or light weights with a slow controlled tension if you want maximum muscle ...",
    "transcript": "JESSE: You know, one of the best things that\nJeff’s taught me since I’ve been working for him has been, it’s not just the exercises\nyou choose, but it’s how you do them. [mechanical noises] JEFF: Jesse! Whoa! Whoa! JESSE: What’s up? JEFF: What are you doing? JESSE: All right. So, remember when you told\nme that it’s not just doing the exercises, it’s about how you do them? Going from point\nA to point B? JEFF: Yeah. JESSE: Well, dude. You were 100% right. For\nexample: take the robot curl. JEFF: That’s a good exercise. It works your\nbiceps and- JESSE: Yeah, but the problem is, if I do it\nlike this…I don’t feel anything. Literally, nothing. However, when I become the robot\n– ready? [mechanical noises] Biceps. [mechanical noises]\nForearms. [mechanical noises] Biceps and forearms. Dude! It's incredible! You’ve got to be\nthe robot to feel the robot curl. [mechanical noises] JEFF: Okay. Someone’s got to turn you off,\nman. Can I take these? Thanks, man. JESSE: System failure. [power down noise]\nYou know, I just wish you’d try it. Without noise, with noise. Without noise, with noise. JEFF:\nWhat's up, guys? Jeff Cavaliere, ATHLEANX.com. JEFF: Today I want to try and help you determine\nhow you should be performing your reps on whatever exercise you’re performing. It’s\na big question. There are a lot of different ways we could\nlift a weight. We could just get it from A to Z. We could try to get it from A to Z focusing\non a lot of details. We could push it fast. We could push it slow. Speed matters. All this stuff, guys, we know we need to focus\non it. But what’s the right answer? I have to answer that by first asking you a question.\nThat question is: what are you training for? Because if you’re training for strength\nor hypertrophy the answer could be different. If you’re training for strength there’s\none thing you should always be seeking. The first thing you should be seeking is efficiency. What I mean by that is, you want to try – let’s\nsay you’re doing a bench-press. We realize that the bench-press is going to recruit our\nchest, our shoulders, our triceps. We’re not trying to isolate on a bench-press if\nwe’re trying to improve strength. We’re trying to get those muscles to perform\nthe work together. I’m not trying to, in this instance, say “Hey, get those shoulders\nback” – yes, to protect the shoulder, but not for the sake of trying to get the\nchest to drive the momentum. Really, really squeeze. Get that hard contraction\nthe chest as much as you can, squeeze your hands together at the top. No, it’s about\nmoving the bar and maintaining a proper bar speed because it matters. Actually, moving with a velocity so you can\nincrease your power as well, because we know strength and power go hand in hand. So, it’s\nnot about being specific about trying to isolate a muscle. However, if you’re trying to train for hypertrophy\n– meaning, increase the size of a muscle – you should not be looking for efficiency,\nbut inefficiency. How can you introduce new ways to make a rep harder? The more we can do that, the more stress we\ncan deliver to a muscle and therefore, help it to feel more overload, and adapt in response\nby growing bigger. So, we have to look at a few different scenarios. I’m going to use a lat pulldown here and\nwe’re going to take a few examples where we train to a certain rep range for failure.\nWe already know that training to failure is not always essential. Especially depending\nupon the volume of your training. But to make this example very easy to understand\nwe’re going to say, ‘train to failure’. The first example would be, let’s say I’m\nusing a rep range of – I’ll actually write it down here – let’s say I’m training\nwith my 10-rep max on a lat pulldown and I’m going to fail at 10. But in this one here, I’m taking a similar\napproach to the one when I was training for strength, and I’m just worried about going\nfrom A to Z. Moving the bar from A to Z here. That’s the first scenario. The second scenario\nis, I use a little bit lighter weight. Not much. Let’s say 12, 13 rep max and I’m\ntraining to 10 rep max failure. 10 rep failure. So, in these two scenarios – in this one\nhere I’m really trying to be focused on increasing tension in a specific area of that\nlift. So, if I’m trying to grow my lats from an\nunderhand lat pulldown I’m really trying to squeeze. So, let’s take a look at what\nthese look like. If I’m doing the first example here and I go to pull down, I realize\nI have the biceps as my friends here. I realize that I have my upper back as my\nfriend. I realize that I have my lats as a friend. I realize that what I’m trying to\ndo is get this bar down to my chest as efficiently as I can, with multiple muscles participating.\nThat’s scenario one. What happens is, when I get around rep number\n10, I’m trying to pull and I can’t get anymore because I’ve fatigued the overall\nmovement. Not necessarily one, specific muscle that participates in that movement. That’s\nscenario one. Scenario two is this one here. Where I’m like “Now I’ve got to lighten\nthis one up a little bit because what I’m going to do is, I’m going to focus on making\nthis much more of an inefficient movement.” For my lats, specifically. So, I don’t want\nan overactivation and contribution from my forearms trying to achieve this. I don’t want my biceps pulling too much\nhere. I want to get my elbows down into my sides, adducted hard, and back into extension\nso I can maximally activate the lats. So, it looks more like this. I come down, squeeze,\nI hang out there for a second, I come up a little bit slower for the eccentric. I’m down, squeeze, and come up, squeeze,\nand come up. Squeeze and come up. Squeeze and come up. So, let’s say on the last rep\nI fail at 10. That is a weight that I can normally handle if I didn’t do all those\nextra things for a few more reps. 12 to 13 in particular. But I stopped at 10 because I couldn’t do\nanymore. Those extra intensifying techniques level me out. So now what’s that do? If\nwe look at a graph here, if this is intensity and this is my reps from one, to six, to ten\n– or one, to five, to ten – halfway, if we start on this graph with those two types\nof training what do we have? Well, we know the first one – the true 10\nrep, the 10 done for 10 and not worrying about the journey so much – that’s going to\nbe an intensity level around here. Now the one that was at a 12 to 13 rep max, where\nwould that fall on this intensity curve, in terms of the rep? JESSE: Below it! JEFF: Oh, Jesse! Kind of chiming in. That’s\ngood to know you don’t just appear on the intros. So now – below it. He’s right\nbecause it’s a lighter weight. The intensity driven by that rep is a little bit lighter. However, you know – I hope – that I could\ntake this and, depending upon how I performed that rep in the journey I took to get from\nA to Z – I could take this way the hell down below this. If you need to see an example\nof that all you’ve got to do is look at the following example here. If I have some weight on here, just because\nit’s a heavier weight doesn’t mean when I get under here and start doing this – which\nyou see a lot of guys do – that does absolutely nothing. That’s bullshit when it comes to\ndeveloping and trying to create hypertrophy in the lats. That is just a waste of time and effort. So,\nI just took this, which was a heavier weight, and I dropped it all the way down here. So,\nwe’re not talking about hat. We’re talking about this example here. However, do realize that I could take that\nweight I had that was slightly lower in weight and bring that intensity up from rep 1 up\nhere, or even higher, because of how much intensity and focus I put into the initial\nrep. Then what winds up happening is, their journey throughout the set. So as this one goes, this is a high intensity\nrep. This is a high intensity rep. This is a high intensity rep. This is a high intensity\nrep. I also have this mounting intensity here just because of the overall fatigue. So, it’s\nclimbing, it’s climbing, it’s climbing, and climbing. I get to 10 and I’m done. This one down here, this is pretty easy, in\nterms of the intensity level because I’m not applying any of those extra techniques.\nSo, you guys have felt that yourself. You go through rep one, two, three, four, five,\nsix and if feels like the only ones that are hard are the last couple. That’s what I’m talking about here. They’re\nhere. They’re here. They’re here. When we start to get toward the end, now that shoots\nup. And it might even end a little more intensely because it was a heavier weight being used.\nBut look at the difference in the quality of that set. This is where I tell people all the time “You\nsee inefficiency when you’re trying to get hypertrophy and you’re always going to wind\nup in a better place” because all this accrued additional intensity underneath this graph\nis what creates that stimulus for growth and overload. That is much more significant than what we\ncould do here. Now, a couple more points. This is all meaningful, guys. I’m telling\nyou. If I take this concept and go “I knew it! All I need to do is go really light and\nget that tension.” Time under tension is everything. Guys, I preach ‘time under tension’ a\nlot. But it’s not always a blanket statement of time under tension because I could come\nhere and squeeze as hard as I want. And squeeze, squeeze, squeeze, squeeze, squeeze. Up. Squeeze,\nsqueeze, squeeze. That slow, eccentric, slow, slow, slow, slow, slow – all this super\nslow motion. That’s not doing anything either, guys.\nThe threshold for intensity was too low. This weight was not enough to cross that threshold\nto even make it productive. Unless you’re training for a metabolic overload. A lot of guys are not necessarily prepared\nto train metabolically because the thing with metabolic training is, you do take a light\nweight to failure, but you’d better be prepared to take it to a level of intensity you haven’t\ntrained for in a long time. To make metabolic training effective, it starts\nwhen you – the rep starts when you start to burn. Not ‘when you burn, it’s over’.\nWhen you start to burn, that’s when your set starts, and you go through that burning\nresistant more and more. It takes a mental toughness that a lot of guys don’t apply\nthere. Therefore, they’re making it ineffective.\nSo, then you could say “If that’s the case, do I discredit this attempt, or this\napproach?” My answer to that is also ‘no’. You don’t discredit that approach. Why?\nBecause this is still about – there’s still a huge value to this, guys. Despite the fact that this is great at creating\nhypertrophy, this is also great at a lot of other things. Number one: it’s great at\nstrength training. Just like it was on the example of the bench-press at the beginning. If I get stronger on this, if i become good\nat efficiently moving this bar on a lat pulldown, to the point where I can keep increasing this\npin from workout, to workout, to workout, to workout; am I not getting stronger on this\nlift? All strength doesn’t have to happen in a 2, to 3, to 5 rep range. That's a myth. You can get stronger in any\nrep range. What’s great about that is, as that top end strength improves there – and\nthis is also athletic because I am moving multiple muscles. Getting muscles to contribute\ntogether to move this bar. It’s not about isolating to create inefficient overload on\nthe lats. This is a more efficiently athletic lifting\npattern. But at this top end strength improves guess what happens to this little green mark?\nBecause it starts down here, this one would go up. My overall strength would go up. I\nmight start at a higher level there, but the green also starts at a higher level. So then when the green jumps up, it jumps\nup to a higher intensity level there. So, bringing up our top end strength is also going\nto bring up that adjusted strength that we had on that second example. So, guys, all\nof this matters. When you go to train you have to understand how you’re training. You have to understand the goals of your training.\nMore importantly, you have to understand why you’re there in the first place. It’s\nnot about moving from point A to point B or point A to point Z – however you do it.\nSometimes it’s about the journey in between, depending upon what it is you’re training\nfor. There’s a reason why we follow different\nrep ranges and when we program them. We program them at specific places to illicit specific\nresponses. We do that in all of our programs, depending upon the goal you’re trying to\nachieve right now. they’re all over at ATHLEANX.com. In the meantime, leave your comments and thumbs\nup below. Let me know what else you want me to cover\nand I’ll do that for you. If you haven’t already, subscribe and turn on your notifications\nso you don’t miss a new video when we publish it. All right, guys. See you soon."
}