{
    "id": "Hk65AxtXJD4",
    "title": "How to Hip Hinge (FIX THIS!)",
    "description": "Train like an athlete here - http://athleanx.com/x/it-starts-here Subscribe to this channel here - http://bit.ly/2b0coMW The hip hinge ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to show you how to master\none of the most important, biomechanical joint actions that you can. It doesn't matter whether you're training\nyour lower body, or your upper body because a lot of upper body movements will require\nthat you know how to hip hinge. More importantly, when you look at certain\nexercises like the squat, I would say if you don’t have a mastery of the hip hinge, if\nyou don’t know how to initiate a hip hinge you probably shouldn’t be squatting because\nyou're going to wind up hurting yourself. Those that can't hinge at the hips properly,\nbasically send all the stress into the joints that can't handle it. When you understand that the center of gravity\nis your pelvis, and it's built to be able to handle all of the stresses that you put\non it from above and below, then you realize how important the hip hinge is. So here's all you have to do. I actually covered this tip on Instagram the\nother day. If you haven't followed our Instagram page\nyou can do that. It's @ATHLEANX, here. Do that because I put a lot of different content\nover there. I try not to be too repetitive. Here I've got a lot of questions, if I could\nactually cover this more in depth. So I'm actually doing that now. The hip hinge, there's one little drill that\nI do that allows me to feel it instantly, and I want you guys to be able to do the same. When we look here, first of all, where are\nwe talking? Right here. These lines that come down right here. You can imagine where they go, okay? They come down here, they kind of head south. They're at this angle, and they're at this\nangle here. We all have them. It doesn't matter how fat you are, or how\nlean you are. We've got this angle here between our thighs\nand our torso. That's what we want to be able to focus on. We can do that with our hands. So I'm going to get in here. This is a bear squat machine. This machine is one that we actually used\nto use in Major League Baseball. It allows for hands-free squatting, and not\nhaving to have the bar across the neck. Again, for a pitcher, or an athlete we might\nnot necessarily want to have that in season. But for me, it allows me to hands-free demonstrate\nsomething for you. Sow when I get up here, what I'm looking to\ndo is put my hands in those creases, okay? Rest the base of my hand – my pinky, all\nthe way down to the base of my hand – right in those creases. My idea is, I want to squeeze my pinkies between\nmy lower abdomen and my upper thigh. If they're on that crease, the firs to move\nthat I want to do is squeeze them together. Make the hand ultimately disappear in that\ncrease. From here. Okay? So I'm going to hold it on one hand, demonstrate\nit from one side. So what I want to do is make my hand disappear. In, in, in, like this. Okay, now it's totally engaged. Then come up and out of it. Here, here, here; it's totally engaged, and\nup and out of it. If I didn't do that, if I didn't hinge first,\nif I bent at the knees – I bend, bend, bend – you can still see there's nothing going\non here. Even if I try to hinge late, I'm not getting\nin there enough to cover the hand. To cover the pinky. What we're doing is we're placing all that\nstress down into that anterior knee, to the kneecap, to the ankles. They're not built for that. The butt, the hips are what are meant to do\nthat. So we'll do a few more. I'll come up here, come down, and I'll pop\nmy fingers right in here. You'll see the chest remains up, and out,\nbut your back isn't straight. Get your back straight, but it's not angled\nstraight up and down. Your back is angled instead here, forward,\nbut it's straight. It's not rounded. All right, the other thing that we'll do – this\nis a home exercise tip, and I stress 'home' because you might want to drop your pants\nfor this, literally. So if you don’t have a mini-band, one of\nthe things that people still tend to struggle on if they can't hip hinge, is a secondary\nweakness in their glute medias. So they can't allow the hips to stay in the\nright alignment as they drop down to squat because the glute medias isn't strong enough,\nand their knees start to cave in. So if you don’t have a mini-band, you have\nelastic in your pants, you can drop them down like this, just below your knees, push out\nagainst the elastic of the waist band, and then do the hip hinge. Now, if you're somebody that deals with knee\npain when you squat, if you combine these two movements together – the resisted movement\nof the knees and also the hinging of the hips with the hands – you're going to feel no\npain in your squat. Likely, it should all be gone because you\njust restored the normal mechanics and placed all that load into the glutes that are meant\nto handle this in the first place. Again, home exercise tip, guys. Don’t start dropping your pants at the gym,\nokay? Again, if you want to invest in the mini-band\nwe actually have them over at ATHLEANX.com. You can place them right around your knees\nand then go feel free to do them anywhere you want. In the meantime, guys, I hope you find this\nvideo helpful. These two little tips are very, very easy\nto do. You don’t need to do them with weight. You should start with them with just your\nown hands, and bodyweight just to reinforce the movement pattern. Once you master the pattern, then you can\nstart to add weight. Don’t jump into your heaviest weights. Own it at every step of the way, up to that\npoint. You'll probably wind up being, not just pain\nfree legs, but also better gains. If you're looking for a program that puts\nthe science back in strength, head to ATHLEANX.com right now and get our ATHLEANX training program. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover here\nand I'll do my best to do that. All right, guys. See you soon."
}