{
    "id": "ho-cSlb79BA",
    "title": "Arm Workout WITHOUT Weights (BICEPS AND TRICEPS!!)",
    "description": "Get jacked without weights - http://athleanx.com/x/absolutely-jacked Subscribe to this channel here - http://bit.ly/2b0coMW Arm ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The view certainly looks good from up here\nand you'd better get used to it. Especially if you want to build bigger arms\nwithout needing heavy weights because you can use your own bodyweight and certainly\noverload your arms. When you think about how much your body will\nweigh if you actually use it as a resistance, your biceps and triceps are no match. Let me show you a little circuit here that\nyou can do, that will put your biceps and triceps to the test without having to use\nany weights at all. The first thing we do is we get up on our\npullup bar. This is one of my favorite, absolute best\nexercises you can do for your biceps because we can direct constant, tie-motor tension\non our biceps using our body as overload. So more than I can probably curl. So I get here, I get my body on the bar, and\nI push away just a little bit so my arm is almost at 90 degrees. So now I turn this more into a chin curl – static\nchin curl – that you have to try to hold for five seconds. Now, as I work to hold this, obviously, I'm\ngoing to get negative eccentric overload as my bicep starts to lengthen out. We know that eccentric overload is necessary\nfor creating the micro-damage that's responsible for muscle growth. Strength is a different issue. When we're talking about muscle growth we\nget this eccentric overload here, I hold it 45 seconds, fight for everything I can. Once I get done with that I drop down to a\nbar that I have setup here. Now, if you're doing this at home use a broom\nstick over two chairs. Use the back of, or the underneath side of\na counter. Whatever you have to use. Here, you get down now and you slide out this\nway. A little bit further. Now we have an inverted chin curl. So from here, our feet are flat, come up,\nand now I'm curling once again. Now, from here I've got a little bit more\nof a challenge. 45 seconds, yet again. I try to hold, hold, and hold. Again, the tendency is going to be for me\nto have to give in to the weight, but I can't. I've got to hold myself up, squeeze as hard\nas I can, 45 seconds. All right, I keep going, keep going, keep\ngoing, and fight it. From here we head back up to the top. We go 30 seconds up there. We go 30 seconds back down here. 20 seconds up there. 20 seconds back down here. That's only half your arm though. Now we have to go to the other side. So what we do is, with this bar that we have\ndown here we do our tricep extensions. Again, we're going to have an exercise here\nthat will allow us to isometrically overload the triceps in the elongated position to hit\nthe longhead and have enough eccentric overload as our body tries to resist the movement down\ninto this stretched position. So they come down in here, I get right down\ninto this position here. Now, my bodyweight is lengthened out behind\nme, I have a lot of resistance here to hold it. Hold it. Hold it. Again, it's going to push me more into this\nposition. Stretch out the longhead. 45 seconds. Fight it. Fight it. You get all the way to 45, come straight down\nto the ground. Now we're working on that contracted position\nand you go right into our L-sit, or a modified L-sit. I'm just going to take my hands, press them\ndown to the ground right there, and hold. 45 seconds. You have to. You can see my heels are slightly touching\nthe ground. Very, very, very lightly. Oh, man! Not fun. Go all the way down, 45 seconds. 30, 30, 20, and 20. So guys, don’t let anybody ever tell you\nthat weights are necessary to create big arms. If you know how to use your own weight as\nthe resistance you can do plenty of damage in a short period of time. If you're looking for a complete training\nprogram that shows you how to use techniques like this, to take advantage of limited space,\nlimited equipment, or even just some of the techniques that you didn't know before; head\nto ATHLEANX.com and get our ATHLEANX training system. We also have our ATHLEAN0 program that doesn't\neven use any of this stuff. No bars, doesn’t need anything. No pullup bars either. That's over at ATHLEANX.com. In the meantime, I hope you've found this\nvideo helpful. I'll be back here again in just a few days. Leave your comments and thumbs up below. Let me know what you want to see and I'll\ndo my best to cover it in the days and weeks ahead. I'll see ya!"
}