{
    "id": "HpM6bRZY4Hc",
    "title": "ATHLEAN-X Gym Tour (STEP INSIDE!)",
    "description": "Train with the same programs the pros use here http://athleanx.com/x/pro-athlete-workouts Step inside the ATHLEAN-X training ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. You've asked for it. I'm going to do it here today. It's the 4th of July weekend so it's a good\ntime to step back and take a little bit of a break and give you guys a tour of the new ATHLEAN-X Gym here the X BOX, that\nyou guys have been asking about. You've noticed it in the training videos,\nyou want to know a little bit more about it. Well I figured I'd take you through so I could\nshow you why I selected what I selected. And give you an idea of what this place looks\nlike, you know. First of all, we've got a tract here of Turf. And when I'm training teams in here, it gives\nme a good open run to do Sled Pushes, or to do Sprints or just a good open area\nto do any kind of Ab work where we need some extra space. But this is our big, sort of tract of Turf. Then we have, of course our display screen\nhere. There's a lot of cool things that I can actually\ndo on that display screen. For the guys that have any of our programs,\nthey know that I spend a lot of time at that board. It's basically a large Telestrator. So I can actually break down, something I\nhaven't done yet is actually take somebody's performance, film one of my Athletes doing, let's say a\nSquat and then draw and physically show the most important parts about their form, and break it all down there, sort of like\nan NFL Telestrator type effect. And that's a very helpful thing. And starting right here in the corner, we\nbasically have our, first of all, we have our ATHLEAN-RX Supplements here. They're always on hand here. Guys that train with me know how important\nI think nutrition and supplementation is, especially in and around your workout. So we basically have our RX1, 2 in the back\nthere, Post Workout, Pre Workout over here and Nighttime Recovery and of course, our Athletes, while they're\nhere, with what I feel is obviously, only the best in Sports Nutrition. Then we have our Kettlebell racks, some Slam\nBalls, some miscellaneous, you know med balls right at the bottom. Right off the bat, well first of all you're\ngoing to notice, that there's always Sports on here. I mean this is what I do for a living so here\nmy beloved Mets. Of course you've got to pull for them and\nrout for them. They're here playing the LA Dodgers. But in the background here we have our Woodway\nTreadmill. And the Woodway, for those of you who are\nfamiliar with the treadmills, is definitely the best in the game. There's a reason why it's here. Because this training environment was meant\nto be equal to the best in the game. I spent many years in Major League Clubhouses\nand got used to the fact that, the best pieces of equipment were offered to the players so\nthat they could train at their highest level. Well I wanted to make sure that the same exact\nthing was available to the guys that train with me here. So there's no step down from what they're\nused to training with. This Woodway Treadmill, the greatest part\nabout it is this belt doesn't go on a deck. There's no deck under here. So it's basically suspended on air. So that allows us to have a really nice cushioned\nsurface, very low impact, safe, feels good for all the Athletes that run on it. So that's why this is here. Next we have a Glute/Ham Raise. Now the Glute/Ham piece is a great opportunity\nfor us to do Closed Chain Hamstring Training because our feet can be in contact there with\nthat backplate. And more importantly than that it gives us\nto train Hamstrings and Glutes together. And I talk about all the time about trainings\nthose two muscle groups together because they're meant to train together and basically drive the entire Posterior Chain\nby working together. And the guys that train Hamstrings in isolation\nare the guys that wind up having many many Hamstring injuries. Something that we work a great deal on here\ntrying to prevent, is Hamstring injuries. One of the most common injuries in Sports. And even just for our weekend warriors, Hamstrings\ncan be a big deal and a problematic thing. Not if you're training the right way and getting\nyour Glutes to work with your Hamstrings. So we have our rack of Dumbbells, you've probably\nseen these appear in previous videos. One thing you'll notice, yeah I'm pretty damn\nanal about how these things go back in the racks. I put them back in the order that their supposed\nto be in. And I don't know why in most commercial gyms,\npeople can't figure that out but it's pretty simple, they go from 5 all the way down there,\nup to 100 down here. And they just go up every 5 pounds. So if you can count you can put them back\nin the right way. Here is a Lat Pulldown Machine. I certainly love Pull Ups and I do a lot of\nweighted Pull Ups. But I just love the ability to lock myself\nin here on a Lat Pulldown and pull a lot of weight. And it's a low profile machine, it doesn't\nhave a lot of width to it so it fits in nicely in this gym. It's just one of the pieces that I like to\ninclude. Here, this is a remnant from what I actually\nhad back from a few videos ago and I kept it. Because it gives me the chance to still have\nthe Roman Chair setup but it was the Pull Up Bar until the rest of the stuff came in. Which I'll show you in a second. But this Roman Chair setup I actually use\nstill to do our Boxer Ab routine. I'll link it over here if you haven't seen\nit already. It's our routine that we use, it's a Crusher\nbut it works best off of a Roman Chair so we kept it. Here this is my machine that was sort of like\na special order piece for me. It's sort of my and some of my older Athletes,\nit's a Perfect Squat is what they call it, but what this allows me to do is, face in this way and basically put the pads\non my shoulders so it creates an environment where I can actually do Hands Free Squatting. So for me, I don't know if however long you've\nbeen watching me, but I have a pretty messed up set of Knees. They've been beaten up and bashed from doing\nyears of bad training, probably the number one impetus for why I created the ATHLEANX\nTraining System in the first place and why I even became a Physical Therapist,\nwas to try to learn more about maybe the shit I did wrong for many many years and fix it. And help others fix that now. The Perfect Squat allows me to actually brace\nmy own Knees, give my Patellar Tendons a little bit of extra support because that my hands\ndon't have to be on a bar, and I can still load up, with this plate loaded\nmachine, do some heavy Squatting but give my Knees a little bit of a break. And it doesn't compromise your form like a\nSmith Machine does because your body can move in any plane here as this thing arcs down. Alright so this upper piece will arc in the\ndirection that you like to move in. This is just a big overhead door, allows us\nto get the equipment in here. It can open up on a nice day. Got a True Bike here. Another way for me to train my Legs in a way\nthat I can still do a sort of a low impact approach but also train my Legs just by making that\nresistance a little bit higher. So obviously a little bit more of a lighter\ntraining effect there. But that's ok, it's still another conditioning\noption as well. Here you notice the Landmine setup and I'll\nlink that video again right over here where I gave you some unique Chest exercises you\ncould actually do with an Olympic Bar Landmine setup. And if you haven't seen that video, you're\ngoing to want to watch it. But this is a great piece and it's attached\nright to sort of the Holy Grail of the whole place which is our Double Rack setup. And our racks here are custom made, you can\nsee they're made in our black and red colors and this is the best that it gets in the business. They don't make anything heavier duty here\nand again I've talked about, there's some guys training in this gym with me, some pretty strong assed guys, I need my equipment\nto be able to stand up to the punishment that those guys can dish out. And these racks do just that. I have one sort of set up for Benching. And we span across to the other one that I'll\nset up actually for Squatting. But back to the one here, again we've got\nlots of different support options here. We have spotter plates back there. But then we can have, even if we decide to\ndo Pull Ups, I've got nutra grips set up, I've got wide grip, I've got a skinnier bar\nfor underhand. So lot's of different options. Our training bands, our ATHLEANX Bands hanging\nfrom here. Our red XTREME Bands there. The cool thing is we can actually do Resisted\nBench Press or Resisted Squats with the pegs that are on the bottom of the Squat Rack. Up top we've got our Angled Latter, sort of\nour American Ninja Warrior Ladder and then we've got our Straight Ladder. And again I've been going back to my days\nas a child, don't worry I'll explain that in one second, my childhood days, I used to\nlove the monkey bars, and just sort of being able to climb all over\nthe place. Well I still do this now but I'll make it\na little bit more challenging. I'll actually thrown either a weight vest\non or I'll put a weight belt on, a dip belt with suspended weight and maybe carry 45 pounds\nor 90 pounds as I do these bars to make it more challenging. That again as I talked about, that's our Sports\nTicker. And again I have to get all the updates. This is my business, it's not necessarily\na hobby for me guys, so I have to understand all the latest injury updates. I have to understand player movements, you\nknow player moves, guys getting sent up, sent down. But what's also cool is when we're training\nin this environment here, I can get my players all set up with their heart rate monitors, and actually have them display upon that board\nso guys can get an instant feedback on where their heart rate is depending upon whatever\nour training goal is for that day. It could be right here displayed on this board\nso it doesn't just have to be a Sports feed, it can be much more than that. Again over on this other rack here we have\na Jammer setup. So a lot of times Defensive Backs, Offensive\nLinemen, Defensive Linemen, they'll train in here and when we do we use those Jammers\na lot. If you haven't seen them, basically this allows\nus to load up here on one side and then press in an explosive way up and out, ok. It's just up and out in an arc. So if I get down in a, you know in a breakdown\nposition here I can come up, use my Legs and jam at the same time, which is a pretty functional movement for\nguys that especially like I said, Defensive Linemen, Offensive Linemen, Defensive Backs. So this rack, once again, I will set up as\na Squat Rack primarily so I don't have to keep jumping back between the two. Ah, I mentioned the TV's up there and the\nentertainment is always there. But of course we've got this place locked\nin for sound too. And we can turn it up when we need to. Little Metallica on right here. So it's a pretty cool place to train I can\nguarantee you that. And the guys that do train here we seem to\nget our work done. Let's just hear that first part. Probably the best band ever, for you guys\nthat always ask, Oh I wonder if Jeff's a metalhead? I definitely like Metallica, this is sort\nof my deal. But I do have LL Cool J Radio on here too. Just in case I need to get into that groove\ntoo, some old school R&B Hip Hop. So this is the gym guys and I've got one more\nthing I meant to show you. Hey Charlie come here. Charlie come here, get over here. You guys know Charlie here, this is the official\nmascot of ATHLEANX. Come on right here to the logo. Come here, ok are you ready to sit . Sit. Sit Charlie. And there he is, that's my boy. So Charlie joins me here at the X BOX. He's my best friend. You guys remember that Charlie's the one that\nhad, see he's tired already, he's the one that had the ACL issue on that knee. I'm happy to say, he's doing great and he's\non the mend, he's on the comeback. He's never been stronger. So he hangs out here and I love having him. But guys this is it. I basically wanted to put together a little\ntour for you here on this 4th of July weekend. Ah, it's kind of a time to just step back\na little slow video here but you've been asking for the video and a tour of the new place. So I figured let me show you what it's all\nabout. I can promise you this, there'll be a lot\nof great videos coming out of here. We've tried to up our production value for\nyou guys, you are loyal viewers who are almost at a million viewers by the time you're watching\nthis. And I think it's well deserved by you guys\nbecause you're the ones that have supported this channel. And have sort of forced the upgrade here from\nthe low quality videos that we started with to things that you guys can expect now, bigger\nand better things. That being said, whatever you want to see\ndone in this X-BOX, you've got to let me know below. What type of video, what type of questions\nyou have, and I'll do my best to make sure I bring the videos to you. And lastly as said, it's the 4th of July,\nthis all wouldn't be possible without our Independence and our ability to do some really\ncool things here and choose what we want to do for a living. This is what I chose to do, this is my life,\nthis is my passion and I thank any of those who had any part in creating our Independance\nhere, anybody that served who's allowed us to be\nable to do things like this, I feel Blessed. So guys, remember leave your video request\ndown below and I will do my best to bring them to you here on this channel. And I'll be back here in just a couple days\nto get those requests going for you alright. So have a great rest of your weekend. If you're celebrating the 4th of July, have\na great one. I'll see you back here soon."
}