{
    "id": "HsXeu9G7lQo",
    "title": "5 Muscles You’re TOTALLY Forgetting to Stretch (BIG MISTAKE!)",
    "description": "While we should all be stretching, there are likely 5 muscles that you totally forgot to stretch and that's a big mistake. In this video, I ...",
    "transcript": "So, let's face it, you don't have all day to \nwork out, and I get it. However, are you just   working out and forgetting to do maybe some of the \nother things that are going to make your body feel   better, namely stretching? Well, today I'm going \nto show you five stretches that you're forgetting   to do completely, and your body's paying the price \nfor it. I'm going to show you not only what to do,   but when the best time to do them is let's \nstart breaking them down one by one. \n  All right, so in order to help you out, I'm going \nto need you to do two things for me. First thing   is, pull up a chair and then take a seat. And not \nonly are we going to sit here and actually learn   what we need to do to fix these muscle tightness, \nbut we're actually going to do the first stretch.   And the first muscle that I want you to target \nthat you're forgetting right now is called the   peroneal muscles. And it's a muscle group actually \non the outside of our lower leg. And probably   if you just run your hand up and over this area \nhere, you might feel that it gets kind of painful.   Oftentimes, this muscle can get tight, people with \nflat feet, because as their arches collapsed down,   this muscle becomes shorter and shorter.\nSo how do we target this? All you got to do   from the sitting position is take the soles \nof your feet and put them flat together,   which is going to require you to roll them out. \nAnd from this position here, we've got a good   stretch because those muscles wrap under the \nfoot. Now I want to use our hands on the seat   and just try to stand up as much as we can, bring \nour knees together. You're going to be limited by   the tightness in this muscle and you'll feel it \nhere. And that's what you want that good stretch   for about a minute to a minute and a half. Now, \nyou can do this at any time of the day. You can do   it at night, as I recommend most static stretches, \nor you can simply do it during the day because   it's going to make you feel better. Just make sure \nyou stop forgetting this muscle altogether. \n  The second muscle you're forgetting all \nabout, I really can't blame you because   you can't even see it. It's not only one of those \nout of sight, out of my muscles, but it's actually   one you can't even touch. And we're talking about \nthe subscapularis because it's actually underneath   this shoulder blade. You can see it's the one \nthat runs right up under here and you can't   even palpate it even if you wanted to. But it \ndoesn't mean that it's not doing its damage by   becoming tight and we need to do something about \nit. And how do we do that? With one of these,   just a regular broom, a mop or anything, a \nPVC pipe that you could use as a dowel. \n  And all you have to do is just throw it over \nyour shoulder like this, as if you're carrying   a jacket. You line it up with the middle of your \nbicep, and then you reach in front and grab the   broomstick from the front side. And then you open \nyour chest up nice and wide and start to pull   up on that stick. And what this is doing is \nyou can see it's getting external rotation   at the shoulder. That subscapularis muscle is \nironically one of the rotator cuff muscles,   but it's the only one that internally \nrotates the shoulder of the four. \n  You obviously have a lot more inter rotation \ngoing on with other muscles too, so you want   to make sure you're doing your best to increase \nyour range of motion into external rotation. This   stretch is one that you can do any time during \nthe day. Hold it for 45 to 60 seconds. Make sure   you work both sides, and I promise the shoulder of \nyours is going to feel a hell of a lot better.\n  I think we all can agree that we've become pretty \nimbalanced people, at least pastorally. We lost   the war against gravity a long time ago because \nwe've let those anterior chain muscles pull us   down and forward without doing enough work for \nthose posterior chain muscles to create that   balance so that we need. However, it's actually \none of those anterior chain muscles that we never   even focus our attention on that's doing a lot \nof the damage. And the easiest way to fix that   is with one of these. Yes, there's actually \nstill a use for a physio ball. And the muscle   we're talking about is the rectus abdominals, \nthe abs. The function of which is to pull your   ribcage closer to your pelvis. It also tends \nto round out the upper back contributing   to this poor posture that we have. \nBut we can stretch it with this physio ball   simply by allowing ourselves to contour over the \nball. And you do that first by dropping your hips   down, allowing them to drop over the front side \nof the ball and pull those arms up over your   head. And what this is doing is creating that \nseparation that we're looking for between the   lower ribs here and your pelvis. That's going to \nplace a really nice stretch on the abs, 45 to 60   seconds at a time, 2 to 3 times a day, especially \nif you're demonstrating either that rounded   shoulder posture or if you just sit a lot.\nThe fourth muscle you're forgetting all about   is another one of those out of sight, out \nof mind, or actually out of touch muscles,   because this one is really, really deep and we're \ntalking about the QL or the Quadratus lumborum.   You can see that it's the muscle that attaches \nhere to your pelvis and then to the vertebrae   in your lumbar spine. And what it does is it \nhikes the hip up from one side or the other. \n  We oftentimes don't even sit right, right. We're \ndoing too much sitting as it is, but we don't even   sit properly because we usually choose one cheek \nover the other. And what happens there is when you   do it, you get that lateral shift and then that \nhip will get higher and shorten this muscle. So,   what are we supposed to do about it? Well, we've \ngot to stretch it. And the best way to do this   is what we call a QL slide, you get to this all \nfours position, you're going to slide one leg   back just like that, allow it to drop down to the \nground so that the outside of your hip hits the   ground. And you can see that muscle is actually \nbeing targeted nicely here, stretching from the   top of that pelvis and through that lumbar spine, \ngetting some of the lateral flexion that drops the   hip down, but also allowing you to post off of \nthis arm over here to intensify the stretch.\n  And again, we hold this for about a minute or a \nminute and a half, making sure we do both sides.   Not only will you start to feel looser in this \narea, but for those of you that have a lot of   back pain that's unexplainable, this is oftentimes \nthe cause. Start working this in and I promise you   you're going to feel a lot better. And that brings \nus to muscle group number five and maybe it's   actually one you even try to stretch and we're \ntalking about the lats. And if this is what you're   doing to stretch it, can I ask you to consider \nsomething different? I actually made an entire   video on how to stretch the last and it's actually \ngoing to help you to stretch that QL at the same   time, you can watch that right here. \nAnd if you haven't done so, guys,   make sure your click Subscribe to turn on \nyour Notifications, so you never miss a   video when we put one out. If you're looking \nfor a complete step-by-step program, we have   them all available over at Athleanx.com. \nAll right, guys, I'll see you soon."
}