{
    "id": "i1Ke14lne9M",
    "title": "Get Abs Like a Gymnast (AT HOME!!)",
    "description": "Get ripped abs like a shredded pro athlete here http://athleanx.com/x/get-athletic-abs-here If you want to get abs like a gymnast ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. So you want to get Abs like a Gymnast. Ok, well I'm going to let you in on a little\nsecret. The key reason why Gymnasts have much stronger\nAbs than the majority of us, is because they have the great ability to\nscrutinize their Core and Ab firing with every movement that they do. So what do I mean by that? Well, if you're going to do any type of lifting\nmovement, it could be a pull up, it could be a push up, it could be a deadlift. If you can't control that movement or initiate\nthat movement through the Core first, then you're going to lose power that you generate\nin the periphery, wherever that is, it could be in your legs for a deadlift, it\ncould be in your arms for a pull up, as it passes through that weak Core. I've talked about this before and I talked\nabout it as a concept called energy leaks. You can plug those energy leaks if you can\nsynchronize the firing of your core to occur first before any other peripheral movement\noccurs. It's how stability of the entire body works. It's how the kinetic chain passes energy up\nand down. And it's how you become the most powerful. So if we're going to get Abs like a Gymnast,\nwe need to start mimicking the ability to do that through the actual Ab exercises that\nwe do. So take a look at these two moves that you\ncan start doing right now. Right here is something that I call a Pike\nDip. Now the Pike Dip is actually a cool movement. Because not only can you do it in a gym but\nyou can actually do it at home too. And I'll show you how you can do it both ways. First off in the gym, the thing you want to\nmake sure you're doing here is, you stabilize your body, you straighten your arms out, you\nlock out the elbows. So that you're not being held back, at this\npoint, by the upper body strength but that you're focusing on the synchronization of\nthe Core firing first. So, now with our arms straight, what we do\nis we just try to pull up on our butt, we try to raise our butt and pelvis up against\nthe force of gravity. This will activate our Core. You'll feel it, believe me after just a few\nreps. I have a hard time getting through even 10\nreps of these, if I really concentrate on the lift and the hold. Now again, I mentioned we can do this at home\ntoo. All you have to do is just find a corner of\nyour kitchen counter, put your hands on each side of it, and do\nthe same damn thing. You can just go and lift your pelvis up, hold\nthat contraction. You're getting the benefits almost of a vacuum\nas well, as you try to pull up and under. That's the feeling that you should get. And you do the same thing here. You hold it for about 5 seconds each rep and\nyou try to complete 10 high quality reps. The next thing that you can do is the classic\nGymnastic L Sit. And L Sit really works out Abs, again it's\nlike an inverted V Up. We're able to stabilize our upper body again\nand utilize the strength of the upper body, but first you've got to make sure that that\nCore is doing the work. And you'll find that once the Core contracts\nand you can control that L Sit and hold it, everything else feels that much lighter. We've done videos before on the pull up too. Right, energy leaks. If you contract your Abs first, before you\ndo any set of Pull ups, you will automatically do more Pull ups than you were doing prior\nto contracting your Abs. You have to become a lot more aware of your\nown ability to contract and then move. Don't just move and then try to contract and\nreact. It's not the way it's going to be, it's not\ngoing to work that way. Alright guys, if you found this video helpful,\nmake sure you leave your comments and your thumbs up below. If you want to start training like an Athlete,\nif you want to get Abs like a Gymnast, you've got to train like an Athlete. You can do that at ATHLEANX.COM with my ATHLEANX\nTraining System. I show you step by step, exercise by exercise,\nand workout by workout, exactly what you have to do to start looking like an Athlete by\ntraining like one. Guys, leave your comments and thumbs up below,\nand let me know whatever else it is you want to see here on Washboard Wednesdays, I'll cover it for you, one video every week\ndedicated to Ab and Core Training. Alright guys, I'll be back here again soon."
}