{
    "id": "I2Mu3lpUfMY",
    "title": "Bodyweight Back Workout (SORE IN 6 MINUTES!)",
    "description": "Bodyweight back workouts can not only be done, but they can be brutally effective if done right. In this video, I show you a 6 ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. You asked for it. You've got it. The Sore in Six series, the bodyweight edition. We're going to start in the hard part. We're going for the back. A lot of people say \"Jeff, I don’t know\nhow to train my back without bodyweight if I don’t have access to a pullup bar.\" Well, what I'm going to show you here, today,\nI realize that anybody could go out and get a pullup bar, but I want to show you a Sore\nin Six workout you could do for your back using just a straight bar. Now you don’t need to have a big rack and\nan Olympic bar to do this. Forget all that nonsense. I've seen so many people do this same, exact\nexercise sequence using a fricking broomstick over the top of two chairs. You have no excuses, okay? The important part here though, is unlike\na pullup bar, it's not really that easy to do a mechanical drop set on a pullup bar,\nunless you want to start incorporating new equipment. Like a band to help offset some of your bodyweight. We're not doing that here. We're trying to keep this as minimal as possible\nand isolate this to just that straight bar. So here's what we're doing: you're going to\nget underneath this straight bar, and the positioning of your feet is going to be critical\nbecause it is going to determine your ability to keep this thing going for size minutes\nstraight. First, start out with your legs as far out\nas you can tolerate. The farther out your legs are – if they\nwere to be on your heels here, and your legs straight, that would be the hardest for you. Unless you actually even decide to elevate\nthem up, onto another bench. We're going to keep them on the floor. We're going to start out as far as you can. Each two minutes you're going to pull your\nlegs in a little bit closer. You're going to see why in a second. Then you're going to pull your legs in the\nclosest in that final, two minute segment. Three, 2 minute segments. 6 minutes total. Here's the exercises: the first one up is\na straight arm push down. This is one of the best things you can do\nfor your back and it's actually a version of a level here that we're trying to recreate. What you're going to do is you're going to\nallow your body to slide under the bar, but the key is where you're pushing from. You're not just extending your knees here\nto drive your body back. What you're really trying to focus on is pulling\ndown with your hands. The key is trying to fight that negative. Lower your body back down as slow as you possibly\ncan. Just 20 seconds, but give it your all. From there you immediately go into a one-armed\nrow. Center your hand on the bar. Again, your feet are out as far as you're\ngoing to keep them, and then pull your body up. As you go down eccentrically lower slow and\nallow your body to rotate a little bit to get a little extra stretch in the lats. Then you swap over for the final 20 seconds\nto that other arm and do the same thing. Now finally, after we get there to 1 minute\nwe have 1 more minute here in our 2 minute segments. Here, we're going to go back and do a plyo-inverted\nrow. So now, with your feet out as far as you can,\nsame spot, pull your body up as hard as you can. You get the benefit now of two arms. You should be able to do these. Even though you're fatigued. Now when you grab onto the bar fight that\nnegative again and keep going. And keep going, and keep going, and keep going. See if you can do these for the full 1 minute. If you need to stop and rest periodically\nyou can, but get right back up on the bar and go again. Now, what do we do from there? Bring your knees in just a little bit, bring\nyour feet in a little bit, and repeat that sequence of 2 minutes. Bring your feet in one more time and repeat\nthat sequence one more time with 2 minutes. See if you can make it all the way through\nhere. Here's your Sore in Six Minutes workout for\nyour back with bodyweight only. So there you have it, guys. The Sore in Six Minutes, again, kicking it\noff with the back. Look, it's not – bodyweight training is\nnot a compromise. It doesn't mean that \"Oh, man. I've got to train on my bodyweight, which\nmeans I'm compromising on the results I could see.\" That's straight BS. You can get great results if you know how\nto manipulate and train your bodyweight, especially if you can continue to drop through failure,\nand beyond failure by using techniques like we're using here. We have an entire program at ATHLEANX.com. That's our ATHLEAN-0 program. Guess what? It doesn't use a straight bar. It doesn't use a pullup bar. It doesn't use anything at all. Not a single piece of equipment. I wrote the whole program to understand and\nrealize that people may not have access to anything. I want you to be able to do it on a deserted\nisland if that's all you had. That's over at ATHLEANX.com, if you're looking\nfor a program that focuses just on using your bodyweight. In the meantime, if you've found the video\nhelpful, and if you're happy with the Sore in Six series with the back make sure you\nlet me know that, too. All right, guys. I'll see you soon, in just a couple days. By the way, guys. There Sore in Six minute penis workout. I promise you, there never will be. As a matter of fact, if it's taking you six\nminutes only, you're probably doing something wrong. All right, I'll be back. See ya."
}