{
    "id": "IitCDC9vrMA",
    "title": "WWE Sheamus Workout (BEHIND THE SCENES!)",
    "description": "WWE Superstar Sheamus recently stopped by the X-Box to train with pro athlete trainer Jeff Cavaliere. These are some of the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. I always say it: “If you want to look like\nan athlete, you’ve got to train like an athlete.” Today we’re training like athletes. WWE Superstar Sheamus, who’s actually a\nsubscriber to our channel – when I find out that information it always humbles me. But what’s even cooler is I get a chance\nto actually have these guys come in here and train. When Sheamus contacted me, he wanted to come\nin, he wanted to train in the X-box, we caught a lot of that on film. Actually, the entire video is on film. We’re going to release that on his channel. That will be over at Celtic Warrior Workouts. So, if you guys haven’t already subscribed\nto that channel, I’m definitely recommending you do. It’s got workouts he does with other WWE\nsuperstars. It gives you behind the scenes sneak peeks\nat what they do and I’m actually a fan of the channel. You can link to that and watch that up here. Make sure you’re subscribing and turning\non notifications because our video, the full workout with me actually going through all\nthe exercises with him and trying to hang with Sheamus himself is going to be viewable\nthere in the next 24 to 48 hours. In the meantime, I want to show you what that\nworkout looks like in action. SHEAMUS: It’s freezing. Jeff! JEFF: What’s up, brother?! SHEAMUS: How’s it going? How are you? JEFF: How you doing? SHEAMUS: Great, man. Thank you so much for having me here. JEFF: Thanks for coming, man. SHEAMUS: I’ve been super excited since I\nspoke to you the first time in our first conversation we had about my YouTube channel, Celtic Warrior\nWorkouts at ATHLEANX and I’ve been looking forward to this day for a long time. JEFF: I’m super pumped to have you here. SHEAMUS: That’s great, mate. Absolutely great. Love your workouts, big fan of your channel. As I said I’m excited to get to stop in\nand get to do a Jeff Cavaliere breaking workout. JEFF: In the ring, beating yourself up, heavy\ntravel schedule, not a lot of sleep, recovery; you need to be able to hit it, and hit hard,\nand get out of the gym, and go back and recover. We can do that. We don’t have to beat up your joints if\nwe use some exercises that actually lighten that load. But at the same time, still get that desired\nend result of getting bigger and getting stronger. SHEAMUS: Awesome, yeah. JEFF: We’re going to do a posterior chain\nworkout. It’s from the back of your heels all the\nway up to the back of your neck, up here. We want to get that stuff to work together. As athletes, I think that’s the area we\neither fatigue the most, we have the most amount of weakness, and we just don’t train\nit that much. SHEAMUS: Let’s do it. JEFF: Ready for the fun? SHEAMUS: Yeah, absolutely. JEFF: Let’s go. Drive through. That’s it. There you go. Lean forward. Pull them up this way. Lead with your hands so- SHEAMUS: Like that? JEFF: There you go. Hands up over your shoulder. SHEAMUS: That way. JEFF: Almost like you’re trying to toss\nthem back over your shoulders. SHEAMUS: Like that? JEFF: Yep. Okay, do you feel that posterior side there? SHEAMUS: I feel everything. JEFF: Just – yeah. Knees, let your hips drop back, forward, and\nthen throw- SHEAMUS: Oh, wow. JEFF: Then from there, just drop the hips\ndown. Just the hip, right, and then through. Right there. You see that? SHEAMUS: So from here-? JEFF: Just stay right to there. yep. SHEAMUS: Okay. JEFF: So, I reach across, reach across, you’re\ngoing to come and just – arms straight. So right here. There you go. Then you’re going to come up and out. There you go. You’ve got it. perfect. Perfect, dude. That’s it. Anybody can do them like this. That same person is going to wind up killing\ntheir lower back. What you’ve got to do is use your glutes\nto load the low back properly. That means instead of being here, you get\nhere. SHEAMUS: Okay. JEFF: Which is that hip hinge again, which\nprotects the low back. SHEAMUS: Okay. JEFF: Right over the top. Hands down. Get ready to absorb it with the other hand. There you go. There you go. That’s it. Head straight. That’s it. If your head stays straight, your hips will\nstay straight. Perfect. Feel that? SHEAMUS: It’s weird. It feels so weird. JEFF: It wants to twist you and you’ve got\nto teach your body to be more stable and prevent that. If you just think about what a muscle does,\nit allows you to make it work even harder. SHEAMUS: Right. JEFF: If we know it starts from way down here\nin our pelvis and goes all the way up to the back of our arm, we need to get our arm and\nour pelvis as far apart as we can to get the maximum stretch. If we have a good stretch, we get a more powerful\ncontraction. SHEAMUS: Okay. So here, right? JEFF: Yep. Drop back. Now reach around this part, get as far away\nas you can. Keep your head straight. That’s it. Let the other arm float. There you go. That’s it. Rotate the hips as you come through. There you go. Like that. That’s it. Nice, man. That’s perfect. This is your engine, right here. Drive it up. By the way, when this is stable this will\nwork better. SHEAMUS: Oh, sh*t. JEFF: Nice. We have a saying ‘you can’t fire a cannon\nfrom a canoe’. If the ground is unstable and you try to shoot\na cannon off that, there’s no way that thing is going accurately where you want it to go. If you can stabilize from the ground up – from\nthe base – now you’ve got something to actually work off. That’s what’s happening. You stabilize the glutes, the upper top part\nhere, and the back muscles will work more efficiently. Awesome. So from here? SHEAMUS: Yeah. JEFF: It’s a squat. SHEAMUS: Yeah. JEFF: Everything pulls through together. Right here, squat down, pull. You’ve got all your big muscles working\ntogether here. SHEAMUS: Here? JEFF: Yep. SHEAMUS: All right. JEFF: Sit down first. Sit down first. Then come up, then you’ve got to pull everything\ntogether. Pull up. That’s it. That’s it. That’s it. Come on! I said one of the key components to getting\nthe lats to work is not just getting that adduction of the arm down into your side. One of the biggest functions of the lats that\nwe saw in that single arm was to get back, behind the bar with extension. You can’t really do that if we stay vertical. If we go back to a leaning back pulldown we\nstay back here. That’s okay. You’re going to get that extension, but\nyou’re missing all that vertical pull of the lats. So, we have all that with the lats, which\nlets it stay vertical, but then get that extension. So, you bring it down here, and then when\nyou get to that point you drive the elbow back, down, and behind you, okay? Try to stay as vertical as you can. Back to here, and then pulldown. SHEAMUS: Okay. So, we’re going here, yeah? JEFF: Yeah, you’ve got longer arms than\nme. So, your arms are pulling straight. Try to stay upright. Pull it straight down, down through here,\nand you pull down on one side and squeeze. You feel that? SHEAMUS: Yeah. JEFF: Down, squeeze. You feel that? Each time it’s down it’s squeeze and rotate. Just like that, man. SHEAMUS: That’s crazy. JEFF: Yeah. SHEAMUS: That’s crazy. JEFF: Huge pulls. SHEAMUS: Just using that pulldown machine\nis a completely different exercise. That’s mad. JEFF: Sounds nice and sweet. Come down here. All we’re doing is getting our glutes contracted\nhere, we get our thighs up off the ground. SHEAMUS: Yeah. JEFF: Arms will stay up here, come all the\nway down, to your side, come back up, and touch. If you get seven and seven – in that 15-rep\nrange – we’re good. Isn’t it amazing how weak those muscles\nget on that back side? Think of how much you press out in front of\nyour body. That’s about 2.5lbs in that movement and\nchallenging that is. But that’s why we’re doing what we’re\ndoing. We have our conditioning exercise where – I\nlike battle ropes, but I think a lot of times people use the battel ropes- SHEAMUS: These are for Instagram videos like\nI have in the past, right? We’re going to do one like ‘Yeah!’. JEFF: Slam it as hard as you can. Again, what’s happening is, everything tends\nto be front side dominant again. We can make this more of an upper back activity\nby just slowing it down a little bit, focusing on what muscles are working, and get it to\nactually do that. So, you grab an underhand grip here. That’s it. Come on! Dig in. Four more, let’s go. Nice and high. Get in closer. Come in closer. There you go. Get those arms up high. Here, just doing a row. We’re just going to row this row. SHEAMUS: That’s cool. JEFF: I like to do it out of this position\nhere and swap about halfway through. 10, 9, 8, 7, 6, 5, 4, 3. Pull! 2, 1. SHEAMUS: Jeff, I’ve wanted to work out with\nyou for a long time. You didn’t disappoint me. This is off the charts. There’s no doubt working out with you today,\nthat’s the reason why you’re in the top of the game. Best in the world, right here. JEFF: So, there you have it, guys. Obviously, he left it all out there. Guys, I can honestly tell you this: when Sheamus\ncame in here, arrived at Hartford Airport, drove down, got in here late at night, we\nwere filming these workouts until 1:00 in the morning. He was still ready to go. He wanted to go a couple more rounds. I have to admit, I’m the one that copped\nout. I had to go to bed. The fact is, I’ve never seen a harder worker. I’ve never seen a guy more willing to leave\nhis ego at the door, and train, and learn, and train hard, and I think that’s why he’s\nas successful as he is. More importantly, I think that’s why he’s\nas good of a dude as he is in person. Again, I recommend you head over to that channel. Check it out and make sure you’re watching\nover there because our full video of the workout is going to show up soon. In the meantime, if you liked this video,\nguys, click thumbs up. Subscribe to our channel and be on the lookout. There is one more coming, and guess who gets\ninvolved? Jesse decides to challenge Sheamus. I have to tell you; the odds don’t look\nso good for him. That video is coming up next time on our channel. All right, guys. I’ll see you again soon."
}