{
    "id": "IKJWKJQXTuY",
    "title": "How to Fix Knee Valgus (KNEES THAT CAVE IN!)",
    "description": "If you have knees that cave in (a condition known as knee valgus) then you are going to want to watch this video. Whether your ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going to talk about knock-knees. Something more technically called \"Knee Valgus\",\nbut it's when our knees start to cave in, and you get that look that looks like a little,\nbaby bird. You probably don’t like it, but more importantly,\nit's causing, and wreaking havoc on the rest of your body. I promise you. But there are two types of this. The first – and a little less severe – is\nthe type that actually happens only when you do certain exercises. More importantly, the down, or bottom portion\nof a squat, but otherwise, you're good to go. You only see it in that bottom portion of\na squat. Versus the other people who walk around with\nknock knees all the time. They have that inward caving of the knees\nall the time. Both of them are going to cause a problem\nif you don’t fix them. I want to show you how to fix both of those. So let's start with the lesser of the two,\nand we'll get Jesse under the squat bar to help show that. So here we are now with a great view of Jesse's\nknees. JESSE: Hey, everybody. JEFF: Not what you wanted to see here, but\nI promise you it's going to be helpful to understanding what it is, when we talk about\nthat first, less permanent, more transient, or 'functional' valgus that we get. Especially on a squat. I want to show you why that really happens. Jesse, why don’t you come on and grab the\nbar. What's happening is, as Jesse goes down to\na squat, this is what you'll see. As he gets down lower, the knees cave in,\nand then as he gets back out the knees will go back out again. So show it again. In, they cave, and then they come back out. Go down. They cave in, and then they come back out. Why are they caving, and why are your knees\ncaving in like that at the bottom? Mostly it's due to a lack of strength in your\nquads. So similar to when I'm doing a bicep curl,\nwe know the hardest part of the curl is right here, in the middle of it. Where our arms and elbows are at 90 degrees. So what happens when I need to get through\nthat part of the range of motion? I either lift my arm up, to let the shoulder\nhelp me out here, or I lean back to let the low back help. But both of them are trying to lift the bar\nhigher to get me out of that range of motion. As soon as I can get past that part, then\nall those compensations usually go away, and I'm able to resume doing an elbow curl. What happens here at the squat – come down\nagain. When we're down in this position here, maximally\nloading the quads, right at that 90 degree, or a little bit lower position; if your quads\naren't strong enough here, they have to get recruitment and help. Go ahead. Then they will pull on the muscles that are\nin the best positon to be able to do that. That is the adductors, or the hamstrings. We know with feet in this position here – usually\nwider than shoulder width – and the knees tracking outward as you go down, into the\nsquat like that – the biggest stretch is on the adductors at the moment. So they can actually pull. Momentarily give you a little bit of that. He keeps coming up. Right past that point now, it's no longer\nthat difficult on his quads. So now they can get out of it, and he can\ncome back up the rest of the way. So it's compensation for usually having a\nweakness in your quads that can't withstand the load that you're putting on your shoulders. So the two easy ways to minimize that, and\nwork around that, number one – your ego isn't going to like this – it's to lessen\nthe weight that you're using on the bar and make sure you can command every, single rep\nwithout allowing the knees to cave in. Number two is going to be to narrow your stance\na little bit so you aren't putting the adductors at this mechanical advantage, and this ability\nto really do that, and – there goes Lucky. Bye, Lucky! To be able to kick in here, and help you at\nthe bottom. The next thing you can do though, is you can\nactually work to strengthen the hips themselves, which will be a better long-term approach\nfor everybody. Including the more severe group here, which\nwe're going to address now. So it helps to break out Raymond to show you\nwhat is actually going on, and why your knees are in the condition – hopefully not this\nbad – but he's got knock knees here. He's got knees that cave in. I'm saying that, these are things that are\nin a more severe condition. They're happening to you all the time. It's not just functionally, with a single\nexercise. So what's happening here? The first thing you have to understand is,\nwhen you look at the knee joint itself, it's not really an entity. It's actually just the result of two other\nbones that are making it up. I call this a consequential joint because\nit doesn’t really matter what you're talking about, in regard to knee, unless you want\nto talk about what's actually happening in the tibia – from the bottom – and what's\nactually happening from the femur, at the top. It's the reaction of what's going on with\nthose two bones that determines what's going on with the knee. You never want to look to the knee for the\nsource of the problem. You look above, and below. So let's start below because this is where\na lot of stuff happens. I'm going to show you on myself here, how\nflat feet can really, really contribute to this knee valgus, and what you need to do\nto fix it. We know that a leg that sits properly should\nlook like that. As the arch here collapses toward the ground,\nas it will, and it over pronates. As it will with somebody that has flat feet. You can see that it actually drives the tibia\nin with it. As this drives in, if this stays out here\nyou've got this gapping going on here, at the knee. You've got that valgus. So you've got that gapping, and knock knee\nbecause of this over pronation. All your bodyweight is driving down, and in. So if we can correct this then we have an\nopportunity to get this back out, and take some of that valgus stress away form the knee. If you look at the hip here as well, what\nwe can do is get some internal rotation of the femur in the hip – up here – that\ndrives this, again, down, and in, and creates this gapping here of the knee. From the top down. We need to address both the top, and the bottom. Let's start with the foot, though, and talk\nabout the flat foot condition, and show you how you can do some things to actually loosen\nup particular muscles, and then strengthen others to really start to fix this, and make\nthis better. So we have the feet again, from the bottom\nup. If we're going to try to work on this knee\ncondition here we've got to make sure we're fixing the feet from below because of what's\nhappening at the tibia, like I just showed you. Here's why it's so important. When the foot over pronates, what happens\nis this lower leg rotates down, and in, which brings the knee down and gaps it in like that. We know what happens is the muscles on the\noutside of the leg here get adaptively shortened, and tight because you're in this position\nall the time. Remember, this is the chronic form of this. This is the one you're in all the time. So these muscles get tight. So here's what I want you to do. The first thing is: you've got to attack this\ntrigger point that's located right on the outside of that lower leg there, as Jesse's\nshowing you. What you do is, you can either take your fingers,\nor you could take a lacrosse bar or something, and you put your finger on that spot. Then what you want to do is rotate your ankle\nin the direction he's doing here. So you're actually trying to floss that muscle\n– that perennial muscle – underneath your finger there. You'll want to scream, or jump through the\nroof if this is actually something that you deal with on a long-term basis here. This is going to be tight. On top of that, you also want to stretch this\nmuscle. So you're going to do the stretch here that\nJesse's showing you, too. You're going to cross your leg over, and then\nyou want to point your toes down, like you're trying to go up on your tippy toes. Then from there, you're trying to twist your\nfoot at the same time that you're pulling it down. You're trying to twist it up, toward the ceiling. The good thing here is because of the position\nof your hips here, into external rotation, any of the hip internal rotation tightness\nthat you – which you're likely going to, as you'll see – is going to be addressed\nhere, too. So it's a great one-two punch. But beyond that now you want to strengthen\nthe muscles that are probably becoming too weak here, and not helping you maintain that\narch. Therefore, it's not allowing you to keep that\nbetter position at the knee. So here's where you would hook a band onto\nyour foot and do some of the exercises here. Ironically, it's not just trying to strengthen\nthe muscle that's on the opposite side here, which is the posterior tib. That wall is functionally opposite of what\nyou're doing for the perineal muscles that are tight. I can tell you right now, the perineal muscles\nare also probably not strong. Your whole stirrup there is weak. So you want to strengthen them as well, and\nyou can do that with this exercise here. You're actually just trying to resist the\nmotions of inversion of the foot as you go and move your ankle in this direction. So the point being, your muscles got tight\nhere because gravity is pulling you down in that position, not because you're actively\npulling yourself down, into that flat footed position. You're just letting gravity win here. That's what's causing these muscles to stay\nin this shortened position and over time, become tight. So stretch them out, strengthen them on both\nsides, and you'll be moving yourself in the direction of fixing it. At least from this point, down. Now let's work on it from this point up. So if we've got the bottom up to the knee,\nnow we've got to work from the top, down. That means we've got to target the hip because\nthe hip is going to be what controls the femur here, which is really half of that knee joint,\nas we talked about in the beginning. I'm going to tell you right now, the number\none problem that's causing this knee, this femur, to internally rotate here is a weakness\nin the external rotators, or the abductors of the leg. I can tell you, it doesn't matter how much\nyou're squatting. It doesn't matter how strong you are as a\nsquatter. It doesn’t matter how much lunging you're\ndoing. Guys, if you're not paying attention to the\nsmall muscles of the hip here that allow it to be externally rotated, and control the\nexternal rotation of the hip, then you're not doing enough. I know this is the boring stuff, but this\nvideo was made to help you finally overcome this. So if you could commit to doing three, or\nfour sets, two, or three times a week you're going to go a long way to finally fixing this\nposition of the knee. As I said, consequentially this knee is getting\nkilled. It's getting destroyed here because of this\nposition. This 'knock knee' position. You trying to do anything out of that is a\nrecipe for disaster. So when we look at the hip itself, we've got\nto abduct it. So how can we abduct it? I like this side-lying exercise here because\nit can be scaled to all levels of strength. So if you start here, in a weaker position\n– we know it's weak – you're going to put your hands on the ground, you've got your\nfoot assisting you on the ground, and you're just trying to go into this side plank lift. You're really trying to abduct that hip on\nthe bottom there to start strengthening it. What I like, again, is that I don't have just\nstay there as I get stronger. It's going to become too easy. When I want to go a little more after advanced\nlevel strength here, then I can take away my hand, or even take away my foot and lift\nthat other leg up, off the ground entirely so all the work is now being done by that\nbottom hip, into abduction. So it's a great way to scale yourself and\nmake sure you continue to put the heat on that hip, and make it do its job. But beyond that, we also have to strengthen\nthose external rotators. What I like to do is take this band and wrap\nit just above the knee – not below, because we don’t want to torque the knee too much\n– put it above the knee. We allow ourselves – as Jesse is doing here\n– to get himself into internal rotation at the hip, as far as it can go. So the excursions, the amount of range of\nmotion that he has into external rotation, is maximized. As he gets into position here, now the exercise\nstarts. Now he wants to try and pull against the resistance\nof that band, get it all the way out here, as far externally rotated as he can, hold\nit for a brief count, come back in nice, and slow. Eccentric control is a great, great asset\nto have when you're talking about the hip because as you go down into that squat you're\ngoing to get internal rotation naturally. But you want to be able to eccentrically control\nit as well. So you want to make sure you're doing both\nhalves of that exercise. Most importantly, both of these exercises,\nto start correcting it from the top, down. Guys, you start from the bottom up, you start\nfrom the top, down; I don’t care where you start. But both of them have to be there because\nwe know the knee is a factor of both of them. So there you have it, guys. No matter whether your condition is more temporary,\nor more long term, you see here that the areas of attack you want to focus on are the same. You've got to work from the bottom, up. You've got to work from the top, down. Stop blaming your knee because it's not the\nproblem. Even though it's the thing that looks so messed\nup, that's not what's really going on here. You have to make sure you're attacking the\nreal root cause, and hopefully I've shown you a very simple way to do that. I've also put together a complete program\nthat likes to put the science back in strength, but in a way that allows you to find the things\nthat work, do only the things that work, and stop wasting time doing the things that don’t. All of our programs are built on that same\nprinciple, while at the same time helping you look like an athlete. At the end of the day, we want to perform\nand look better. Those are all available over at ATHLEANX.com. If you've found this video helpful leave your\ncomments below. Let me know what else I can help you with\nand I'll do my best to do that in future videos. All right, guys. See you soon."
}