{
    "id": "iPBTCm7urjU",
    "title": "Best Upper Chest Exercise (WITHOUT EQUIPMENT!)",
    "description": "Jacked chest without equipment - http://athleanx.com/x/jacked-without-equipment Subscribe to this channel here ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So you're training at home and you're3 running\na little bit short on your upper chest exercise options. Not after watching today's video. I'm going to show you how to draw on the use\nof dumbbells and barbells so that you have a great option when you don’t have access\nto them and it's really accomplishing the same thing. If you look at the actual exercise when you're\nusing a barbell, what is the main difference when you're doing a barbell press inclined,\nversus flat? It's the position of the arm. So if you look at what's going on with the\narms, the arms would be pressing this direction here, if it was a flat bench-press. But if we were to sit up at an incline the\narms are going to go in this position here, and they're going to push at that angle. Why is that? Well, to target the upper chest is clavicular\nfibers here that run from our clavicle – which is this bone right here. You might even be able to hear it knocking\non me. It runs down toward our arm. So to get here, it picks the arm up in this\ndirection. So when we come across our body and push from\nhere we're going to get more of that upper chest when we do that. So we can mimic that just by going to the\nfloor and doing the exact same thing. If you get into a pushup position here and\nyou preset the arms, now you're going to be able to put yourself in that same position. So you don’t get your arms underneath your\nbody this way. You put your arms out in front of your body\nat about that angle. Almost 45 degrees from where you start. Now if you're a beginner you would do this\nfrom this position here, on your knees. You're going to just let yourself guide down\nuntil your face is down between your hands, or if you're on a more advanced, you're going\nto lift up a little bit here into more of a pike position. You're going to still do the same thing. You're going to dive down, let your elbows\nflail out, and then when you push back, you push through the heels of your hands, and\nyou almost try to touch your biceps together. So what I'm doing is, I'm pushing through\nthe heels of my hand here, and I'm trying to bring my biceps together. Just like this. Here, and bring my biceps together. They're not going to actually touch, obviously,\nbecause my hands can't move. But what I am going to do is allow a little\nbit of that extra adduction of the chest to make this even better. I am going to show you one tweak you can do\nto make that better. The idea is, if I do this right toward you\nguys here, by coming down at this angle, I'm just recreating the incline bench-press here,\ndone, here. So I come this way, like this, hands close\ntogether, dive down, let the arms fly out, push back, squeeze, squeeze. Dive down, squeeze. Down, squeeze. Right in through here. Down, and squeeze up. Now, what was I talking about in terms of\nmaking that better? You can make it better by adding an adduction\ncomponent because we know that one of the biggest functions of the chest is to bring\nthe arm across the body. One of the major limitations to regular pushups\nand bench-press is that you always stay out here and you're never even worrying about\nthe adduction of the arms. Well, you can do it in a fixed position by\nnot worrying about what's going on with your fixed arms, but what's going on with your\nmoveable torso. So I could take my body and rotate it on a\nfixed arm to get adduction at the shoulder. So here's what it looks like. If I'm in here – and I'll do it on my knees\nhere to start. If I'm in here, I push down here, and as I\ncome up I rotate my torso to the right. So I'm just rotating my body to the right\nand you can see about how much of that is rotating this way. Down, come up, and I rotate. Now, what has happened here? I covered this with a flat pushup before. What's happened is, I've created that much\nadduction because I come down, and then I rotate here which creates a relative adduction\nof the arm against the torso. Your body doesn’t care whether it's the\narm moving on the chest, or the chest moving on the arm. It's just that you're getting the adduction,\nwith is a function of the chest. So you can see, when my arms are here and\nI rotate I'm going to get more of the activation of the full chest. Again, here, rotate, more activation of the\nfull chest. Then when we add that component of elevating\nthe arms we're going to get the activation of the chest all the way around from the upper\nfibers all the way down. So you can take this new move and input it\ninto any of your workouts at home and you've got a much better option for training your\nchest than just relying on regular, fixed hand pushups, or any other variation that\nyou might do. Even dips, once you're working a little bit\nmore of the lower chest, and of course, still with that same fixed hand placement with no\nrotation. I hope you guys see that there are no excuses\nthough, when it comes to training at home. Don’t let training at home be a limitation\non the results that you see because it's just not true. As a matter of fact, if you're looking for\na program that, step by step, lays it out, removes all the excuses, and also shows you\nthat you don’t need a single piece of equipment – no bars, no bands, nothing; not a single\ndumbbell. Head to ATHLEANX.com and get our ATHLEAN0\nprogram. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that in the days and weeks ahead. All right, guys. I'll see you soon."
}