{
    "id": "ItVl70_M544",
    "title": "“My Shoulder Hurts When I Bench Press” - NOT ANYMORE!",
    "description": "If you have shoulder pain when you bench press you are definitely going to want to watch this video. You may even think you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I think I'm going to have an incredibly\nhelpful video for lots of people because shoulder pain when bench-pressing is something that\nplagues a lot of people. I’m not saying you're unable to do the bench-press,\nbecause what's ironic about this condition is that we tend to keep pushing through the\nbench-press, even though we have some pain or discomfort on every, single rep. Now, if you look at me doing the bench-press\nhere, you might say to yourself \"Yeah, I get pain.\" But where? You can identify the different point in the\nrange. Do you feel it more here at the bottom? Or do you feel more of that twinge and discomfort\nwhen you get a little bit away from the bottom, toward midrange? Or maybe some people even feel it here, at\nthe very end. Guys, I'm going to tell you this: it doesn’t\nreally matter where you're feeling it. There are different structures that are responsible\nfor those different points in that range of motion where you're feeling pain. But guess what? You shouldn't be feeling pain at all when\nyou bench-press. But I have something that you need to focus\non that might be different than what you're focusing on now. We tend to focus on the structure. I've shown you guys here before, there are\na lot of structures in the shoulder in the bench-press. We have different things that can get pinched\non a bench-press. We could get the bursae that lays over the\ntop of the shoulder. Less frequently, but it can happen. We get the biceps tendon that lies in here\nthat could get pinched either at the bottom because we entre into internal rotation here\nat the bottom of the bench-press. Or even as we start to approach the end where\nthat bicep tendon can get pinched in there. Which could also cause come labrum discomfort. Or you get the rotator cuff that gets pinched\ninside here, due to impingement. Most likely here at the bottom. And because of its role in stability, that\ninitiation of the press from the bottom is where that unstable rotator cuff is going\nto come in and really become problematic. But guess what? Again, it doesn't matter where you're feeling\nit. The issue is that you're feeling it. I don’t like to blame the structure because\nif you had the stability in the shoulder you can offset even a damaged structure. I'm going to say that again. If the stability was there, even a damaged\nstructure would be protected because we know that one of the main roles that your body\nis supposed to have, in terms of the entire balance of the muscle of the shoulder is you\nshould have a centralized humerus here. Meaning, it should stay centralized in the\nball-and-socket. No matter how you move your arm around. It shouldn’t migrate up and start to pinch\nany of those structures. That's what happens. What needs to happen instead is that you have\nthe best stability in place to do this. So, here's a test for you. Anybody that has shoulder pain, do the following. Go grab – as you see me doing here – a\nlighter set of dumbbells. About half as much as what you would normally\nused for a 10 to 12 rep set. First things first, pinch your shoulder blades\ntogether. Create some stability. Get your shoulder blades together, and down,\nand back, and initiate that, and hold that throughout the entire repetition. Now, start to press. When you press, look at how slow I'm pressing. I want you to literally be mindful of every,\nsingle inch of the press. The goal is zero pain. Absolutely zero pain. To be able to press every inch, and be able\nto monitor, at any given point, do you feel any discomfort or pain? I'm going to guarantee something pretty phenomenally. For 98% of you, when you have shoulder pain\nwhen you bench-press, when you perform it this way; you're not going to feel any discomfort\nor pain. Why? Because you've just placed stability at the\nforefront of the exercise. You're not focused on the weight you're pressing. You're not focused on just getting the weight\noff your chest. You're focusing, first and foremost, on the\nstability of the shoulder joint as you press. By forcing you to slow down and be mindful\nof every, single inch in that repetition. The side benefit of this is a high degree\nof tension placed – where? Actually, on the pecs. As opposed to just trying to heave this off\nyour body. What is the utilization of this? Why is this useful? Number one, as I've said, it works as a test. As a diagnostic. Does it mean you don’t have anything wrong\nin your shoulder? You probably do. If you're getting some pain, you might have\nsomething wrong in your shoulder. But it's not necessarily that structure that's\ncausing the pain. When you slow it down and you stabilize that,\nyou're able to protect that injured structure with that stability. Meaning, regardless of what the issue is here,\nyou can still press without pain because of the stability that's protecting that structure. So, what you would do is, if you have bench\npress pain, you've got to slow it down. You've got to back it up a couple of notches. You've got to be willing to drop the weight\ndown and work on being able to press pain-free while you work on rehabbing and going back\nover the weaknesses that cause that. Where the instability starts to rear its head\nis when this painful structure starts to become a problem. So if you do your scap work, if you do your\nrotator cuff work, if you do your freakin' face-pulls; you can work on correcting that\nwithout continuing to re-aggravate the inflammation in here from working through the pain on that\npress. As you just saw, guys. I promise, like I said, 98%. You do not have to have the pain when you're\npressing. You don’t. You'll feel it here. Another thing you can do is try to let the\nego drop a little bit and work on building up that strength with stability by starting\nat – let's say I was using 40lbs and then go to 45lbs, and 50lbs, and 55lbs, and 60lbs\nand work my way up. Again, not tolerating even a single inch of\npain in that range of motion. You work your strength up that way and you\nstart to build the solid foundation as you're working on getting rid of that long-term problem\nthat's here in your shoulder. But don’t be so quick to judge that this\nis the problem. That your labrum, your AC joint, the bursae,\nthe rotator cuff tendon; that this is the reason why you can't bench-press pain-free. No, it's because you don’t have the stability\nto do it and protect that structure while you're trying to work on it and get it better. Guys, I hope you've found this video helpful. It is, again, something very enlightening\nwhen you go to try this because a lot of people – lots of people – have some sort of pain\nin their shoulder when they bench-press. A lot of you are now going to be able to do\nthat pain-free. Just by slowing it down and being mindful\nof it. If you're looking for programs where we build\nin the science behind what we do – because, as you're going to see right here, the science\nmatters. Explaining the differences here makes a whole\nhell of a lot of difference in how this exercise feels. It can have the same effect on everything\nyou do. All our programs are over at ATHLEANX.com. If you found the video helpful, leave your\ncomments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you in the weeks ahead. Again, if you haven't done so already, make\nsure you click 'subscribe' and turn on your notifications, so you never miss a video when\nI put one out. All right, guys. See you soon."
}