{
    "id": "jdFzYGmvDyg",
    "title": "Stop Doing Bench Dips Like This!",
    "description": "Bench dips are one of the most commonly performed exercises in the gym. Given their ease of setup, they are actually a great ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So today I'm going to show you the right way\nto do a bench dip so that you don’t shred up your shoulder in the process. I call the normal bench dip the \"rotator cuff\nripper-dip\". There's a reason why we actually put it in\nour exercise fails video. There's a reason why that video is funny,\nbecause we've all recognized it. Unfortunately, all too often. People do this version of the dip way too\noften. This is the bad version. A lot of people might say \"But Jeff, it looks\nnormal.\" That's the problem. This. Do you know what I'm doing wrong? Do you know what the problem is with this\ndip? You should be focusing right in on that shoulder\nand the problem is the position of this shoulder in relation to my trunk. It's way forward. You see how it's jutting here, forward? Also what's happening is we're allowing it\nto collapse. We're allowing our shoulders to hike up and\njust collapse on our neck, and then we crank out our dips from here. Well, what all that's doing is just really\nscrewing up your shoulder because it's taking all the structures inside that shoulder joint\nand compressing them as we press weight through our arm. If you look at Raymond over here you'll be\nable to see what I'm talking about. So this is the ball and socket, it sits in\nthis position here, you put your arm back, behind your body, and as soon as you put force\nthrough your hand you're pushing up into this joint. So you have some compression. But when you allow your shoulders to then\njut forward like this, you're pushing forward, and up. You're creating a lot less room for all the\nstructures that run through this little space up here. You have your supraspinatus tendon, your rotator\ncuff, you have your bursae; all this stuff gets inflamed and jammed up, against that\nspace. Then you start grinding up and down, up and\ndown, up and down. You're creating a lot of repetitive stress\nto that joint. That's not good. So if you're going to do the exercise the\nright way you've got to figure out a way to take that strain away. The first thing you have to do is, you have\nto externally rotate the shoulder because internal rotation is going to pull the shoulder\nforward. External rotation is going to pull the shoulder\nback. So the position of your hands is extremely\nhelpful. If I do this – which is what most people\ndo, they take their thumbs and they put them in this way, right next to their body – I'm\ninternally rotating. I'm almost giving myself no chance to do the\nexercise properly. If I take my hands and I turn them out, now\nwe're externally rotating. You can see the position of the shoulder as\nI turn out. It goes back. That's the first thing. The second thing is – I mentioned to you\nbefore – allowing your shoulders to collapse on your body, and on your neck. You don’t want that. If it collapses you could see that also throws\nyour shoulder forward. So what you want to do is, you want to keep\nyour shoulders down, and back. So if you look from behind here, the difference\nis, when I get ready to dip, if I'm collapsed here and I'm cranking out my reps like that,\nor if I set them down, and back here, and now I'm cranking out my reps you can see the\ndifference that the shoulders stayed down as the elbow is bent. Now, it takes a lot more force and contraction\nin the triceps to do this because now all the work is being done in the triceps. But that’s what you want in the first place. So when we're here you can see the shoulder\nstays in a much better position. It's not getting into this position here. So your biggest two keys are: positions of\nyour hands, and then the stability here, through your shoulders to keep them down, and back\n– depressed – as opposed to letting them ride up. If you do that and you crank out your dips\nyou get a lot more of what you're looking for, and a lot less of what you're not looking\nfor. Guys, again, I've always said that exercises\nthemselves – it's not just whether you're doing them. It's whether you're doing them right. If you're looking to be in this game for the\nlong term – meaning, being able to lift without injury – you've got to make sure\nyou get these things right. If you were doing this and you had no idea,\nyou might just wake up feeling worse, and worse, and worse progressively, over the course\nof many, many workouts and say \"I don’t know what happened.\" You didn't do one thing wrong. You did one thing wrong, repetitively and\nit snuck up on you. I don’t want to see that happen to you. If you want to train smart, if you want to\ntrain like an athlete, if you want to train the right way; head to ATHLEANX.com and get\none of our ATHLEANX training programs. I put a link below to our program selector. That will allow you pick the program that's\nbest suited to your specific goals, but all unified by the fact that I'm going to make\nsure – as a physical therapist – to train you safely, to help you get to where you want\nto be, the right way. Those are over at ATHLEANX.com. If you've found the video helpful leave your\ncomments and thumbs up below. If you want me to cover what was wrong with\nall those other exercise fails we did in that video let me know. I'll do that too, in the coming videos. All right, guys. See you soon."
}