{
    "id": "JDnttfZ0c1s",
    "title": "Do These 5 Bodyweight Exercises with Ease (CHEAT CODES!)",
    "description": "There are some bodyweight exercises that are as difficult as any weighted exercise out there. There are others that look far more ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to show you five bodyweight exercises\nthat are on the more difficult side of calisthenics exercises that are not as hard as you think\nthey are. As a matter of fact, I’m going to give you\nthe cheat codes. The tricks, the tips, the one thing you want\nto focus on – or two – that will make them a lot easier. They’re not throw away exercises, guys. These are all things that are going to add\na benefit to your training program as a whole. But if you can’t do them, you’re not going\nto be able to gain those benefits. With that said, let’s get started right\naway with the dragon flag. The dragon flag is a more difficult ab exercise,\nbut it’s actually more a glute exercise. That is the big problem here. If you’re looking for the cheat code stop\nfocusing so much on this side of your torso and focus more on what’s on this side of\nyour torso. That’s the key. If we look at the mechanics of the exercise,\nwhat we’re losing here is the opportunity to get the glutes to help out because you’re\ndisengaging them. If your hips start dropping in here, as you\nstart to get out straight, like that, yes; your abs are working to hold up your legs. But what really needs to be working are your\nglutes. They need to be squeezed up. If you think about only one thing during this\nexercise, make sure you’re not allowing your hips – as your legs get out – to\nstart sinking and dropping, creating this angle between your thighs and torso. Instead, if you squeeze your butt up you’ll\nstraighten that out so you have one straight line between your thigh and your torso. If you squeeze your butt up as hard as you\ncan, holding the rest of your body up will be infinitely easier. So, it should look like this. Come up. You can start high if you want it to be easier,\ncome down. Come down here. So, the secret is not necessarily the abs,\nbut the ass. The second exercise here is the explosive\npushup variation we call the “Hannibal Pushup”. It’s not as difficult as it may seem. The thought process is, you’re really trying\nto not think about exploding up to where you’re touching everything in one shot, but where\nyou’re cutting the distance in half. All I have to do is bring my hands from a\nposition here, to a position about here where my pelvis was. All I have to do is bring my toes from a position\nhere, to a position up here to where my pelvis is. So, I’m not trying to think about exploding\nto touch them together. I’m thinking about meeting in the middle. So, when I get there it’s not as difficult. The ground I have to cover is not as bad. I don’t have to explode as much as I thought\nI did to get there. So, I come down, come up, right in the middle. Exercise number three is the typewriter pullup. You’ve likely seen this before. It’s definitely amore challenging version\nof the pullup because you have to have more control of your body. Especially at the top, in the most difficult\nrange in the exercise. But don’t forget you do have another hand\non the bar. This is not a one-armed pullup. The other hand should come into helping you\nto perform this exercise properly. The other thing you want to do is make sure\nyou’re widening your grip here. If we’re going to be sliding side to side\nand you start off too narrow, you’re not going to be able to do that without having\nto change hand position, lifting your hand off the bar with all your bodyweight suspended. What you want to do is be able to slide with\nyour hands in position. So, first of all, get wide. Second, as I come up – and I’ll demonstrate\nthis in full in a second. As I come up and I slide myself to this side,\nthis hand is key. I want to utilize the strength of my wrist\nto give me some support on top of that bar. Just because I’m not holding this way doesn’t\nmean I’m not holding onto the bar. I am holding onto the bar with my thumb and\nmy wrist. So, you slide to this side here, you reengage\nthat hand, you slide that way, and extend the hand. Point your hand and your fingers out, away\nfrom you so you’re turning and getting the thumb down toward the ground to hook on the\nbar. So, it looks like this. I come up, wide, and then I go to the side. I can come back here to the side, to this\nside, to this side. Or I can come up angled and go right into\nit. That’s more of an archer. So, the key is getting wide, staying wide,\nand then when you’re up, realizing that this is providing a lot of downward force\non the bar to allow you to perform this. Next, we have the high box jump. You guys have probably seen some people do\nsome pretty impressive jumps here. This isn’t even all that impressive for\nthe guys that are really, really good at these. However, it would be challenging for a lot\nof different people. I will tell you this: you do not need a great\nvertical jump to be able to execute a high box jump. What you need is the ability to get your knees\nup toward your head or over your head. However high you can get your knees up and\nover your torso, the easier this is going to become. What we want to do is work on the hip flexor\ncapability. So, if I was going to warmup for this exercise\nwhat I would do is come up to the box, I’d lift my knee up into it like this, try to\nget as high as I could. And then lean in, really stretching out the\nmuscles in the posterior chain here that are going to get stretched as I bring my knee\nup and lean in. We want to get that knee up toward the head. Of course, I’ve got to do both sides. Then I’ve also got to realize I’ve got\nto get my hands, if my hands are going to be working for me, I need to think that my\nfeet have to come up toward my hands. So, I could stand here in place and then drive\nmy knees up. My feet up toward my hands. That way, to more dynamically warmup the movement. Finally, we know that we could do a deep sink\ndown into it to, again, get ourselves into position where our head and upper body is\napproaching our feet. The last key here is, after getting ourselves\nwarmed up that way, is to not forget to use our arms to do this. So, we’re using the arms that are driving\nfrom here, up as I lift. So, it will look like this. Come down. One more time. And then down. So again, really trying to get my legs up. I wasn’t jumping straight here, through\na vertical. I was bringing my legs up to try and get myself\nand my feet up on top of this box. Finally, exercise number five: the floating\ntuck planch as seen here. Now, I’m going to tell you guys. This not nearly as difficult as it may appear. That’s because we’re utilizing physics\nto perform the exercise, if we do it right. What we want to do is mostly focus on two\nthings. Number one: the position of our hands on the\nbox when we do it. We have some options. I could have my fingers faced backward this\nway. I could have them faced that way, or I could\nhave them faced out with a wider hand position. But there’s only one right way to do it\nbecause we want to make sure our hands are as close to our center mass in gravity as\npossible. In the case of this exercise, and many, it’s\nour pelvis. We want to make sure our pelvis is balanced\non our balance point here. So, if I have my hands here in this position,\nor in this position you can see the natural bend of the elbow is outward. With an outward bend of the elbow we see it’s\nnot nearly as good as it could be if we put our hands facing backward. Why? Because now when the elbows go back, they’re\ngoing right down into the pelvis. Getting really close to that center mass,\ngiving me a better balance on this box. Not to mention, we know when our elbows are\ntucked into our side, I can get a lot more lat engagement here for stability. What we don’t want to happen is to get up\nhere, balancing, and have our upper body wavering, or having our shoulder blades jostling up\nand down because we have no stability through the back. We want to have tightness through the back. So, if you do those two things it becomes\na hell of al to easier. So, I get my hands facing backward and tucked\nin, and then I get in position here. I’m going to lean forward so now I’m balanced\nover the top like that. Then once I’m there I’m going to lift\nmy knees up, continue to fall forward, and then allow my legs to go back, balancing and\ncounterbalancing the legs and feet with my head, and upper body. So, I’m in here like this. Elbows in tight. In this position here and press out. Come in, tuck, out, in, out. In, out, and down. So again, it’s a balancing act. Yes, you need to have adequate upper body\nstrength to be able to isometrically hold yourself there, but it’s not nearly as demanding\nas it may seem if you have the mechanics of the exercise wrong. So, there you have it, guys. There are five bodyweight exercises, not nearly\nas hard as you maybe thought they were. Now, I’ve given you some cheat codes to\nallow you to get out there and start trying them. Guys, if you’re looking for a step by step\nbodyweight only training program, no equipment at all required; that’s our ATHLEAN-0 program. It’s available over at ATHLEANX.com. In the meantime, if you’ve found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the days and weeks ahead. If you haven’t already, subscribe and turn\non those notifications so you never miss a new video when I put one out. All right, guys. I’ll see you soon."
}