{
    "id": "JiMdrw0KyVU",
    "title": "If You Could Only Do 1 Stretch... (BEFORE YOU LIFT!)",
    "description": "Train harder and smarter - http://athleanx.com/x/train-like-an-athlete Subscribe to this channel here - http://bit.ly/2b0coMW If you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we are going to talk about the stretch,\nbut I want to start by saying this: as a physical therapist stretching, and mobility work, and\nall those things have sort of become so non-prescriptive. They're just done randomly and people are\ndoing the things because they look cool, or that people have told them to do. That's a problem because if you don't need\na certain stretch, or certainly, if you don't need a certain mobility drill you shouldn’t\nbe doing it. All you might be doing is contributing more\nto your problem. That being said, what I'm going to show you\nhere today is going to help a problem that almost all of us have. I would say virtually every single one of\nus has a problem, where? In our thoracic spine. So what is that area? First of all, it's that area of your spine,\nthe mid-back. You basically – we all know we have our\nlumbar spine, which is our lower back, our cervical spine which is right here in our\nneck, and then we've got the rest of it. That's the thoracic spine. What we lose here is we lose the ability to\nextend through it. We get more, and more, and more, and more\nflex. You know what this looks like. You can probably look at yourself right now\n– don’t change your body, you probably just noticed that you're doing a little bit\nof this if you're sitting at the computer watching this video. So why do we have that? Because we spend a lot of time on the keyboard. Because we spend a lot of time driving. Because we spend a lot of time texting. Because we spend a lot of time with our hands\nin front of our body and we spend a lot of time letting gravity beat us as we go down,\ndown, down, down. So we need the ability to thoracically extend. Here's why: because when we can extend we\ncan also rotate. Try this right now. Get all the way down here, and then try to\nrotate. You're going to lock yourself up. You don’t have the ability that you do as\nsoon as I extend, now I can rotate much more freely, because I've unlocked my spine. I can also test how much movement I have at\nthe shoulder when I get here in this flexed position in the thoracic spine and I try to\nraise my arm up. I get locked. That's all I got. When I come up here and I extend, now I can\ngo all the way up back here more. I've got a lot more ability to raise my arm\nup safely over my head. So think about every exercise that impacts. Almost every, single exercise that you do. Lower body, or upper body. So why do we want to fix it? Well, we want to be able to have something\nthat we can do before a workout. You might be the type \"Jeff, I don’t want\nto do anything.\" Do this. It's going to help. You're going to fix thoracic extension and\nrotation at the same time. Take a bar, a dowel, a wooden bar, or anything. Lay on your stomach. Now we're going to use one side to post off\nof, and the other side to rotate toward. So what you're going to do is, you're going\nto lift up here, we'll use this side to post off of, and you're going to just keep your\nleg down on that side. So you're going to rotate here, all the way\nthrough, until you feel that stretch. If you let this leg come up with you you're\nnot really challenging the rotation in your spine. You basically just came and fell on your back. So you want to keep this one knee in contact\nwith the ground and come back. Now Jessie, if you'll come up on top of me\nyou can see that I've got full extension through my thoracic spine, or as much as I have. Which is better than just letting it stay\nflexed and stuck and I've rotated because I've kept my hips in one direction and rotated\nmy shoulders in the other direction. So I've got that rotation going on. Then we're just going to come down here. Again, it feels great. You're going to post up off this side here,\ncome up, and then rotate. Oh my God. So again, we've got extension through the\nthoracic spine, and rotation together. So do this about two, or three times in each\ndirection. Here, up, and each time you'll notice it gets\na little bit easier. I let me knee come up a little bit on that\none. Keep it down. Right there. All right. So again, too much of all this random stretching\nand mobility work going on. Especially, as I said, it gets under the skin\nof a physical therapist, but prescriptiveness is important. I can pretty much tell you that prescriptively,\neverybody needs to do this. If you just do this one little drill it will\nhelp you no matter what you're training that day. All right, guys. If you've found the video helpful make sure\nand leave your comments and thumbs up below. In the meantime, if you're looking for a program\nthat tries to do it the right way, tries to prescribe the things that you need at the\nright time that you need them; then head to ATHLEANX.com and get our ATHLEANX training\nsystem. If you've found the video helpful, again,\nleave your comments and let me know what you want me to cover, what else you want me to\ndo here for you, and I'll do my best to cover it in a future video. All right, guys. See you."
}