{
    "id": "JJAxStcNZeo",
    "title": "How to Get WIDER Forearms (WORKS EVERY TIME!)",
    "description": "If you want to get wider forearms you have to train the muscles in the forearm that are most responsible for their size. Often times ...",
    "transcript": "So, if you want to build a wider forums, whether \nyou're talking about this direction here or this   direction here, the good news is I've got you \ncovered today. Because there's a right way to   do it and maybe a much more right way to do it. \nThe thing you have to do first for me, though,   is not make the mistake of blaming your lack of \nforearm size on something that you can't control.   If you look at the forearms themselves, you \nshould notice one thing, that down here,   anywhere passed about this part of the forearm is \nmostly just tendons. The bellies of the muscle die   a lot higher up in the forearm. And therefore, if \nyou're looking at your skinny wrist and saying,   there's no way I can build my forearms up, instead \nof blaming that blame your parents because there's   nothing you're going to be able to do about \nincreasing your bone size. You're stuck there,   but you can do something here. And we want \nto start by talking about how we can get   more of this width here from top to bottom. \nThen we've got to look at the extensor side   of the forearm. And for me, there's going to \nbe two muscles that you want to focus on. One   is actually something you're probably not even \nthinking about right now. And the other one is   this and this is the extensor carpi radialis\nAnd I'm sure if you're training your forearms,   you're doing a lot of that because you're \nprobably doing a lot of reverse risk   curls with a dumbbell. That's great. \nHowever, when I pick up this dumbbell,   watch what actually happens because this is pretty \ninteresting. Just by holding this dumbbell here,   the muscle that pops out the most or fills the \nmost space in your forearm is actually this right   here. That's the brachioradialis and that is not \na wrist extension muscle because it doesn't even   cross the wrist it ends over here on the radius. \nSo, what we want to do is focus on flexion of the   elbow when we want to build up that muscle. \nNow, when I add the extension part here, you can   see that that muscle that you're trying to build \nthis extensor carpi radialis lies right underneath   that muscle. However, it's not all that big \nof a muscle. So, if you're trying to build   bigger forearms and increase their \nwidth, you really have to focus on   building up this brachioradialis. So, a lot of us \nhave probably used a reverse curl in the past to   do this and you'll grab a straight bar. And the \nnice thing about the straight bar is it's going   to full pronate your hand in order to grab it \nin this position here. And we know that there's   a synergy between the brachioradialis, the biceps \nand brachialis. And the more supinated we are, the   more the biceps is going to want to take over. \nSo, if we can get into a fully pronated position,   then we can kind of favor more of the work \nbeing done by the brachioradialis, and therefore   help to build it. The problem is some of us can't \nget in this position because of our wrists. So,   you would grab an easy curl bar from this position \nhere and we could see that we're less pronated.   So, we have a little bit of easement on the wrists \nthemselves and you would perform it with this. \n  Now, here's the interesting thing, the range of \nmotion on the exercise matters. Why? Once again,   because of that synergy overlap between the \nbrachioradialis and the brachialis. If we look   at the skeleton here, we can see that as we break \nhis arm, we can see that the brachialis is starts   up higher inserts just past the elbow joint. \nWhereas the brachioradialis starts lower and   starts all the way down here. Remember, it doesn't \ncross the wrist, so it has no impact on whether   you extend your wrist or you don't. \nBut what this is is important because   if we want to favor more brachioradialis, then \nwe want to decrease that range of motion. Why?   If I was going to try to pull this plate up, \nright, and I had a big, long lever like this,   this would be the brachioradialis. I don't get a \nlot of force capability to pull this up from here.   I'd be much better off coming real close to it, \nlike the brachialis and easily pulling it up.   But once I get it into this position here and \nit's up enough, well, pulling from back here   is very easy to keep that force going. So, \nif we can abbreviate that range of motion,   we're going to have that same capability. \nNow, the way we do this is we just start the   bar at our waist, and we turn this into sort of a \nreverse drag curl. So, we start here at the waist,   which is already going to cut down some of \nthat range of motion from that full extension.   Right? Making sure that the b brachioradialis is \ndoing more of the work and all we do is lift it   straight up. Okay, getting all that elbow flexion \nand you can see the brachioradialis is doing a   lot of the work right there in the form. But \nnow we mentioned that extensor carpi radialis,   that muscle that lives right beneath it. How do we \nwork it? All we got to do is just end this with an   extension at the top. So down slow, up, extend, \ndown to the waist, up, extend just like this.\n  So, you can see this will hammer both muscles \nat the same time and light them up in a way you   probably have never experienced before. That's \npart of the equation. If you want to go and focus   on really building this up, you have to also focus \non how you can lift more weight. And we know that   when we're in more of a neutral position, like a \nhammer curl, we're going to have a better line of   pull for the brachioradialis and we're going to \nbe able to overload it. So, of course, I don't   want to just do that lighter exercise. I do want \nto do heavier hammer curls. Just understand in   this position here, there's more work being done \nby the biceps and of course the brachialis because   we're getting away from full pronation. \nBut you still want to have that one, two   combination. Now, what about the other side? This \nside here, to build this up, this width. Here's   where a lot of people make a big mistake. Again, \nthey focus on all kinds of risk curls. Again,   doing it from this position this time. Good. \nBut realize that there's a bigger chunk of these   muscles responsible for something different, and \nit's going to be the action of the fingers. So,   if you look here, this is what happens when I just \nisolate wrist flexion. You can see what happens to   these muscles in the forearm. But when I do this, \nyou can see just how much more work is being done   in this area. So, if I'm not working on \nresisted flexion of the digits in the fingers   that I'm not really building these \nmuscles up to the full capacity. \n  So how can we combine them once again in the same \nway you come right here, you do this exercise.   You grab a cable, or if you're at home, you use \na band. I'll show you how to do that quickly.   But you put the cable in the distal part of your \nfingers just like that. And then I'm going to pull   down and get that clenching action that we're \nlooking at before. Pull down and then pull into   wrist flexion. So, all the way up into the fingers \ndown wrist flexion, just like this pull and down.   Probably one of the most intense contractions that \nyou'll ever feel on this side of your forearm.   And one of the best ways to actually build this up \nand what's nice is you get a chance with the stack   to be able to just increase the weight \nas you're able to handle more. \n  Now, for those that are asking. But Jeff, didn't \nyou say one time that letting it drift into the   distal fingers can overload that muscle to the \npoint where it causes pain in the medial elbow?   You're not going to be able to do that there \nbecause the loads are way, way, way, way, way less   than what you would do that with when you're \ndoing chin-ups or pullups or lap pull downs,   where when the bar drifts too far, it overloads \nthis muscle that it can't handle it.\n  Ironically, as you start to strengthen that \nmuscle with the exercises I just showed you,   you actually start to fortify yourself against \nthat injury happening when you go back to those   other exercises. So again, I mentioned if \nyou were going to do this at home, you're   just going to want to drop down. Same thing, a \nband hooked up to a pull up bar, come down here,   put it up into the distal fingers. Pull down \njust a bit, you're going to curl and then curl.   Make sure you work in the resistance through \nthe hand all the way down into the forearm. \n  Guys, if you're looking for more workouts, \nwe actually have a perfect forearm workout   that you can see here. If you're looking for \nfull programs, guys, we always put the science   into everything we do you can find them at \nathleanx.com. If you like the video guys   leave your comments and thumbs up. Make sure \nyou subscribe and turn on your notifications,   so you never miss a new video when we put \none out. All right guys, see you soon.   "
}