{
    "id": "jOVKYzJLf_s",
    "title": "8 Things We DON&#39;T Miss About 90&#39;s Bodybuilding!",
    "description": "The 90's were known for bodybuilders that rocked Zubaz pants, fanny packs and even sunglasses in the gym. Beyond that ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going to take a little trip down\nmemory lane together to look back at eight things we don’t miss at all about '90s bodybuilding. You see, we took an opposite approach a few\nweeks back when we took a look at the Strong Man era, but there are some things we actually\nliked. Here, not so much. And for good reason. JESSE: Whoa. We're going to – whoa. Whoa, whoa, whoa, whoa, whoa. What's wrong with '90s bodybuilding? JEFF: First, the fashion, maybe? JESSE: Zubaz will never go out of style and\nI think they'll agree with me. JEFF: I think we should just let the footage\nspeak for itself. JESSE: Sweet. I got you. I got you. JEFF: Whoa, what are you doing? JESSE: What it looked like you were having\ntrouble. I was just giving you a spot. JEFF: I'm fine. Honestly. I'm good. JESSE: All right. All right. JESSE: Whoa, whoa, whoa. JEFF: Dude, get the f**k off! JESSE: Dude. JEFF: Please tell me that was your fanny pack. JESSE: Yes, it's a fanny pack. Also, dude, you look like you could use a\nspot. I'm here for you. Anytime you need it, bro. All right? Anytime. Woo! Let's go! JEFF: Guys, let's face it, you take any trip\nto a gym back in those days and there were spots galore. You had a guy spotting on shoulder presses,\non lat pulldowns, and even wrist curls. JESSE: Go, go, go! You've got this! Let's go! JEFF: Look, I'm not opposed to a good, old\nfashioned spot on a squat, or even a heavy bench. But let's say it's a good thing that we have\nsome independence returning to training again. Hey, what's up? JESSE: What? JEFF: Is that your journal? JESSE: Yeah, it's really important to track\nmy progress. JEFF: Yeah, man. It is. Is this your last training block? JESSE: Nah, dude. This is today. JEFF: All this is today? JESSE: Yeah, it's like waging war on your\nmuscles. You've got to attack from every different\nangle. Pew. Pew. Pew. Pew. Pew. Pew. Pew. You know what I'm saying, bro? JEFF: For those of you not old enough to remember,\nthis is an article straight from Iron Man magazine circa 1995. And yes, I still own these articles. Don’t ask me why. This is a chest workout right here. All these exercises. 29 sets, in case you're counting, to be performed\non a Tuesday. Of course, if you flip it over, 31 more sets\nto be done on Friday. No. I told you I wasn't exaggerating. Hey, bro, are you almost done with these? JESSE: Yeah. JEFF: Can I use the bench. JESSE: Yeah, dude. When I'm done. I've got one more set left. If you want to wait right here so you don’t\nlose the spot. JEFF: Yeah, yeah. Cool. *snoring Guys, it only takes a little closer look to\nsee how much faster it gets worse when we talk about training shoulders here. We have a lateral raising going on. We have seated lateral raises. Standing lateral raises. Forward lean lateral raises. Back to standing lateral raises, in case you\nmissed it, I guess. The one-armed cable lateral raise. And of course, the pure, negative machine\nlateral raise. Guys, we weren't exaggerating here. There wasn't just a lot of duplication when\nit came to training in the '90s. There was a lot of pure 'suckiness' when it\ncame to training in the '90s. JESSE: Aw, s**t. Anabolic window, get out of the way! JEFF: All right, guys. This is one I've got to fess up on. As a former believer in the anabolic window,\nafter forgetting my shake at home I had to rush home form the gym, and in the process,\nI got a speeding ticket. I mean, you've got to get there before the\nwindow closes. But going 80 in a 25, not really the best\nway to do it. Although, desperate times do call for desperate\nmeasures. The more embarrassing part of this whole story\nthough? I was more angry about missing my window than\nI was about the speeding ticket. Guys, for the record, I've never actually\ndriven 80 in a 25before. I don’t advocate that you do either. Speeding kills. JESSE: Woo! Yeah! Let's go! JEFF: Bro, nice set. Nice set. JESSE: Oh, thanks, bro. JEFF: Water? JESSE: Oh, dude. Where's the nutrition facts on here? JEFF: It's…water. JESSE: I know, but I've got to see how many\ncalories, if there's any fat in it. Dude, I'm on a no-fat diet. JEFF: Bro, it's water. JESSE: Yeah, but…all right. Did you clean this bottle out? JEFF: Yeah. JESSE: Did you use blue Dawn? Because it cuts through the grease and gets\nall the fat that's already in there, out. If you already had fat in there, without blue\nDawn, it's still there. I can't drink this, bro. Too much fat. To the trained eye that's fatty water. JEFF: It's f**king water. JESSE: It's not just water! JEFF: Are you for real? JESSE: Dude, fat's good now. Carbs are the bad guy. JEFF: That's got carbs on it. JESSE: You f**king wrote this for me, all\nright? JEFF: Bro, you're so out of breath. Are you okay? JESSE: Yeah, man. I was just doing my curls. They're real high-intensity. JEFF: Dude, why don’t you try to mix in\nsome cardio or something? JESSE: Cardio? JEFF: Yeah. JESSE: Are you joking me? JEFF: Yeah. JESSE: Dude, cardio eats your gains. Everyone knows it eats your muscles. It's like a rabid dog. *barking* That's exactly what cardio does;\neats your gains, bro. JEFF: Well, I've got to say it's really nice\nseeing athletic conditioning making its way back into training because back in the day,\neven the walk to the water fountain in between sets was pretty much your cardio. But even then, you had to make sure you went\nreally slow because you don’t want to spike your cortisol. JESSE: Hey, bro. Jeff, come here. I need a spot. JEFF: What's up? JESSE: Listen, I don’t need a spot. I'm just trying to get in the corner. I've got some goodies in here, right here,\nfor you. This is what I use. I've got some pharmaceutical grade HGH. JEFF: You do? JESSE: The low dose – I do. Best of all, low grade beaver tranquilizer. Do you want any? JEFF: I'm good, man. JESSE: What do you mean, 'you're good'? JEFF: I'm good. JESSE: Dude, these are gains! Do you want gains?! JEFF: Dude, I'm good. JESSE: You don’t want gains?! This is where your gains are! In this bag! So maybe I could tempt you with this. A whole carrot cake. JEFF: Now, see? That's something I can get into. JESSE: Here, have a bite. JEFF: Sure. Great. Um, hmm…it doesn’t – there's kind of\na weird taste to it. JESSE: Oh, the carrot cake? No, no, no. That's not the carrot cake. That's because I put beaver tranquilizer in\nthe icing. JEFF: So basically, this gym here has got\npretty much everything you need. JESSE: This is bullshit. JEFF: What? JESSE: Dude, I'm supposed to be training abs\ntoday. I don’t see an ab crunch machine. JEFF: There are a million things you could\ndo instead of an ab crunch machine. JESSE: That doesn't answer my question. Do you see an ab machine in this gym? I don’t see one there. I don’t see one there. And I certainly don’t see one over there. Is there an ab crunching machine? JEFF: I don’t have an ab crunching machine. You – I'm going to go do hanging leg raises. You do – whatever. JESSE: Yeah. Like that's going to work for you. Go on a walk! Worst training session EVER! Dammit!"
}