{
    "id": "jv31A4Ab4nA",
    "title": "The PERFECT Shoulder Workout (Sets and Reps Included)",
    "description": "The perfect shoulder workout should consist of exercises for your front delts, middle delts and rear delts (not necessarily in that ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Continuing the series today, we’re talking\nabout the perfect shoulder workout. I have a guest here with me. Raymond. You guys know Raymond. Raymond, say ‘hello’. What’s up, guys? Raymond, ATHLEANX.com… Okay, enough. The fact is, guys, we’re going to use Raymond\nhere because, as always, we’re putting the science back in strength to show you how to\nconstruct the perfect shoulder workout. Of course, I’m breaking out the muscle markers\nin a second. I’m going to talk about that in just a little\nbit. The fact is, there are some components, just\nlike in our chest and bicep, and every other video we’ve done in this series, some requirements\nto claim the ‘perfect workout’. Right off the bat, if we’re going to do\nthis, we need to start including exercises that activate the shoulder properly, before\nyou train it. Why is it such a big deal here, when we talk\nabout the shoulder? Because the shoulder is a 3-dimensional joint. Not just that. If you look at Raymond here – this is why\nwe brought him – we have all the freedom of the ball-and-socket joint here. We get all this freedom in the shoulder because\nof the type of joint that it is. But it’s not just that. The socket is actually the shoulder blade. So, we realize all the muscles that are affected\nby the shoulder movement, we realize it’s not just things that attach to our humerus,\nbut also the things that attach to the scapula, too. So, there are so many muscles at play here. We need to know how to activate them and get\nthem to work together properly. The next thing we have to do is use the foundational\nstrength moves. For this particular muscle group, it’s the\noverhead press. You can’t get around overhead pressing,\nbut we want to make sure that even when we do that, we do it properly and we have a way\nwe can scale the weights when we do it. And then end with another important component\nfor neuro-muscular reeducation to make sure we’re locking in what it is we’re trying\nto establish with that first set of warmups. We continue on. We want to make sure, of course, that we count\nfor the stretch. Why is that such a big deal? Because in the shoulder itself, it’s probably\nthe biggest muscle group that gets avoided and overlooked when it comes to stretch. Why? Let’s take a look. If we look – breaking out the muscle markers\n– here at the shoulder, if I were to do this and push up here you can see the front\ndelt is right here. You can see that line right up, in through\nhere. Now, what I have in the back here – let’s\nuse a different color. What I have in the back is the rear delt. You can see that popping out. Down, and around like that. Then all the fibers coming down this way. Which leaves, in the middle, that big area\nof the middle delt. Which would be right in through here. They all come down and they all feed down\ninto this portion of our upper arm, right here. So, all of them feed down and around into\nthat point. Well, if I look at any movement of the shoulder,\nwhether it be a side lateral raise where my arm stops on the side of my body, or whether\nit be a front dumbbell raise where my arm stops here on the side of my body. Or a shoulder press where my arm stops, pretty\nmuch in the same position; they’re all lacking the stretch placed on the deltoid. Any one of those heads that we can incorporate\nif we do a few things. If I were to do some exercises like this – the\nfront delt raise – you can see if I take my arm back behind the body, look what’s\nhappening here to the fibers in the front delt. They’re getting stretched. Well, we’re going to do that and apply that\nto all heads of the delt as we go through this workout to make a perfect workout. We now also have to understand if you want\nto train yours shoulders, or any muscle in your body completely, and you’re going to\nfollow this channel; you need to train like an athlete. That means it’s not always about isolation. We talked about ways to hypertrophy a certain\nmuscle group. Sometimes dropping the weight down, leaving\nyour ego at the door, making sure you isolate that muscle to gain a maximum hypertrophy. However, if you want to be an athlete, at\nsome point you’ve got to figure out how to tie it all back together again. We mentioned all the muscles in the shoulder\ngirdle. At some point you’ve got to get those muscles\nto be allowed to train together to allow for powerful movements. I’m going to show you exactly how to do\nthat, too. Finally, face pulls. Guys, you know we can’t end a shoulder workout\n– especially when we’re talking about the rear delt – and not include face pulls. Let me put all this together for you, show\nyou exactly how to do this step by step. We kick this one off, like I said in the intro,\nwith that all-important warmup. It’s important because of all the freedom\nwe have in that range of motion in the shoulder. That means we’d better have it before we\nattempt to do these exercises. So, we have to warmup the shoulder properly. We do that with the overhead band press. It looks like an overhead press< but look\nwhere the resistance is coming from. It’s not from the ground up like a typical\ndumbbell, or barbell would be. It’s pulling you toward the front. That means you have to activate the muscles\non the backside of your body. The rear delt, and more importantly, the rotator\ncuff. This is a good activator to get your shoulder\nto start working properly. We know that we need the support of the rotator\ncuff because we do overhead activities. So, we want to warm it up. We do that here with a three second hold. Very deliberate. Good, quality reps. Two sets before we move on. We move onto, what else have we talked about\nin the beginning? The value of those foundational exercises. The ones that you can overload the most. Which, in this case, would be the overhead\npress. When we do our overhead press here, we really\nsetup to target four sets and we do it in a descending fashion. So, 10 reps, 8 reps, 6 and 6. Ideally, you’re going to add some weight\nto the bar and not just having fatigue bring your reps down. If you do that, again, we’re working on\ntrying to overall build our strength. Now, if you’re training at home and you\ndon’t have access to a barbell for a press, don’t think you’re getting off so easy. You can always do the handstand press. Guys, this is not easy. As a matter of fact, anybody that does this\nwill tell you it’s a difficult exercise. The key here is that we’re lighting up the\nentire shoulder girdle in a way that you can clearly overload. For some reason, if this is too easy for you,\nthrow a weighted vest on and you’ve just made this thing harder. Before we’re done, we come back one more\ntime to that same exercise here with the band. It’s done more as a reinforcer. Neuromuscular reeducation. You just went through this exercise with the\nweights, with that vertical force up and down, now you want to reinforce it once again. Get the rotator cuff awakened again. Make sure it’s working. So, we can integrate that better, and better\nfrom session, to session and make sure we avoid any of those injuries that usually come\nwith an inaccurate warmup prior to training. Next, we have to incorporate this stretch\nthat I said we’re often overlooking when it comes to shoulder training. We don’t do it, most of the time, in any\nof the other muscles that we train because it naturally works its way into the exercises. Here, as I mentioned in the shoulders, you\nhave to force it into what we do. But it doesn’t make it any less important. So, we can do that here in a tri-set. Basically, a 21. We’re doing cable raises. We’re doing them for the front delts, the\nmiddle delt, and the rear delt. Now, the key again is, where you’re finishing\nand starting. Not necessarily what’s happening in the\nmiddle because in the middle of the exercise it’s going to look just like what you do\nwith a dumbbell. But because of the cables, and because of\nhow we can position our body we can place a good stretch on the muscle as we do it. Watch as I do this rear lateral raise here. Again, a couple of things to point out. You guys know that I think in order to get\nthe rear delt the best you have to get extension of the arm behind the body. Get shoulder extension, and then let it come\nout in front of your body, across the front of your body. Get a full stretch. We’re not really going to do that if we’re\njust doing dumbbell raises. We’re going to stop at midline. But we work our way around from the weakest\nto the strongest. So, we have energy when we get to the 14th\nor the 21st rep. So, we go to the middle delt next. Again, I’m not just raising my arm up to\nthe side and dropping it like I would be in a regular dumbbell lateral raise. What I’m getting here is the position of\nmy arm behind my back, getting that extra stretch on the middle delt every, single time. You can see I’m starting with a big stretch\nand I’m exploding it out of there to get to the top. We wrap around to the front, we do the same\nthing. Again, by positioning myself in a split stance\nand allow my arm to go back into extension behind my body, I’m placing a better stretch\non the front delt fibers. So, I get that more powerful contraction when\nI come out of that position. So, it’s a different way to apply the same\nstretches that you normally would with a dumbbell and get the added benefits of the stretches\nthat are often overlooked every time we train them. Moving on, I mentioned in the beginning – and\nalways on this channel – if you want to look like an athlete, you’ve got to train\nlike an athlete. One component of that is that you have to\ntrain explosively. When we try to train explosively it’s not\ntime to try and isolate individual muscles. At this point, you want to make sure you’re\nincluding something that allows all these muscles of the shoulder girdle to work together. We can do that with a combo of a cheat lateral,\ngoing into a dumbbell push press. What we do is load up our weight higher than\nwhat we would normally use a for a lateral raise. Again, we’re not specifically looking to\nactivate the middle delt to do this exercise. We’re allowing the traps to help here. I’ve talked before about the trap strap. When you’re looking to strictly develop\nthe middle delt you want the traps out of it. When you’re trying to train power and explosiveness,\nyou want the trap to help because it’s trying to help. All these muscles are situated in this area\ntogether because they prefer to work together. At least have one component of your workout\nthat focuses on that. We’re going to do that with that cheat lateral. Again, we’re trying to eccentrically control. This weight is not out of my control. Even though it’s heavier, I get the chance\nto swing it up, but I have to control it on the way down. If I can’t control it on the way down, I’ve\nused too heavy of a weight. But I go right from there into a dumbbell\npush press. I clean it up to my shoulder, and now I’m\ntrying to press up overhead explosively. I’m allowing the legs, I’m allowing the\nhips, I’m allowing my entire body to help me in this movement. Just like I would if I was out in the field\nof competition and I had to push somebody, or something away from me. I’m not just going to try and isolate the\nmiddle delt. I want all the muscles at my disposal to kick\nin. We’re going to do that and take advantage\nof that in this set. We take that for three sets on each arm to\ndouble failure, and we move onto the last exercise here, which is the cable face pull. I’ve talked about it – I’ve made a whole\nvideo on it – on why you should end every workout, not just this one, with the face\npull. Of course, it’s going to show up here and\nwrap up the perfect shoulder workout. The key in doing this exercise is your mindset. I have for your to do three sets of 15, but\nyou know what? You should focus doing 15 sets of 1, three\ntimes. Which means, quality trumps everything. Make sure that every, single rep you do, you’re\nnot focused on pulling, but keeping the knuckles facing backward to demand external rotation. And to provide that support for the shoulder,\nto incorporate the rotator cuff with the rear delt. These are so important. Again, you’re not just trying to throw these\nreps away and call them a finisher and be done. You’re not looking for a burn. You’re looking for high quality repetitions\nevery, single time. So, there you have it, guys. The perfect shoulder workout to make sure\nyou hit all heads of the delt – oh. This, here? A little bit of a casualty. If you haven’t been following me on Instagram,\nguys, you’re going to want to make sure you do that – @ATHLEANX – to see the whole\nstory of how that happened. I’ll leave it at this: you’ve got to at\nleast see what I did to Jesse. I’ll leave it at that. Guys, the fact is, if you’re looking for\nscience-based training, this is the place to come. If you haven’t already subscribed to our\nchannel, please do so. And turn on your notifications so you never\nmiss a video. If you’re looking for science-based workouts,\nstep by step, day by day; that’s what we do here all the time. All our programs are available over at ATHLEANX.com. In the meantime, let me know what you want\nme to cover. I know there are other muscle groups you want\nme to cover in this series. Just let me know and I’ll make sure I do\nthat for you. If I have to break out Raymond – say something,\nRaymond. Say something, Jeff. Okay, whatever. This guy – he’ll be here to make sure\nthat we cover everything you need to know. All right, guys. I’ll be back here again in just a few days. See you."
}