{
    "id": "jyFMBf-SrHs",
    "title": "Trap Workout (SORE IN 6 MINUTES!)",
    "description": "Get the complete program - http://athleanx.com/x/all-included Subscribe to this channel here - http://bit.ly/2b0coMW If your trap ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The Sore in Six Minutes series continues,\nand this time we're hitting the traps. It's a six minute sequence that you're going\nto do. Again, simple in terms of how we structure\nit, but the effort is going to be something that you're probably not accustomed to, and\nthat's great because this is what we're going to use. The overload, the uncomfortability here to\ndemand a change, and to demand that soreness the next day. Now, how are we going to do it? We're going to go with the old classic, the\nbarbell shrug. We're going to load it up to – not your\nmax weight here, guys, because when you see what we have to do you're going to understand\nthat the volume is going to impact that ability to use that. But you're going to use a heavy weight. For me, here, it's 245. So again, we're not breaking records, but\nit's something I'm going to have to sustain for a long period of time. I'm going to start the clock, and I'm going\nto let it run for six minutes. So it's just a running clock for six minutes,\nand I'm going to start with the barbell shrug. What I want to do is be able to do 10 shrugs,\nand then hold for 10 seconds. Then nine shrugs, and hole for nine seconds. Then eight shrugs, and hold for eight seconds. Realizing that even if your traps give out\n– or don’t give out – your grip is probably going to. So at some point you're likely going to stop. When you do, you're going to work on another\nexercise. I'll show you in a second, but when we do\nthis shrug here's one key thing I want you to focus on: you load the bar up, you shrug\nup here, and then when you come down allow your shoulders to protract. Allow them to come down at that angle, okay? So when they're here they're up, and then\nallow them to protract. Why are we doing that? Because the traps insert here, on the lateral\nportion of the clavicle and the acromion. So when this part moves forward we're getting\na greater stretch on the trap. So if we can let that protraction occur, we're\nnot talking about doing rolling of the shoulders. We're talking about just allowing them to\nprotract. Then when I come back up I'm not just lifting,\nbut I'm retracting at the same time. The key is, we're getting more of that eccentric\noverload and tension with every rep. up, and then eccentrically overload down. That's going to help us to create that damage\nleading to soreness later on. Now, I mentioned if I had to stop at some\npoint. Well, if I do then I come over here and grab\na plate. For me, I'm using 25lbs. the 25lbs will do an overhead trap raise. So we'd basically hold the plate here, like\nthis, and then basically hands down, thumbs pointing down. I'm going to then go thumbs pointing up at\nthe top, okay? Then down, under control here, and then up. What you want to do is squeeze your traps\nto do the raise. So I'm squeezing my mid-back to raise the\nplate up, and then come down. This is actually working the lower traps. The upper traps are being worked this way. Up on the shrug, the lower traps are being\nworked here to stabilize the scapula as we lift up overhead. You do 10 reps of the overhead raise, go back\nin here and resume wherever you left off. So if I did 10 and I held for 10 in a contracted\nposition, nine, held for nine, eight, held for eight, couldn't get to seven; I go over\nhere, knock out 10, come back in here, seven reps, hold for seven. Now, I'm going to play it all out for you\nas I did it, which is a lot of where it left me – out of breath, as you can see – and\nI'll show you exactly how we execute it and how it looks in real time. There you go. So there you have it, guys. There is your Sore in Six Minutes trap workout\n– trap sequence, really – and people are already asking \"Where do I fit these in?\" I'd like to think of them as plateau busters. If you're someone that can't get a muscle\nto respond and you don’t feel that you're getting any response from that muscle because\nyou never get sore in it; these are guaranteed to induce that soreness. Is this the only way you could do soreness\nand induce soreness? No. Does soreness equate, all the time, to new\ngrowth? No, but because we're overloading, and because\nwe're putting the science back in what we do when we do this exercise, and we get that\neccentric stretch, we are adding the elements to grow. At the same time, when these are intense you\ndon’t want to start mixing multiple Sore in Six Minutes together. You're going to be biting off more than you\ncan chew, okay? So make sure, again, you're using this spark\nand get yourself out of that rut, instead of using them as your workout all the time. Guys, if you're looking for a program that\nlays out exactly what to do step by step, day by day; head to ATHLEANX.com and get our\nATHLEANX training program. We manipulate the volumes, we issue you the\nworkouts as we know you can handle them, and not just throw it all out there at random. All right, those are over at ATHLEANX.com. In the meantime, I know you like the Sore\nin Six Minutes series. Continue to let me know what other things\nyou like to see and I'll do my best to cover them in these future videos. All right, guys. See you soon."
}