{
    "id": "k8mkr459wA8",
    "title": "7 Minute Triceps Workout (JUST DUMBBELLS!!)",
    "description": "It is possible to build bigger triceps with a 7 minute triceps workout and a pair of dumbbells if you know how to do it. In this video ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to show you how to absolutely\nannihilate your triceps in less than 10 minutes. You only need one – at most, two – pairs\nof dumbbells. You can do it at home and it’s going to\ntake you less than 10 minutes. The thing is, we’re going to put the science\nback in strength, as we always do. We’re going to utilize mechanical drop sets\nhere to allow you to keep going even as the fatigue mounts through this quick workout. Second, I’m going to show you why, and how\nto preferentially hit the longhead of the triceps, the one that accounts for the majority\nof the size and bulk of the triceps themselves, and by doing so, allowing you to see and use\nexercises that hit it in its most effective ranges. Both in its stretched position, and in its\nfully contracted position. They key is putting it all together, showing\nyou how to do it step by step, knocking it out, and then when we come back I’ll tell\nyou exactly why this works as well as it does. You thought I was kidding when I said it was\nbrutal, huh? Well, I’ll tell you this: it is, but it’s\ngoing to work. You guys know that the ‘what’ is never\ngood enough for me either. The ‘why’ is important because when you\nunderstand why these things work they become that much more empowering. What we’re looking at, the first thing I\nwanted you to notice from that workout is, you’re going from, and changing a position\nof your body. From lying on your back, to being upright,\nto get into this prone, or semi-prone position. One of the reasons I do this is because I\nwant to make this exercise and workout entirely memorable. We know that we’re doing two exercises in\none position, two exercises in the next, and two exercises in the next. There’s a bit more ease to recall we can\nget from having it setup that way. Beyond that, we go back to that whole concept\nI said about mechanical drop sets. If you look at this first combination here,\nyou have the dumbbell lying tricep extension, into the dumbbell close grip bench-press. Let’s say we select a weight that allows\nus to fail at a 10 to 12 rep range on the lying dumbbell extension. We really shouldn’t be able to do anymore\nreps from our triceps if we’ve reached failure. That is unless we utilize a shortened moment\narm. If we take some of that length away, the distance\nfrom the dumbbell to the triceps, and we shorten it by bringing it up over our chest, we can\nutilize the same weight, and continue to rep out by alleviating some of that load on the\ntriceps. We do that now, and we move onto the next\ncombo here. The next combo, now we’re sitting up and\ndoing the overhead tricep extension into the dips. By simply placing the dumbbells on the ground\nand giving us something to push off from. The best thing about this combo, as we mention\nagain, the longhead of the triceps. In this combo we’re actually taking it through\na fully stretched position by having our arms up over our head, into a fully contracted\nposition by having our elbows back behind our body, when we get into a fully straightened\nelbow. Once again, we’re able to utilize a mechanical\ndrop set. Not necessarily by changing the moment arm,\nbut by having a loaded versus an unloaded exercises option to drop down to. Remember, when we’re doing this overhead\nloaded position, you guys know how I feel about this position when it comes to the shoulder\nand shoulder health. We don’t want to have our arms all the way\nback here, stretched, trying to lift this dumbbell up. What we do is, we’re placing our arms in\na lot of internal rotation to get into that position. Instead, if we let our elbows drift forward\nhere and we work it, we’re still getting the same effect on the tricep. No matter whether I’m going way out to the\nside, or whether I’m going in here more with the elbow forward. The key is that we’re alleviating some of\nthat unnecessary stress that we have to put on our shoulder to do so. Finally, we drop into that final combination\nhere. That is the kickback into the close grip pushup. The benefit of the kickback here is, once\nagain, I’ve always talked about how I think this is one of my favorite exercises for hitting\nthe tricep because we get that elbow back behind the body to get that full contraction\non the triceps. By actually getting the longhead into its\nfully shortened state. Something that we don’t get through every,\nsingle tricep exercises we do. Especially not from just rope pushdowns. Once again, mechanical drop set. We can take an exercise that’s weighted\nand go to an exercise that’s unweighted – like the bodyweight tricep pushup – and\nrep out and continue to go even further. Now, we’re taking a one-minute break between\nthese combos so we can recharge ourselves to get the most out of it, and there is that\none opportunity that you have to switch the dumbbells right before that final combination. We do know that not a lot of us are strong\nwhen it comes to the tricep kickbacks. So, you might want to have that secondary\nset of lighter dumbbells here. But even if you did it and you carried through\nthe same dumbbell that you used from the first exercise, you’re just going to limit the\nrep total that you can do at that stage of the game. So, there you have it, guys. A quick workout for you that you can do in\nless than 10 minutes with a single set of dumbbells, or two, and it’s going to work. Guys, you know if you can put the science\nback in strength it’s going to unlock a lot of potential you’re probably sitting\non right now. I know how much more all of us have. We do have an athlete inside of us, we just\nneed to be able to unleash it. By putting science in our training plans,\nthat’s how you do it. If you’re looking for a step by step plan,\nguys, I have it all available for you at ATHLEANX.com. In the meantime, if you haven’t already\nsubscribed please do so, and make sure you turn on your notifications, so you never miss\na video from us. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the days and weeks ahead. All right, see you soon."
}