{
    "id": "k_x9xc6ot2s",
    "title": "12 Minute Workout for Muscle Mass (HIT EVERY MUSCLE!!)",
    "description": "Build muscle size while getting ripped in 90 days here… http://athleanx.com/x/get-size-and-cuts-at-once If you want to build ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. This is what happens when you forget to film\nthe intro before you do the workout, but it leads to an important point. What happened in this workout you're going\nto see today is what left me in this position right nw. out of breath, barely able to talk. I'm doing it with just a barbell and a set\nof dumbbells. Guys, you can build muscle mass if you want\nto trade in some of that workout length for intensity. Let me show you exactly how it's done. Alright, so first exercise we're going heavy. Mass building the exercise. Start with the cornerstone heavy exercise\nlike the deadlift. The deadlift, for me, it's a leg exercise\nfirst and foremost. That first push and pull off the ground – it's\na push – I'm pushing with my legs and then of course I've got my low back, triple extension,\nmy gluts, my traps, everything helping me to power this up. Pretty heavy here for me. An 8 rep max. I'm trying to get heavy weights done quickly. Now I come over here, now we have to shift\nthe focus. I'm shifting to a pushing exercise to give\nall my pull muscles and my lower body a break. So we're going to a classic dumbbell inclined\nbench-press. So rom here I'm trying to go for about a 10\nrep max here. Now, there is a metabolic carryover from the\ndeadlift that I just did. So it's going to make what's traditionally,\nmaybe, might be your traditional 10 rep max; it might be a little bit less. Especially as you pile up round after round. So, here I'm working on my 10 rep max, I drop\ndown, and I grab one dumbbell and I bring it over with me to do a really cool exercise. It's a hybrid of what we call a dumbbell shovel\ncurl. The shovel curl is done with both hands on\nthe handle and it basically mimics a cross-body hammer curl. So we're working forearms and biceps, brachialis,\nbut then we've got to make it a little more difficult by going over the top with our press. In the press there's a lot of core strength\nand stability through your abs, through your obliques, to be able to maintain that position. I put myself on the ground, on my knees in\norder to demand that my core do most of the stabilization. I don’t have the benefit of my feet to do\nthat. Again, about an 8 rep max. It's just whatever you can do with the weight\nhat you've chosen from the bench-press. Now, I'm at about 1:40 for that first grouping. I take advantage of some extra time here. I don’t want to go into my deadlifts tired,\nokay? Again, it's metabolic in terms of what happened\nfrom those other two exercises. They were not really impacting the muscles\nI would use here on the deadlift.t so they've had a good amount of time to rest and recover\nfrom that. I just want to make sure I have my breath\nso I'm not doing this in a fatigued state. So now I'm back to, in this case, the 405. Again, drive up. By this point, the workout, one round in and\nI'm kind of geared up and ready to go. Of course, I started with a little bit of\na warm-up to get myself ready, but here I am now in the second works and I'm cranking\nnow. Again, notice that first pull is just a straight\nleg movement. It's like a leg press up from the ground. Then once I get to the knees; boom! Shift right into the hips and make the hips\ndrive through and drive your whole body forward and pull the bar up. Now, back to the dumbbell bench again. So you can see, again, there's a few elements\nat play here. By stacking the exercises the way we're doing\nit we're actually allowing muscles to relax and rest without wasting time. Remember, it's 12 minutes. You don’t have a lot of time here, but I'm\ntrying to prove a point. You can definitely build muscle mass despite\nthe fact that you may not have that much time. Sometimes there are more challenging. These are \"density workouts\" we like to say. We're condensing what all is done here – 5\nrounds – which is basically 5 dead lifts with an 8 rep max, 5 sets of a 10 rep max\ninclined bench press, and 5 sets of our dumbbell shovel curl, or shovel curl press. So, that's being done in 12 minutes. That might take you 25 or 30 normally, or\neven longer for some guys. 45 minutes. So when you do the same amount of work in\na much shorter period of time you're dramatically increasing your workload, therefore overloading\nyour muscles and giving them stimulus to grow. So I don’t count the reps. At this point I don’t even care how many\nreps I get. Remember, it's just about going to failure\nand making sure that the load you're using is enough to cause overload. So now I'm in here, round 2, the last exercise\non here, running the clock. Still going, I'm still ahead of that 12 minute\npace. Again, some people might only get 4 rounds\nin, but if they're 4 really good rounds that's great. It's the effort level. It's the intensity. Remember, intensity is one of the biggest\nfactors for driving muscle growth. Far too many people do not workout at a high\nenough intensity. I've talked about under training, I've talked\nabout over training. Over training is something that is going to\nbe very real for natural guys who don’t allow their bodies a chance to recover from\nworkout to workout, or within a workout cycle. Most importantly, the effort has to be there\nif you want to get anything out of your workouts. Now I'm moving into another round, a little\nbit closer up just to see the nuances of the exercise. Remember, it's always – with the deadlift\n– it's hip, hip, hip, and right at the level of the knee, and drop. Hip, hip, hip, hip, hip, and knees. So if you want to know how much hip and how\nmuch knee contribution it's really easy. Let the bar dictate. When it reaches your knees; boom! Drop your knees down. When you're pulling up, pull straight by pushing\nthrough the legs until you get to the level of the knees. Once at the knees; boom! Drive the hips forward, just like that. Next, on the incline bench-press, you can\nsee the level of the incline. I've got it at 30 degrees. We talked about that before. The best angle for targeting upper chest and\nminimizing the shoulder involvement, we'll get that shoulder involvement on the next\nexercise. For the safety of our AC joints I don’t\ngo down below the level that I'm bringing it here. I'm going to hear some people saying \"No,\nyou're supposed to go all the way down and touch your chest.\" For me, those extra 2\" aren't worth the health\nand safety of my AC joint. I've already popped it once and I was out\nof the game for quite a while trying to recover. So now, on this one here, again it's whatever\ndumbbell weight I used on the press. I'm going to use it here as well and just\ntry and crank out as many as I can. A limiting factor – who knows what it's\ngoing to be? It could be your core. It could be your forearms. It could be your biceps. It could be your shoulder as you can see it\ngets tough to press that up and overhead. So there you have it, guys. A 12 minute mass building workout that encompasses\nevery single muscle group in your body and it hits them intensely, but quickly. Remember, workout efficiency is your best\nfriend. A lot of guys don't have a lot of time to\nwork out and they use that as an excuse to not do it at all. If you're willing to trade in some of that\ntime that you don’t have for a lot more intensity I guarantee you can get a lot more\nout of your workouts. If you're looking for a program that spells\nit all out and pairs all your workouts up the way they're supposed to be written, guys,\nit's the ATHLEANX training system. You can get it over at ATHLEANX.com. If you've found this video helpful make sure\nyou leave your comments and thumbs up below. I know you like when I take the torture myself. Leave your comments, let me know what else\nyou want to see me do and I'll do my best to bring them to you here in the coming weeks. I'll see you back here real soon. Thanks, guys."
}