{
    "id": "Kb6CktirkEQ",
    "title": "“My Glutes Will NOT Grow” (JUST DO THIS!)",
    "description": "If you have tried everything to grow bigger glutes but nothing seems to work, then this is a video that you have to watch. Here, I'm ...",
    "transcript": "What s up guys, Jeff Cavaliere, athleanx.com. So, \nif you can't get your glutes to grow, then this   is the video that you've been looking for. You \nsee, even if you're doing all the things right,   you're doing pull through because you watch this \nchannel before. You're doing barbel hip thrusts.   You're squatting, you're deadlifting, but nothing \nis making your glutes grow. Well, there's a reason   for that. The best thing to do is test yourself \nright off the bat. And that's what Jesse's down   here for. And that's what I'm inviting you to \ndo right now. Put your phone down, step away   from your computer, come down to the floor. \nSo, we get into an on all fours position here like   this and we're going to try to do is this straight \nin one leg, we re going to test both of them,   but straighten one leg all the way back as far as \nyou can and lift it straight up to the ceiling.   And what I'm looking here for is an \nintense contraction in the glute max,   right here. Do you feel that? It should feel \nas if you just balled up your bicep and got as   intense a contraction as you possibly could. \nIf you don't feel that you definitely need this   video. Now there's a bunch of people that \nprobably don't feel it because they never   put the phone down and stepped away from the \ncomputer to actually do this. Promise me you'll   do this at least when the video is done. But \nof the people that do feel the contraction,   I call out at least three quarters of you, because \nthe only way that you actually felt it was by   turning the leg a little bit like that to do that. \nSo, check back and look around the corner and see,   is your toe pointing towards the camera? Or \nwas it done properly with the toe pointing   straight down to the ground and the heel up? \nBecause all you do is substitute the glute medius   into this that causes that lift, I want just \nglute max. When you don't have good neuromuscular   control of the glute max, it takes a lot away from \nthose other exercises you've been doing already,   rendering them not as effective. And not only \nthat, it turns you into a back dominant extender   rather than a glute dominant extender. As soon \nas you do that, and you perform those big unless   you're asking for low back pain. So how do \nwe fix all that? We can make you a dominant   extender and we could get really low back pain at \nthe same time that we grow your glutes. Meet me   over there I ll show you exactly what to do. \nAnd so here we are at a pull up bar with a band   attached to it. Don't worry, if you don't have \nanything at all, I'll show you something you could   do against a wall with just your own body. It will \nbecome almost like rocket fuel for those bigger   lifts. We're not replacing those lifts with this \nexercise, we're complementing it. And as you'll   see here in a second, it's the perfect complement \nto what's maybe missing in those exercises,   which is why you want to focus on it. Even \nthe best athletes in the world perform this   exercise because they know how important, \nbigger, stronger glutes are to performance.   We all can benefit from doing something for \nour glute max here, that's how we do it. \n  So, we put our foot here into the band \nthat's looped over the pull up bar   and we let the hip rise up as high as \nit possibly can, which puts us into a   good degree of hip flexion. That's important as \nyou'll see here in a minute. You push straight   down against the band down into extension. \nAnd then when we get to this point here,   we're going to push against the band as hard as \nwe possibly can back in that direction. And also,   of course, lift the leg up against the downward \nforce of gravity, so you can really feel the group   backs working here. And then on the rotation going \non here like we would not want to do on the floor,   we just get good, isolated hip extension. \nSome of the things you'll notice here, which is   why it's a good complement, as I said, you have \na lot of range of motion of hip extension here.   And it's not just this part from here to here. \nThat's the extended hip pass neutral. But hip   extension is happening all the way from the very \nbeginning of the exercise. Meaning you're going   through a position where the hip is in about a \n110 degrees of flexion or 120 degrees of flexion.   All the way down through is 110 degrees \nback through an additional 20 or so,   you're in about 130 degrees of resisted hip \nextension. Also at the peak portion here,   the contracted position to fully extended the \nposition, you've got good tension here on the   glute max. At the top of a squat, not really. \nYou know, at the top of the squat when your hip is   actually just straight up and down, right through \nparallel, through the downward force of gravity,   you don't necessarily have a lot of activation \nof the glutes in that position. The last thing we   know is that in a typical squat, we get activation \nof the quads at the bottom of the exercise.   What that does is it causes a little bit of a \nconflict at the joint itself. Because we know   that we're trying to either flex the joint \nor extend the joint. So, you start to get a   little bit of reciprocal inhibition of the glutes \nbecause they can't do both at the same time. Any   time we're trying to cure a muscular inefficiency \nproblem like we are right here at the glute max,   you don't want to take anything away from \nthe muscle you're trying to improve.\n  So, in this case, we don't have the quad \ncontributing to the exercise as much   because we're not in that overloaded position \nas we are in the downward position of a squat.   For all these reasons, guys make this exercise \npart of what you do. Not a replacement for what   you're doing right now, but part of it and \nI promise it's going to be rocket fuel for   the performance on those bigger lifts. But I \nmentioned another way we can do this, and that's   up against the wall. I'll meet you over there. \nWhat we do is we get ourselves up against a wall.   All right with the second leg, the one you're not \ngoing to work you a fold it down and under. And   when we do is we fold it as much as we can because \nyou want to get as close as we can to the wall.   So, once we do, we scoot even closer to the wall. \nWhat that does is it gives us more hip flexion.   The closer you can get, the more this hip is going \nto come into flexion to mirror the benefits we get   from the banded of pulldown. So, from here now, \nall we're going to do is focus on how we push   through the foot because it matters. If you were \nto take the toe off of the wall and push through   the heel or maybe even pull down through the \nwall, you're going to get far too much hamstring   activation here and that s not what we want. \nWe want glute max driving through hip extension.   So, we push the foot flat into the wall and \nwe try to push through every single inch   of the soul of our foot. And as we do it, \nwe pull up very slowly and slow and slow   and really try to drive through glute max. And we \nhold for a second or two at the top, we come down   and we repeat driving through. Repetition count \nhere, like the other exercise guys, I don't really   care. It's high quality, good contractions. If \nyou're getting them, you keep going. If you're   starting to lose it or substitute, you stop. \nGenerally, this takes place in around the 10   to 12 range. And treat this like an \nexercise. It s not simply a warmup.   If your glutes aren't responding right now, it s \nbecause you don't have that good control of the   glute max and is not contributing as it should. \nMake this muscle work. Treat this like an exercise   as it should be. Include it into your routine \nand I promise you, this will start working.\n  Guys, if you're looking for programs \nwhere not only the exercises matter,   but how we do them always matters. You can \nfind them over at athleanx.com. If you found   the video helpful make sure you leave your \ncomments and thumbs up below. And also,   if you haven t already done so, make sure you \nclick Subscribe and turn on your Notifications   so you never miss a new video when we put \none out. Okay guys see you soon. \n "
}