{
    "id": "KBLsNbolr_c",
    "title": "Shoulder Stretches for Your Delts (ALL 3 HEADS!)",
    "description": "Bigger wider shoulders in 90 days - http://athleanx.com/x/use-this Subscribe to this channel here - http://bit.ly/2b0coMW Shoulder ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Three muscle markers today to try to help\nyou understand how to stretch out each head of your shoulders more effectively. You see, we talked about how to train them\nin the past, but a lot of people forget to stretch them and they're just like any other\nmuscle. We need to pay attention to them. Especially due to the fact that they tend\nto get tight because they get over developed. So what we want to do is attack them one head\nat a time. To do that, as I said, I broke out the muscle\nmarker. So what we're looking at here is the front\ndelt, the middle delt, and the rear delt. They're actually really easy to see if I go\nto my undrawn side here, and I just raise my arm up. You can see here that the front delt, I could\nactually grab it. It attaches here to my clavicle; to my collarbone. You can see that right here. Here's the bone, and it comes in right off\nof here, and it comes down in front, and then serves here. They're all in the same spot here on our upper\narm. Then we've got our middle delt, which is the\nchunk right behind the front delt, which is all here, and it comes down again. Feeds down into here. So again, we can see that displayed on the\nother side. Finally, we've got the rear delt that's in\nthe back here that comes off our scapular spine. That is, if you were to go grab onto your\nshoulder blade here you can feel this ridge that you can grab onto with your fingers. At the very end of that ridge, which is right\nhere, is where the rear delt will start. You can see that I actually had it popped\nup for a second there. Then it comes down and around, and then again\nit inserts in here. So you can see that's going on back there. So, obviously the muscles are positioned in\ndifferent places. So they need different angles of stretching\nif we're going to get at them. A lot of times people stretch them incorrectly. So to start off we'll start on the front delt. To do the front delt, if we know that the\nfunction is to raise your arm up in front of you, what you'd want to do to stretch it\nis get it behind you. But not just that, remember I said that it\nattaches to the clavicle? So if we could somehow get our clavicle to\ncome this way as the arm goes back this way, then we'd be doing a good thing here to stretch\nout the front delt. So what we do is, we position our hands behind\nour back. Just like this. Then we're going to raise them up. At the same time we want to stick our chest\nout. So as we watched it here from the front and\nup close, my hands are behind my back. They're coming up. You can see that it's stretching out that\nfront delt, but then what I want to do is I want to get my clavicles forward. So I could do that by sticking my chest out. You can see that stretch that's being placed\nhere on that front delt is big. Guys, these are things that you're going to\nbe able to instantly feel when you do it. So again, hands behind your back. They're sliding up. Once you get to that point you can't go any\nfurther, stick the chest out. Next, the middle delt. I see a lot of people try to stretch this\nout by going like this, or they go like this. They sit there and they're stretching that\nmiddle delt out. It looks like they are getting a decent stretch,\nbut they're missing a big component. If it attaches down here, and it starts here,\nif I were to do this – yes, I'm pulling my arm across. I'm stretching this out as you can see, but\nI don’t want to have my arm up here. What I want to do is, you're going to instantly\nbe able to feel the difference. Take it, and then flatten it down that way\nas I pull across. So now watch it on this side where you can\nactually see the fibers. I'm up here, I can stretch it, but now when\nI actually pull down against my chest you can see that the fibers of the middle delt\nare now getting a really good stretch. Again, like I said, instantly feel that as\nyou can see here. It's tight against my chest, not floating\nup here. So still 90 degrees, but then down against\nthe chest. Finally, we have the rear delt, and this is\nanother one where people will do, and they'll try to keep going up at an angle because they\nsay you've got to take the elbow further away here from the back to try to create more length\nin that muscle. The problem here, especially people that sometimes\ntend to stretch their shoulders because they feel they have to, because they have pain\nand discomfort in the shoulder; if I drag this across and I keep going up, up, up, up,\nup, while I am stretching the rear delt out I'm also creating more of an impingement feel\nhere. Potentially, in my already tight, or crowded\nshoulder joint. So by doing this and raising it up I'm actually,\npotentially, limiting my stretch because the pain starts to set in that prevents me from\nwanting to go any further. So what you do instead is, you get behind\nthe elbow here, you bring it across, and you just scoop it. So I'm still trying to go for length, but\nwhat I'm trying to do is I'm trying to scoop it up and under this way. Around here, I scoop it up and under. So I'm leaning a little bit forward – as\nyou can see here – and I'm trying to basically scoop it from here, underneath. Now I'm getting a little bit more of that\nlength, but I'm not getting that raising here that can create that tightness and impingement\nin the shoulders. So again, up close, in here, scoop it, lean\nforward a little bit, and stretch it out. So there you have it, guys. You can stretch your shoulders, all three\nheads, as long as you understand the A) the anatomy of the shoulder; and B) how to reverse engineer that to allow you\nto get as best a stretch as possible without having to rely on elaborate equipment, or\nanything like that. These things you can do just as I did here\nwith nothing but my own bodyweight, and no; you don’t need the markers to do this. You feel it instantly. All right, guys. If you like the muscle marker videos though,\nof course, leave your comments and thumbs up below and let me know. In the meantime, if you're looking for a program\nthat puts the science back in strength so we have a better idea of, not just what we\ndo, but why we do it; head to ATHLEANX.com and get our ATHLEANX training system. All right, guys. I'll be back here again in just a few days. See ya!"
}