{
    "id": "kDI0IpjWi68",
    "title": "Home Core Workout Combo (GET RIPPED!)",
    "description": "Be ripped 365 days a year with this - http://athleanx.com/x/always-ripped Subscribe to this channel here - http://bit.ly/2b0coMW A ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. If you're training at home and looking for\nthe best way to get a visually impressive core, a ripped, and shredded looking core,\nyou've got two things you've got to promise me that you'll do. The first is you'd better dedicate yourself\nto a good nutrition plan. Start eating better. if you do you'll bring your body fat levels\ndown low enough so that you can see and reap the rewards of the muscular definition that\nyou're going to get by doing this exercise here today, that hits two muscle of the core\nthat you probably over look a little bit in your training. You see, it's not all about the abs when it\ncomes to having a maximally shredded looking core. Because the abs alone will do this, but when\nyou get the obliques and the serratus anterior in as well, now we've got a framed out, shredded\nlooking core that's actually tapered in, and looks much more impressive. We could do it without any equipment. Just get down on the floor and do what I'm\nshowing you here. You start by bringing your knee across your\nbody toward your opposite elbow. Now that bottom up rotation, the rotation\nin general is hitting the obliques hard. Now, from here though, we're going to keep\nthat contraction and then slide the knee up our arm. What we're doing here is, yeah, we're getting\na little extra flexion of the spine. So we're getting our abs to work a little\nbit more, but more importantly we're getting protraction of the scapula. Meaning we're getting this push around our\nbody of the shoulder blades coming around and forward. This is the protraction that you're looking\nfor, and the only way we can really hit the serratus anterior. The serratus, again, is that muscle that sits\nup in here that, again, adds to that muscular definition and tapering in of the core. So we're hitting them and getting them both\nto work, but work together. So you've got the bottom up rotation again,\nwe're hitting both sides, of course, that hits the obliques, and then that added plus,\npushing up and away as we slide our knee up and back down, is getting that serratus anterior\ninvolved as well. So you start adding this to your home training\nprogram and you start watching what you're eating and guess what? You're going to start to see a much more impressive\nlooking torso, or core when you look in the mirror. Guys, that's what this is all about. Combining smart training and smart eating. If you're looking for that combination, head\nto ATHLEANX.com and get our 90 day training plan, along with our day by day meal plans. I've got it all laid out for you. The key here is, you'd better start training\nmuscles that want to train together. So you'd better stop overlooking important\nmuscles that don’t get trained enough. And thirdly, you'd better make sure that you\nknow what's going in your mouth each and every day so that you can make sure that your body\nfat levels are lean enough to be able to see the results of your hard work. All of that over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful, leave your comments and thumbs up below. Let me know what you want me to cover here\non this channel and I'll do my best in the days and weeks ahead to do that. All right, guys. I'll see you soon!"
}