{
    "id": "kTXamMFe_co",
    "title": "4 MIN Morning Fat Burning Workout (BURN FAT FAST!)",
    "description": "Having a morning fat burning workout that doesn't take a lot of time and can work your full body quickly is helpful in giving you the ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. I'm going to so something I don't do that\noften, I'm going to do a workout here today with you. It's a fat burning workout. And to burn fat guys, we understand one thing\nand one thing only, and that is you need to be in a hypocaloric state, meaning you are\neither taking action towards burning more calories in a day than you are right now or\nyou're taking in fewer calories in your daily meals. I talked about how important the second half\nof that is. Getting your nutrition right is going to have\na humungous impact because that occupies 23 hours of the day. What I'm going to show you right here, occupies\nfour minutes or maybe eight or maybe 12, depending upon how many times you go through it. We didn't work out a long time ago, early,\nearly on in the channel called Four Minutes of Hell. A lot of people were requesting a remake,\nsomething new on that. So, let's just call this one Another Four\nMinutes of Hell. So that being said, right behind me here in\njust a little bit of space, you're going be able to do this with just a single dumbbell. Hello, Jesse. Welcome, by the way. Oh hey, what's going on? By the way, you want to be in this? The first time I did Four Minutes of Hell\nwas enough. Besides someone's got to keep time. All right. Excuses, always, always excuses for Jesse. So, guys, step back here. Let's do this with me here for movements 30\nseconds apiece, four total minutes. We're going to start here with the Dumbbell\nin your hand on the right side, you're going to drop back into a lunge on that side and\nthen you're going to step up leading the double up to your shoulder and go into a side lunge. You're going to work that side the whole way\nthrough. We'll rest briefly in between and go do it\non your side. Are you ready, timer? Ready. All right, here we go. Give me the countdown. Three, two, one. So nice and smooth, clean it up to the shoulder,\ncatch it and get to that lateral lunge, try to keep that back leg straight. Time. Time. Switch it up the other side. Here we go. Step over here, down. Try to keep that back leg straight. Time. Time. Next one. Now, we work the Posterior Chain a bit. We're going to a swing one arm at a time,\nhit back, hinge, come up to the top. You need about 15 second rest in between exercises. The dumbbell straight through. Pop the hips. Sit back into the hinge. Time. The goal here is to try to hit our entire\nbody in just four minutes. Other side, drop down. Time. Now, I follow that Dumbbell down to the ground,\nand this time we're now going to do something for the core. These are Russian Twists. But to do this, you want to actually row your\narm back on the side here. Don't tap them down side to side, row your\narm back, and then press that dumbbell up overhead with each one. We're going to work one side at a time. Ready. Row it, press. Row, press. Row, press. You sure you don't want to do this Jesse? Oh, I'm very sure. Row it. Row. Row. Row. Time. Woo! Same thing, feet are down, grab the dumbbell,\nyou ready. And go. Drop. Working on the shoulders, upper chest, core. Time. That's another one of the NSFW workouts, if\nyou don't have the visual going on, people might wonder why you're watching. The last exercise. It is a Renegade Row into a Pushup done one\nside at a time. You're going to have to crank out quite a\nfew pushups here. In position. Ready? Go. Working your back and of course with the pushup. Time. Last one. Switch it over to the other side, give yourself\nabout 20 seconds here. You've got more pushups coming we're going\nto work the other side. Dig it, let's finish strong. Here we go. I'm here Jesse. Ready, set, go. Give me the time. Fifteen seconds. Time. And so with that guys, there's four minutes\nin the books. Now whether you turn that into eight, 12 or\n16 minutes, it's up to you. What I would rec-- Looks like you could use this. Uh yeah, don't go too far away because you're\ngoing to be doing this. No. Slacker. Anyway guys, I know you feel. Tough workout. Now what are you doing? You can't get mad at a puppy. No, I love my puppy, but you can put her down. I don't what you rubbing off on her in any\nway, shape or form. So, the number of rounds, guys, is up to you. But I would recommend, if you're a beginner,\ngrab just five-pound dumbbells or even none just to feel the movements. As you work towards the intermediate range,\ngrab 10s or 15s and as you get to the more advanced stage, grab 20s, 25s or even up. The fact is, the heavier you grab, the more\nwork your body is going to be doing to go through these motions and the more calories\nyou will burn. To that end, four minutes is not going to\nbe good enough, if we're looking to burn significant amount of calories. Take that rest in between, about three minutes\nbetween rounds, and drop the weight down to use each subsequent round so that we can encourage\nmultiple rounds of this to three and maybe even four. Guys, it's not easy, but it's worth it. If you're looking for programs where we map\nout everything for you, we have the nutrition mapped out day by day, along with the conditioning\nworkout and the strength training workouts as well, you can find them over at Athleanx.com. If you found the video helpful leave your\ncomments and thumbs up below. Make sure you check out the video and link\nat the end of this one to see just how important those other 23 hours are outside the gym. And guys, if you have already done so, make\nsure you click subscribe and turn on your notifications, so you never miss a new video\nwhen we put one out. All right guys, good luck, see you soon."
}