{
    "id": "kYQrzZdlIL8",
    "title": "RIPPED ABS - Beginner Ab Workout (5 Minutes!)",
    "description": "If you are a beginner and want to get ripped abs you need to do two very important things. The first is you need to train your abs ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to give you a beginner workout\nfor abs. Now, the key is that this is not your only\nworkout. I just made a video not long ago when I talked\nabout one of the biggest mistakes you can make when you’re trying to lose weight. It’s to think that an ‘ab only’ approach\nis going to get you there. We know you need to have your nutrition in\ncheck in order to do that. However, if for a beginner you can commit\nto a five-minute workout – or a six minute workout like this one is going to be here,\nto at least get you going, to start to build that momentum – then it’s a good thing. But realize you want to make sure you’re\ntransitioning to something greater. That you’re starting to work your entire\nbody and not just focusing on the abs. With that being said, there are some key differences\nbetween this beginner ab workout and some others that you may have seen because we want\nto make sure we’re training the right way to hit the right functions of the abs, not\nleaving anything out. So, this will do exactly that. I’ve got a stopwatch here that we’re going\nto do everything to. So, it makes it very simple to track. So, I’m going to get down here. The very first thing you want to do is something\nwe call a halo. The reason why halos are good is that you’re\nworking your lower abs. So, any movement where we take the pelvis\nand curl it back, up toward the head is going to be initiated with a contraction down from\nthe bottom portion of the abs. So, we want to make sure we start with that\nbecause that tends to be the weakest. So, we pick our legs up, and when we’re\nin this position here, now we’re going to lift and draw a circle. So, I’m trying to draw circles into the\nceiling just like that. So, I lift, I’m drawing a circle, all the\nway down, and around just like this. This is the circle. Now after 30 seconds I’m going to start\nreversing direction. So now I’m going to lift and draw circles\nin the opposite direction. 30 clockwise and 30 counterclockwise. Then what you want to do is start getting\nyour obliques involved now. So, you still want to stay bottom-up because\nyou’re most fresh at this point in the workout, but you get the obliques involved by creating\nsome rotation because they run down at an angle. So, what we do here is, now we’re going\nto curl our pelvis off the ground and as we do, twist the butt in one direction. Curl and twist the butt. Curl and twist the butt. Just like that. So, I’m literally lifting my pelvis from\nhere to here. Off the ground, lift, twist, and down. So, no hanging exercises. Hanging exercises tend to be a lot more difficult. We’re going straight for the somewhat simpler\nversions here, but still not negating the principles that I want you to follow here\nwhen it comes to training your abs. Great. Now the next thing is what we call a midrange\nmovement. Where we want to train the abs in both directions. Meaning, stability from the top down, and\nthe bottom up. That’s where you’re working on that entire\nmidrange. This is where plank become a good option. However, if you’ve seen me talk about planks\nbefore I’m not a big fan of them. Why? Because they’re just not that challenging. They’re not dynamic. They’re too static. We can make them a stability exercise, but\nstill have them become more dynamic by adding movement in. We can do that with a pendulum plank reach\nout. So, we get down in this position here and\nwhat we do is by making a pendulum with the lower legs. So, I step out, here, and back, and step out,\nand back. Out and back. Out and back. That’s the bottom portion. But what we do is add the arms in, too. So, I step out, back, out, back. Arm out, and back. Arm out, and back. When I go into this reach position with the\narm you can see I’ve decreased my stability on the floor. I’ve taken where I’ve had four limbs down,\nfour points of contact, and made it temporarily three, and even when I put the hand back down,\nthis elongated arm out here has increased the work that the abs have to do. So, I come back in. So, step out, step out, arm out, arm out. Step out, step out, arm out, arm out. And I keep that going for one minute. Each of these exercises so far has been done\nfor one minute. Now, we still want to have that rotation,\nbut this time from the top down. So, what we can do there is an exercise we\ncall the chainsaw. So, you’ve probably seen scissors before. You lift your torso off the ground, engage\nthe abs, get in this position here, and you just flutter your legs back and forth. For a chainsaw we want to make it more dynamic,\nso more motion. So, what we do is, we come down, we lift,\nengage, up, and then what we’re doing is rotating our legs and our feet, trying to\nkeep our torso pointing straight ahead, but all of our lower body rotating. Scissor, scissor, scissor, scissor, over there. Come up here a little bit more. So, scissor it and rotate it. You go one minute of these. Now, you rest as needed between these exercises. Depending upon how much of a beginner you\nare, you might need a little more rest. If you can keep cranking through them, that\nwould be ideal. The less rest time you spend between ab exercises,\nthe better the overall effect. Finally, we do a sit-up-rollup. This is a very important point here. We end with our top down movement. Going from the top toward the bottom. Why? Because we’re strongest in that direction. We have more strength in any top down movement. We’re going to need it because at this point\nin the workout we’re fatigued. However, you’ve probably seen a lot of people\nanchor their feet under something to do a sit-up. When they do, by hooking their feet and pulling\nup, they’re engaging their hip flexors, which has a detrimental effect on the lower\nback. Especially over time as you accumulate more\nand more reps. So, what you do is, you find that same surface\nand instead, you hook your feet beyond. So now when the feet are beyond, and you pull\nback, you’re activating the hamstrings which are on the opposite side of the hip flexors,\nwhich can help to decrease the hip flexor activity, therefore decreasing the pulling\non the low back. It’s a completely opposite effect, but the\nabs still have the same opportunity to be worked. So, with my feet anchored beyond that point,\nwhat I do is keep my arms up here and I curl up. When I’m at the top – a very important\nkey here – you paint yourself back down. I just covered this in a lower ab weakness\nvideo. You want to be able to pain yourself down. Same thing on the way up. You want to unpeel yourself off the ground,\none segment at a time. Here, and then on your way back down you engage\nin a roll down one piece at a time. Roll off one piece at a time, paint yourself\nback down one vertebra at a time. By engaging, by getting into this flexed trunk\nyou’re engaging the abs already. You’re disengaging the hip flexors, you’re\nprotecting your back, there are no detrimental effects to exercises like this with a sit-up,\nor ab workouts in general. You complete this here for one minute. So, you see that five exercises for one minute\na piece, the idea is if you’re beyond a rank beginner, you can do this two times and\nit will give you about a 10 minute workout. If you are a beginner, start here. Like I said before, I don’t care where you’re\nat in terms of rank beginner and this getting you on the ground and actually doing something. That’s great. But use it as an impetus to do more. Ab training alone is not going to get you\nthe results you want. Pair it up with good nutrition, pair it up\nwith some good total body training; now you’re really going to start seeing the results of\nyour hard work. Guys, I hope you’ve found the video helpful. If you’re looking for more workouts, we\nhave lots of advanced training in our ATHLEANX videos as well. Make sure you check them out. If you’re looking for one of those programs\nyou can find them over at ATHLEANX.com. We do have programs scalable to all levels\nof ability. If you’ve found the video helpful leave\nyour comments and thumbs up below. Let me know what else you want me to cover\nand I’ll make sure to do that for you. Also, turn on those notifications because\nyou want to make sure you get notified by YouTube when I do put up a new video. All right, guys. See you soon."
}