{
    "id": "kz4O4o7JCbc",
    "title": "I Got My Test Results (BAD NEWS)",
    "description": "If you've been watching my videos over the last few months, you might have noticed the sleeve I am wearing on my elbow.",
    "transcript": "So, I got my test results back and they're not \nlooking too good. What's up, guys, Jeff Cavaliere,   Athleanx.com. So, yeah, what I hold in my hands \nhere are my test results and actually have   something to do with the reason why I'm wearing \nthis sleeve on my elbow and have been for a long   period of time. And what we're talking about here \nis an injury to my bicep, to my elbow, actually.   And what happened was I was walking my son into \nschool back in February, it was icy out and   he slipped on the ice, and I was holding him and \nessentially as he dropped down, I tried to quickly   grab him. Well, I felt this pain in my elbow \nand I thought at the time that maybe it was a   supinator muscle strain deep inside my elbow. \nIt didn't concern me all that much because I was   able to still train. I was again, I'll throw a \nsleeve around it and then keep going. And it kind   of holds a key part of my message here that \nI want you guys to make sure you understand   and that is the concept of training through and \naround injuries, which I'll get to in a second.   So, because we wanted to make sure we knew what \nwas going on, I had an MRI done. Well, in addition   to having the MRI on my elbow, being a physical \ntherapist and sometimes the worst type of patient,   you know, I said, Well, I do know that \nanatomically, if I'm looking at my elbow, I   might want to check out my shoulder too. And given \nthe fact that I've had a long history of a lot of   shoulder problems dating back to the incident \nwith the New York Mets when I threw a baseball,   I'll tell you about that in a second. Not so well \nby the by the way. I wanted to make sure we kind   of checked out what was going on there. \nSo we go to have the MRIs done and that's what   this is right here. I'm actually going to share it \nwith you guys here as we read along together. And   it turns out it's actually more interesting than \nthe elbow itself. So, what it's telling me here   is that I've got, as far as the rotator \ncuff is concerned, a 50% thickness tear   in the supraspinatus tendon, which is actually the \nmuscle in the rotator cuff that is responsible for   external rotation or one of the three that are. \nThe infraspinatus and subscapularis are intact.   The AC joint, this little joint at the end of my \nshoulder here has a little bit of a spur that's   coming down from underneath the joint with some \nmild AC joint degeneration. The Bursae is fine.   The Glenohumeral Joint, interestingly has some \ndiffuse glenohumeral cartilage thinning. So,   on the head of the humerus up there with \nsome osteophyte formation or early arthritis.   The labrum, as we expected, has an almost complete \ncircumferential tear with only a small portion of   the superior labrum intact, which I definitely \ncould tell you from the second it happened.\n  The long head the bicep tendon is actually \nfully intact and moderate to severe glenohumeral   degeneration, I'll get to that in a second. \nSo essentially in non-medical terms, this is   saying that I have the shoulder of a fucking \n80-year-old man. Now for those that have never   heard this story, it all started with that throw. \nSo back in 2008, I was at spring training with the   New York Mets, just minding my own business out in \nright field when one of our all-star outfielders,   Carlos Beltran, was walking by me. And I say, God, \nit's surprising how much shorter it is to go from   right field to third base. It just looks so much \nfurther on TV. So, he kind of looks at me and   he raises his eyebrows and says, You think it's \nshort from here, there? Why don't you try throwing   baseball and see if you can get it there?  \nSo of course, not wanting to back down from   a challenge, I said, Well, I know I can get it \nthere. I just want to know who's going to catch   it when I throw it. So, he hands me the baseball \nand says, I'll give you $1,000 bucks if you can   get it there on the fly. So of course, I wanted \n$1,000 bucks. I grabbed the ball and I unwind   just an explosive throw. The problem is it sort \nof died on the outfield grass somewhere behind   shortstop and the only thing explosive \nwas what happened inside my shoulder as   I completely tore my labrum and apparently my \nrotator cuff, too. It's a good thing, though,   that I've got the MRI to remind me of how \nbad my shoulder is supposed to feel, because   quite honestly, it feels pretty damn good. I come \ninto this gym every single night, 10:00, 1030,   after I put the boys to bed, and I train. And I \ntrain hard, and I feel great. And I don't have   the limitations that the MRI is suggesting that I \nhave. And I think that's one of the things that I   want to get across to you guys are out the back \nbecause a lot of us have been in the position   where we get diagnostic imaging that tells us \nsomething that maybe we don't like to hear. \n  And the good news about that is that the \ndiagnostic imaging doesn't always support what's   clinically happening with you. So, a lot of times \nthere'll be imaging that says things look pretty   damn bad in there, but clinically you feel totally \nfine. So are you supposed to start worrying about   what's inside the MRI report, or are you supposed \nto maybe continue to do what you're doing because   clinically you're doing fine? Or the MRI will \nsay nothing's wrong with you, but clinically you   feel like shit. So, you know, is there nothing \nwrong with you because the MRI says nothing's   wrong with you? I would disagree. \nYou know, I think that when it comes to   learning about what's actually happening to you, \nyou need to learn more about what's going on with   your own body. You need to become the master \nof your own body. And one of the main reasons   that I have this channel, one of the very main \nreasons I think, why we are as watched as we are,   is because I've always tried to give you guys the \nunderstanding and knowledge. Look, I understand   you can learn a tip or two on TikTok in 10 \nseconds, right? I think the to inform people   so that they know exactly what's going on \nwith themselves so they can better prepare   for things like this and even have more \ninformed training approaches, you need to   get the education. You need to understand what's \nhappening. I've always tried to do that here. \n  So, using this MRI as an example, I'm going \nto hope to do the exact same thing for you   right here. So, let's pretend that this is you, \nright? What would you do? Well, if you don't have   an actual report or a visit to the doctor yet, I \nthink you should start there. And I'm saying that   as both a physical therapist and a member of the \nmedical community. But also, because I think at   least gives you a point of awareness of knowing \nwhere to maybe start. Maybe where to start your   own Google searches because you know what you've \nbeen told you have. But the next thing that we all   need to be able to do is quickly start to assess \nwhat it is that we're having a problem with. What   is it that's causing pain and discomfort? \nSo, in the case of a shoulder, I want you to go   over and start bench pressing. Of course, I want \nyou to do it very light. What I want you to do is   just assess what you're capable of and what you're \nnot necessarily capable of pain free. And that's   beyond just doing a single exercise, we're talking \nabout breaking down the variations. So doing an   Incline Bench Press, doing a Flat Bench Press, \ndoing a Decline Bench Press and seeing which one,   if any, feels better or worse than the others. \nAnd the reason why that matters is because when   it comes to the structures in your body, there is \na sensitivity to small things, even just like the   angle of the bench. Or the speed at which you move \nthe dumbbells or the barbell. Or to that point,   whether you use dumbbells or a barbell to perform \nthe exercise, all the little nuances matter.\n  And it's important that you don't just cross the \nexercise off your list because you think that   doing one variation of the bench press means you \ncan't do any of them because that version hurt.   Once you do that, you want to take the exercises \nthat are problematic out of the equation. I'm   talking about the specific variations of the \nexercises out of the equation. And the reason   why I say those can be removed, even though in the \nsame breath I'm saying you can train around this,   is because I know that there's so many other \nvariations of exercises that can do what you're   trying to do from the muscle benefit standpoint \nthat aren't going to be problematic. \n  There are thousands and thousands of exercises. \nSome might say you have to do the squat, but if   the squat causes knee pain for you, I'm confident \nenough to say you can do a squat pattern,   let's say squatting down to a box. It s a little \nbit different than the squat, but the movement   pattern is the same, but completely eliminate any \nof the discomfort that you have in your knees. So,   without having to say I can't squat anymore, \nyou're able to say I can squat this way,   at least for now, and maybe be able to resume \nsquatting fully as I get over this injury. \n  And one of the worst things you can do oftentimes \nwith any injury is don't do anything at all. So,   when you decide or maybe your doctor says, because \nit's the easier recommendation to make, Listen,   don't do anything right now. Let it calm down. \nI'll see you in four months. I don't think that's   the best approach to go because the disuse from \nnot using the muscle in any capacity oftentimes   leads to other repercussions and problems down the \nroad that you're going to have to try to undo and   those could be potentially even long term. \nSo, I would say that with the approach of   finding the right exercises, this MRI report \nbecomes a hell of a lot less meaningful.   Because once you have the exercises that are \nable to be done, you continue to build them up,   you continue to build your strength up. That's \nwhen you start to add your weight and build up   your strength in those exercises and always be \nmindful of how you feel as you're doing them.   And as you do this, guys, you start to become a \nlot more knowledgeable about what is right for   your body. I talked about it with this shoulder \ninjury. Again, you do not know me for any time   frame from my early days on YouTube, I had the \ninjury, but meanwhile I trained around it and   through it. Sometimes I had to abbreviate range \nof motion. Sometimes I had to choose completely   singular exercises for a workout for my chest.\nAt one point in time when this was inflamed,   actually, from demonstrating a muscle \nup that really screwed this up again,   I decided to just limit my chest \ntraining to Cable Crossovers.   You know what? It wasn't very exciting; it \nwas rather boring. But I was able to get   my chest engaged. I was able to get a complete \ncontraction and not have to give up on chest   training completely. And after a period of time \nof limiting myself to just the crossover motion,   I was able to resume pressing without issue to the \npoint where I'm pressing now without any issues at   all. I can do any variation of a Bench Press, and \nnone of it hurts me at this point. And you have   to be prepared to play the longer game, right? \nDoesn't have to be forever, but it may not be two   months or three months or even four months. \nBut as long as you're still able to train,   what does it matter, right? If you're still making \ngains and I think I've continued to be able to   make gains throughout my entire career because \nI've chosen smarter training methods. I've chosen   ways to still keep the flow going without \nhaving to stop altogether. And ultimately,   that is the biggest tool that you can put in \nyour toolbox, is the ability to keep training.   To be able to choose the exercises that keep \nyou in the game, rather than opting to go sit   on the sidelines and get no results at all.\nSo, guys, I hope you found this video uplifting.   I'm like you, I've got some of the same issues. I \nget banged up, I get, you know, all kinds of aches   and pains. But I think that by having the training \napproach that I use here, I haven't been out of   the game ever. I keep going. And I'm able to keep \ngoing and have good energy and be able to attack   my workouts and make the right decisions along \nthe way, because I've allowed myself to become   more knowledgeable about what my body is actually \ndoing. And I've taken the right steps in whatever   training I do to ensure that I'm not taking steps \nbackward, but more so always taking steps forward,   even if by just this much every single day. \nIf you're looking for programs, guys,   where I try to empower you with the same ability \nto keep going no matter what and still make gains,   I've got them all over at Athleanx.com. In the \nmeantime, if found the video helpful, if you   have a story that you want to share of an injury \nthat you're dealing with, make sure you leave it   below. And if you haven't done so, make sure you \nclick, Subscribe and turn on your Notifications   so you never miss a new video when we put \none out. All right, guys, see you soon."
}