{
    "id": "lA8rPARyzDQ",
    "title": "Fast 6 Pack Ab Workout (15 REPS ONLY!!)",
    "description": "Get a six pack fast by training like an athlete here http://athleanx.com/x/where-6-packs-are-made The ironic thing about getting 6 ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.COM. I'm still working on getting my voice back,\nbut you know I'm not going to miss a Washboard Wednesday Workout. When it comes to ab workouts, if you want\nto get them done faster, then you better start figuring out how to do your ab exercises slower. Sure, you can see a lot of guys in the gym,\nme included, doing exercises just like this at this pace; however, if you want to get\nyour work done more quickly, then you've got to work on slowing those reps\ndown. Why? Because we can increase the time under tension\nby doing so. I want to put together for you a 3 exercise\ncircuit that you might only be able to do for 5 or 6 reps per exercise when you slow\nthat pace way down. Yes, it becomes much more difficult, but what\nwe're all working here for is the most bang for your buck. If you can get your work done faster, then\nwhy not do it? So, without further ado and with the last\nbreathe of my voice here, let's get you right to this workout, 5 reps a piece, 3 exercises,\nsuper slow motion. WASHBOARD WEDNESDAYS ARE BACK So, there you have it guys. Give that workout a shot. No, it's not going to take you very long,\nbut I can guarantee your abs will be sore and hurting the next day, especially if you've never tried to slow down\nthe pace. It's just one training variable, and it's\none you have to start using if you want to develop a complete physique. Don't start relying on the same old things\nall the time, guys. You'll get the same old thing you've been\ngetting all along. If you want to start making a change for yourself,\nyou've got to start challenging yourself. That's what we do here on ATHLEANX. I am challenging my voice right now to speak,\nand I'm going to keep challenging myself here in the gym every single time we get in here. I want you guys to do the same. Head to ATHLEANX.COM right now. Get our ATHLEANX Training System. Start challenging yourself from Day 1, and\nlet's start training you like an athlete. Alright guys, we'll be back here again soon. If you found this video helpful, make sure\nyou leave your comments and thumb's up below. See ya."
}