{
    "id": "Lb9MGpL12QM",
    "title": "Shoulder Workout for Bigger Shoulders (HIT ALL 3 HEADS!)",
    "description": "If you are looking for a shoulder workout for bigger shoulders, then you've come to the right place. In this video, I am going to show ...",
    "transcript": "So, you want to build some impressive boulder \nshoulders. You don't need to start lifting heavy   rocks, but you do need to start with a pair \nof heavy dumbbells. And the first exercise   I'm recommending is a Dumbbell Seesaw Press. And \nwhat we're doing here is, we re simply going to   alternate one arm driving up and the other arm \npulling down. And that's the key. I want you   to actively pull down with the one arm as you \npress the other one up, because neurologically   we actually function as push pull machines so we \ncan get better output by pulling down while we're   trying to push up. The other thing that we see \nhere is a stacking of the wrist over the elbow,   over the shoulder by simply leaning a little bit \nto one side while we press up. This would be very   helpful for those people that have a little bit \nof discomfort with overhead pressing. Now you're   not locked into having to do the Seesaw Press, if \nyou prefer, you can do the Barbell Overhead Press   or you can do one of my favorites, The Landmine \nPress, it doesn't matter which one you pick,   just start off with something heavy. \nBut now I know you were thinking, Jeff,   can I have the sets of reps, please? So, what you \ndo is four sets of this exercise. The first one,   you're going to choose a weight that you \ncould fail in the 8 to 10 rep range.\n  The second set, you're going to choose heavier \nweight that allows you to fail in the 6 to 8 rep   range. And on the last two sets you're going \nto keep that weight the same and work your   way towards getting those 6 to 8 reps again. \nEven if you have to rest/pause your way to it.   But you're not done because here's where the fun \nstarts, because now you drop one of the dumbbells   and do an over and back where you're just going \nto try to burn out those delts one more time   by heaving the dumbbell and using a little \nbit of momentum from your legs if necessary.   If you're using the Barbell Overhead Press, \nyou're simply going to turn it into a Push Press   once you've reached fatigue. And if you did that \nLandmine Press, you're going to use your legs once   again here to grind out those final grueling reps. \nNow, of course, if you want bolder shoulders,   we're not stopping with one exercise. We need to \nstart focusing more on that middle delt and how we   can build it out. And my favorite way to do that \nis with something called the Cable Side Lateral   Row. And here you take a cable, if you have \naccess to one, don't worry, I'll give you an   option if you don't. And we simply going \nto pull our arm across our body and pull   out into abduction to hit that middle delt.\nLook at the stretch that we're getting on the   middle delt and the rear delt in the beginning \nposition, because I can cross my arm all the   way across the front of my body. That gives us \nthe chance to recruit these muscle fibers more   effectively because of that stretch preceding \nevery rep. But I mentioned maybe you don't   have access to this machine. No problem. All you \nhave to do is this Side Lying Lateral Raise. And   by just simply laying yourself on the bench \nlike this, you're having your arm drop down   into that pre stretch position, giving you the \nsame benefits without necessarily the equipment   requirements. As far as sets and reps here, \nyou're talking about three sets of 8 to 10   on each arm. No need to rest in between, as you're \nworking one arm, you're wrestling the other.   Keep the flow going here, guys, to keep the gains \ncoming. But that round fullness characteristic of   a boulder shoulder isn't limited just to the \nmiddle delt. If you look at me from the side,   it's also going to grow in this direction too. \nAnd for that we've got to make sure we hit the   rear delt too. And I like to do something called \nthe Hip Hugger. The idea would be focusing on what   the elbows are doing, they need to move out to \nthe side and back behind you at the same time.\n  I don't want you to turn this into a shrug, \nand if you do that and don't think about just   lifting the dumbbells up, just rather take them \nalong for the ride, you're going to nail this   exercise every time. Squeeze every single \nrep at the top, increase the weight here,   three sets of 6 to 8 reps that will get the job \ndone. Did somebody say rear delts? Might as well   just said Face Pulls because you knew we weren't \ngoing to make it through a full shoulder workout   without including my favorite exercise. And here \nwhat I'm looking for is stimulation of the rear   delts. Of course, we're going to hit the upper \nback too, because this exercise is just so damn   versatile. But I want you to get those elbows back \nbehind your body. A lot of people do this wrong,   they leave the elbows out in front of them. \nGet them at least to the level of your body   or back and keep those arms at 90 degrees and keep \nthose hands pushing backwards to get the external   rotators. And this exercise is always going to be \nan amazing exercise for rounding out the back part   of that shoulder of yours. Now, when it comes to \nrounding out those boulders, more of us have less   of a problem doing it with our front delt. The \ndevelopment usually comes a lot easier because   of the other exercises we do, but it doesn't \nmean you have to avoid them entirely.\n  So, what we do here is one of my \nfavorite exercises and it's just   a Stretch Front Raise. And all we're doing here, \nguys, is applying the same principle we did before   with putting that pre-stretch on the muscle \nthat we want to grow. We can elicit a stronger   contraction just by dropping those arms down, \nwhich naturally puts them into extension because   of the angle of the incline bench. If you don't \nhave access to this or you want an alternative,   you could do this with the cables and what we call \na Cable Stretch Front Raise. That stretch being   applied to the front delt is going to help with \nthe recruitment of those type two fibers which   are most capable of growth and creating that \nfull boulder shoulder that you're looking for.   Once again, you're looking for three sets of 8 to \n10 reps for maximum shoulder development and to   cap off this workout. And yes, pun intended. And \nbecause I always look to hook up my subscribers,   if you're looking for this workout, you don't \nfeel like writing it down. You can have it over   at athleanx.com/boulders. If you're looking \nfor more workouts, you check out these two   shoulder workouts and make sure you subscribe \nguys. I'll be back here next week. See you."
}