{
    "id": "lbFzh44yN-s",
    "title": "70 Rep Full Body Workout (NOT EASY!!)",
    "description": "Challenge yourself to change yourself. Do it with ATHLEAN-X! http://athleanx.com/x/challenges Full body workouts are one of the ...",
    "transcript": "It's challenge time here at ATHLEANX. Are you going to rise up and get this one\ndone? Or are you going to drop the ball? Or should I say, drop the Bell? It's time to find out today. Hi, Jeff Cavaliere, ATHLEANX.COM. Challenge time. If there's 3 things that we are known for\nhere at ATHLEANX, it is, 1. The ability to build muscle and burn fat at\nthe same time. Everything we do and preach is based around\nthat ability. 2. The putting the science back in strength,\nas we like to say. And you guys can see that. Maybe if you saw the video we did over the\nweek about how to increase your Pullups using a scientific basis for that. Thirdly, our challenges. Why? Because I feel like we need objective ways\nto measure our progress. It's not good enough if you're doing a DVD\nprogram to simply get to the end of the DVD. Right? There is no objective measure of what your\neffort was by getting through the workout. I need to know. What is your strength? How do you compare to the other guys, so I\ncan give you a measure of your own performance. That's what will drive you to get better. So, who dropped the bell? I didn't spell that wrong. That's correct. Who dropped the bell? In this case, I'm going to show you. We can use a dumbbell, we can use a kettlebell. The goal here of this challenge is to combine\nupper and lower body. We are going to make these muscles work together,\nand we're going to kind of pick on somebody in between. In this case, it's going to be the forearms,\nthe brachioradialis, the muscle that sticks out right in through here ok, in the forearm. We want to make that one work on overtime,\nbecause we are going to make our arms stay in this 90 degree position throughout. That's what these 30 second holds are. So, I'll take you through each of these exercises. Step Back Curls/10 Each Leg. Push Out Press. Walking Lunge. Thrusters. Cyclone Squats. You can see a lot of upper body/lower body\nmovements going on, but these 30 second holds in between are going to be the real true test. Ok? Can you make it through the whole challenge\nwithout dropping the bell. Alright? Will you have to put it down because your\narms are on fire? We're going to find out today. Alright. So, let's get this one underway. Right here on my side, though, you'll see\nmy weapons of choice. Ok. Your choice, too. What are we going to use? A dumbbell? And yes, you can use the ATHLEAN BLOX. You just simply grab them and hold it like\nthis. Ok? That's the BLOX. A regular dumbbell. You can hold it either like a goblet position\nout in front of you, or you can hold it on it's ends again, out in front of you here\n90 degrees because you want to get the forearms involved, or you can use a kettlebell. In terms of the weight, what you're going\nto use is what you normally would do for a Shoulder Press. Working sets of your Dumbbell Shoulder Press. So, if you're using 50s or 60s, you want to\ngrab a kettlebell that's around 50 pounds. This one just happens to be right around there. So, I'm going to grab this. The idea here is to get these forms activated. How? By getting in this 90 degree position. Again, you can see it's right in here. The muscle right in here. The brachioradialis, right in through here\nthat ties in obviously the upper arm and the lower arm. We want to make sure that this thing is lit\nup and active the whole time. So, you don't want to have it rest against\nyour body. You want to have your arms out. The first thing is a Step Back Curl. So, we're going to step back, allow the arms\nto come down, and then come up to 90 degrees. Step back and down. Back and down. Back, Ok? And we wait 30 seconds in between. We're already on fire. Ok. From here, after we wait 30, we go Push Out\nPress. Alright. From here, 1, 2, 3, 4, 5, 6, 7, Don't drop\nit. It's tough. 8, 9, 10. And hold this sucker out there. How many times can you make it through without\ndropping the bell. Next, our Walking Lunge, or Standing Lunge\nhere. You're going to come down, lunge out and to\nyour side. Out and to the side. Out. Out. My arms are on fire! I'm complete with that. Shake 'em out. Whew! Shake it out and go back up again. 30 seconds. Next is the Thruster. Come down, thrust with your thighs. Up, press. No more. Shake them out. I literally can't straighten my arms out any\nmore Last exercise will be the Cyclone Squat. 10\non each side. Hold this up. Spin, and straight down. Spin, and down. And then finish it with one last hold. Fight it guys. Fight it. I don't think I made 30. So I put it down around 3 times. Here's my challenge to you. Beat me. Ok. Beat me. If you don't even beat me, and you put it\ndown 4 or 5 times, so what. It gives you an idea of where you stack up\nso that the next time you hit this challenge, you do better. Right? All the training in ATHLEANX, throughout the\n12 weeks of the program is geared at testing you, then training you, and testing you again,\nnot just in this challenge, lots of challenges. So, there are a lot of different things we\ncan measure here. The true test? Yes, there's smome endurance component especially\nbecause I have to speak. But really here, what is the muscle endurance\nof my forearms? So, guys. If you haven't already, start finding out\nwhere you really stack up. Head to ATHLEANX, grab the 90-Day Training\nProgram, and see where you measure up. I tell you. It's an invaluable part of training. It goes along with science. It goes along with the ability to add muscle\nand strength and size and get lean at the same time. And it goes along with pushing you to your\nlimits. I'll see you guys back here in just a few\ndays. Thumb it up if you like to see me torture\nmyself, and in fact leave some of your scores below in the comments if you dare try it. See you guys soon."
}