{
    "id": "LEJ-LjI5Ebo",
    "title": "SHOULDER TRAINING MISTAKE! - Avoid the &quot;Traps Trap&quot; for Bigger Shoulders",
    "description": "The ATHLEAN-X™ Training System: http://athleanx.com/x/trapstrap By far one of the biggest mistakes I see in shoulder training is ...",
    "transcript": "Is your shoulder development falling vicim\nto what I call the \"Traps Trap\"? I am going to show you today how with one\nshift in focus during an exercise you can change all that really quick. [Music Intro] What's up guys? Jeff Cavaliere AthleanX.com Today I am going to talk about something really\nimportant: shoulder development. What happens when we train, we sort of have\nsubstitutions. We know what we want to do. In this case we\nhave a side lateral raise. We know we want to get the dumbbell from this\nposition out to our sides, and get it from down low to up high. The problem is sometimes, our bodies are really\nsmart. They tend to overcompensate and find out ways\nand substitutions to get to the same point. What winds up happening is what I call the\n\"Traps Trap\". That means that our Traps become a little\nbit too involved in the motion in trying to get this dumbbell to the top. So let me explain what I mean. Basically if we take our dumbbell-I want to\nget it to the top. I can raise it with just my shoulder, if I\njust concentrate on raising from the side. Or I can get my trap involved, because it\nis going to elevate my arm. So if I just take my arm and I bend it here\nand then I lift my shoulder-I brought the dumbbell up from basically waist height out\nto the side here just by using my trap. OK? Right up through here. That is what happens with a lot of guys when\nthey are trying to develop their deltoid. They wind up getting way too much substitution,\nso as they are raising it up, they are lifting up through their trap. Just like that. I have seen a lot of guys just do that when\nthey are training. The problem is when you have about 50 percent\nof the work being done by the trap, and 50 percent of the work being done by the deltoid. If you are trying to build your shoulders,\nthat is not going to get it done. So what do we try to do? Well, we try to do just a couple things: one,\nyou want to get focused on the actual trap and shutting it down. Now we can do that 2 different ways. We can do it by concentrating on it and we\ncan do that by trying to neurologically shutting it off a little bit. So how do we do it by by concentrating on\nit? We do it just by pulling our shoulders down\nand back. So we are setting up in this position, OK? Just like that which will try to rest them\na little bit. Then as we bring the weights up, you are going\nto see that we are going to leave it just at the shoulder. OK? Just abduction here of the arm up without\nthat trap involvement from before. So the next thing we are going to do is actually\nsqueeze at the bottom of the rep. So when we do that-remember the chest is going\nto sort of protract the shoulder forward. That will actually put the muscle on the backside,\none of the retractors or elevators of the shoulders, the traps, on rest. Neurologically turn it off a little bit. The same way if we want to make the triceps\nrest, we are going to flex the biceps which is going to make them relax on the back side\nof the joint. OK? So if we engage our chest in the front\nand pull our shoulder blades back, now from here it is literally straight up and down. Again isolated to just at the delt. A little contraction at the bottom then just\nlet the delt do the work. So as much as we can, we are really trying\nto turn off the traps from doing too much of the work. That is the difference guys, between following\nand exercise and workout plan, and following and exercise and workout plan correctly. Remember: anything written on paper can be\ndone a lot of different ways. With Athlean-X I try to give you a program,\nand also the how-to behind it. So we always want to train like athletes. We want to take the best parts of that, the\nmost intricate parts of actually doing one exercise. Because the guys rehab-ing, and you want to\nget a specific response from him; you have to sometimes tweak exercises to do that. There is nothing different than doing a regular\nworkout. This is a science guys. I said before that we put the science back\nin strength and this is what I am talking about. Start doing your exercises correctly. Start doing them with the Athlean-X training\nsystem. You are going to build more muscle more quickly\nbecause you are targeting the way they are meant to be targeted. I will see you back here in another week. This one goes by quick, it seems like they\nare here before you know it. I will be back here guys very very soon. I\nwill see you then."
}