{
    "id": "lWUlQtpqUe4",
    "title": "100 Pushups in 10 Minutes (WARNING: NOT EASY!)",
    "description": "100's of new exercises in one program - http://athleanx.com/x/get-it Subscribe to this channel here - http://bit.ly/2b0coMW Can you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Just 10 pushups. Do you have 10 pushups in you? Of course you do. I know you do. You wouldn't be watching this channel if you\ndidn't. But do you have the ability to do those 10\npushups 10 different times? Especially if you make the difficulty level\nof that pushup harder and harder every time you do them. We're going to find out today because for\nthis challenge I want to see if you can hang with me. 10 pushups every minute. However fast it is for you to complete that\npushup, you get to rest the balance of that minute. You start up the next variation in minute\ntwo and you keep going. You try to get all of these. The ironic thing is, we're going to end where\nwe start. I'm going to explain why when we're done with\nthese. Let's get on the floor, let's get some pushups\ndone. So how'd you do? I hope you made it all the way to the end. You can see it already took enough out of\nme as well, but I'll tell you this: there's a couple key lessons here you need to learn. Number one: if you can do pushups, don't stick\nwith doing just pushups. Right? If you can do more, push yourself at every\nopportunity. I just gave you nine other variations to make\nsure you're making these things hard for you every time you do them. Second thing is, when and where you do your\nexercise matters. We started with pushups, we ended with pushups. The fact that we're ending with them after\ndoing nine other difficult variations makes them a whole different exercise. The fact that we changed the way we do the\nexercise makes an entirely different exercise. Don’t get stuck in your routine of doing\nthe same damn things over, and over, and over again. Change up the way you do them. Change the exercises that you're doing. Continue to challenge yourself. If you're looking for a way to challenge yourself\nat every opportunity, please give me the opportunity to do it for you. I would love to kick your ass in every, single\nworkout. You can head to ATHLEANX.com right now and\nget our ATHLEANX training system. In the meantime, let me know how you do on\nthis challenge. How far do you get? Do you get all the way to 10 minutes? I can tell you, those last 40 seconds are\npure hell. All right, guys. I'll be back here again real soon. Make sure you leave your comments and thumbs\nup and whatever else you want me to cover – I can't even talk. My tongues not working, I'm so burned out. Leave your comments below if there's anything\nyou want to see and I will do that for you in the days and weeks ahead. All right, guys. I'll talk to you soon."
}