{
    "id": "LxLrZ7GCtlY",
    "title": "Pec Tears and Bench Press (WARNING!)",
    "description": "If you are worried about suffering pec tears when doing the bench press then you are definitely going to want to watch this video.",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. \nShould you fear the bench press? Are you in   danger of being the next one to suffer a pec \ntear? Look, I get it, with the videos that   have been going around lately, you have probably \na good reason to be fearful. As a matter of fact,   if you haven't seen this one, this one's \ngoing to strike fear in pretty much anybody.   Look, there there's no doubt that is one of \nthe most gruesome pec injuries I've ever seen.   But are you next in line to suffer the same fate? \nNow, what people have done sort of ad nauseum at   the moment is break that video down and try to \nreverse engineer what happened there as reason   for what you could do to correct or prevent that \nfrom happening to you. That's not the way you look   at this, guys. As a PT, I can tell you, you need \nto sort of look a little bit more globally at the   biomechanics of the exercise and see where \nyou might have some shortcomings that could   potentially increase your risks a bit in terms \nof your performance of the exercise. So, I want   to make sure that I do this the right way, guys. \nI'm going to put the science back in strength and   break the exercise down for you segment by segment \nand see where you might be at risk and maybe   where you don't have to be concerned at all. \nAll right, so the thing we should do is make sure   that we're all talking about the same muscle, \nbecause when we talk about the pecs, there's a   differentiation between the pec major and the pec \nminor. And you can see here the pec minor has a   different attachment point than the pec major does \nand is the big difference of why we almost never   see pec minor tears on the bench press and why we \nalmost exclusively see pec major tears. Because   the major attaches to the arm, which is going \nto be able to move in space to create a greater   stretch that can reach his breaking point. \nSo, speaking of that breaking point,   the pec can tear in one of four different places, \neither in the muscle belly itself or at something   called the musculotendinous junction, where the \nbelly feeds into the tendon that then goes on   to attach it to the arm. Or it could be a little \nbit more ugly where it's going to detach itself   or avulse from the bone. And that can be either at \nthe proximal attachment on the sternum or out here   in the humerus. It's actually the humoral avulsion \nthat we saw in that video that I showed you. \n  Okay, so now who's most susceptible to this \ninjury, because that's probably what you're   most concerned about, are you next? Well, there's \ntwo major categories of people that have to worry   even a little bit here. And that is, number \none, you're an athlete. Particularly a rugby or   football player, a boxer or maybe a professional \nwrestler. Because there are stresses that can   happen spontaneously in those sports that place \na great eccentric overload on your pecs that can   result in a tear. Ironically, almost all the tears \nthat occur in these athletes happened in that mid   belly form. The other population of people that \noftentimes will experience those tendon pec tears   or those avulsion type tears is a weightlifter. \nAnd if you're watching this channel, you're   likely lift in some ways. However, within that \ncategory, there's one exercise that stands above   all the others when it comes to creating that pec \ntear and that's the bench press. And we're talking   specifically about the barbell bench press. And \nwhen we look at it in relation to the dumbbell   bench press, there's almost a non-existent risk \nin the dumbbell bench press versus the barbell   bench press. The disproportionate number of pec \ntears that come from a barbell versus a dumbbell   actually for me holds the key difference as to \nwhy we were at increased risk from the exercise.   And that gives you the opportunity to \nmake some adjustments accordingly. \n  To understand the key differences between \nthe variations of that same exercise,   you want to understand what the pec does \nin the first place and more importantly,   how we can place it on stretch by going in \nopposite of those actions. And the first   thing I want you to do is take your arm out to the \nside and place the other hand here on your pec.   Now, I want you to pull your arm down to your \nside. That's called adduction, right? And when we   do that, we can feel the pec engage and contract. \nWe can intensify that even more by not stopping   at our side but allowing it to actually cross \nmidline. That's called horizontal adduction,   but it's still a form of adduction. The second \nmain function of the pec is to actually internally   rotate the shoulder. So, if I take my arm and \nI dive it down and then take the thumb and try   to point it down towards the ground, you're going \nto feel the fibers of the chest engage even more.   The third function is to actually flex the \nshoulder more of a job of the upper pecs,   but still the pec major we're talking about \nbringing the shoulder up into this direction. So,   if we wanted to see where the chest becomes most \nat risk, then we want to see how we place it   on the greatest amount of stretch, and that is \nreversing those directions. So instead of going to   adduction, you want to go into abduction, getting \nthe arm out away from our body instead of internal   rotation, we go external rotation. You can see \nthat when we get into external rotation here,   you can feel an even greater stretch on the \npecs. The last thing is not shoulder flexion,   but the opposite of that, which is shoulder \nextension, bringing the arm back behind the body.   You can see what I get to the bottom of the bench \npress, I'm putting myself in that maximum stress   position. Place a high load there, you're \nasking potentially for some trouble. \n  Well, not so fast. You see, because of \nthe three motions I just talked about,   there's only one that actually can be \naltered and is altered between the two   different positions of the bench press, whether \ndone with the barbell or dumbbell, and therefore   potentially subjecting you to a pec tear. \nIt's not rotation. Because rotation and   altering rotation on the bench press, no matter \nwhat form you're doing, is non-negotiable. You   can't change the rotation of the shoulder and \nstill do the same effective exercise. If I do   the bench press and you look at it from the side \nin order to be done right, the bar has to ride   over the forearm directly in line with the elbow, \nthat is where your pressing power comes from. It's   also where your safe shoulder mechanics come from. \nBecause if I allow the bar to drift backwards   into more external rotation, not only have I taken \nthe bar away from the desired alignment over the   elbow, but I've placed additional stress on the \nfront caps on the shoulder. We don't want that.   Equally as bad, we would allow the bar to drift \nforward, taking us into more internal rotation.   This is going to lead to a far greater \nlikelihood that you're going to see an AC   joint injury than ever having to worry about a \npec tear alone, because these biomechanics are   horrible for the shoulder. And again, nothing \nyou would even consider, so it's a nonfactor   between the difference of the two versus the bench \npress. Which leads us to the extension component,   once again, not something we even consider here. \nAs a matter of fact, on the dumbbell bench press,   you get more extension of the arm \nbehind the body because you're not   being stopped by the bar on your chest.\nAdd to that fact that most pec tears occur   in this zone right here. And that is the \nzone just a couple inches off of the chest   where you were nowhere near full extension \nat the shoulder. Again, fewer injuries on the   dumbbell bench press versus the barbell bench \npress extension is not the focal point. \n  Which brings us to abduction, that third \ncomponent of chest function that I believe   is the determining factor of whether or not you're \nat greater risk of a pec tear when you're doing   the bench press. See, because if I grab a pair of \ndumbbells, you can see first and foremost that my   hands are very close together, much more narrow \nthan we would finish the top of a bench press.   Hold onto that thought for a second because it \nmatters. When I lower the dumbbells from there,   you can see that the elbows track pretty close \nto the side, generally at about a 45-degree angle   or so from the side. And Jesse even verifies that \nhere with a goniometer measurement at the bottom.   Now, if I grab a barbell immediately, because I \nhave to take a non-close grip bench press grip,   I'm going to be gripping much wider at the top \nthan I would on the dumbbells. Like I said,   what that does, guys, is it takes that arm \ninto greater abduction even from the start.   If I hold my hands right here as if I'm holding \na pair of dumbbells, you can see that grabbing a   barbell takes my arm into greater abduction \naway from the body from here to here.\n  Now, from there, we drop down, even if \nyou're properly tucking your elbows,   you're going to find in most people, they don't \nhave the flexibility to get any closer than,   let's say, 60,65, 70 degrees of abduction, which \nis a significant increase over the 45 degrees   that you get on the dumbbell bench press. \nThis alone adds just enough of a difference,   especially for those people that are lacking the \nmobility and the flexibility through the pecs in   the shoulder to handle the stresses, especially \nunder high loads in the heavier loads that you   would experience on the barbell bench press versus \na dumbbell bench press that can lead to that   sudden pec tear they've now become fearful of. \nSo why are you at such risk here? Well,   a couple of things are happening. Number one, the \nactivity of the pecs is greatest during the press   in this area. We know that right off of the \nchest, the shoulders contribute the most.   Then it sort of shifts a bit more towards the \nchest, doing the majority of the work. And then it   sort of finishes off with the triceps, helping you \nup through the lockout. If we apply the fact that   we know that eccentric stresses are even greater \nthan concentric stresses, most pec tears occur on   the way down. And again, in this red zone where \nthe packs are controlling the most of the work   and the tension through them is highest.\nNow, if that tension exceeds what the tendons   can handle, they can snap. Add into the \nfact that anyone abusing anabolic steroids   has generally weakened tendons and they are much \nmore likely to give in and be able to be exceeded   by the force that can be generated through the \nstronger pecs, especially in this risk area. \n  So now is the recommendation they have to stop \nbarbell bench pressing in order to avoid the   pec tear? No, not at all. As a matter of fact, \nagain, the risk is very, very low for most people,   especially those that are not abusing \nanabolic steroids. But I will tell you this,   you should try to adapt your chest to the stresses \nthat it's going to have to face in a barbell bench   press that are unique to that variation versus \ndumbbell bench press. We could actually use   different variations of the exercise to help our \nbody to accommodate to the stresses is better.   First thing we could do is a pause bench. No, \nnot the kind done traditionally with the pause   occurring at the level of the chest. I'm saying \ndone on netcentric when the stresses of the chest   are at their greatest and that area of the dissent \nthat they're at their greatest and that is two to   three inches above the chest. Now, of course, \nyou can take this even further by incorporating   the traditional pause to the chest for a \ndouble pause. Take it down on the center,   hold for a second in that hot zone, two to three \ninches above the chest, come down to the chest,   hold for a second and then explode back up to the \ntop. Now, one of my favorite ways to do this is   actually to get out of the bench press entirely \nand take it to the floor in a weighted to push   up. And what's unique here is we're actually \ntaking it from an open chain exercise to a closed   chain exercise. And that has different kinematics \nthat make the exercise more safe and has better   stability provided to you when you perform it so \nyou can explore wider hand positions on the floor   to get your body used to the stresses that \nthey're going to feel in the best press. \n  The fact is, all of these things can help you to \naccommodate to the stresses so you don't have to   forgo the exercise just because you're trying \nto avoid a pec tear. All right, guys, I hope   you found the video helpful. If you're looking for \nprograms where the science is in everything we do,   because as you see here, the science matters. \nYou can find them all over at Athleanx.com.   If you haven't already done so guys, \nmake sure you click subscribe and turn   on your notifications so you never miss a new \nvideo when we put one out. And also, guys,   leave your comment below, tell me what you want \nto see in a future video and I'll do my best   to do that for you in the days and weeks \nahead. All right, guys, see you soon."
}