{
    "id": "M-RT3MvTY_8",
    "title": "Your Cardio Machines are LYING To You!",
    "description": "Did you know that your cardio machines are lying to you? In this video, I am going to show you how the cardio machines you are ...",
    "transcript": "You burned 463 calories. \nYou burned 641 calories. \n  You look so handsome.\nYes, you, you sexy beast. \n  That beard is ravishing.\nWhat the fuck?\n  So, I got some bad news for \nyou. This machine right here   is lying to you. But it's not just this one, \nso is this one and this one and even this one.   See guys is you re using a treadmill or any \ncardio machine right now to determine the amount   of calories you re burning to help you in your \ngoal to lose more weight, you're not getting the   right math. You're being lied to. The number \nof calories that you're burning are just not   accurate. Today I'm going to show you not only the \nworst of the worst, but also I'm going to tell you   the machines that are maybe better worth your \ntime than others. It's time for the truth. \n  But the first truth that needs to be \ntold is if you're using your cardio   as a way to create your caloric deficit, to \nlose weight, you're making a big mistake.   Because you're never going to be able to outrun \na bad diet, we talk about it all the time. Even   just one slip up in a meal is enough to race an \nhour's worth of effort at the gym. You need to   make sure that when you're trying to lose weight, \nyour efforts are focused first and foremost   on cleaning up the foods that you're eating \nright now. Make your caloric cuts there and use   the additional cardio to supplement those efforts. \nAnd that's where the real results will happen. \n  So, the first thing you have to be on the lookout \nfor is how these things are actually asking you   for the information, because if they're not asking \nfor your weight directly, then they're not giving   you an accurate result. Because we know that \ncardio machines need to know how much you weigh.   A heavier person has to work harder to move their \nbody through space and therefore can burn more   calories. Whereas somebody that's lighter is going \nto burn less calories for the same activity. \n  Well, what happens with these cardio machines \nis they calculate that calorie burn based off of   something called a MET M-E-T which is a metabolic \nequivalent. And essentially one MET is the value   of you sitting on the couch doing nothing. The \ncalories that you would burn by literally just   sitting down watching TV. And anything you \ndid that increased your activity beyond that   is going to be some multiple of that number. So, \nif you went for a jog, you could have, let's say,   a three or four MET burn, which is three or \nfour times harder than sitting on your ass.   That being said, it's always calculated by \none bodyweight number, usually 154 pounds.   So, if you don't weigh 154 pounds, you're not \ngetting an accurate calorie output read back to   you. If you weigh less than that, then you're \nactually overestimating how many calories you   burn and if you weigh more than that, you're \nactually maybe underestimating by a little bit.   But don't worry, there's a lot of other \nways that these machines are screwing you.   I'm going to show you those, too. \nWait, isn't this your towel?   Oh, that's disgusting. \nAnd one of them is by actually maybe   fudging the math intentionally. You see, a lot \nof times the number that you read in terms of   the caloric burn is based on including something \ncalled the REE or the Resting Energy Expenditure,   the calories that you would burn normally at rest. \nSo, let's say you're on the treadmill and it tells   you that you burned 420 calories. Well, what if \nit's also including the fact that you would have   burned 100 calories if you did nothing at all? \nWell, that's just inflating the overall number.   You only burn 320 extra calories. You're already \nlikely using that number in your base calculation   to determine how many calories you need to \nburn during the day. It's just not fair. \n  So, you might be asking yourself, why would they \ndo such a thing? Well, maybe to make you think   this machine is amazing. And I would love to do \nall my workouts on this machine. In a matter of   fact, I might want to buy one of these and put it \nin my house because it makes me feel good about   the number of calories I'm burning. Just throwing \nit out there. But let's not just blame the   machines entirely, because if you're doing what \nI'm doing right now, you're screwing yourself.   If you've ever ridden a bike leaning this way, \nyour posture is creating less caloric burn. How?   Because you're doing less work. Leaning on the \nmachine, on weighting some of your body weight   is costing yourself some calories. Amazingly \nso up to 50% less than what you thought you   were burning and that causes problems. \nYou can do it even on a treadmill. You've   probably seen it a million times or done it \nyourself. You hold on with your hands or worse,   you lean forward. Or even on a Stairmaster any \nattempt at all to try to weight any of your body   weight is a good indication that you're actually \nlooking for a way out. If you're going to do   your cardio, make sure you stand up straight \nand do so with good posture, you're going to   get a lot closer to the number that you actually \nthought you were burning in terms of calories. \n  Can I ask you a question? If you're going do bicep \ncurl, do you think you get better results doing   this or actually taking it through a full range of \nmotion all the way down and all the way up? Well,   it should come as no surprise the full range \nof motion is better. But then why are you doing   this when you're doing cardio, you're cutting \nyour range of motion short often. For instance,   if you use a Stairmaster, or in this case, a Step \nMill, a lot of us take the option of taking short,   choppy steps. We don't drive the step all the way \ndown through full hip extension. What that means   is less work being done. And for you, let's \nwork means less calories and less calories   means less weight loss. \nAnd look at even your choices,   like the elliptical machine. It's locking you into \nan abbreviated range of motion. You can't extend   your leg for the back even if you wanted to. \nAnd then even this, I'm sure you've seen people   who stand up while they're pedaling on a bike. \nNow, this is not just some fancy peloton trick,   it's increasing the range of motion. You're \ngetting more hip extension also on unweighting   your body. Remember the more of your body weight \nthat you're bearing during the exercise. You're   doing, the more calories you're burning and \ntherefore getting better bang for your buck. \n  So, remember, if it feels easier, it is \neasier. Instead, look to make it harder,   increase that range of motion. And with that \nincreased range of motion and work done,   you're going to find better overall success from \nyour time spent in the gym. All right, so if all   these cardio machines are lying to you, are there \nat least some that are lying to you less? And the   answer is yes. And it starts with the stationary \nbike. It's the most accurate overestimating   by only about 7%. And the reason for this is \noftentimes the way that we calculate the calories   burned here is through mathematical formulations \nand based off of power output. In other words,   watts. And when we do that and we combine it with \nour body weight, which most of these machines will   ask for, we get a much more accurate judgment.\nHowever, next up on the list is going to be   the Stairmaster. Here we're looking at about \na 12% overestimation on the number of calories   that you burn. But you've got to make sure, once \nagain, that you're not leaning on that machine,   like I said, and that you're taking those nice, \nlong, full range of motion steps. The next one up   down the list in terms of accuracy is going to \nbe the treadmill, which really isn't such good   news because so many people use this machine. \nAnd the problem here is twofold. Number one,   the accuracy is now off by 13% to up to 20%. And \neven if you do what I told you and keep your hands   off the handrails, sometimes you're still fighting \na losing battle here. Because the calibration of   the machine is a requirement to maintain its \naccuracy and most gyms just don't calibrate the   machines often enough. So that's something you \ncan't even do anything about. And then finally,   the most inaccurate of them all is the elliptical \nmachine, sometimes off by as much as 42%,   mostly due to the fact that the range of motion \nvaries greatly between even different models. \n  Now, to put this all into real \nworld perspective, imagine this   if you spent 30 minutes on an elliptical machine, \nyou might be overestimating the number of calories   burned by 130. Now, think about that. If you're \ntrying to create your overall deficit for the day   and you think you've burned 130 calories more \nthan you did, therefore you could eat more food,   you're kind of setting yourself up for disaster. \nExtrapolate this out for the entire year,   if you were to take 130 calories in extra over \nyour baseline rate every single day, that's a   14-pound weight gain by the end of the year. \nLet's face it, we need to figure this out. \n  Or do we really? Because there's a few things you \ncould do right now that are actually going to just   nullify the inaccuracy of these machines and \nstill help you to get back on track in terms of   your weight loss. And the first thing is just to \nchoose a different machine because there are some   that are just way better at burning a lot more \ncalories. So even if they're off, you're still   burning a lot more than you are right now. And \nthe main key here is to integrate one that has   working arm movement, not just going along for the \nride, like on the elliptical, but actually working   and working hard. And one of the easiest ways \nto do this is with an air bike, you could burn   about 20 to 25 calories for every single minute \nthat you're on this. The other option is to   use a rowing machine again, resisted upper body \nmovement as well as lower body movement here.\n  Obviously, when you use these guys, you know \nhow much more difficult they are. The difficulty   is going to be a dead giveaway in terms of the \neffectiveness of the exercise. And finally, you   could use something like this ski ergometer or the \nski erg. The point is you have alternatives to the   standard cardio options that are ultimately going \nto do a better job of helping you burn calories.   Yeah, I know they're not the most pleasant, but \nat the end of the day, what matters is the work   that you do. And the more work you do, the more \ncalories you burn and ultimately, the more weight   you'll lose, so you got to consider it. But even \nif you decide that you just want to stick to the   machine you're using right now, you want to find \nways to make it more accurate. What can you do?   Well, the first thing, as I mentioned, is to try \nto find one at least allows you to input your body   weight. Because when you do, you're going to have \nan infinitely closer accuracy when it comes to the   number of calories burned. But the other thing \nI like to just recommend is throw a towel over   it and stop looking at the calories. Instead go \noff of your respiratory rate. The more difficult   it is for you to carry on a conversation \nduring exercise, the more indicative it is   of the amount of effort you're putting forth.\nSo, aim for more breathlessness. In other words,   whatever cardio machine you're using right now, if \nyou're more breathless, the next time you use it,   you're likely working harder and therefore \nincreasing your calorie burn. Or make it easy for   yourself and do what I advise my athletes to do. \nSimply take the output that the machine gives you   and divide it in half and use that to calculate \nyour intake amounts for the day. Oh, and by the   way, don't rely on the wearable devices to try \nto improve your reporting on your calorie output.   They're actually not much more helpful. \nAs a matter of fact, the best of them has shown   only a 20% inaccuracy, with the worst \none being actually 96% inaccurate. Yeah,   even a blind squirrel finds an acorn once in a \nwhile. So, remember, if you're looking to lose   weight and cardio is part of your equation \nhere, at least make sure you're getting the   right numbers back. In the meantime, if you're \nlooking for more proof that trying to outrun   a bad diet is a bad idea, you're going to \nwant to watch this video right here. \n  No, not that video. \nThat video right there. \n  Oh, man. \nIf you're looking for a complete program,   you can find it over at athleanxcom. If \nyou haven't done so, click subscribe,   turn on your notifications so you're never \nmiss a new video when we put one out. \n  Oh, Jeff, can I tell you a lie? \nSure. \n  You're the best boss ever.\nYou're so funny, Jesse. I think I love you."
}