{
    "id": "m4-MLaa4nCs",
    "title": "Do This Stretch First Thing EVERY Morning (INSTANT RELIEF!)",
    "description": "If you wake up with stiff, tight muscles and wish there was a single simple stretch you could do that would make you feel amazing, ...",
    "transcript": "What's up, guys? Jeff Cavaliere. Athleanx.com. So \nwhen you wake up in the morning, if you look at   all like this, I'm talking about the gyrations \nthat I'm going through here, the twists,   the stretches, the tightness in the hip flexors, \nright, the back just does feel like you can't even   move it or turn it at all. If that is you, then I \nhave the solution for you here. Because I'm going   to show you one thing-- and I know there's some \nother things I gave you in the past to do in the   morning, but this is the one thing if you have \nreally no time at all to drop down on the floor   and do because this is going to fix a lot of those \nissues that you're feeling in one shot. All right,   so with that being said, got a new feature here. \nA lot of sports channels of the replays and   telestrations, well, we have something called the \ntelestriation. Don't worry, it's cool. All right,   so what's this exercise? Now, first of all, as \nI said you're going to be on the floor to do it,   and every single person can do this. It \ndoesn't matter what your strength level is,   what your ability level is. You can do this. \nAll right, and the thing is you got to first   think about what might be getting a little bit \ntight and screwed up when you sleep overnight.   Because you're sleeping for maybe six, \neight, ten hours-- Jesse, 14 hours-- and   you got to undo some of that because we tend \nto get really stiff. Well, think about it,   if my arms are by my side like they probably are, \nwe're going to get some lat tightness because   that's where we stayed there the whole night. \nIf I sink into the bed at all-- which if it's   soft enough you will-- you're going to get some \nrounding of that thoracic spine. Your hips are   also going to sink in a little bit too so they're \ngoing to be in a little bit of flection, okay,   so they're not fully straightened out. So you \nget some hip flexor tightness. You're not really   rotating. You might like to lay on your side, but \nyou're not keeping your torso here and turning   from the top to get actual rotation through the \nthoracic spine so you can get tight there too.   So we can fix all these things and this is what it \nis. The exercise is the bridge reach-over. Okay,   so now, what is so great about this? Well, this \nis where we want to start breaking down piece   by piece. And this is where I say, Hey, boom, \nright there, and I freeze it. And now I have the   opportunity to break out my telestriation. \nHey, hey, hey, that's my idea! Jesse,   it is Jesse's idea actually, but it's a good one. \nSo now look what's happening here. First of all,   I'm pushing through the heels, all right. And I'm \ntrying to drive up in that direction. But what it   does is it enforces this glute activation. And not \njust that, because we have the knees bent here,   we get hamstring and glute coactivation, which \nis how they always prefer to work. People tend   to let the hamstrings dominate, they don't let \nthe glutes do enough of the work, and that's what   leads to an overload on the hamstrings and a lot \nof hamstring strain. So at least you're training   this to work in the way it prefers to work. But \nbeyond that, look at the hip extension I get. I   actually get even a little bit of a bow at the \ntop because I'm getting all the way through.   And a lot of times we don't ever really extend \nfully through to the top, and we know again,   just a little bit of flection at night we need \nto get through that to feel like we're getting   rid of that tightness. So we have activation \nhere in the glutes. But beyond that, what's   happening here with the lats? The lats are getting \nstretched out in that direction. Arm up overhead,   right? Attached to the top of the humerus here, \nseparated from the hip itself. These two points   getting further and further apart from each other \nhere like that. And now we have some stretch on   the lat so that second problem is done. And then \nwhen we look here, this is the key for me. We get   thoracic extension and we get the rotation in this \ndirection. So if I clear that off, we can see it a   little bit better. Again, extension and rotation \nbecause I got to reach to the opposite side. So   in one move we're getting all of that. And by the \nway, very little rotation here at the lumbar spine   because we know that we don't want to try to do \nthat. We don't get rotation from the lumbar spine.   It stays in alignment with the hips. We're just \nreaching up and getting the rotation from where   it should come from, which is the thoracic spine. \nSo again, you alternate here. If we go back and   take a look at what it looks like, one side to the \nother like that, each time drive it up as high as   you can, push through the right leg to reach over \nto the opposite side, push through the left leg to   reach over to this side. An amazing exercise that, \nagain, any person can do. Drop down on the floor   in the morning, do five to each side, maybe do it \ntwice, you're good to go. So there you have it,   guys, a quick stretch that you can do every \nsingle morning that's going to undo a lot   of the things that are happening when you sleep \nto make you feel a hell of a lot better and get   you off on your day in the right direction. Guys, \nremember, if you're looking for programs where we   build all of these things into everything we do \nbecause it all matters. How you feel not just   during your workout but after your workout may \nbe even more important. All of our programs are   available over at Athleanx.com. If you found the \nvideo helpful, if you like the new telestriation   feature-- Jesse's idea by the way-- leave your \ncomments and thumbs up below. Make sure I do more   videos of them. If you haven't already done so, \nclick subscribe, and turn on your notifications so   you never miss a new video when we put one out. \nAll right, guys, see you soon. Telestriation."
}