{
    "id": "MABMQy8CCNc",
    "title": "HOME &quot;300&quot; WORKOUT (Bodyweight Only!!)",
    "description": "Get 6 weeks of completely bodyweight workouts here! http://athleanx.com/x/no-equipment-needed The 300 workout is definitely ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.COM. We've made it, and I say WE. Our 300th Video! Guys, if it wasn't for you watching, subscribing,\nparticipating, and supporting ATHLEANX, we would have never made it this far. SO A BIG THANKS TO YOU! And now, your thanks from me is probably one\nof my hardest workouts ever. It's our 300 Workout. This one is going to be bodyweight only. What I wanted to do was make sure that we\ngave you guys a basic, or more basic, version if you're just starting out, and then our\nadvanced version that will really kick your ass. It depends on where you are and how much you've\nbeen following our videos for the first 300. If you've been following them all, you're\nready to take on this advanced version. This is a XERO-inspired workout, guys. That's our Bodyweight only program. The only thing we're going to do is we're\ngoing to use a bar here. We have the advantage in the XERO Program\nof not even using anything. Not even a single bar, band, bench, nothing. But here, let's break one out and push you\nguys to that next level. (4:05) Alright, guys, so there you have it,\nanother workout. And yes, number 300 in the books. The thing is, like I said in the beginning,\nguys, all the thanks goes to you, all of your support of what we do here at ATHLEANX. This is what makes it all possible. This is what drives me to do them. 300 more videos are on the way, and I can\nguarantee you, they'll be better than the first 300. If you guys want to learn more about ATHLEANX,\nor start following our programs, whether it be XERO or even our Training Programs that\nrequire minimal equipment, then Head over to ATHLEANX.COM right now and get\nyour 90-Day Training Program. Make sure, as always, you leave a thumb's\nup or a comment below. Tell me which version you followed. Hey, if you want to get bold, post a video\nof yourself doing one of the versions that we just showed you. Alright, guys, we'll be back here next week. Remember, 3 videos a week now. I gotta get back to work."
}