{
    "id": "maRsK69j6m0",
    "title": "Stronger, Healthier &amp; Ripped at 40 (HOW HE DID IT!)",
    "description": "If you have ever wanted to be stronger, more ripped or feel less achy and beat up from your workouts then you are going to want ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. I’ve got a different type of video for you\nhere today. I’m going to give you a ‘behind-the-scenes’ look and access to one of our athletes. WWE\nSuperstar Seamus. Often times we don’t get a chance to learn about the guy. We only learn\nabout what we see on TV, but what I think is very interesting about the transformation\nthat Seamus has made is that it does give you the chance to look at the guy. The guy who’s having the same struggles\nthat a lot of you have. We all have our issues. Whether we’re trying to put on size, whether\nwe’re trying to lose fat, however we’re trying to change our bodies. We run into obstacles\nand it’s how we approach them that we get through them and we can learn from them. I\nthink you’re going to definitely find that to be the case in this video. But to set the stage a little bit, a few weeks\nago when Seamus came in here with the Usos – which is a video we put up on this channel\n– Seamus and I sat down, recapping and going over what this was. And really, we were referenced\nback to the start where Seamus was at a crossroads. He was at the point where he either wanted\nto put on a bunch of size, be like the next Brock Lesner type, or whether he needed to\ngo the other direction. Which is what my suggestion was because at the same time that he wanted\nto know what to do aesthetically, athletically I always have a focus on where we’ve got\nto get to. He’s not a young guy. He’s over 40 now and at the same time he\nhad some aches and pains, and he had some nagging injuries that were really important\nto address, so we could set the stage for him to stay around a lot longer. Those are\nsome things we talked about as well. So, I think the whole thing here, guys – you’re\nalso going to get a peek into what he’s like as a person. I think you can genuinely see right away he’s\na great guy and, again, you don’t always get a chance to see that part of the athlete.\nIt’s just whatever we see on TV. Especially wrestling. It’s depicted in a very, very\ndifferent way. So, I think you guys are going to enjoy this and find it very helpful. With\nthat being said, let’s get started. I’m here with WWE Superstar Seamus and he\nmight look a little bit different to you guys. Whomever has been following this transformation,\nbecause it’s been a big one, and I want to talk to you about what you’ve been doing.\nI want everybody out there to know how you did it because just like anybody else, sometimes\npeople think “Oh, he’s an athlete. It’s got to come easy to him.” SEAMUS: Yeah. JEFF: Has it been easy? SEAMUS: No. JEFF: Okay. So, for that reason I want people\nto hear what you’ve had to do to do it. Again, here’s what we’re talking about,\nguys. It’s the transformation here that you can see for yourself. So, let’s rewind\na few months. You and I got together. SEAMUS: Yeah. JEFF: We were talking a little bit and you\nhad some questions for me, at that point. SEAMUS: Yeah. I decided that I thought it\nwould be a great idea to put on a lot of extra pounds, to make myself look bigger in the\nWWE ring – more imposing. Unfortunately, what happened was putting on all that extra\nweight, I put on a lot of body fat. So, my biggest fear is always being – you always\nthink in your mind you want to be bigger. Maybe it’s the body builder mentality when\nI started because I started training young and you always think ‘bigger is better’.\nBut I was always afraid to get really lean, or drop all that weight because- JEFF: Becoming small. SEAMUS: Yeah. I felt like that would translate\non the TV, or in real life where, if I’m not looking big, or if I’m not filling out\na t-shirt or jacket, that means I’m not where I need to be. I feel like I’m less\nadequate. I always feel like that idea of training when you first go to the gym and\nstart lifting is being able to – your arms popping in the sleeves of a t-shirt. I guess it’s that kind of self-conscious\nfeeling or image you have. So that’s what I talked to you about. You were telling me\n“No, I think you can lose – drop this weight, stay lean, but also look big.” JEFF: And look bigger. SEAMUS: Yeah. And I was having an internal\nstruggle with that. JEFF: Which is tough because, again, guys\nthat have gotten themselves to that point, it is tough to think about becoming a little\nbit smaller in size because of the weight loss. SEAMUS: Yeah. JEFF: But what actually happens, and we preach\nit all the time, is that as you become leaner – and we’re not talking about getting\nweak in the process. SEAMUS: No. JEFF: But as you become leaner, and you train,\nand you maintain your hard training – you’re not sacrificing the difficulty of your training\n– you will actually start to look way more muscular. The changes in appearance become\nmuch more muscular, especially in how you look. People will say you look a lot bigger. Guys will say that I look like I’m more\nthan 200lbs. If you stood next to me – if I stand up right next to Seamus, you’ll\nknow that I don’t weight over 200lbs. But it’s the appearance that the muscularity\ncreates. So, it’s always a good thing. SEAMUS: Yeah. So, we had the conversation\nwhere we talked about diet and- JEFF: Nutrition. SEAMUS: Nutrition, excuse me. Diet’s not\nthat word- JEFF: It’s a hard habit to break. SEAMUS: No, it is. That’s that word – that\n‘diet word – because when you’re on a diet- JEFF: Because you did diets a lot of times\nbefore. SEAMUS: I have. I’ve tried – I’ve kind\nof ping-ponged up and down. But we talked a lot about nutrition and the training I was\ndoing as well. I started changing my training. If I was doing a bench-press, for example,\nI started off with a wider grip, which is what you recommended. So, the weight there\ndropped a little bit. Not too much, but just to get more of the chest. JEFF: Feel a little bit more intentional. SEAMUS: Yeah. JEFF: Instead of just moving the weight, which\nwe were focused on, now you’re focused on creating movement from the muscles you’re\ntrying to stimulate. That was a huge difference. And it does require a slight drop in weight\n– I always think that our bodies don’t necessarily know the numbers on the side of\nthe dumbbell, or on the side of the barbells. SEAMUS: Yeah. JEFF: What they know is the tension that the\nmuscles are creating. And almost by lessening the weight a little bit more you created a\nlittle more tension. SEAMUS: Exactly. JEFF: It’s almost become harder. SEAMUS: Exactly. Even like anything on the\nback when we were doing pulldowns, or seated rows, every rep is that squeeze for 2 seconds\nat the top. And right away, the next morning you wake up and you feel like your body is\nin shock because it’s not used to training that way. And you really are – the first\nrep is just as important as the last rep. So, I changed my training that way, but also\nthe biggest problem I’ve had is being on the road all the time and having drives until\n3:00 in the morning, it was all about nutrition. I’ve been eating healthy for the last couple\nof years, but the problem is even if you’re eating healthy, if you’re taking too many\ncalories than what your body is burning off then you’re going to store body fat. JEFF: Mm-hmm. SEAMUS: It’s as simple as that. So, I was\nable to track macros better, and the food I was eating, and I combined that with fasting\ncardio, and your workout training tips that you gave me to create a leaner, more rounded\nmuscle. JEFF: And you were moving better, too. SEAMUS: Yeah. Moving a lot better. JEFF: Feeling better? SEAMUS: Way better. I started on WWE on TV\nwhen I was 31 and I’m 41 now, mate. And I feel better than I did at 31 years old. JEFF: Yeah? SEAMUS: And I know I look better as well.\nThat’s – just the fact that I’m taking control and being accountable for everything\nI’m doing on a daily basis. It’s all about breaking habits. It’s all about not taking\nshortcuts. JEFF: Yep. SEAMUS: And that’s what’s been a huge\ndifference to me. So, I literally feel better than I ever have in my entire – this is\na great feeling. From where we were to now, that conversation we had, you don’t think\nof it right away because it’s not an overnight process. That’s, I think, what people have\nan issue with. It’s like, well, they want changes right now. You want something to happen right now, but\nif you stay the course, and you’re patient, and you know what your goal is – to where\nwe are now, it’s like – what are we, in March? To look back on that, the picture you\njust saw- JEFF: Look. SEAMUS: It’s unreal. JEFF: People don’t understand that 6 months\nlooks like a long time away and they’re like, “I don’t want to have to do this\nfor 6 months”. SEAMUS: Yeah. JEFF: But if you do it day by day…so, a\nfew weeks ago we met up with Aamir Khan, the number one Bollywood actor who goes through\nsome incredible transformations for his roles. Sometimes he has to put on excess weight.\nOther times he has to get himself in incredible shape. He said that the thing he does when he makes\nhis transformations is, he doesn’t focus on the end goal because it looks too insurmountable.\nIf it was a mountain you wouldn’t stare at the top of the mountain. SEAMUS: Yeah. JEFF: Instead, you stare at the path in front\nof you because the one thing you know you can do is take the next step on the path,\nright? SEAMUS: Yeah. JEFF: You know you can move one foot forward.\nInstead of having to look up – because then what happens is after taking a series of steps\nwhich, in your case, is 6 months later, when you look up the top of the mountain is right\nin front of you. SEAMUS: Yeah. JEFF: As opposed to when you looked at it\nfrom the very beginning and it looks like it’s not something you could actually tackle.\nSo, I preach that mentality. I think it’s very important. Even, they mentioned with\nthe macro counting. It’s funny because we don’t even really recommend that people\ncount macros to the point where it becomes a mathematical chore. SEAMUS: Yeah. JEFF: It becomes something that you despise\nand don’t want to do. So, you have the easy out for “Oh, I got tired of doing that.”\nIt’s not necessarily about that. For you, it was about awareness. Counting macros for\nyou was more of an awakening. SEAMUS: Yeah. JEFF: To actually realize what it was because\nit was too haphazard. It was too much unpredictable. Especially when you add into that the schedule\nthat you guys follow. In late one night, skip a meal the next day. Everything was so unpredictable,\nand you add to that the fact that you didn’t really have any awareness of what you really\nwere taking in. SEAMUS: Yeah. JEFF: It was a recipe for disaster, no pun\nintended. SEAMUS: Yeah. No, it’s great. Like you said,\nyou eat healthy and you think “Why am I still putting on weight?” or “Why am I\nnot losing weight?” But you can eat healthy, but at the end of the day, I would eat – even\na healthy meal has calories in it. JEFF: Right. SEAMUS: If you take too many of those meals\nor you overeat then you’re not going to lose weight. When you talk about the mountain,\nthat’s exactly what it was. Where I’m at now and where I was then, to think of where\nI am now, I didn’t think I – I didn’t believe, or I didn’t really foresee me getting\nas lean as I am at this point right now. JEFF: So, where to from here? SEAMUS: I’m just going to keep going, mate.\nI’m just enjoying the process. I really am. Obviously, Goodwill are doing a great\njob because they’ve got all my clothes that I had. Suits and everything. I put on a t-shirt\nnow and I feel like I’m wearing my dad’s t-shirt as a teenager, but I want to keep\ngoing. I want to see where this process goes because\nwith Celtic Warrior Workouts, the mentality is ‘Brave Change’. Stepping outside your\ncomfort zone. That’s not just about working out or trying different workouts. It’s all\nabout your body as well and your diet and everything that comes with it. And this has\nbeen – this whole channel and everything, for me, has been a process. It’s been a\njourney. JEFF: Yeah. SEAMUS: So, I’m going to keep going as- JEFF: If you guys haven’t already done so,\nsubscribe to Seamus’ channel. Follow the journey. Again, it’s not just your channel’s\nslogan about ‘Brave Change’. You literally do it. You’ve done it yourself. You put\nyourself out there. SEAMUS: Yeah. JEFF: You put yourself out there, even with\nme in saying “This is what I look like and I’m not really happy. What can I do?”,\nyou know? SEAMUS: Yeah. JEFF: And then you followed through, which\nwe talked about off camera. Follow through, guys. Don’t just set your goals. Follow\nthrough on them. And yes, take on that step by step approach, but make sure you’re at\nleast taking that step. Follow through and great things will happen. You’d be very surprised what you can achieve\nif you just do something about it and not just keep talking about it. One last thing,\njust in case – this is social media. SEAMUS: Yeah. JEFF: The people accuse you saying, “He\ndoesn’t look like that in real life”, can I see in real-time here that you actually\nlook that way? SEAMUS: You can, but I don’t want them sitting\nthere thinking – you talk about a goal, Jeff. The goal is to have a better six-pack\nwith Jeff Cavaliere. JEFF: There you go. SEAMUS: It’s not about the climb. There’s\nthe mountain right there. So, okay. JEFF: Let’s see it. SEAMUS: Let’s see it? JEFF: What have we got. SEAMUS: No one start throwing dollar bills\nat me, all right? All right, here we go. JEFF: Look at that. Hard work right there.\nLooks a lot different. SEAMUS: Holding my breath in. JEFF: Here. Can we – oh, wow. He’s actually\nbeen training, too. Not just that. Talk. SEAMUS: I think I’m stuck in this position. JEFF: Guys, like I say all the time: it takes\nan approach that makes sense and it takes an approach that you can be consistent with.\nIf it wasn’t something he could stay with consistently, he never would have gotten to\nthis point here. SEAMUS: Yeah. JEFF: Find something that works for you guys.\nFind a nutrition plan that works for you guys. We have one. It’s our X-Factor Meal plan.\nWe’re not taking carbohydrates out of it, guys. I think training like an athlete is\nimportant. We don’t want to deprive ourselves. If you’re interested it’s over at ATHLEANX.com.\nIn the meantime, Seamus, thank you again for coming in. SEAMUS: Thank you, mate. JEFF: By the way- SEAMUS: Can I say one other thing? JEFF: Yeah, you can. SEAMUS: Just, as a kid, I was way overweight.\nI’ve always had that body fat. So, if I can do this type of transformation by sticking\nto correct nutrition and following rules, and being consistent; you can, too. I’m\nno different than anyone. I didn’t wake up – I’m no genetic freak or anything\nlike that. It’s just about being consistent, watch\nwhat you’re eating, and being accountable for everything you’re doing. So as a chubby\nkid, whatever, if I can do it, so can you. JEFF: Great. Awesome. I was going to mention\nthe workouts we did. SEAMUS: Yeah. JEFF: So, we just banged out another series\nof workouts. A leg workout on my channel that we’ll be posting up here – if it already\nhasn’t – and then the other portion on your channel, where the real torture starts. SEAMUS: Yes. JEFF: And we take the Usos through it as well. SEAMUS: Yeah. JEFF: So, guys, I want to make sure you head\nover there. Check him out and while you’re there, subscribe. It’s awesome. I’m actually\na subscriber to his channel. I follow his journey every step of the way. SEAMUS: As am I, of his. Yeah. So, until then,\nBrave Change. Oh, now you’re just showing off. JEFF: Now it’s- SEAMUS: See that, Jesse? Huh? What have you\ngot, Jesse? What have you got? JEFF: See you."
}