{
    "id": "mAtnlVdAxSo",
    "title": "Squat “Fix” Gone Bad (STOP DOING THIS!!)",
    "description": "If you want to learn how to squat properly you have to learn the right cues. In this video, I'm going to cover one of the more popular ...",
    "transcript": "What's up guys, Jeff Cavaliere, athleanx.com. Today we're talking about the squat and how\nyour feet should be positioned, or maybe not your feet. You see a lot of guys, you've probably heard\nthe cue, turn your toes out a little bit in order to get a better depth into your squad,\nbecause a lot of us get stuck. We try to go down deeper into a squat, but\nwe run out of room down there in our hip joint. We might feel it in the form of a pinch, or\nwe might just get down to the bottom and say, I can't go any further without other compensations\nup and down the kinetic chain. But the problem a lot of times in the cue. Toes out is not going to solve your problem. You need to think more up the chain towards\nthe knees because we need those needs to be out. And the difference here is the feet themselves\nhave a bit of extra rotation capability that are a bit independent from what's going on\nabove it. And by the way, this is a pretty badly cracked\nfibula. Don't let this happen to you. If you're going to try to squat, ignore this. This part I'm talking about is the foot. So you want to make sure that you're not just\nturning your toes out because they can move relatively independent from what's going on\nabove. Not entirely, but relatively. We have much more ability to create what we're\ntrying to do when we focus on getting the knee itself externally rotated, turned out. Why? Because when we get to the hip, joint itself\nwas getting stuck a lot of times is the ball in the socket that acetabulum. Whether it's face too forward, the orientation\nitself is what causes issues for people or makes it different between one person and\nthe other. So when I bring my leg up, if the leg isn't\nrotated enough, what happens is as I come up to the front here, I actually hit a bony\nblock. When I get to a certain amount of flexion\nhere, I have a bony block and I can't get any higher. You can see right here I've run out of room,\nbut what if I can get to more external rotation and that's by focusing on what's happening\nat the knee, as I get up to here, you can see how much deeper I can go. I freed up that bony block by clearing it\nwith more external rotation. So instead of cuing your feet, you do this. You get in this position here and you turn\nyour knees out. And what it does is a few things. Number one, it gives us the ability to get\nmore contribution in activation of the adductor's because we're on a little bit more of a stretch. The adductor's can help us with extension\nof the hip. So when we're down the bottom of a squat and\nwe come up out of it, we want hip extension. So in assistance to the hamstrings, in assistance\nto the glutes, we get adductor activation. This is so important that oftentimes when\nsomebody comes to me with hip pain or hip pain following squats, whether it's from an\nimpingement or just a history of degeneration, if they squat and then they say that they\ndon't have adductor soreness the next day, then I know they're not doing this right. You have to then focus on getting your knees\nout more because you want those adductor's to contribute. The next thing it does is it brings in some\nadditional help. We want the glutes to participate in getting\nus out of the bottom of a squat. And you could feel how much they can contribute\njust by doing this. Stand up if you're watching us sitting down\nright now. Turn your toes in as much as you can. Now, try to squeeze your glutes as hard as\nyou can. You're not going to feel that much going on\nthere. Now, without doing anything else, I'm not\ngoing to change the strength of your glutes, I'm just going to change the orientation of\nyour body in space here. I'm going to turn my hips out into more external\nrotation, not the toes, the hips by getting the knees out there. Now I squeeze my glutes and I feel much more\nof a contraction, as you will, too. We know we have a lot more strength there. So if we can get the glutes to contribute\nwith more strength here, then we've got the winning combination. So how would I cue this and make sure you're\ndoing this properly? Well, again, focus not on the feet, but on\nthe knees. Get those knees turned out about 20 to 30\ndegrees and now I take my hands right here and I want you to take your hands and put\nit right here in the creases of your legs, right in that hip joint. Now visualize sitting down, having the pelvis\ndrop right down so that just like I showed you as that leg went up into flexion, you\ngot to drop that pelvis down in between. So if I'm right here, I drop straight down\ninto my hands at the floor and you can see that my pelvis actually dropped inside my\nfemurs. They re traveling out here but they've cleared\nroom for this up and down path of the pelvis. That is going to give you the type of cue\nthat you're looking for. Now, the final thing, how would you reinforce\nthis? How would you want to make sure that you're\ndoing this properly? Well, number one, you've got to make sure\nthat your adductors are flexible enough to allow this, because as your knees start traveling\nout, you want to make sure that you have the flexibility to allow you to continue to drop\ndown those adductor are going to feel some of that stretch we talked about. That beneficial stretch that creates the reflex\nto get you back up out of the bottom. And the other thing is you want to make sure\nthat you do strengthen the external rotators of the hip and I like to do it out of a flex\nposition. So one of my favorite things to do is a simple\nclamshell exercise. Just laying on your side, placing the band\njust above the knees, having the hips flexed here, and then, of course, working on external\nrotation strength of the Glute Medius from this position. The addition of this the stretch in this exercise\nare really there just to reinforce what it is we're focusing on, and that is cuing you\nbetter to not focus on just the position of the foot, but more importantly, on the knees. And by the way, when your knees are traveling\nout, they're going to find that it's a little easier for them to track out over those toes. And again, going beyond the toes is something\nthat I've done an entire video about why it's important to allow your knees to track that\nway. It's just going to be a lot easier for people\nwhen you don't have to go all the way in the sagittal plane. You have some of this tendency to move out\ninto the frontal plane that's going to make that all a hell of a lot easier for you to\nexecute. All right guys I hope you found this video\nhelpful. Make sure you try this out. If you're having any problem at all in getting\ndown to depth where you feel that bony block or impingement in your hip, this is going\nto help you tremendously. If you're looking for programs, guys, where\nwe put the science back in strength step by step, all our plans are laid out over at Athleanx.com. If you haven't done so already, make sure\nyou click subscribe, turn on your notifications so you never miss a new video when we put\non out. All right guys, see you soon."
}