{
    "id": "MCzFqNiFPwE",
    "title": "The PERFECT Chest Workout (20 MIN EDITION!)",
    "description": "If you want to build a perfect chest but you only have 20 minutes for your chest workout, what would you do? In this video, I'm ...",
    "transcript": "If you're running short on time, but you don't \nwant to shortchange your results, I'm going   to show you what you have to do by trading and \nworkout length for workout intensity to keep the   gains coming in your chest. Guys, we're talking \nabout just 20 minutes to get the job done. \n  What s up guys, Jeff Cavaliere, Athleanx.com. \nLook, we've all been there short on time,   but still long on desire to not miss \nyet another workout. But what do you do?   Do you skip it yet again or do you find a \nway to get the job done? Today, I'm going   to show you and introduce a all-new series here \nan abbreviated way to train to not compromise the   games that you're after. We're starting right \naway with chests. If you only had 20 minutes,   could you get the job done? I'm going to take \nyou inside my head to show you the training   strategies that I use to adapt to the short time \nframe to make sure we keep the gains coming. \n  Now, I think we should start with two \nimportant caveats. The first is going to be,   don't make a habit out of this. I'm giving you a \ngame plan here to allow you to get the job done   without much sacrifice. But if you make a habit \nof doing this every single time you train, I would   suggest finding time to actually dedicate more \ntime to training so you're not always in a pinch.   Consistency with your workouts and consistency of \neffort in those workouts is and always will be the   fastest way to get to where you want to be.\nAnd that brings me to my second important caveat   here for this video and that is one exercise \nyou will not find in this workout is the Barbell   Bench Press. And no, not because I don't like \nit. I just named it my number one exercise of   all of our chest exercises. It's the fact that \nI primarily use this one for building strength.   Using this technique, these short, condensed, \n20-minute workouts are not conducive to maximizing   strength. Whether it be the warmup progressions \nthemselves that take a lot of time for some   people, or whether it be the fact that your rest \ntimes in between sets are generally going to   be three minutes on the low end of the five \nminutes. You simply are going to run out of   time before you can even complete, let's say, a \nfive by five. Not to mention, as you'll see here,   we're going to have to drop the weight as we move \nthrough this workout. Simply changing plates can   take more time than you have available to you \nand doing with dumbbells is going to be that   much faster. So, the focus of this video is \ngoing beyond hypertrophy and how to continue   to build muscle in those time crunch limited \nsituations. This is how we get it done. \n  And so the journey into my brain begins \nhere with our first exercise combination,   how we start our workout. And it's with the Cable \nCrossover directly into the Dumbbell Static Press.   Now, this is a chest focused workout. Yes. \nI'm going to get into more complexity as we   go down the line here if you guys like this \nseries, so make sure you let me know below.   Because we know that complexity gets increased as \nwe increase the number of muscle groups that are   participating in the workout. Less time we've got \nmore stuff to cover. But it's a little bit easier   when we focus right here. And I use the first \nexercise that Cable Crossover as a pre-exhaust for   the second. You see, we know that when it comes to \nchest workouts, the chest oftentimes likes to play   that third fiddle to both the shoulders and the \ntriceps. We don't want that to happen. We have   a limited amount of time, and we want to drive \nas much tension into the chest as possible. So,   we can do that with this exercise. Now, one of the \nlimitations, this exercise is if you go to heavy,   it becomes a bit of a core challenge. But we don't \nhave to go heavy here. We can lighten up the load   and use this to really, really focus on letting \nthe chest initiate every single contraction.   We know when we head into the second part of this \ncombination, the Static Bench Press, we re going   to get the help we need from the shoulders and \nthe triceps. But right here, pre-exhaust the   chest by using just an exercise that allows you to \ndo this. Fight for every single repetition here,   take it to failure. we know. When we head into the \nsecond part of this combination, the static bench   press, we're going to get the help we need from \nthe shoulders and the triceps. But right here,   pre-exhaust the chest by using just an exercise \nthat allows you to do this fight for every   single repetition here, take it to failure.\nFrom there we go right into that second half of   the combination here, the Dumbbell Static Press, \nwhich is something I got from that one-legged   monster, Casey Mitchell and it's a great way to \nintensify the traditional Dumbbell Bench Press.   And remember, if we're trading in that time, we \nhave to up the intensity, this for sure will do   the job. And the best part about this is I don't \nhave to necessarily go right into light weights   because I had the pre-exhaust before this. \nI can still use relatively heavy weights,   but make sure that I'm accommodating \nfor those by lowering the repetitions   but still keeping the tension high. \nThe Static Press does that because as you   can see here, I'm maintaining that high tension \nposition on every single rep. Whether I'm pressing   or holding there's still a lot of tension here. \nAnd the slow speed of every repetition is actually   pretty forgiving on those rusty shoulders, the \nguys that need a lot of warm up, because the slow   pace allows you to focus one side at a time. Not \nto mention the pre-exhaust before this did have a   bit of a warmup effect on getting ready to do this \nsecond half. And so, it takes 60 rest after that   combination with the goal being to perform three \nof them to form failure, the first half with a   10 to 12 reps range on the crossover and about \nfive repetitions each on the Static Press.\n  That would bring us to a combination that leads \nto 6:15 of total elapsed workout time by the time   this is done. Now, a note on that rest it s 60 \nseconds. I understand, guys, it's a compromise.   Ideally, I'd like to get at least 90 seconds \nto 120. But the way we account for that,   if we don't focus so much on maintaining \nthe weight that we started with.   You can see here in the second set of Static \nPress, I'm okay with dropping the weight down.   Remember, your muscles don't understand \nnumbers, they don't read they just feel,   and they feel tension. If you can keep the tension \nhigh by forgetting about the number of reps and   instead of making each one of those reps count, \nthat is how you're going to continue to ensure   the intensity is high enough to drive the \ngains you're looking for in this workout. \n  And that brings us right into our second exercise \nof this workout. Again, the clock is ticking,   we go right there to the Incline Dumbbell Bench \nPress. Now for you guys there training at the gym,   you're still on the same bench you were just \nusing. Just prop it up here, all importantly   to that 30-degree angle, not the 60 degree. If you \ndon't understand why you might want to check out   my chest exercises, ranked video, where we tell \nyou about the all-important difference. But for   here, I simply grab this set of dumbbells \nthat's still on the heavier side for me,   accounting for the mounting fatigue here.\nI'm not trying to just sacrifice and go all   the way down to lightweights where I'm turning \nthis into simply a metabolic burnout workout.   You want to push and drive muscular growth, \nyou're going to have to push yourself hard. Here,   I m going into the Dumbbell Incline Bench Press. \nI love this, number as a perfect complement to   the fact that we did a flat bench exercise first \nand we have to hit the upper chest. You can see   this does a tremendous job taking the dumbbells \nfrom more of a low position to a high position.   The key here is, again, pushing myself all the \nway to failure, whatever that is, raging for   about 10 reps per set. But accepting the fact that \nif I don't get it, it's really all about pushing   yourself every set to the end point to that \nfailure until you can't get another good form rep.   And again, three sets to form failure here with \nthe rest time being 60 seconds once again in   between sets. Accepting the fact that you have to \ndrop that weight down further and further, that s   okay, remember tension. So, the idea being if it \ntook me 35 to 40 seconds to do each one of those   sets when we account for the rest time and the \nthree individual sets here, we've now got a total   elapsed workout time of 11:15. Times ticking, \nbut we're looking pretty good right now.\n  Which brings us to our third exercise, which \nis actually another combination of a Bodyweight   Dip right into a Band Assisted Dip. Three sets \nagain to form failure of that combination. So,   as you can see here, I grab the band and I walk my \nway over to the dip station. I hang it on the dip   handle, and I get ready to do my Bodyweight Dips. \nNow, my advice here is, I'm already fatigued.   If you can do 12 or less dips bodyweight, then \njust stick with the bodyweight. If you're doing   15, 16, 20 of these and I would start with \nweight and drop down to a bodyweight. But   for me and for most people, we're probably \ngoing to be able to start with bodyweight   only and then drop down to the assisted dip. \nThe key here is we're doing three of these in a   drop step fashion instead of doing more sets of \ndips and having to rest more in between sets.   Even if we're doing just 60, there's more inter \nset rest periods, which is just simply going to   add more and more time to your workout. We don't \nhave time. So I go right from this exercise,   taking it to form failure. I simply take that \ndip band put it up on both handles, push down,   place my knees inside and there you go, I've got \nan Assisted Dip without much rest in between.   I'm not looking for a whole hell of a lot of \nreps in the second half here, but once again,   trying to push myself to and through failure, \nupping the intensity. Yet another technique   with this drop set to just push myself \nbeyond what I'm comfortable with. \n  This is how we're going to drive these gains when \ntime isn't on our side. Once again, push until I   can't do any more. I take my one-minute rest in \nbetween sets. Again, a 60 second total there,   about 30 seconds on each half there. Now we're up \nto 17:15 for our total elapsed workout time. We   still got time left. We got one more thing we can \ndo. In that case, I switched to my last exercise,   which is the High to Low Banded Crossover. And \nfor this, the workout has already conveniently   brought me to my knees with how brutal it's been. \nI'm in the perfect position to do this exercise.   I'm going from that high to low position, getting \nmore of that lower chest. But more importantly,   the all-important adduction that we haven't \ntouched since the first exercise when we did   the cable crossover as a pre-exhaust. And here \nmy goal is simply just to seesaw back and forth   between my left arm and my right arm. This takes \nabout 30 seconds or so for me to just burn out   completely. I turn right into the second set, \nthere's no rest. The rest of my right arm is   when I'm working my left arm and the rest of my \nleft arm is when I'm working my right arm.\n  But the fact is, when we seesaw back and \nforth there about 30 seconds per side   for three total sets, we've got three additional \nminutes of work added to the 17:15 for a total   elapsed workout time of 20:15. Now look, don't \nhold me to the exact time, it might take you   19:45 or 20:45. The fact is it's a damn fast \nworkout an it's going to get you to the gains   you're looking for without compromise. \nAnd so just like that, in the nick of time   we get the work done. No, it wasn't easy, but \nyou guys know a life lesson here anything worth   having doesn't come easy and you can't get \nsomething for nothing. If you want to go fast,   you're going to have to go hard. Trade \nin some of that workout length for   intensity and this is how you get it done. \nIf you felt a little helpful and you want me to   cover more muscle groups, make sure you leave your \nthumbs up below. If you want to cover more splits,   do the same thing. If you're looking for \nprograms guys, where we put the science   into every selection we make, you can find \nthem over at athleanx.com. In the meantime,   if you haven't already done so, make sure \nyou subscribe and turn on your notifications,   so you never miss a new video when we \nput out. All right guys see you soon.   "
}