{
    "id": "mf6GhC6QVEU",
    "title": "Stop Doing These 11 Exercises (DO THESE INSTEAD!)",
    "description": "Nobody wants to waste their time doing exercises that don't work. That said, even good exercises can become bad ones when ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going to do something we haven't\ndone in a while. That is visiting the Iron Graveyard where\nall the exercises we've killed in the past reside. As a matter of fact, we're going to revisit\nand pay our respects to some of those that we've already place in the graveyard and buried. More importantly, we're adding a few more. Look, I'm going to do what I've always done\non this channel. I'm not just going to tell you to stop doing\nthe exercise and that's it. I'm going to tell you the specific reasons\nwhy we put them in the graveyard in the first place. More importantly, what you can do as a direct\nreplacement for it. With that being said, we're going to call\nin Jesse here to make sure we can get this video done the right way. JESSE: You want me doing the bad exercises? JEFF: Of course, because you're the king of\ndoing things wrong. You know what I mean? JESSE: Okay, if I'm doing that, I want my\nnew, new intro playing. JEFF: They've already seen your new intro. JESSE: No, no, no. My new NEW intro. Yeah. Run it. JEFF: You've got to be f***ing kidding me. JESSE: Okay, we can get started now. JEFF: Can we? JESSE: Yes. JEFF: Let's go. Guys, the first exercise up is – so we might\nas well kick off this list with one that we've had dead and buried for quite some time on\nthis channel. It's the dumbbell fly. Done this way. Unsupported on a bench, which happens to be\n– most of us do this exercise. The fact is, we're hanging out here in all\nof our shoulder-wrecking glory when we do the exercise this way. This unsupported version is placing so much\nstress – not just on your chest. As a matter of fact, a lot of the stretch\nthat you might feel here is being redirected to a different muscle in our arm called the\ncoracobrachialis. More importantly, it's what you're doing and\nputting your anterior shoulder capsule at risk when performing it this way. We have alternatives. I've discussed before, if you're really dead\nset on doing a fly, do them on the floor. At least by doing them on the floor here you\nhave a bottom. You have a safety net and you have additional\nbenefit of overloading the exercise on the eccentric portion of it to get better benefits\nin terms of making muscle gains. But why are we even screwing around there\neither? If we want to do something that's going to\nget our chest to respond, at least do something that includes adduction. Take it from a point in the range of motion\nthat gets our arm out from our body, it applies the stretch we were looking for in the first\nplace, but then allows us to cross midline under tension. The fly doesn't do that. When we reach the top, we're losing additional\ntension on the pecs. We can get that by simply swapping this for\na cable or band and continue to cross our body in a full crossover. So, there's one exercise that signifies \"I'm\nlost\" more than any other. It's this one right here. It's the dumbbell side bend. People will do this exercise ad nauseum trying\nto sculpt out a midsection, carve out their abs, get ripped obliques; whatever it is they're\nsaying. A lot of times they don’t even put the dumbbell\nin the right hand when they do. I'm here to tell you there really is no 'right'\nside to put the dumbbell in because the exercise itself is trash, if you're trying to train\nyour obliques. We know by now that the obliques aren't side\nbending muscles. Can they bend us to the side? Yes. But if you look at the direction of their\nfibers what do they prefer to do? Rotation. So, if you want to train them, get a rotational\nexercise. One of my favorites to do is this. I hang from a bar and I simply try to initiate\na rotation of my pelvis. Curl it up and twist it a little bit in one\ndirection. I'm not looking to get my legs all the way\nup to the bar. I’m simply looking to control the lifting\nand turning of my pelvis with my obliques and really focus on trying to do that every,\nsingle repetition. Now, I understand that some might say \"Hey,\nthis is really difficult.\" It doesn't mean you have to do it hanging. You could do it over here in the captain's\nchair as well to unweight a lot of your bodyweight, if that's one of the issues you have right\nnow that's preventing you from doing the exercise smoothly. You do the same thing here. Again, range of motion is not that critical. Initiating from the obliques and making sure\nyou're rotating, even just a little bit, to get them to do the job they prefer doing in\nthe first place. Speaking of exercises that we do all too often,\nI'm going to throw another one in here. The concentration curl. Look, I've covered in a previous video how\nto do the concentration curl if you're going to do it at all, because most of the time\nwe alter the exercise so much that we change the strength curve on it. We redirect most of the force into the shoulder,\nas opposed to the biceps in the first place, and there are things we could do that are\nbetter anyway. Like, maybe, stand up. Get on your feet. Like a barbell curl. We're not getting crazy here, guys. It's just a lot better of an exercise. We can use more weight, we can make sure the\nforce is being directed into our arms – what we're trying to build in the first place – and\nmore importantly, we can get a little bit of functionality because our core is going\nto have to help us control the weight. As we lift that heavier weight up, we have\nto be able to counteract that. None of that is happening when we're just\nsitting on our asses on a bench. Posing, more or less. I'm telling you right now, if you're looking\nfor better gains overall, the faster you can swap out this exercise for this one, the better\noff you're going to be. A new addition to the Iron Graveyard is this\none right here. The Cuban press. Now, don’t get confused because you've probably\nheard – \"But, Jeff. There's external rotation going on here. Look. You like external rotation at the shoulders.\" There is. Except that there's a whole hell of a lot\nof internal rotation with elevation that's happening to get to the point of the exercise\nwhere you externally rotate. Not to mention the eccentric internal rotation\nthat's happening on the way down. Guys, it doesn't just matter how an exercise\nstarts and finishes. What matters is how you go through the exercises. The journey is what's most important. We can follow the same beginning and end points\nin a much safer way if we swap out to this one here. That's the Urlacher. Instead of going up to the top here by internally\nrotating our shoulders, we can initiate through our biceps – which is a natural movement\n– and transition to external rotation a lot sooner. We can bypass the internal rotation of the\nshoulder at all points in the exercise, making it a hell of a lot safer. Not to mention, the end result is a better\nexercise. If you were to do a few reps of each I guarantee\nyou, the one you're going to feel more effectively, training your shoulders, again, without all\nthe pain is going to be the Urlacher. Swap it out, guys. I promise you, the results will be worth it. Speaking of shoulders, I'm going to sound\nlike a broken record here, but it's for good reason because things aren't changing. Biomechanically, a shitty exercise once will\nalways be a shitty exercise. That brings us to the upright row. The king of all shitty exercises. Jesse, thank you for demonstrating, once again. The fact is, we can do better than this. There is so much wrong with this exercise. I've mentioned before, as a physical therapist,\nif you were to come to me in the clinic and I was going to diagnose you with impingement\nI would put you in the exact position that you're going to be in to perform an upright\nrow. A provocative position to cause an irritation\nto the supraspinatus and the tendons in your shoulder. You're literally doing that test to yourself\nwith every, single rep of an upright row. We can do better than that. All we have to do is alter the position of\nour arm during this upward journey. Instead of letting the elbow win the race\nto the top with the wrist down here losing, we can let the wrist win and the elbow lose. Meaning, let the wrist beat the elbow to the\ntop. What happens is, the difference in shoulder\nmechanics. We get an internally rotated shoulder with\nthe elbows higher than the wrist. We get an externally rotated shoulder when\nthe wrist is higher than the elbow. The dumbbell high pull accomplishes this so\neasily. Once again, it's one of those exercises that,\nwhen you do make the switch, not only does it instantly feel better, but it allows you\nto get better contraction in your shoulders, and will ultimately allow you to get better\nresults. MAN: Why? Why? Why? Why? JEFF: Can you just do a regular f***ing pullup,\nplease? Next. Next up is one I like to call an insta-lift. One of those that we do for Instagram because\nit looks really cool when you load a whole lot of plates on a bar and do a motion that's\nabout 4\". The rack pull isn't something we need to be\ndoing. We can pretty much get rid of it because not\nonly is it not as impressive as it looks, as I've discussed before, you're placing a\nlot of unnecessary stress on an area in your shoulder complex called the thoracic outlet. You don’t want to mess with thoracic outlet\nissues. What you want to do is simulate a deadlift\nmore. Don’t take the bar from above the knee. Increase that range of motion, take the bar\ndown at least below the knee. If you want to put it on a couple of mats\nor blocks you can do that. If you don't want to pull it from the floor\nall the time. But what you're going to get from this is\na reduced traction on the arms because you're doing something you could lift from the floor,\nor slightly off the floor, you're going to still have the benefit of building your traps\nbecause the deadlift itself is a great trap builder. And you're going to functionally start doing\nthe exercise that's going to have much greater carryover to the deadlift itself. Not to mention, any other thing you do in\nyour day to day life. Sticking with the legs, this is an exercise\nyou see everybody doing in pretty much every gym. This is the leg extension. You can see Jesse cranking out reps here and\ngetting a nice squeeze on his quads, but it's what's happening beneath the surface. Particularly beneath that kneecap of his is\nwhat concerns me. I think the compressive forces on the patella,\nespecially in this flexed position and initiating from this flexed position is going to be a\nproblem. Particularly for people that have problems\nalready in their knee. If you have chondromalacia, if you have patellar\ntracking problems, these are things that are becoming exacerbated in this exercise. And we realize something in an open chain\nenvironment like this where your leg is hanging freely and working freely is never going to\nhave the carryover as something you could do close-chained with your foot in contact\nwith the ground. Especially when we're training athletes. So, is there something we could do better? I believe there is. It's this. This is the T.K.E. drop lunge. This is a two-part exercise. The band is placed around the knee to allow\nus to contract against it, to get that resisted knee extension. To not have to sacrifice the benefit that\nwe're feeling, the squeeze in the quad, during the leg extension. But beyond that, we can load this a lot heavier. We can apply a connected load. One through our knee extension and hip flexion\ncombo during this drop lunge and then still have the band as the additional, final kicker\nto really impact that quad at the top. So, we're getting a more functional exercise. Again, the feet are in contact with the ground,\nwe're loading it heavier, and we're placing a stress on the knee that allows for extension\nwithout all that compressive load that we get inside that leg extension machine. Let's bring out Raymond to cover an exercise\nthat has been in that Iron Graveyard for quite some time. Really, really buried deep beneath the earth\nhere. It's the behind the neck shoulder press. Look, I don’t have a problem with an overhead\npress. I love overhead pressing, but when you do\nit behind the neck, you're fighting your own anatomy. Let me show you what we're talking about. If you look at the ball and socket joint that\nis the shoulder, the socket is created by the scapula, the shoulder blade itself. You can see the socket doesn’t face directly\nout toward you. It faces forward at about 45 degrees. So, if we wanted to mirror the natural range\nof motion of the ball and socket, we would let the socket and the ball move in this plane\nangled slightly forward, in front of the body. Not all the way over here. Behind the neck pressing is fighting your\nown anatomy, causing a higher likelihood of impingement at the shoulder. So, I'm in favor of pressing overhead, but\nwe've got to do it like this instead. In front of you. There are a few things that come to your benefit,\nin addition. That is the additional help of your triceps. The overhead pressing movement is built for\nstrength. We're trying to train the overall strength\nof our upper body. Why are we trying to remove the triceps from\nthe equation? What we can do to make this really simple\nis taking a more narrow grip. By taking a more narrow grip on the bar, just\noutside shoulder width, you can see what happens. If I was going to try and press from here,\nbut instead bring it to here; that narrowing of the grip brings the elbows into the same\nposition you're looking for, ideally, out of Raymond itself. Just make that swap out. Get that bar from behind your body to the\nfront of your body and those hands from out wide, to more tight and close to your body\nhere, and I promise you'll be better at the exercise, and your shoulders will be better\noff for it. Finally, as we wrap up, the last two exercises\ncan be grouped together because they're unified by stupidity. This – what Jesse's done before – and\nthis, that Jesse's done before. When I say \"Jesse\", I mean – well, you know\nwhat I mean. The fact is, any advice that this Jesse gives\nis just stupid, bad advice. So not only are these exercises a representation\nof that, but it's something you want to avoid at all costs. However- JESSE: Whoa, whoa, whoa, whoa, whoa. I changed my hair, okay? I don’t have that hairstyle anymore. So, I don’t know if you can consider me\n'that Jesse' still. JEFF: It's a work in progress. Guys, hopefully you've found this video helpful. Remember, it's not necessarily always the\nexercise. What's most important is how you do the exercises\nand hopefully now, with a little bit of logic and reasoning behind why I've selected what\nI did, at least you might be willing to explore some of the alternatives. And just see for yourself how they work for\nyou. If you're looking for a step by step program\nthat puts them all there for you, step by step, day by day; you can find them in our\nprograms at ATHLEANX.com. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. And if you haven't already done so, click\n'subscribe' and turn on your notifications so you never miss a new video when we put\none out. All right, guys. See you soon. JESSE: Wait, Jeff. We forgot to ask. Do you guys like the new intro? Leave a thumbs up if you do. JEFF: Don't encourage him, guys. Don’t encourage him. That's it."
}