{
    "id": "mIzG-bPG0zA",
    "title": "Bodyweight Lat Exercise (THE HUMAN PULLOVER!)",
    "description": "Build serious muscle without weights - http://athleanx.com/xero Subscribe to this channel here - http://bit.ly/2b0coMW If you are ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'll give you a new weapon for your\nback training arsenal. The bodyweight back training arsenal. Yes! It's possible. You don’t need to have a pullup bar to train\nyour back. Not if you can do the human pullover. You see, normally you'd use a dumbbell to\ndo a pullover, but if you have an understanding of what the mechanics are in the dumbbell\nand what it's actually doing for your back you could do this with your body. It's all about relative motion. Let me explain. What you do is, you position yourself here\n– somewhere – that you can anchor your body to that's not going to move. So a heavy piece of furniture, if you're going\nto do this at home, or you do it with a piece of equipment if you're going to do it at the\ngym. It's definitely a worthy gym exercise because\nit certainly ain't easy. Now what you do is, you first start by looking\nat the regular pullover. If you look at the regular dumbbell pullover\nyou see that all I'm doing is moving my arms on a fixed torso. My body is laying straight, it's still, it's\non the floor, my arms are moving back into shoulder flexion, and then down into extension\nof my shoulders. It's getting towards extension and of course\n– because I'm not every going behind my body – it's going into extension and adduction,\nwhich is what the lats will do. Now, we can do that same thing if we fix our\narms and then move our body. We're still going to get that same relative\nmotion at the shoulder joint and therefore, do the same thing for our lats. So you can do that in this dragonfly position. Now don’t worry if you can't do dragonflies\nbecause that is a difficult exercise for your core, but you don’t need to. You can shorten your legs, as I'll show you\nsoon, and make this not about the core strength, but more about the lat strength. So when I position myself here, I initiate\nonly with a push down of the hands into the anchor point. I'm trying to push as hard as I possibly can. That will lift my body up. I'm not curling up, I'm not using my abs to\nlift up. I'm literally driving my torso and my hips\nup by pushing down with my hands. They can't go anywhere because they're stuck\non the anchor point, but that will lift up the rest of my torso. Now here's what I talked about. This could be difficult because you may not\nbe able to lift the full weight of your body. So you can shorten the weight of your body,\nessentially, by pulling your legs in. When you pull your legs in now, it's easier\nto lift up and execute this exercise. Of course you can go the other way, too. You can turn this into more of an additional\ncore challenge, on top of it being a lat challenger, but letting your legs go out really straight. Now you have a little bit of that dragonfly\ncomponent as well. The idea here is, if you understand that we're\ncreating the same motion at the joint, and therefore the same work is being done by the\nlats without having to change anything else about the exercise. We're just flipping it around. As I said, relative motion. Whether you move the arms on the torso, or\nthe torso on the arms; the angles are the same as what's happening here on your body. So that's what we want to understand, and\nthat's what you're going to want to start incorporating if you incorporate this one\ninto your back training arsenal. All right. So there you have it, guys. I hope you've found this video helpful. If you're looking for a complete bodyweight\nonly training program that literally uses no equipment at all, head to ATHLEANX.com\nand get our ATHLEAN0 program. In the meantime, if you've found this video\nhelpful, if you're going to start incorporating it, if you're going to try it out; let me\nknow. Remember, I read your comments because I want\nto see what it is you want me to make here on this channel, and that's how I decide. Tell me what you want me to do and I'll do\nmy best to cover it. All right, guys. I'll see you again soon."
}