{
    "id": "mK2X48vkluM",
    "title": "Can’t Get a Muscular Back? Just Do THIS!!",
    "description": "If you have tried to build a muscular back but it just doesn't seem to be responding, then you are going to want to watch this video.",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to teach you how to get\na more muscular looking back. You see, it’s not complicated. It really isn’t. It’s very, very simple. But it’s hard because it requires a lot\nmore concentration than you might be giving your back at the moment. A lot of guys fall victim to this because\nthey can’t see their back. It’s on the opposite side and they don’t\nget the gratification they do when they’re training biceps in the mirror. But don’t make that mistake because all\nit takes is a little bit of focus. This guy in the thumbnail here, that’s not\nme on the opposite side. We look different. The difference, though, is probably not in\nsize. He’s probably about the same size as me,\nbut the difference in back muscularity is evident because I really, really focus on\nhow I do each and every rep. I want to teach you how to do that exactly\nthe same way here. I’m going to give you a complete routine. It’s another Size in Six routine. Six minutes to show you how to do this if\nyou want to get a better mind-muscle connection. First of all, look what I’m doing here with\nmy back. We’re talking about activation. The very first thing you need to know how\nto do – if you’re going to get any extra development, or a better mind-muscle connection\n– is to learn how to adduct your arms into your side. One of the key functions of the lats. You see, as soon as I pinch my elbows down,\ntight, into my sides I get instant activation of the lats. One of their prime functions. So, what I want you to do as a warmup to this\nwhole routine is squeeze and see if you can feel any discomfort. Remember we talked about it? If it doesn’t feel uncomfortable you don’t\nreally have a good mind-muscle connection with that muscle. Right there, off the get go, if you don’t\nget any kind of discomfort with an adduction of your arms into your sides, it might be\ntime to start worrying. Not completely, yet. At least not until we take this next step. That is adding something to it. Not just adducting and squeezing the elbows\ninto the sides, but now extending the arms behind your back. So, we’re going to work and involve a lot\nmore than just the lats. We’re going to get some of the other back\nmuscles involved in here as well. You should feel this collaborative effort\nbetween these muscles to make it an even more intense contraction. If you don’t feel anything here, if it doesn’t\nstart to get to be difficult to hold this then you really need to start working more\non this exercise. You need to start doing just these things\nalone to improve your mind-muscle connection. Now we go one step further. We know that the lats, because they wrap around,\nthey come all the way around from the back, up, and attach up here to our arm; they have\nrotary capability. They can pull down, and around, down, and\naround. So, if we don’t utilize any type of rotation\nin our activation then we’re missing out. This is where you should really feel it. If you’ve already done the adduction, if\nyou’ve already pinched your shoulder blades and pulled your arms back behind your body,\nand now you rotate to one side; it should get to be an extremely intense contraction\nthat you can’t tolerate for very long. If that’s not the case, then you’d better\nstart doing what I’m showing you here – these activation drills – more often. You can do them frequently. Three or four times a week. But now we can take it over to a routine because\nthis routine is going to reinforce everything we just did in the form of an exercise. All you need to do is have a lat pulldown\nmachine, and somewhere you can do a very simple, basic Y without any weight. Trust me, you won’t need it. Here’s what we do. We go over here to the lat pulldown machine\nand we take an underhand grip. Why? Because it’s simulating that first act we\ndid over here, which is the adduction. The squeezing of the elbows down, tight, and\nto your sides. You can see me doing that. Now, it’s not just getting down and speeding\nout of that rep. It’s getting down and squeezing it, really\ntrying to feel it every, single rep. We do that and move on, after doing that for\none minute, to the Y. The Y is an exercise that we do without weights\nwith our chest face-down on an incline bench, about 20 or 30 degrees up. What we do is, we get our shoulder blades\npinched back together, and then we reach up into a Y position up, over our head. You do not need the weight if you are squeezing\nfor dear life. What I’m trying to do is take the back of\nmy hands and press them up into the ceiling if possible. Obviously, they’re not going to reach, but\nyou can see that the lower traps – right here, I’m focusing on those lower traps\n– those muscles are firing in ways that you probably can’t activate in other exercises. Especially not a straight lat pulldown. You’re not getting that activation here. Eccentrically, maybe. But not concentrically. So, we need to focus on that. These little exercises work. But I’m squeezing as hard as I possibly\ncan because I’m going for the quality of every contraction. Then I do this for one minute. Then I head back over to the lat pulldown\nagain, but this time we’re not going underhand. What we’re going to do is go overhand and\nfocus on getting the elbows back behind the body at the same time. You can see this is evident by the fact that\nall the muscles in the back are contracting here. Even the traps, as I get down to the bottom,\nyou can see them kicking in. As well as, obviously, the teres major and\nminor. All these muscles across my back here are\nreally starting to work. All I had to do was focus on the squeeze. A lot of us just go up and down, up and down. We move the bar down to our chest and we get\nit back up again. Not enough if you want muscularity. If you want to pull out all these muscles\nhere, if you don’t want to look like the guy in the thumbnail, and you want to get\na more muscular looking back you need to start focusing on these things. We do this for a minute and we go back to\nthose good, old Ys one more time. Reinforce them. I don’t care if you only get six reps. Spread them out over 10 seconds a piece. They’re all going to count because that’s\nwhat we’re going for here. The quality of contraction. Then you come back to the lat pulldown and\nthis time we’re doing our rocking pulldown. Now, it’s not forwards and back rocking\nlike the cheating pulldown. Don’t do that. What we’re talking about is this rocking\npulldown that allows us to pull the bar down to about eye level, and then from there, pull\nback with one hand. You wait until you feel this. If you haven’t already done this, guys,\nI’ve shown this to you months ago. It’s incredible how it feels. But you will feel a contraction like you never\nhave before if you try this. What you’re trying to do is get that rotation\nback and around. Then come up, and pull down, and get that\nrotation back, and around to the other side. Every time, going for a good, quality contraction. That brings us to five minutes. We’re not done. There’s one other thing you can always benefit\nfrom, especially after doing all this really focused contraction. That is stretching the damn lats out. A great way to do that is with this stretch\npulldown. All I’m doing here is, as I let the bar\nrise back up to a starting position, I allow my torso to sink back. Why? Because if I can separate the distance between\nthe arm here, where the lat attaches, and down here where my pelvis is, I can make that\ndistance longer, and I can get a better stretch. So, if I sink back and reach out I’m getting\na really good stretch on the lats every, single time. It’s just a great way to finish this off\nso you don’t feel completely tight after doing all these focused contractions. So, guys, implement this. I promise you, if you have to start with the\nactivation techniques alone, fine. They’re going to go a long way toward helping\nyou to get better control of your muscles in your back so when you take it over to the\nlat pulldown you’ll be a lot better at it. It’s not just the lat pulldown. It’s a row, it’s a pullup, it’s every,\nsingle exercise you do. You want to squeeze it. You want to feel as if the muscle is doing\nthe work. Don’t be satisfied with just pulling the\nweight down and getting it from A to B. It’s the quality of what you do that matters most. If you’re looking for a program that – we\nreally place a high emphasis on quality, but at the same time I teach you step by step\nwhat to do; those are all over at ATHLEANX.com. In the meantime, if you haven’t subscribed\nmake sure you do so, and turn on those notifications so you never miss a video. And whatever else you want me to cover here,\nthis channel is for you guys, you let me know and I’ll do that for you in the days and\nweeks ahead. All right, see you soon."
}