{
    "id": "MQe3wUNk2Yc",
    "title": "Bruce Lee Ab Workout for a 6 Pack (DRAGON ABS!)",
    "description": "So you want to do a Bruce Lee ab workout for a 6 pack and you wonder what it would look and feel like, then you've come to the ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. So \ntoday I'm going to give you a plan to get abs like   the legendary Bruce Lee in just 22 days. Now, \nlook, I know you're probably thinking, how am   I going to get from maybe this to that in 22 days? \nWell, step by step and with consistency. And that   is the plan here. Guys are going to do this plan \nliterally for the next 22 days. It's not long,   it's not a big commitment, but you have to be \nconsistent with it. And I'm going to show you   the exercises that Bruce Lee actually used to help \ncarve out a six pack. But it also helps, you know,   to try to eat like Bruce Lee, because we know \nthat nutrition is a huge part of whether or not   you'll actually see your abs. So, some of the \nmain takeaways from how he ate was number one,   he actually abstained from alcohol. Now, maybe you \ncan't do that entirely, you like a drink now and   then, but you want to cut it down if you can. \nBecause the less consumption of alcohol,   the less empty calories, but the better chance \nyou're going to have to see your abs. Number two.   He actually didn't really eat a lot of junk foods. \nHe cut out the refined sugars, he actually still   eat carbohydrates, but he got rid of a lot of the \nfried foods and junk foods. As a matter of fact,   there are stories about him going to McDonald's, \nbut the reason that there's stories of them   is because he didn't go all the time. People \ntalk about me eating carrot cake because I do   it twice a year. They don't talk about me \nin chicken because I do it all the time,   it's boring story. \nAnd thirdly, like I mentioned,   he didn't avoid carbohydrates. He knew that \nthey fueled his workouts. I'm not advising you   ever get rid of carbohydrates entirely from your \ndiet either. Just eat them more responsibly. So,   with that being said, what are the exercise? How \nare we going to stack together this workout? Well,   there's an interesting way that we can \ndo it. And it's called the O.T.E. method,   which is a number Or Till Exhaustion. And we did \nis we actually started with this exercise here   is called the Standing Elbow Twist. He did 25 \nto each side or till exhaustion. So that means   that you're a minimum number here is going to be \n25. If you can do more, you go till exhaustion   and you can do 30 or maybe you can do 35, you \nwould go until exhaustion. However, if you were   to stop at some point on the way to 25, briefly \nregroup, take a breath and get right back into the   exercise until you reach 25 and then you stop.\nDon't try to speed through this. It's a very slow   and deliberate move. Get that good contraction \non your oblique to both sides 25 and when you do   you hit the ground. And the next exercise that he \nperformed here was called the Frog Kick. Now he   actually did a variation, both laying down and \nactually hanging from a bar, but the mechanics   are the same. You bring your knees in towards \nyour chest to shorten that lever arm and make   the exercise a little bit easier. And then you \nshoot them up in one motion up towards the sky.   You get a little bit of a pelvic lift off of the \nground to ensure that posterior pelvic rotation,   lower ab activation. You come back down, you \nstraighten the legs out, Again that's sort   of an isometric challenge for the lower abs. You \ncome back in and you keep going. And once again,   the number here was 25 or till exhaustion.\nWe're going to the next one here and it's actually   called the Single Leg Raise. And for this he \njust got back into this recliner position.   And from here you're just driving one leg up, \nkeeping it straight and really trying to get   that contraction in your abs. Again, I call this \nsort of a mid-range movement because you have   both top down and bottom up activity going on \nat the same time, though, the top is actually   staying relatively stable. You really want to, \nas you did in the standing ab twist exercise,   really drive and feel the contraction from the \nbottom up. Don't just lift your leg up with your   hip flexor. There's a difference and you'll feel \nit. If you do that, you're just going to feel   your legs getting tired. If you do it the right \nway, you should feel your abs getting tired here.   You do this for 25 or till exhaustion.\nAnd then we move into the next exercise. We sit up   a little bit, we do the Seated Elbow to Knee Tuck. \nAnd all you're doing here is now you sort of get   much more of that upper body involvement, right. \nIf the last one was more stable, now we're getting   both the top in the bottom working together in \nthe classic mid-range movement. And I'm just   trying to balance and maintain my stability \nup top because it's not that easy, you'll   see you're going to want to fall backwards. Again, \nthe oblique you're going to take another hit here,   but that's perfectly positioned because you're \nable to continue to do it because you're not fully   fatigued yet. We move up the chain to the top down \nmovements as you get more and more fatigued.\n  Which brings us to the top-down movement, which \nis the classic full Sit Up. Now, whether or not   you want to anchor your feet under something \nor not, just be conscious of the fact that   you don't anchor under something and then start \npulling with those hip flexors again. If anything,   I like to anchor my feet beyond something so that \nwhen I pull back, I'm activating the hamstrings,   which will shut the hip flexors off a little \nbit and allow me to make sure that the abs   are doing the work. Whatever it is, come all \nthe way up to the top lawyers up, back down,   keep that posterior tilt, keep that curvature \nof the spine so you're not just flopping back,   which can be detrimental to your back. \nAnd then wouldn't leave this out guys,   the last exercise here is going to be the \nclassic Dragonfly. You might think to yourself,   there is no way in hell that I can do that \nexercise. Well, guess what? All you got to   do is a minute of it. And I don't care how many \nseconds you can break off at a time, you have to   accumulate one minute before this workouts over. \nNow, if you're on more of the advanced side. You   do it with your legs out like I'm showing here. \nIf you need a little bit of a break, remember,   we can shorten that leather arm, bring the knees \nin and still try to get that floating effect   up a little bit and down a little bit, up a little \nbit and down a little bit. By doing this, guys,   you're going to kind of put that final nail in the \ncoffin. But so what, there's nothing left after   this so give it all you got. And I promise \nyou, you're in for a great ab workout. \n  So, guys, if you found the video helpful, \nremember, leave your thumbs up below. Let me   know what you want me to cover and I'll do my best \nto do that for you in future videos. If you're   looking for programs where we build in systematic \nab training with a purpose and progression,   it's in all of our workouts. You can get \nthem over at Athleanx.com. In the meantime,   guys, if you haven't already done so, click \nSubscribe, turn on your notifications and   never miss a new video when I put one out. \nAll right guys, good luck. See you soon."
}