{
    "id": "MWYETIHsicg",
    "title": "How to Lose Weight Forever (UP TO 50 LBS FAT!)",
    "description": "If you want to know how to lose weight forever you have to start by looking at how you look at the food you eat. If the way you are ...",
    "transcript": "I've got to say, Jeff's been really, really\nfocused and dialed in for the last year. He's been training harder than I've ever seen. Honestly, I wish I knew what he was doing\nit for. Jessie. You want some of this? It's really good. I should have known. What's up, guys? Jeff Cavaliere, ATHLEANX.com. Finally, 364 days. I made it. I got my carrot cake. I have my cheat meal. Now today I'm going to show you how my cheat\nmeal – my one cheat meal a year – is exactly what you're going to need in order to lose,\nnot 5lbs of fat, but 50lbs of fat. But stick with me. Stick with me because it's going to be a lot\nmore doable than you think. You see, that video that I did make about\nhow to lose 5lbs of fat, you should have learned quickly that nutrition will dictate the body\nfat levels that you have, and carry, year round. There's no secret exercise. There's no amount of reps that you do of that\nsecret exercise that can overcome a bad diet. But beyond that, when you need to lose more\nthan that, when you need to lose up to 50lbs of fat, what is it that you need to do? Well, let's start where you think I would\nstart. That is, you've got to eat 5oz of broccoli\nin the morning, you have to eat maybe 10oz of asparagus for lunch, and you have to eat\na little bit of iceberg lettuce for dinner. Guys, forget all that nonsense. That is not what you're looking for. That is not what you need to hear. I promise you, I'm going to give you exactly\nwhat you need to hear, and you have to believe me that it is the truth that you need to hear. No recommendation of how to eat like a rabbit\n– that's not what you're going to need to have in order to be successful because those,\nwhatever I would tell you to eat, is going to be drastically different than one of my\nathletes I'm training. What they would eat in a day to keep them\nripped and lean all year could make you fat. Their activity levels are different, their\ndimensions are different, the levels of muscularity are different. We have to give you a strategy, a real world,\nreal strategy, a no BS strategy that will work for you year round. That's what I talk about here, on this channel. It's always been about, not just losing weight,\nbeing lean; it's about keeping it year round. Guys, I could stand up here – just because\nI have a shirt on doesn't mean I can't show what I have 365 days a year. Everybody that uses our programs can do the\nsame damned thing. They don’t just lose weight. They keep it off. They don’t just gain muscle. They keep it. That's what I think is a huge difference behind\nwhat we do. That's what I will always preach to you. So what is that truth? What is the real thing you should be seeking? It's the fact that my cheat meal doesn't feel\nlike a cheat meal because once you determine that you actually enjoy the way you're eating,\nthen there's no such thing as a cheat meal. Think about it. the cheat meal mentality is derived from the\nfact that you're cheating away from the thing that you don’t like doing and most of us\nare stuck in some eating plan that we don’t like doing. The foods that we're eating at the moment\nare the things that we're compromising on, that we're depriving ourselves of, which makes\nthe cheating stuff more appealing. So what I'm telling you is: stop doing that\nto yourself. Stop making yourself feel like you're craving\nthe cheat meals because you hate the shit that you're eating on a daily basis. I never do that. I've never done that in my entire life. What I've identified, and what I want you\nto do is identify meals you actually like. Take meals, start at breakfast. Maybe it's bacon, egg, and cheese. Maybe it's a bowl of oatmeal with walnuts,\nand brown sugar, and whipped cream. Whatever it is that you like – actually\nlike – and if you don’t know how to review them yourselves for the nutritional content\n– in other words, is it a nutritional meal? Is it nutritious? Is it worth a damn? Especially, does it align with your goals\nof building muscle and burning fat? If you don’t know how to do that ask a friend,\nor ask somebody else that can do it, or look it up online. You're going to be able to find the information\nabout whether that's a good meal, or not. Once you've identified that meal, and it's\na good one – because there's always going to be meals that you enjoy eating, I promise\nyou that – don’t think that you're only meal option are boiled carrots and steamed\nbroccoli, and chicken with no flavor. That is so gone. That mentality is so old. That is gone with the Arnold era. You don't have to do that to even be contest\nready. Some guys would say \"Oh, Jeff! You should compete.\" Not interested, believe me. But I do carry low enough body fat levels\nthat I can allow myself to look a certain way, and I don’t deprive myself. Every, single night. Here's the truth: I eat frozen yogurt every\nnight. A bowl of frozen yogurt, probably about that\nbig, with whipped cream on top. I eat carbs like they're going out of style. I eat pasta, I eat potatoes, I eat big portions\nof rice. I don’t really worry about how much I'm\neating. I eat foods that I enjoy and when I do that\n– and when you do that – then all of a sudden this 'cheat' mentality doesn't exist. So what happens with the carrot cake? Is that my cheat meal? No, guys. It's what I choose to eat. When you stop looking at it as this dichotomy\nbetween bad stuff and good stuff, or things I don’t like, and things I want to have;\nthen all of sudden it doesn't become anything other than \"I just choose to have that.\" And I choose to have that on my birthday. Now, could I eat it – I could eat it every\nweek. I promise you I could eat it every week and\nstill look the same here. I just don’t choose to do that. I actually enjoy the other foods more. And I feel that the other foods align myself\na little bit better with the goals I'm trying to achieve. You could do the same thing. but the point is this: the sooner you stop\nthinking \"cheat meals\", the sooner you start thinking \"I'm going to choose to have this\nbecause I want to have it\", and the sooner you identify things that you like, that you\ncan live on, then this is all going to be so damned easy. I promise you. As a matter of fact, when you do make these\nchanges you're going to see these changes stick around for the long term. Not just for this little period of time. Not so I could go make a YouTube video, or\ncluster a bunch of YouTube videos together where I looked lean and then stop making them\nfor a few months. None of that. I would be able to stand here, for you guys,\nas a leading example of how it's done, and that you can see that, too. Guess who else is actually doing it? I showed Jessie up here. He's not doing anything magical. I'm not reserving the tricks for him and keeping\nthem away from you guys. He's doing the same damned thing. He's completely changed the way he eats. It's become a lifestyle for him. It's really, really simple. Now I'll leave you with one last note. If you are the guy who intends to continue\nto do what I'm telling you not to do, at least do this. I'm going to give you a tip, too. An actionable tip. If you're going to have this mentality of\nthe 'cheat' stuff, or the good stuff versus the stuff that's your diet stuff that you're\ntemporarily doing, at least do this: don’t pair two bad ones in a row. Start by doing that. Try to make a good choice, and then your bad\nchoice. A good choice, and then a bad choice and evaluate\nwhat that does. If you have 50lbs of fat to lose it might\nget you down to 35lbs of fat to lose. Just that one change. Now, as you see that happening, you're getting\nencouraged by those results, now say \"Well, what if I just string two good meals together,\nand then a bad one? And then two, and then a bad one? And then two?\" And you drop back down. All of a sudden you're down 25lbs of fat. Let that be the inspiration for you to start\nrealizing that the more good choices you make – and I mean good choices that you like\n– then the more success is going to be in your future. And the long term success is going to be in\nyour future, and that's what it's all about. Guys, if you're looking for a plan that lays\nit all out, the same thing – no secrets, nothing different, it's what I do, and it's\nwhat all the guy son our program do, and it's how they get success and keep it off – we\nlay it all out for you meal by meal, day by day. By the way, I'll leave you with one other\nthing, too. I hear this all the time. \"Jeff, intermittent fasting! That's the way to go!\" Maybe it is. Maybe it is for you, but that doesn't change\nany of what I just said. All that's doing is changing the window in\nwhich you're eating, but it doesn't change how you look at food. Think about how you're eating in that period. Make the choices based on finding food that\nfuels you and that you enjoy, and stop thinking about \"Oh, I'm going to cheat now.\" No. Don’t do that. Don’t do that to yourself. Change your mentality and you'll change the\nway you look, I promise you, year round. The ATHLEANX Factor Meal plan is in our ATHLEANX\nprograms. You can find the right program for you by\nclicking on the link below this video and it will take you to our program selector. Just a couple minutes and we'll get you the\nprogram that's most aligned with the goals that you're trying to achieve right now. Likely, if you're watching this video it's\nprobably our Max Shred program. In the meantime, if you've found this video\nhelpful and truthful – I'll always give you the truth guys, you know that, in a helpful,\nhonest \"this is what you need to do\" truth – make sure you leave your thumbs up below. Let me know what else you want me to cover\nhere, in these videos, and I promise you I'll do my best to do that in the days and weeks\nahead. All right, guys. See you soon."
}