{
    "id": "MY6nKL59L1o",
    "title": "How to Lose “Stubborn” Belly Fat (GONE IN 4 STEPS!)",
    "description": "If you want to see how to lose stubborn belly fat and get rid of it once and for all, then this is a video that you don't want to miss.",
    "transcript": "What’s up guys? Jeff Cavaliere, Athleanx.com. \nSo, you’ve got some stubborn body fat,   especially right here around the mid-section and \nyou want to get rid of it. Well, guess what, I’m   going to help you to do that in this very video \nand all you’re going to need is a mirror. Not   to look in and try to find where your body fat is, \nwe know that that’s why you’re here. I want you to   look in the mirror because I want you to be able \nto answer the four questions that I’m going to ask   you honestly. Because if you can do that, I \npromise you you’re going to get the goal that   you’ve been trying to get to for the first time \nmaybe ever. All right, so with that being said,   let’s start asking those tough questions and more \nimportantly, giving me those honest answers. \n  All right, so the first thing we need to \ndo here is talk about how we’re defining   “stubborn” all right, because a lot of us will \nsay, “Look, I just can’t get rid of this” but   are you really trying? And I’m serious, because \nI’m not holding that against you, but there’s   a difference between calling this stubborn \nand maybe this guy that has a flat stomach,   but maybe has a little bit around the love \nhandles is calling that stubborn body fat. \n  Because this right here is not stubborn. What \nthis is, it’s a lack of doing the right things   often enough. And if you do the right things more \noften, you can go from here to here. And likewise,   if you did the right things really often, \nalmost all the time, you could do this. But   I’ve talked about this before, this isn’t what \neverybody wants. And I’ll give you the real   honest answer why, because not a lot of people \nwant to do everything it takes to get here. \n  In other words, they don’t want to have \nto have the level of consistency and   commitment and maybe foregoing some of \nthe other things that are required to   get here. This might be good enough, and as \na matter of fact, I’m okay with all of it,   it’s what your goals are that matter to you. \nBut the good thing is you’re going to be tell   what you need to do to get to whatever \nlevel it is that you’re looking for. \n  All right, so it might surprise you that \nI’m going to talk right out of the gate   about Drinking. But here’s the reason why, \ndrinking is one of those things that not a   lot of us want to give up entirely. And you may \nnot have to. Again, it depends on where you are   in terms of where you’re starting and where \nyour goal is. If you want the flat stomach,   drinking can be very much part of that equation. \nIf you want to be extremely ripped it may have   to become a very minimal part of the equation \nand the reason for it is a couple of them. \n  Number one, drinking metabolically is handled \nby our body differently. When we have it in   our system our liver is going to preferentially \nwant to metabolize it over fat for energy. So,   you’re interrupting your own process of trying \nto rid of body fat if you engage in drinking more   and more often. Besides that guys, I understand \nthat drinking provides something much more than   a quenching of your thirst. There’s a social \naspect to it, people like to reminisce about   old times and drink with friends or create new \nmemories while they’re drinking with friends and   family. They don’t want to give it up entirely. It \ndoesn’t mean that much to them and it’s not that   valuable to have a ripped six pack if they have \nto give up all drinking. But that’s why I have to   ask you the question, where do you sit right now \nbecause it is a factor and it’s a big one. \n  If your answer’s no, well then congratulations. \nThis is not one of the issues that’s causing you   to have any remaining fat that you’re trying \nto get rid of. But if the answer is yes,   well then you’ve got to ask yourself a few \nmore questions. And that is, how many times   per week are you drinking? Is it one to two times \nor is it more than two times? All right, then the   next question I ask is, how much each time? And be \nhonest. Again, no one is listening to your answers   other than you and I talking here. But how much \neach time? Let’s say you to it one or two per week   and you have one to two glasses of wine or mixed \ndrinks or maybe two to three beers at a sitting.   That’s about four to six beers in a week or \nmaybe two to four glasses of wine in a week. \n  Now, is that okay or not okay? This is okay if \nyou’re trying to get to that level of let’s say   a flat stomach. But if you want to get to that \nultra-ripped condition, then that’s not going   to be okay. If it’s more than this then, again, \nit’s not okay even to get yourself down to that   flat stomach. If you’re doing it more than two \ntimes a week, well guess what has to happen? If   it’s more than two times a week, well then the \nconsumption levels have to go down. It can’t be   up to two glasses or three beers, it’s got to go \ndown to one glass of wine and maybe two beers at   most at a sitting. So, in total over the course \nof a week you are ingesting less alcohol. \n  Of course, if it’s more than above, then it’s not \nokay again. But the fact is here guys, let’s say   you’re at a given level of body fat right now and \nyou are drinking. If you’re trying to go lower,   then go lower on your consumption of alcohol. \nThere’s no instance where drinking here is going   to be beneficial to you in the long run if you’re \ntrying to decrease your levels of body fat. \n  The next thing we have to focus on is actually \nvery closely related to Drinking and it’s the   other stuff that we put in our bodies. We \nwant to look for a Caloric Deficit because   we know that in order to lose body fat, we \nhave to create a Caloric Deficit. However,   my first question would be to you is, are you or \nare you not creating one? If the answer is yes,   it’s not an instant congratulations because I \nhave something listed over here and that is,   are you doing it responsibly or are you doing it \nirresponsibly? There’s a big difference guys. \n  Irresponsible is crash diets, it’s consuming \na very low amount of calories, it’s excluding   certain macronutrients because you’ve heard \nthey’re bad for you, i.e., carbohydrates.   Long-term that’s not going to work and long-term \nit’s going to do more irreversible damage and   more for setting your mind in a wrong place in \nterms of how you look at food in an unhealthy   way that’s going to cause you to not succeed. \nSo there’s no instance where I believe that   irresponsible decreasing of your caloric intake is \na good idea, so in that case that is not okay.\n  If it’s Responsible, meaning 200 or 300 up to \n500 calorie deficit per day through your intake   of food, then I would say that’s okay and you’re \ndoing the right thing in your pursuit of a flatter   stomach or a more ripped condition. If the answer \nis no, I have three follow-up questions. The first   one is, are you eating clean? And any trainer \nout there who’s ever had to ask this question has   probably heard the answer many, many times before \nand that is, “Yes, of course I’m eating “clean”?   Then my next question would be, “Well, really?” \nAnd then the answer is, “Yes, of course I’m eating   clean.” Then my next then my answer would be like, \n“No, but seriously we’re friends, you can tell me   if you’re eating clean or not.” See, because we \ndon’t define “clean” eating if you’re actually   eating clean, I say that all the time. Those that \ncall it “clean” are likely not eating clean. \n  Eating clean is actually healthy and eating \nhealthy is something that you do on a regular   basis, it’s not something that you’re doing \ntemporarily or that you even put a name or a label   on it. You just do it and you eat more healthily \nand you understand what foods comprise a healthy   diet. So, when we’re there then you’ve got to talk \nabout portion control. Because if you are eating   really healthily and you’re eating the right foods \nand you’re not excluding micronutrients like we   talked about before, then it does come down to \nthe next question and that’s Portion Control. \n  How big are your portions? And you know \nhow big they are, are they bad or are they   good? Right? If they’re bad you’ve got to fix \nit. You’ve got to stop eating two plates of   everything. You’ve got to look at how you can \ndivide your place responsibly. I put a whole   video together on how to divide your plate so \nthat you can know that you’re getting it right   every single time. I’ll actually link that \nvideo for you. This is what it looks like,   I’ll make sure I link it for you at the end of \nthis one so you can get a grasp on how you can   divide your plate and get this right every single \ntime. It’s actually very, very easy to do. \n  Let’s say you’re doing that right. Well then \nit comes down to consistency because if you’re   eating healthy and your portion control is good, \nbut you still have body fat, then it’s got to be   coming down to this last element and that is \nyour consistency levels. And this is where I   think things tend to fall apart. But you have \nto be willing to answer the question and define   for yourself how low you want to go, where do \nyou want to ultimately be? So, I say, “What’s   consistency?” Consistency means how often are \nyou straying from your healthy eating plan? \n  If it comes down to having a cheat meal, \nI’d say you’re okay, you’re certainly okay   to get yourself down from that belly to that \nflat stomach. Absolutely okay to do that. Can   you have a cheat meal every single week and get \ndown to that ultra-ripped condition? Sometimes,   if you’re doing everything else right, and \nthat’s a big if. The thing is, you’re more   likely to get to that ultra-ripped condition if \nyou’re taking those cheat meals down to let’s say   every other week or certainly once a month. \nNow, if it’s a cheat day can you get down to   that flat stomach? I have an issue here, I don’t \nthink that you really can get down to that flat   stomach consistently by doing that, by having \na cheat day every single week. You could do a   lot of damage in a single cheat day that can \nundo a hell of a lot of good that you’ve been   accumulating over the course of the rest of that \nweek. And finally, if you’re having a cheat year,   my question would be are you Jesse? I mean, \ndo you ever eat right? Because honestly   guys if you’re never willing to have consistency \nhere, then we already know what the issue is. \n  All right, so the third question up \nhere has to do with your Training,   and I guess it could be as classic as do you even \nlift? Well, not that, I mean do you do anything.   Are you doing anything besides nutrition? And I \nget it, I’ve talked about how important nutrition   is to your pursuit of dropping your body fat \nlevels. It’s most important when it comes to   dropping body fat levels. However, you’re never \ngoing to maximize the results that you see there   and be doing everything you can possibly be \ndoing if you’re not supplementing your training   along with your nutritional improvements. \nSo, we’ve got to train, and we can do three   different types of training here. The first \nthing I’m going to start with is your cardio   and conditioning. Because a lot of people will do \nthis, they get a little bit less food that they’re   taking in, they’re creating the caloric deficit \nand then they’re jumping on an elliptical and   they’re trying to burn a few extra calories. Why \nis that never the most successful way to do this?   Because you’re not building muscle doing that. \nAnd building muscle is going to be your absolute   best friend when it comes to creating an easier \njob for your body to get to lower levels of body   fat and most importantly to maintaining them. \nMuscle being much more active tissue is going to   metabolically help you, even at rest, to get \nto that lower body fat level and maintain it   and even go beyond what it is you thought you \nwere capable of. Cardio and conditioning while   important for your heart, isn’t necessarily \nthe best option. However, if the answer is,   “No, I don’t do anything” or even “Yes, \nI do cardio and conditioning” my next   question always becomes, what’s your body fat \nlevel? Because your body fat level is going   to give me the best recommendation from there. \nIf you’re less than 15% for men or less than 25%   for women, then I would actually say to you, if \nyou want to make some additional drops in body fat   levels, increase your cardio and conditioning \nto two to four times per week. However,   if you’re above 50% for men or maybe even 20% for \nmen and you’re above 25% or 30% for women, I’m not   necessarily recommending that you focus here. \nI’m not saying don’t do this, I’m just saying   this is not going to have the biggest impact \nfor the two reasons I just said. Number one,   nutrition is always going to be your bigger play \nhere and number two, you should be doing this,   prioritizing nutrition and weight training. \nOkay? Because weight training should always   come as your focus when you’re at higher body \nfat levels and you’re trying to get it down. \n  Your cardio then comes in second to this. But \nagain, weight training, yes. How often? How   many times per week? Less than three times? Up it, \nup it more. Three to five is where I want to see   you be, everybody. It’s just the prioritization of \nwhere this needs to be. Again, you can supplement   with your conditioning on top of that, but this \nis where I want you to be. If the answer is no,   of course start three to five times per week. \nThen we go over here. This is kind of the Holy   Grail here where we kind of get the chance to \nmix the two and that is Complexes. Are you doing   Complexes? Yes. Great. Are you doing Complexes? \nNo. Start two to three times per week. So, the   Complexes are where we combine compound movements \ninto one flow so that we can do like a Barbell Row   into a Hang Clean, into an Overhead Press, into \na Front Rack Reverse Lunge. Things like that   where we can actually move a lot of muscles in one \ncoordinated movement flow. You’re going to build   muscle here and you’re going to burn calories and \nit fits into this realm of weight training and it   fits in nicely inside of this three to five time \na week training. So, even if you’re doing standard   weight training and strength training you can \nfit your complexes into those workouts too. \n  Which brings me to my fourth and final question \nhere and that is about your Ab Training. You see   because it’s not just regular training here, but \nit’s our abs that are in focus and I like to look   at them as a separate area of focus because I \nknow how impactful it can be if you actually   ad this to your current training. If you do this \nguys, again, if you’re first is answer is, “No,   I don’t do any of it” then my answer would \nbe, hey, start now. And it’s not just that,   not just your rectus abdominis, your six pack, \nbut it’s your entire core that I want you to work,   which I’ll get into in a second. \nIf the answer is, “Yes, I do it” then my   next question would be, how many times per week \ndo you do it? And if you say three or less,   then my recommendation is going to be to do more \nthan three. You see I believe in even up to daily   ab training for no more than ten minutes at a \ntime is incredibly impactful when it comes to   losing body fat. You’re probably thinking, “Wait \na second, Jeff, have you lost your mind?” No,   I’m not talking about spot reduction of body fat, \nI’m talking about the visual impact and the side   effect that training these muscles will have on \nyour overall outlook as you attempt to get closer   to that goal of yours, whatever it might have \nbeen, the flat stomach or incredibly ripped. \n  You see, at even higher levels of body fat, \nwhen you train the muscles underneath you will   actually see them. And you can see the upper \nabs, you can start to see the upper obliques,   but you’re not going to see anything if you \nhaven’t taken the time to be dedicated to training   those muscles. So, I want to see an increase \nin consistency here because not only that,   I found a second effect from doing this. When \nyou can commit to just a five-minute routine   or seven-minute routine, we’ve got plenty of them \nup on YouTube here, that sometimes is the impetus   to get you going. You’re like, “You know what I \ncan do this for seven minutes. I’ve done it now   10 days in a row. I’ve done it 20 days in a row. \nI’ve done it for a month straight. I like to see   the results I’m actually seeing here; I’m getting \nencouraged by this. And that in and of itself   provides additional motivation to allow you to get \nthe other components here right. You’re starting   to eat well more consistently, you’re starting \nto increase your training, you’re starting to do   all those thing right. You’re decreasing your \ndrinking; everything starts to fall in place.   Do not neglect the importance of separate ab \ntraining when it comes to the overall approach   to get into those lower levels of body fat. \nSo guys, remember, when it comes to dropping body   fat levels, the most important thing you \ncan do is look in the mirror. Like I said,   not to identify where you’re having a problem we \nprobably already know that. I’m talking about to   answer these questions honestly. Because it’s \nonly then that you can start to make progress.   We all have areas that we need to work on guys, me \nincluded. The thing is though, you’ve got to get   honest with yourself about where it is that you’re \nfalling short right now because when you do,   and you can start to address those areas that’s \nwhen you start to make some big progress. That’s   when you start to go from here to here and \nthat’s when you can go from there to here.   It’s all a matter of the levels of sacrifice \nthat you’re willing to make and the level of   consistency you’re able to do that in.\nIf you’re looking for a program guys that   makes this a lot easier to follow than you think, \nwe include meal plans and step by step workouts,   you can get them all over Athleanx.com. If \nyou’re looking for a program that will help   you with the core training aspect of it, \nwe have our Core for Abs program. Again,   that’s available at Athleanx.com. The fact is \nguys, I’m just looking for you to become more   consistent in what you’re doing right now to get \nto a better place than you are right now. \n  If you found the video helpful, leave \nyour comments and thumbs up below. Let   me know what else I could do for you in the \ndays and weeks ahead and I’ll make sure I do   those. And if you haven’t already guys, click \nSubscribe and turn on your notifications so   you never miss a new video when we put \none out. All right guys, see you soon. "
}