{
    "id": "n3HN4NQdcqU",
    "title": "How to Get Bigger Biceps Fast (JUST DO THIS!)",
    "description": "If you want to learn how to get bigger biceps fast then you've come to the right place. In this video, you will see how to build big ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. \nToday I'm going to show you how to get your   biceps growing again - fast. Okay? But you have \nto follow along exactly what I'm telling you here,   and I promise you it will work for every single \nperson. Now, there's only two things to blame   when your biceps won't grow and it's not mom \nand dad. It's the fact that your shoulders   and your forearms are trying to do too \nmuch of the work. And what happens is   years of trying to lift heavier than you should on \nbiceps training in an effort to get them to grow,   has actually just been working against you. \nSo, to fix this is going to demand that you   use lightweights. I mean, demand that you use \nlightweights because you have to to neurologically   reprogram what you've sort of ingrained in \na bad way here, which is holding you back.   So, we talked about the delt the problem with \nthe delt is it wants to dominate the curl. And   we know that even shoulder flexion is a component \nof a fully contracted bicep, but it's not the main   function of the bicep. So, if you rely on \nthat, you start to bring the arm up with you,   that front delt is going to be doing a lot of \nthe work and only the more experienced lifter   who has the ability to do that and still keep the \nfocus on the biceps is really able to handle that.   Instead, you want to make sure you take it \nout right now. And the way to take it out   is to keep your shoulders steady and stable, one \nposition. You're not going to see this shoulder   move forward at all, okay? I'm going to keep it \nright down at my side and curl up and up and up   and down, just like that.\nNow, it leads into the second issue here,   and the second issue is when you're back here, \nespecially, you're losing some of that strength   from the shoulder, so the form is going to \nwant to contribute even more and that's where   it starts to cheat and curl up. And the symptom \nof this that you can see yourself is the amount   of knuckles that you see when you curl. See, \nright now, I see these knuckles right here,   right here. But what I don't want to see are \nthose knuckles. And as soon as I see these   knuckles visible to me from this vantage point, I \nknow I've done this incorrectly. At no point do I   want to see that. So, what we do is we dead end \nwrist, we keep it bent backwards, all right? If   we keep the wrist backwards at the top, your hand \nis almost facing straight up towards the ceiling   and we know we've got this stationary elbow. \nWhen we do that, we've got another benefit here,   it keeps the dumbbell closer to us and we keep \nthe dumbbell closer. We get more of that drag   feel to it in the drag feel is going to be good \nfor the outer head of the bicep, the long head,   which really intensifies that contraction. So, \nwhat we start to do is we start to feel a bicep   that we haven't really felt, which is the first \nstep to getting that tension delivered right where   we want it, which is going to get them to start \ngrowing fast. Like I said, you'll be shocked, even   with lighter weights, you're getting faster bicep \ngrowth. We can take it back to a regular curl   later when we've got that tension where we want it \nand start to add the weight later, but right now,   we have to reprogram. So, from here we could do \nit with a bar. The risks are bent backwards, the   elbows stay at the side, come straight up. I don't \nsee those other knuckles at any point in time up.   And again, it's staying relatively close, I'm not \narcing the bell you don't want to see much arc,   it's almost coming straight up from here. Okay and \nI also showed you another way you could do this   was with a dumbbell just by grabbing hold of a \ndumbbell like this, we call the Waiter Curl. It   reinforces the same thing I grab underneath like \nthis. Obviously, the wrist position is going to   be where we need to be. The arms come as straight \nas possible down here in front of us. I curl up   until the dumbbell is flat to the ceiling as high \nas I can go, and I come down. Curl up and down.   And this is a 40-pound dumbbell so it's only 20 \nin each hand roughly and I can absolutely feel it.   Because, again, I'm not getting any of the \ncontribution of the muscles that are going to jump   into the exercise unwanted because those are the \nmuscles that are holding you back. Remember, guys,   efficiency is what your body craves. These \nmuscles are going to make it more efficient   to curl the weight up, but inefficiency is what \nyou seek when you are trying to force muscle   growth. Make the bicep, do all the work, don't \ngive it the help that it's looking for. If you   found the video helpful guys, make sure you leave \nyour comments or a thumbs up below. If you're   looking for programs where we incorporate all the \ndetails, because the details matter, you can find   them over at altheanx.com. In the meantime, if \nyou haven't already done so, make sure you click   subscribe and turn on your notifications when we \nput one out. All right guys see you soon. \n "
}