{
    "id": "nCJVOcBTJUA",
    "title": "He Did This One Biceps Exercise for 30 Days (WOW!!)",
    "description": "If you want to build bigger biceps peaks that look like mountains sitting on your arms, then I'm going to ask you to include this one ...",
    "transcript": "JESSE: All right. So, as you can see here, we have – we've\ngot Ursa Minor, Ursa Major. I think that's Scorpio, Leo. Is that Orion's Belt right there? That might be Capricorn, as well. Is that one the North Star, Jeff? JEFF: I think so. JESSE: You don’t like my astronomy lessons? JEFF: No. JESSE: Aw, come on. JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. And Jesse. No intro. JESSE: No intro this time? JEFF: No intro. Done with the intros for now. Guys, we're talking about building bicep peaks. That exercise that you saw me doing in the\nbeginning of this video was something that goes way back with me. As a matter of fact, when I was working out\nwith my brother, the story as I've told it before – he really didn't let me do anything. He was my older brother and I had to be relegated\nto cheerleader until I was old enough to pick up the weights. But I did have access to a single dumbbell,\nand I remembered seeing an exercise that Sergio Alebo – way before your time, Jesse. JESSE: Way before my time. JEFF: Sergio Alebo did, for his bicep peaks,\nwhere he took a single dumbbell, just like that, and lifted it in that fashion. That stuck with me because I have covered\non this channel before something called a \"Master Tip\" and the value of keeping your\nwrists out of it. Bent back as you curl up to negate some of\nthe extra forearm contribution of the curl and put more of the work on the biceps. I forgot about the exercise. JESSE: How do you forget that?! JEFF: Because when I got access to two dumbbells,\nand a chin-up bar, and a barbell I was switching them out for other things. Like barbell curls and chin-ups. In a question you asked me recently, \"What\ncan I do with a single dumbbell?\" JESSE: Right. JEFF: Besides regular curls. I remembered back and told them about the\nvalue of the exercise and then you went and did it for 30 days. JESSE: Yes. JEFF: But what I did was, I told Jesse, \"Okay,\nwe'll do another experiment. No more 'Baby Shark' for 30 days. Something real for 30 days.\" And what I said was, \"Don't do any traditional\nbarbell curls.\" JESSE: Right. JEFF: \"Don't do any traditional dumbbell curls.\" JESSE: Correct. JEFF: Full disclosure, you still did chin-ups. JESSE: Yep. JEFF: You still did rows. JESSE: Underhand rows. JEFF: Right. So, that's been part of your program anyway. JESSE: Yeah. JEFF: So, the only difference was the inclusion\nof- JESSE: This exercise. JEFF: This exercise. The one, again, that you're seeing here as\nJesse points out all the constellations in my veins and vascularity of my arms. That's the one you were doing. JESSE: Yeah, and I substituted for the traditional\ncurling. JEFF: Right. Just to give them a sense of how often you\nwere doing this and if you did it in – what? You were doing some of the total body workouts\nfrom BEAXT. JESSE: From one to two times per week. JEFF: Right. JESSE: Sometimes three. JEFF: Depending upon what- JESSE: The program I was on. JEFF: Whether it was 'push, pull, legs' or\nwhether you were doing a total body. JESSE: Yeah. JEFF: So, it was not 30 days of this. JESSE: No, no, no. JEFF: Just within a 30-day period. So, you probably wound up hitting at about,\nlet's say 9 to 12 times. JESSE: Yeah. I would say so. JEFF: That's the only bicep exercise you did. So, let's take a look at the exercise itself. JESSE: Okay. JEFF: Go ahead and pick up – I'll coach\nyou through it. So, we're talking about making sure the top\nof the dumbbell here always faces up toward the ceiling. What you get is, you lower it down and you\nhave to change the position of your wrists to make sure this stays level. So, you go down to, about that far. I always try to say you get down as low as\nyou can, as you saw me doing. Just under there. Now, as you lift up, you have to change the\nposition of your wrists to make sure this stays up here. One of the benefits we're getting is some\ngood, longhead of the biceps because the arms are staying close. Similarly, to how they would in a drag curl. We're getting that. We know that the longhead of the biceps, the\nouter portion here of the biceps, are what is responsible for that peak. We get to the top and it's an insane contraction,\nright? JESSE: Yeah. JEFF: So, you hold it – come up closer. Let's see what they see here, now. Right about here. Now, go down. Concentrate on this back arm over here, as\nwe see. Good. And up. Arm's right here. Drag it up. JESSE: Ooh. JEFF: Up to the top. Good. Come down. One more. Up, up, up. Right there. Squeeze it. Hold it. Hold it. Hold it. Hold it. Good. And again, it incorporates that master tip\nthat we're talking about, where you want to dead-arm those wrists. JESSE: Right. JEFF: Get them out of it. Go ahead. You can show off a little bit. So, what do we see here? In all honesty, you can see here in that area\nthat Jesse's got much more development of, first of all, this entire bicep. But he's starting to get more height on here. Go from the backside, so they can see the\noutside of it. Yeah. I mean, there's no doubt. There's a much more defined peak up here than\nyou had at any point before. JESSE: Yeah, I totally agree. JEFF: So, as far as an experiment I would\nsay, in relation to Jesse, it's a success. Right? JESSE: Yeah. Absolutely. JEFF: When you compare it to mine, I would\nsay it's a failure. Right? JESSE: That's not fair! JEFF: But we're not – it is out of proportion. We're not there yet. Right? JESSE: Right. JEFF: But the fact is, I think there's some\nmerit. It's a good exercise. More so than anything else, it's a change. JESSE: It is. JEFF: If you haven't done it before, it's\na change from what you've bend going. I wouldn't say this is the only exercise you\nshould do from now on, but I think it has some merit. Especially as an effective exercise to place\nsome tension on the biceps, and all on the biceps, in the position that they can benefit\nthe most. Especially when it comes to activating the\nlonghead of the biceps and adding more tension to the peak. JESSE: Right. JEFF: Right? So, give it a try. Success? JESSE: Definitely a success. JEFF: All right. Cool. JESSE: I think you'll find success, too. JEFF: Good. I'm glad we made it through a whole video\nwithout one of those lame-ass intros. JESSE: They're not lame. The comments prove that they're awesome. They like the sharks and the laser beams. JEFF: If you're looking for programs that\nput the science back in strength – all these little details matter – we have that built\ninto all our programs. As I've said, it's not just the exercises\nyou do, it's how you do them that matters. I'll coach you through every one. They're all available in our programs at ATHLEANX.com. In the meantime, tell us what you want us\nto cover. If there's something else you want to see,\nmake sure you leave it in the comments below and we'll do our best to do that for you. If you haven't already done so, make sure\nto click 'subscribe' and turn on your notifications so you never miss a new video when we put\none out. All right, guys. See you soon. JESSE: As far as intros go, let me know what\nyou want to see. More laser beams? More lightning? Explosion? Sharks? I'm all for it. JEFF: Sharks. All right. See ya."
}