{
    "id": "NhlVYy1wkKQ",
    "title": "Weak Glutes | Back Pain (HOW TO FIX IT!)",
    "description": "Put the science back in strength - http://athleanx.com/x/science Subscribe to this channel here - http://bit.ly/2b0coMW Weak glutes ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. What are we talking about today? Take a look. Take a good, hard look. Take a close look. Get your mind out of the gutter and look up\nhere, but we're focusing on what really matters. That is your hips, your pelvis; everything\nyou're probably forgetting about. And I'm going to make them – Jessi – make\nthem the star of the show. They're going to be the star of the show here\ntoday because they need to be if you want to start avoiding things like back pain because\nthe biggest thing that I see across every single person working out is an inattention\nto glutes. An inattention to strengthen their glutes,\nespecially into extension. Now I'm going to give you a little bit of\na sobering though. The glute itself will only extend anatomically\n10 to 15 degrees. That's it. Pure hip extension. 10 to 15 degrees from 0. 0 would be right here, okay? So it's not that we have to train it into\nextension so much. What we have to do is get to neutral in the\nfirst place because when we look at how we do a lot of different exercises we never consciously\ntry to even get to 0 to get from sort of a flex position. If you think about posturally how we stand,\nwe kind of stand like this. That means that our hips are in some sort\nof flexion here. We need to have them straight up into extension. 0 degrees at least, back into neutral. The only way we're going to do that is to\nconsciously contract your glutes. Literally squeeze your ass as hard as possible\nto get yourself into a neutral position. Let me show you how this actually plays out. If we did a deadlift, you take a deadlift\nand you get to the top it looks like this. Down, here, engaged, press, and I come up. Now that looks like the top of a deadlift. But we're not really in extension. I'm in at least 5 degrees of flexion here. If I did this and I squeeze my cheeks together\nI just got myself into full extension, and now I'm back up to the top. Now I can hinge, hinge, down, press, squeeze\ninto extension. So we want to complete the rep every time. Complete the rep. Squeeze here. Okay the next thing. if I were to just squat, even if I was just\nsquatting here, we tend to go down into our squat and when we come up we usually squat\nlike that and we stop here. What we want to do is be able to squat into\nfull hip extension. So just engaging the hip again by squeezing. We have that added benefit by squeezing the\nglutes together. Sometimes our hips tend to stray during a\nsquat, whereas they open a little bit, or they open the other way. It depends on imbalances in the hip. Let's say they open a little bit this way. If we squeeze our glutes together we're going\nto re-center ourselves and be in alignment again, ready for the next squat. Down, up, squeeze. So we're always setting ourselves up in the\nright direction. Another thing, again, hip extension. People do barbell hip thrusts. Great. It's a great exercise for doing that and we're\nworking on it. We're trying to address it this week. So we get in this position, push into our\nthighs here, and we drive up. But look at this. Look at the amount of flexion that's still\nin this hip. It's dropping like this. My thigh is coming down, and then it's angling\nback up again into my hip because I'm still in flexion here. Like that. I think I went to the top, but watch how much\nmore I have. Squeeze, squeeze, squeeze, squeeze; all the\nway up. Now I'm in neutral. Now I can actually feel my glutes working\na lot. A lot more than here, but we do this. We crank away at the reps thinking that we've\ndone what we're trying to do, but we really haven't until we go all the way up into extension. So why does all this matter? Because if we don’t get extension through\nthe hips we're going to get it somewhere else. We're going to get it through the low back. So if I come up here and I'm trying to extend\nand I get that far, I'm going to try to arch my back to get up even further. I'm going to get the extension from my lumbar\nspine. If I'm up here doing a deadlift and I come\nup and I don’t get extension I'm going to do this. We see it all the time. Extend through the lumbar spine so that we\nlook like we've reached full extension. But that's not what we want. As a physical therapist, you should be trained\nto be able to look for somebody and say \"What's hurting you?\" My low back. \"Okay, great.\" The first place you want to look is either\nsomewhere right below, or somewhere right above. If we're looking above we're looking into\nthe thoracic spine. If we're looking below we're looking to the\nhips. There's something not doing its job that's\ncausing the area that's hurt to be asking for help and being asked to be called in for\nhelp when it's not really supposed to do that job in the first place. So all that extra extension through the lumbar\nspine is too much of a demand when the hips are well capable of doing the job if you strengthen\nthem the right way. The last thing I would say is, a great exercise\nto focus on – again, a lot of people do this wrong, too – step up. Then you get both hips working in the same\nexercise. So we get up here. We see people do this. They've got dumbbells in their hands, they're\ngoing to do a step up. Okay, here, step up. Here, step up. How many times have I seen people doing this? Here, step up. Not once did I go into full hip extension. Now, if I wanted to come up here and I didn't\ndo full hip extension, if I lift myself this way, here, if I lift my shoulders up, lumbar\nextension, but it's not hip extension. So again, asking my back to do the job that\nmy hips weren't doing. If instead I actually finished all the way\nthrough, now I can ensure the hips are doing the job. So what I like to do is finish with my knee\nup. If my knee comes up, this is driving this\nglute forward into full extension, or at least into full neutral. Then when I come back down I actively engage\nthe hip here in extension. I don’t just let it sit. I engage the hip. Boom. Extend it here. Here. Drive up. Boom. Down. Boom. Down. Up. Down. Up. Down. Not only are the mechanics better, but you'll\nbe stronger. You're plugging those energy leaks that happen\nwhen we loosen everything up in the kinetic chain, when we really should be focusing right\nhere. It all starts here. This is your center mass and unless you start\npaying attention to actively contracting it you're going to be leaving a lot on the table. All right? Guys, I hope you've found this helpful. Remember, a weak ass is never a good thing\nto be, or to have. I'm trying to correct you guys and help you\nnot to be weak asses. Be strong. Be built functional, like an athlete. If you're looking for a step by step plan\nfor doing that head to ATHLEANX.com right now and get our ATHLEANX training program. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want to see and\nI'll do that in the days and weeks ahead. All right, see you."
}