{
    "id": "nK3BNozPEx4",
    "title": "Back Workout (SORE IN 6 MINUTES!)",
    "description": "Build your body with science here - http://athleanx.com/x/athlete Subscribe to this channel here - http://bit.ly/2b0coMW If you ever ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. We're starting a new series here today on\nthis channel. Sore in six minutes. Today we're going to start with the lats. You see, we did a video all about workout\nsoreness and how eccentric tension, and loading during the lengthening of a muscle is one\nof the ways to spark, at least a stimulus, for muscle growth by causing some micro damage\nto those fibers themselves. That's not the only way to create muscle growth,\nbut it's one of the ways we know how to do that, through that mechanical tension. With the lats you either have to choose the\nright exercises, or you have to do them the right way, or as I'm going to show you today,\na combination of each because the right exercises allow you to apply the techniques the right\nway. But before do you have to understand a little\nbit about Raymond. Right? Everybody knows Raymond. You have to know that the anatomy of the lats\nthemselves are going to allow us to do that, if you understand this. So the lats are going to attach on the inside\nhere to the spinous process. All these little bumps back here on your vertebrae. All the way down to the lumbar spine. They're going to come out here, all the way\nto the upper arm on the back of the upper arm. So when you want to stretch a muscle you can\ntake those two points and bring them further apart from each other and you can stretch\nthat muscle. We also know that it feeds down here through\nsome fascia into the top of our pelvis. So we also have a control point with the pelvis. If the pelvis is moving away from the back\nof the arm here we can also do that. So that being said, let's start applying some\nof these techniques to this is minute routine. If you don’t get sore, I promise you; you\nwill get sore by doing this. So let's go here now to the lat pull down. On the lat pull down, the first thing I do\nis I position my arms with my elbows a little bit in front of my body. That's very similar to a chin up, but the\nreal effect is that, the arm being in place here is allowing the stretch point, or the\npoint of stretching of the lats to be greater because this point is getting further away\nfrom this point than it would be if it was over here. So now, by doing that, you've already placed\na greater stretch on the lats and we have to apply the load. When you come down, do as normal. Retract your shoulder blades. Pull them together on the bottom of the pull\ndown. But as you go up, don’t just allow your\nelbows to come forward, but allow the bar to go forward as well. Protract your scapula. Reverse the retraction that you have. Now, if you have an unstable shoulder, or\nif you have a really bad shoulder at the moment, this may not feel comfortable. If that's the case, don’t do it. But if your shoulder is feeling good this\nshould feel totally normal because you're going through the motions here of the shoulder\nblades. Protraction and retraction. You'll feel a tremendously increased stretch\non the lats with even a couple reps, but we have to apply a tempo here. We've got to prolong that eccentric lengthening. So put three seconds on the eccentric portion\nof the lift, one second on the way down. If you do a 12 rep max load you're looking\nat 48 seconds, or so. We're going to go for a minute. So even if you have to rest and pause, that's\nfine. Take that all the way through and then move\non to the next exercise. That is a lat pullover. A dumbbell lat pullover. When we position ourselves here on the bench\nwhat we want to do is, look at that point of attachment down at the pelvis. If we can take the pelvis and move it further\naway from the arm then we're golden. We can do that by actually dropping down. Now, once we've established that position\nwe've got to increase stretch on the lats. Now we have to apply the tension. So let's do a 21 style. Again, don’t just do a lat pullover. Let's throw something at your muscles that\nthey haven't necessarily felt before, and also at the same time, prolong the time that\nyou're going to spend on that eccentric portion of the lift. So you're going to do a 21 style. The top third, just hang out in the top third\nmotion here. Pelvis is dropped. Do the seven reps in the upper third of this\nexercise. Then immediately, without resting, go down\nto the bottom portion. This is where you're really going to feel\nthe stretch. You're going to keep those hips dropped as\nmuch as you can. If your lats are really tight you're going\nto find that your hips are going to want to pop up every time you let the dumbbell go\nbackward. But try to keep them as far apart as you can\nand hang out in just the bottom third and do seven reps. Then from here, again without resting, now\nwe're going to go to a full rep. we're actually going to take the lat through\nthis full stretch, full contraction. So allow the pelvis to drop as you stretch\nback, and then come up into neutral as you pull the dumbbells back up toward the top. So you now go through, again, seven reps here,\nand now you've got yourself the second minute using a 12 rep max load of this six minute\nroutine. Now you might be thinking \"You know what would\nbe a good exercise, Jeff? A dumbbell one-armed row.\" Because you can do it in a lawnmower style\n– as I've shown before – where you reach out at the bottom and pull up, and you get\na nice stretch. Not really. If you look at it, when we get down to the\nbottom here, we are getting a good stretch if we allow the dumbbell to move forward,\nbut we're not really getting the tension. The tension gets shifted to the front delt\nas I try to lift the dumbbell up from below, at that 90 degree point. So it's not necessarily getting the stretch\nand the load at the same time. It's sort of just getting the stretch. Not a bad exercise, just not the best way\nto have a loaded eccentric in that exercise, or as the one that we're going to try to do. But we can do what I'm going to show you here. This is actually an exercise we've built right\ninto AX1. It's a rotational high row. So what we have here is, now we've got the\nopportunity to get our arm – right here – further away from, not just our pelvis,\nbut also the spinous processes in our spine because we can rotate that way, and keep this\nover here. So you can see that these two points are going\nto get further away if I take these and move them over there. That's what we're doing by rotating. At the same time we're going to also rotate\nthe pelvis over there while this stays over here. So creating all this length there as I go\nthrough this row. So you can see, I try to row to the middle. I've got that protraction, or that retraction\nof the scapula again, and then I allow it to wrap around my body and protract, and increase\nthat stretch. Spending time, again, on that long duration\n– eccentric – to get that nice load, and to really make sure that we're hitting it\nhard. We spend one minute on the left arm, and one\nminute on the right arm. That's just four minutes. That's right, because we're not done yet. What you have to do is go back to a set of\nthe pullovers for one more minute, and finish up with one more one minute set on the lat\npull downs. There's your six minutes. As I said in the beginning, this is not meant\nto make you sore right now – although it may, depending on your experience – but\nwhat it's meant to do is make you sore tomorrow, or more importantly, even 48 hours from now. You see, it’s not just the only way to create\na stimulus for muscle growth, but soreness manipulated the right way, through mechanical\ntension can. That's what I want you to do here. We're going to cover all the other muscle\ngroups. You let me know what you want to see and I'll\ndo my best to do that. In the meantime, if you're looking for a program\nthat puts the science back in strength, head to ATHLEANX.com right now and get our ATHLEANX\ntraining program. All right, guys. I'll be back here again in just a couple of\ndays. I'll see you soon."
}