{
    "id": "nlscRmdO11o",
    "title": "“Fat to Fit” in 4 Simple Steps (SCIENCE PROVEN)",
    "description": "If you want to make a fat to fit transformation, you are going to want to watch this video. Here I share with you 4 simple steps that ...",
    "transcript": "What s up guys, Jeff Cavaliere, Athleanx.com. \nSo, if your body looks like this right now,   what would it mean to you if you could actually \nmake it look like this? Or if you're a little   bit older and your body looks like this, how do \nyou think you would feel if you could look like   this instead? Or maybe even if you look like this \nto start, do you think you'd feel better if you   look like this? Well, if you answered yes to any \none of those questions, I ve got good news for you   because I'm going to help you get there today. I'm \ngoing to show you just four steps that are simple,   proven and science based that I promise \nyou are going to get you to a fit body.   Let's start breaking them down one by one. \nSo, as you make your way through this video,   you might recognize some of the things \nwe're talking about here because   you've heard them before. However, I'll ask you \nif you've heard it, how come you haven't been   able to act on it? Because while others may have \ngiven you the advice and maybe shown you the door,   they haven't given you the key to unlock the \ndoor. Well, that's not going to give to you,   because we've all heard the advice, for instance, \nthat you need to be in a hyper caloric state in   order to lose body fat. That is indisputable. And \nmany studies have proven this time and time again,   however, it's not happening.\nThe reason for it is you're either choosing to be   hypercaloric or you're choosing to be\nHypocaloric. \n  And there's a big difference. You see, guys, being \nhyper caloric is a non-negotiable. When body fat   accumulation is your issue, the only way to get \nrid of that excess body fat is to take in fewer   calories than you're burning off throughout the \nday. However, how big of a jump are you trying   to take? Because those that take too aggressive \nof a jump not only find that their diet becomes   unsustainable, but they actually set themselves \nup for failure because it's in direct conflict   to one of the other points we're going to \ntalk about ahead. So, what type of deficit   are we talking about here? Well, you've probably \nheard the recommendation of a 500-calorie deficit   from baseline to create a one pound weight loss \nover the course of a week. Seven days in a week,   500 calories a day, 3500 total calories \nsupposedly equal to one pound, although   science will actually disprove that, too. But as \na rough estimate, we can go with that. However,   even at a 200-calorie deficit there, science that \nproves that we can do exactly what we want to do,   albeit at a slightly slower pace. If I promise \nyou, however, that you still be able to look the   way you want to, would you be okay with that? If \nso, then let's proceed here to step number two.\n  You still with me? Good. Because whether you've \nread the studies yourself or just trust the   people that have read them for you, the idea \nis that you need to take the next step and you   probably know that. But how? How are you going \nto become hypocaloric? And this is where people   tend to choose their next diet, Paleo, Keto, \nMediterranean, where instead of focusing on the   name of how you're going to eat, you really should \nbe focusing on the two main things that matter the   most: your preferences and your behaviors. \nAnd when we talk about preferences, yeah,   it's about the type of foods that you like to eat. \nWe want to make sure that we're not restricting   too much the type of foods we like to eat or we're \nnever going to stick with our strategy long term.   But more importantly, what's the behavior that \nset you up in the position you are right now?   Because the behavior is the habitual \ncomponent, it's the habit you develop.   And breaking a habit is a hell of a lot harder \nthan making some tweaks to food choices. \n  For instance, if your behavior is that you eat too \nmuch at every given meal, what are you going to do   about it? Well, here's what the key to that door \ncomes in, because if you decide that I'm just   going to restrict the amount of food that I eat, \nyou're likely not going to be able to stick with   this plan for the long term. So, what I would say \ninstead is let's figure out a way to work within   that behavior. Instead of requiring an overall \nbehavior change, let's reallocate where we're   going to have our portions be large. I'd rather \nsee you have an increase in fibrous carbohydrates   knowing that the fiber content is going to \nactually fill you faster, but I'm still not   going to deprive you of the larger portions that \nyou tend to need in order to make you feel full.   But we're going to do it from a less calorically \ndense source. So, if we can cut down on some of   those starchy carbohydrates but still allow you \nto eat them, because again, preferences matter,   you do light the carbohydrates, we're \njust going to eat them in smaller amounts.   This is going to be a diet plan that's set up \nfor success because it's working both from a   behavioral standpoint and not restricting the \npreferences that you have in the first place. \n  So instead of one and two, we've addressed the \nfat portion of the fat to fit transformation.   But now what? Well, now we have to focus on what \nwe're doing right, the calories out portion where   we exert our efforts, because you've probably been \ntold that maybe even all exercise is created equal   when it's not making the wrong decision here will \njust leave you skinny and I don't think that's   what you're looking for. Because when you looked \nat those pictures in the beginning here, what   appealed to you is likely the muscular development \nin the after photo. That's what made it stand out.   Going for a jog or a run or jumping on a bike \nis an effective way to burn some additional   calories and help you to more effectively and \neasily get into that caloric state. But it's   not doing anything to create these after photos \nbecause these after photos rely on building lean   muscle tissue. And the only way you're going to \ndo that is by incorporating strength training   into your regular exercise regimen. I'm talking \nabout hitting the weights on a regular basis as   part of your overall exercise programing. Look, \nstudies will pit head-to-head diet alone versus   diet in conjunction with weight training and every \nsingle time weight training wins out, especially   if it's the muscular physique that you're \nlooking to build. Don't overlook this subtle   difference here and assume that all exercise is \ncreated equal because as I said, it's not. And   making sure you get this right is imperative \nif you want to look like these guys here. \n  All right, so in step four, well, what training \nsplit are you going to? Because it matters,   or does it? You see, people get confused often \ntimes and confusion leads to no choice at all. I'm   going to do a total bias split because I was told \nThat's good, or I'm going to do push, pull legs   or I'm going to do the split. But no, people have \nsaid That's bad. So, you know what? I'm going to   do nothing. Well, you need to do something as we \njust established. So, what I'm going to tell you   to do is just make sure you're doing this. Here's \nthe key, progressively overloading, adding more   weight to the bar to allow your strength to build \nfrom work out to work out or phase to phase. Or   increasing metabolic overload and demands on your \nbody by keeping the rest time shorter and getting   more work accomplished from workout to workout. \nWhatever you might do, whatever strategy you pick,   as long as you're striving to push yourself \nto a higher level of fitness and strength,   that's going to do the job. \nHowever, if you're a beginner,   you're looking for a great three day a week \ntotal body plan that's been shown to help   build muscle effectively, you can follow the one \nthat I put together for you for free right here.   It's the perfect beginner workout. If you want \nto get the results like these guys did here,   you can follow our AX-1 Program at Atleanx.com. \nIf you found the video helpful, make sure you   click Subscribe and turn on your Notifications, \nso you never miss a new video when we put one   out. Beginners, make sure you check this \none out, I promise it will help you out."
}