{
    "id": "nmG7fZlKYeo",
    "title": "How to Get Bigger Shoulders Fast (JUST DO THIS!)",
    "description": "If you want to learn how to get bigger shoulders fast then you've come to the right place. In this video, you will see how to build big ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. I'm \ngoing to show you today how to get your shoulders   growing again fast. And I promise you, if you \ndo exactly what I show you, it's going to work   for every single person that tries it. The \nissue is your shoulders don't grow maybe as   fast as you want them to because you're doing a \ncouple of things wrong. Number one, you're not   training your Real Delt enough. And we talk about \nshoulders, especially that front to back depth,\n  the Rear Delt is a large component, \nnot just a little bit of a component,   a large component of what we're talking about. \nAnatomically, I was blessed with a couple of   freckles here that work as some landmarks. I want \nto show you something. If I were to go in this   position here, this freckle is sort of towards the \nfront line of my Mid Delt, here's the split of the   Mid Delt. And this freckle back here is almost at, \nabout an inch ahead of the back side of my Rear   Delt. You can see when you look from the side, \nthis is the Front Delt right here, the whole rest   of the shoulder, the massing of it comes from \nthe Middle and the Rear Delt. So, we can get   an exercise that would allow us to build that, \nwe would be been doing good for ourselves. \n  The second thing is we don't necessarily train \nthe Rear Delt, and when we do heavy enough because   it's capable of handling heavier loads and when \nwe do that, that's when the magic happens. So,   here's what we do, we grab a set of dumbbells on \nthe ground kneeling. Now you can do this standing,   but the benefit of doing the kneeling position \nis that you get away from some of the momentum   you might use from your lower body to do this. I \nwant to load this exercise a little bit heavier,   but make sure that the Rear Delt in the \nMid Delt are doing all the work. \n  So, I get in this position here and I grab my \ndumbbells, I'm in this kneeling position. Now, I'm   going to do it as it's called the hip hugger. I'm \ngoing to drag the dumbbells up towards my hips.   But at the same time, the key for me is to get \nmy elbows back behind my body as far as I can go.   Extension of the arm at the shoulder is \nwhat drives the Rear Delt engagement.   The higher up into extension I get, the more that \nRear Delt I get. Okay, now the second thing I   know I need to have for that Mid Delt is we need \nsome abduction of the elbow away from the body.   So, I want to be able to get that out and abduct \nthe arm away from my body as much as I can. \n  But it's driven by the motion backwards. \nBecause if I stay in the front plain here,   the frontal plane, or if I go even a little bit \nforward, what I do is I turn this into almost   a Kneeling Upright Row, which is no less shitty \nthan the Standing Upright Row. So, what I do is   I get here and that would be a bad position. \nSo, if I actually were to do this and be able   to stare down from my side here, stare in this \ndirection and see my elbows in front of my body,   I'm not doing it right. There are too far in \nfront, that's abduction without the extension   of the arm. If the elbow stays back behind my \nbody like it should and I look to the left. I   can't see my elbow, okay? I can't see any of that. \nSo that's what you want to look for. Peek that way   and see if you can see your elbow.\nSo again, this position here,   I'm going to drive it into extension and then \nget the abduction at the shoulder as well here,   up in there, up into extension and then that \nabduction. Extension and abduction. I get a   good squeeze. Now, the weights I'm using here, \nI kind of tweener weights. They're not the real   lightweights that people use for Rear Delts and \nthey're not super heavy like you would be using   for, let's say, an Overhead Press or Dumbbell \nPress. We're not replacing the need for those   weights, we're complimenting them. And when you \ndo that, that's when the real magic happens. \n  Now, let's say I want to finish this off and I \nwant to get more of the front out here because   I can benefit from adding that in the same \nweight will work in the drop set or let's   say a thirty second rest after the first set to \ngo right into something we call a Scoop Press.   And from the Scoop Press, I just get in this \nposition here, elbows down, locked in place,   ninety degrees. Scoop it underneath in press \ndown scoop, press here, scoop and press.   I'm not curling, just back, scoop and press. Good \nstretch in the front at the bottom here, up the   elbows underneath, drive them up at the top. \nAnd again, as long as you avoid   bringing them out in front of your body here, \nyou'll get away from that internal rotation,   upright row position and more to that extra \nrotation, almost high pole position. Guys give   this a try, and I promise you it will work to \nhelp you to build bigger shoulders. If you're   looking for a step-by-step plan where we build \nan entire athletic body from the ground up,   head to Athleanx.com, check out our programs. \nIn the meantime, if you found video helpful,   leave your comments below, make sure you click \nsubscribe, and turn on your notifications so you   never miss new video when we put one \nout. All right guys, see you soon. "
}