{
    "id": "nmsFJHkWkfo",
    "title": "Chest Workout Tips for Size (HARDGAINER EDITION!)",
    "description": "Hardgainers become gainers here - http://athleanx.com/x/gain-muscle Subscribe to this channel here - http://bit.ly/2b0coMW A ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Jessie. He's back. I know you've been waiting for him. Today we want to cover the chest. So we've had our Hard Gainer Edition, and\nour Hard Gainer Series here. Today it's about exercise tips when you're\ntraining your chest. Particularly as a hard gainer and this guy\nis starting to – he's getting over the moniker now. He's actually starting to become a gainer. As you can, too. But today I want to show you some of those\ntips you can apply when you're training your chest that's going to help you out, all right? We're going to break it down to three parts. The first place we're starting is the pullup\nbar. Okay, yes, I said pullup bar because again,\nwe're following suit with what we talked about before regarding hard gainers. One of your biggest problems is going to always\nbe activation. Remember the first time you ever did a dumbbell\nbench press, or a barbell bench press. You didn't even know where the weight is in\nspace. You're doing your dumbbells and they're kind\nof floating around. JESSIE: Right. JEFF: People tell you to bring them up together\nand you never really hit them in the same spot. That's a proprioception issue. But there's also a muscle awareness issue\nand one of the key points, whenever you're going to press – and we're going to have\nto press if we're going to build your chest – is you've got to be able to press with\nthe chest and not the shoulders. We cover this in a video for our more advanced\nguys and as you can see it's integral to what we do in this. It's very important that you start now. So what I had Jessie do, and what I recommend\nyou do is starting with some scap pulls on a pull up bar. On chest day, believe it or not, and just\nbasically try to do a pullup without moving his arms. Without bending his arms. He gets up there and holds it for a couple\nseconds. The point here is we're trying to activate\nhis lower traps, get to the ability to be able to control the scapula, pull it down\nand hold it there. I'll show you why it's important in a second. A couple more. So I'd have him do a couple sets of this. Six, seven, eight of them, held for a couple\nseconds each. Now come on down. We talked about how you want to ingrain it\nwith what you're actually going to do and that's with actually pressing. So when we press, what we do wrong a lot of\ntimes as hard gainers, is we press and we lead with our shoulder, and we let our arm\ndo the pressing. So let's show what that looks like. As we press the arms are doing the pressing,\nespecially as you're trying to use heavier weights than you should. You're pressing and letting your arm lead\nthe way. That's not what you want to do. You want to let your chest lead the way. So the arms have to stay back. The only way the arms can stay back, the shoulders\ncan stay back, is by having an awareness of those muscles on the backside that you just\nhopefully woke up a little bit and made aware that they're going to need to work. JESSIE: Scap pull downs. JEFF: Exactly. So now let's see with those scap pull downs. So here, you press out and you lead with the\nchest. So this is doing the contraction, this is\nstaying back. Okay, so pressing that way. In as hard as you can, press. There you go. So I have him do some presses standing up\nin the air, just like that. You can see, even his posture is improving\nbecause we're working on these things. Now we take it over to the bench press. Okay, so the bench press. It's not an exercise that you want to avoid\nat any level. Especially as a hard gainer because it's going\nto help you to start building more of that size. But you've got to do one thing for me, Jessie. You've got to do one thing for me, too. You've been doing one thing for me and that\nis, you've got to get over the small plate phobia. See, there's nothing worse than heading to\nthe gym and then getting ready to bench press and then all you can do is this: on the end\nof the bar. Because you'd do anything to have people be\nable to see that big, 45 pounder on the outside so that even that girl is staring at you at\nthe other side of the gym, at least she sees 145. She could imagine that there's two, or three\nstacked on the inside of it, but you just want to get to the point where you can do\nthe bigger plates. The biggest mistake is people doing that and\nnot being able to – they're monkey fucking the plates and the bar and they can't get\nany good reps out. You're defeating the entire purpose and that's\nwhy your chest isn't growing. So you have to start with a weight that you\ncan control. But there is a way that you can incorporate\nheavier weights. It's actually going to be necessary for neurologically\nwaking up your muscles a little bit to help them feel more comfortable and confident in\nhandling heavier weights. So what we do is we take the pins and we set\nthem up high. I'm not concerned about depth, I'm not concerned\nabout anything. What I want to do here is get a weight here\nthat I'm going to adjust by 20% from what Jessie's going to work with. So if he's working with 115 what we'll do\nis we'll get him up to 135 – again, a weight that he's not going to try to lift because\nhe's not going to be able to do it so well since he's just starting out. But instead what I want him to do is get comfortable\nwith the weight in his hands. A touch up. So we get in here and all I want him to do\nis un-rack it. So for a few times he's just going to un-rack\nand get it up over his chest. He adheres to the same principles of the chest,\njust up nice, holds it for a couple seconds, brings it back down. Again, a weight that he's not necessarily\ncomfortable repping out with. Do another one. He starts to feel more confident with the\nweight. Okay, put it down. Now after doing a couple of the un-pinnings\nhere, now what he has to do is do one set. And I don’t care how – again, with the\npins nice, and high – I don’t care how many reps he winds up doing. When he winds up failing, he comfortably is\ngoing to come down to the pins. Eccentrically feel the weight all the way\ndown. Get comfortable feeling what that weight feels\nlike. Come on down. So now he's going to lift up, gets in position\nhere. Go ahead. And press up. There you go. Nice. All the way. Down slow. There. Okay, press, press, press. Down slow. Good. So that's all he has to do. Do a rep, or two, or whatever it is to feel\ncomfortable with that weight and then we're going to go into his working weight. So now what I do is take his working weight,\nwhich is now instantly going to feel lighter because neurologically he's commanded the\nweight that was heavier, he's convinced himself that he can handle it. Maybe he's not capable of handling it for\nfull sets of reps, but from a confidence standpoint he can handle it. So now we get in here and now we do our working\nsets with this weight, which he could be in the six to eight rep range. We're trying to build strength here. But it's a weight now that's 20% less than\nwhat he just did and neurologically he turned himself on. That's it. I won't make you do the whole set. Just one more. It even feels a bit light from – go ahead,\ncome on up – like the same way that a baseball player who would swing a donut on the end\nof a baseball bat would then go to the baseball bat itself and he neurologically turned that\non. All right, we've got one more step here. Again, critical for getting hard gainers to\nstart unlocking more size. Okay, last thing. Now we're on a dip. Now what we want to make sure that you know\nhow to do, and we could do this easily with the dip, is not just train to failure, but\nto learn how to take and train through failure. We talked about that. Again, as a hard gainer we tend to not understand\nwhat our true limits are and that usually holds u back. So on this exercise we can train him to failure,\nand then through failure by just using a band. You can put a physio ball, push it inside\nthis captain's chair setup. But you just take a band, you press it down\nhere, and you let it hand right in front of you. Now what Jessie's going to do, he's going\nto dip and then as soon as he reaches failure, where he would normally jump off the bar we're\ngoing to teach him there's more that you can do. There's a drop set that you can do. You can actually extend failure. Take it to failure again via this band assisted\ndip. JESSIE: So just putting my knees on there. JEFF: Just put your knees on there. So go ahead. We're going to keep them behind the band at\nfirst. Okay, adhering to all the proper principles\nof the dip. Shoulders stay back, he leads again with the\nchest. He's squeezing here from the chest. He's not shrugging his shoulders. We cover this in a lot of other videos. Keep going. I want to see you go all the way to failure\nhere. All right, one more if you're there. Okay now put the knees right in. Get inside there. Now you're going to go down and rep them out. We just took 60lbs off his bodyweight. Adhere to the same principles. Push all the way up. All the way up, all the way up, all the way\nup. Up, up, up, up, up, up, up, up. Okay, good. And down. So it could be another rep, or two, or three,\nbut those are the productive reps because those are when he's most fatigued. Those are when he would have quit and would\nhave left them on the table. As a hard gainer we need to activate. We need to learn ways to feel heavier weight\nso we can get more confident in it and then we need to figure out ways that we can take\nit through our limits. These right here apply to this chest workout. We've got others in this series. Jessie, showing some love. He actually is becoming bigger and bigger\nby the day. The fact is, he's working his ass off to do\nit and I'm proud of him, and I think you guys can do the same thing. So if you're looking for a program that puts\nthe science back in strength, gives you the right approaches and strategies that makes\nsense and they're back in science to get there; that's all over at ATHLEANX.com. Our ATHLEANX training system. In the meantime, if you liked these videos,\nif you want to see more of the hard gainer series, leave a comment and thumbs up below\nand I'll make sure we bring more to you. All right, guys. See you soon."
}