{
    "id": "Noe--e6aBLs",
    "title": "The Key to Bigger Pecs (AND HEALTHY SHOULDERS!)",
    "description": "Build your body with science here - http://athleanx.com/x/athlete Subscribe to this channel here - http://bit.ly/2b0coMW When you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to revisit a topic that we've\ncovered on this channel here before, and that is the positioning of the shoulders when you're\npressing. Particularly if you're doing a bench press,\nor as I'm going to show you here today, other exercises when you're training your chest. Because there are two real reasons why you\nalways want to be conscious of what your shoulders are doing. One of them is going to be the safety and\nthe longevity of your shoulder joint as you're training, and the second thing is actually\nthe aesthetics of your training and what you're getting from your training in the first place. If you don’t have your shoulder in the right\nposition you're actually going to screw up both of these. Let me explain what I'm talking about. When you look at the shoulder joint you want\nto sometimes look at it from the side here, in its position of the humerus, the upper\narm bone, in relation to the rest of my torso here, okay? What we often see is the anteriorly tilted\nhumerus. This way. Where it's tilted this way forward, okay? That's very common because of postural issues\nthat we all run into, because we don’t address the muscle that actually cause the. The pec minor is one of the major muscles\nthat will pull the shoulder blade down, and forward. I actually put a complete video up on this\nchannel about how to stretch the pec minor. I'll link it right here if you haven't seen\nthat because it is a popular adaptation and compensation that happens from our poor posture\nthat we tend to sit in all day long. We do then have another alteration here. We can have more of a neutral tilt of the\n– which would be no tilt – of the humerus in relation to the rest of my torso here,\nand then we can have the posterior where the head is angled a little bit back in relation\nto my torso. What you want to be able to do is get the\nneutral to a bit posterior in all of your pressing exercises. The best way I can tell you to do that is\none real tip. One thing to focus on because there are a\nlot of people that try to do this, and they retract their shoulder blades, but then their\nhead pops forward. That's not good. Or they try to do this and they shrug their\nshoulders to do that. That's not good. What you want to be able to do is get the\nretraction and the depression of the shoulders at the same time. So we could do that very easily by focusing\non the position of the top of our sternum. I always talk about this. If I were to grab onto the top of my sternum\nhere, what angle is it at? Well, my arms are forward. My shoulders are around and forward. It's angling down at this angle right here. Literally, if I tried to rest a glass of water\non it right here it would probably start to tip out, and tip forward. So if all I wanted to do is get this level,\nthen all I have to do is just angle the top of my sternum level. That's it. By doing that I immediately – I don’t\njust pull my shoulder blades back. I pull them back, and down. Now once it's in this position we've created\na much safer shoulder to press from because we're not getting all this movement here. We're not jeopardizing the AC joint in my\nshoulder because when I get here with a dumbbell, if I were to go down and press with this anterior\n– I don’t even want to do it because I'll rip my shoulder. This anterior tilted humerus, with all that\nweight, all that internal rotation is literally what can pop and AC joint in a single rep. So you want to be back, and down. But you set that up, you lift the sternum\neven here, set the shoulder blades down, and you'll actually feel stronger. At the same time, again, from a performance\nstandpoint you are shortening the distance that the dumbbell, or the bar has to travel\nbecause you've brought your chest closer to that. By getting the back in the position it should\nbe. I'll show you the difference. You can see it in action. This would be, when I get up here and I allow\nmy arms to just travel forward, my shoulders are shrugged a little bit, I just don’t\nhave a real attention to the right positioning of the shoulder. You can see that the press – there's activation\nof the chest, of course – but it's not going to be like what I'm going to show you now. So now I lift the sternum up, I pull back,\nand down. Now as I press, I've even got a better pre-stretch\non the chest itself. I'll show you why in one second. From here, press up. Held down and back. Down, and back. Okay, so even from a performance, and aesthetic\nstandpoint not only have I added some safety to my shoulder, but I'm also getting better\nperformance from my pec. As I told you before, when you shrugged your\nshoulders up and get loose in your shoulder girdle here, you're basically taking – especially\nif you look at the upper chest – if the upper chest fibers come from here, and head\ndown to here; what happens when I do this? Round the shoulder, lift forward. What I've done is, I'm just shortening them. There's no pre-stretch. You need a pre-stretch to get a more powerful\ntraction. So when I do this, and this, now I've got\nthat additional pre-stretch here that makes it more effective. When I come over to a dip it's the same thing. I've talked about how important this is when\nyou do a dip, you don’t – a lot of times we get in this position and we do this. So you start here, shoulders are shrugged,\nthey're way anterior. Jessie, come over here for one second. Look at how anterior the shoulders are here. Now, if I were to go down too far you get\nall that force being directed into that AC joint. That can also cause that same problem that\nhappened on the bench press. So what we want to do is, we want to get up\n– I'll show you again when I do this. Everything is kind of collapsed and working\nfrom there. It's not a good position, but if I get to\nthe top and I lift the sternum up, and I get that down, and back, now when I'm here and\neverything's held down, if I don’t allow my shoulders to shrug up – in other words,\ndon’t collapse in – now when I press, come here, and come up. Instantly, a much better activation of the\nchest, a much safer position for the shoulders, and better overall results. So again, I try to boil it down to the things\nthat you can take home and do rather easily and my one point that I want you to focus\non is what's going on here. Ultimately understanding that we're trying\nto influence what's going on back here because that's going to give you, not only better\nresults, but a safer, more injury free future here with all of your pressing. All right, guys. I hope you found this video helpful. In the meantime, if you're looking for a program\nthat tries to give you the reasons why, and not just the what – because I think telling\nyou 'what' is not enough. If you understand why you're doing something\nwhen you're doing the exercises you feel them that much more and they make that much more\nsense. That's what we try to focus on here at ATHLEANX. All right, guys. I'll be back here again soon. Let me know what you want me to cover and\nI'll do my best to do it in future videos. I'll see you soon."
}