{
    "id": "NtaPROZOcmM",
    "title": "Build Big Shoulders with Bands (NO WEIGHTS!)",
    "description": "If you want to build big shoulders with bands and did not think it was possible, then this is the video for you. Here, I'm going to ...",
    "transcript": "I used to work out a lot with weights and the \ncheck comes doing your joints start to hurt this,   back, knees, it just happens. Sometimes \ngetting into that kind of shape can kill you.   There's fantastic trainers like Jeff Cavaliere on \nAthlete-X, his videos are amazing. But at my age,   I found the hardest, toughest, most productive \nway is bands, training with bands.\n  Yeah, bands are great and all and this \nJeff Cavaliere fellow, he's a great guy,   but what about Jesse Laico at Atheleanx.com, \nhe's the real star of the show. \n  I can't disagree with the thing you just said.\n  What's up guy's Jeff Cavaliere, Atheleanx.com. You \nsee, I've always been a Stallone guy and Arnold,   you just gave me more validation as to why. But \nthe fact is, we're talking about bands today,   guys that's we can all agree on and you can \nactually build muscle using just bands. I'm   continuing the series and today we're talking \nall about shoulders. What can you do to hit   the middle, front and rear delt, as a matter \nof fact, you hit the whole shoulder together?   These are the exercises that you want to focus \non. Let's start break them down one by one. \n  So, when it comes to building bigger shoulders, \nwe're going to start here with the big exercises.   You know, the ones that hit all three heads \nat once. And you can't start without talking   about the overhead press. You see, there's a \nchallenge, though, when it comes to overhead   pressing with bands. Usually, you're either using \nsomething that provides good amount of tension,   but you just can't stretch it far enough \nwhen it comes all the way from the ground,   or you opt for something lighter and it just \ndoesn't provide enough overload to cause growth.   So instead, you do this, and this is the line \none arm press. And what this does is it fixes   the band length problem because I can start with \na bent leg and I can match my strength levels to   provide just the amount of tension that's going \nto create the overload necessary for growth.\n  Of course, as I get stronger, I can \ncreep my foot down further and further,   increasing the length of travel and stretch \nof the band. I could also do something really   unique here, I don't have to just settle for \nthe concentric overload. I could actually   introduce an eccentric overload as well. Once \nthe band is fully extended up over my head,   I push my foot down and try to control the descent \nof the hand back down to shoulder level. \n  Now, let's say I want to do something different. I \ndon't want to go for a tension overload, I want to   introduce a metabolic overload to my pressing. \nWell, I could do this, this is the push press   pull apart. And here I could actually focus \na little bit more on increasing the time that   I'm under tension at the top of the press. \nSo when I press up overhead with two hands,   now I actually get a chance to stay there, pull \nthe band apart at the top, and then, of course,   pull it back together, creating an abduction \nresistance that's making it harder for me to   actually get my arms fully extended and my \nhands close together up over my head. \n  When you're looking to get a little bit \nmore explosive with the overhead pressing,   the kneeling up and over's is the way to go \nand see. What you do is you anchor the band   underneath your knees and then you put your hands \nin this pressure position so the band is not   bending your wrist back and you get to this \ntall, kneeling position and you simply drive   this band up overhead as fast and hard as you \npossibly can. Speed matters here. We're looking   for power. We want to introduce a different \nstimulus here for those delts. This is going   to definitely hit the front and middle delt, the \nrear delt not as much, but don't worry guys we're   going to be hitting those in just a minute. \nAnd with our three overall shoulder exercises   down, now it's time to start working around from \nhead to head to head. And we're going to start   right here in the front with the front raise \npull apart. You see, this is looking like a   traditional front dumbbell raise, except we're \ndoing it with bands. But when we get to the top,   we could do something to introduce some new \nstresses here and prolong the time that we   have to spend in this miserable top position \non the front delt raise. And this is where we   just simply pull the bands apart. And by doing \nthat, yeah, we're going to shift a little bit   that load to the middle and rear delt, but most \nimportantly, what we're doing is prolonging the   time under tension that we have at that top, \nmost difficult position of the front raise. \n  If you really want to put a unique stress on the \nfront delts, then you're going to want to do this.   And this is the stretch front raise. The band \nshould be anchored behind you in such a way that   it actually pulls your arm back into extension, \nwhich is going to apply a good stretch on the belt   before every single repetition is performed. It's \nthe act of this stretching of the front delt that   gives you the stretch reflex necessary to create \na more powerful contraction. So, what I like to   do is not just drive my arm up in front of me, but \nthen control the descent in the eccentric all the   way back down. You can literally see the fibers \nresisting this on every single repetition. \n  Working our way around now to the middle delt. You \nknow, you're going to have to do some side lateral   raises here. And you can actually do these better \nthan maybe you can with some dumbbells if you know   how to apply tension the right way. What I like \nto do, number one is not anchor the band under   the same side foot that I'm lifting my arm up on, \nbut on the opposite side. Because what it does   is it gives me a little bit more range of motion \nin which I can actually apply the resistance of   the band. And then I also want to make sure that \nI grab this thing the right way, because whether I   grab a dumbbell or I grab a band with an overhang \ngrip, I'm actually going to be at the mercy of any   kind of weakness I might have my wrist or any pain \nI might have my forearm in terms of performing   this with peak tension at the top of the rep. \nWhat I could do instead with the band is simply   grab it this way, anchor it around the back \nof my hand and then just focus on lifting up   the entire arm. It's not so much focused on \nwhat's happening directly at the wrist. Now,   let's say you have some of those issues at \nyour wrist or forearm and you still want to   take advantage of the gains you can have by doing \nthese lateral raises, you can do the short arc   version of this. And that's when you take a band \nof much heavier resistance anchor it around your   arms like you see me doing here, double up around \nthe elbows and then you simply drive your elbows   out away from your body into abduction at the \nshoulder as much as you possibly can. The fact is,   with the arm decreased from the long arc version \nhere, you're going to have to introduce a heavier   band in order to have the resistance that you're \nlooking for, to create the muscle overload.\n  And now, of course, there's one other thing \nwe can do, and this is my favorite variation   for growing your shoulders with bands, and it's \ncalled the cross body lateral raise. And you can   see right off the bat, one great advantage \nhere, similar to the stretch front raise,   is on getting a stretch on the mid delt. Something \nthat almost never happens in almost any variation   of a lateral raise, even when done with dumbbells. \nYou want to get this band across your body to get   that pre stretch and then forcibly drive your \narm up and across your body into abduction.   You can see the tension that's placed on the \nmiddle delt here at the peak contraction. Try to   hold it for a second or two and then again, resist \nthat eccentric all the way across your body. \n  But lateral raises are not the only way to hit \nthe middle delt guys. There's two more ways that   are incredibly effective at getting the job done. \nThe first of which is actually called the banded   high pull. You see, it looks exactly like the \nhigh pull that I recommend to you all the time   for building bigger shoulders with dumbbells. \nAnd what this does is it not only introduces   the abduction that we need to get our middle \ndelts, but it has another component here   that's so often overlooked and that is some \nadditional external rotation at the shoulder that   can always be beneficial to producing not just \nstrong, but healthy shoulders. So, you can see,   just like with the dumbbells, I don't want my \nelbows to beat my hands in the race to the top.   If I were to do that, I simply turn this into \nan upright row, which we're not doing. \n  Instead, I want to have the hands be \nhigher than the elbows at the top,   which reinforces the external rotation I just \nmentioned. But we have another option here,   too. It's called the hip hugger in the hip hugger, \nyou actually take to individual bands and you   double them up just like this, because we're going \nto need the added resistance. And with your hands   hanging now just at your sides, all you want to do \nis pretend like you're pulling up a pair of pants,   drag your hands up your hips until you get those \nelbows out into abduction. At the very top of   the movement, it's important to hold the squeeze \nfor at least a brief second or two. This is where   you want to really reinforce that tension. \nAnd now, as I mentioned earlier, that brings us   all the way around to the back side, to the rear \ndelt. And the first exercise I want you to do here   is called the Rear Delt Pull. You simply wrap the \nband around your back and you're just going to do   a band pull apart, essentially. But how you grab \nthe band is essential to getting the full benefits   of this exercise. If you could grab the band with \nan overhead grip, the tendency would be to try to   actually do an elbow extension to get the band \nbehind the body, but that's only shifting the   work to the triceps. Instead of you grab it like \nthis, now the focus is on moving the entire arm.   And with the arm being the focal point of the \nmovement now you're going to shift all that   load to the rear delt doing the reverse fly. But \nyou don't have to do it and standing only. As a   matter of fact, you can increase the intensity \nand the focus one side at a time by doing this,   the alternating Bent Over Rear Delt Pull. You can \nsee the position is the same. As a matter of fact,   I get some additional benefits from the down \narm in terms of shoulder stability right up   into that shoulder blade. Either one of these \nis a great way to target the rear delt and help   to get them to grow. Especially if you've \nbeen ignoring them for far too long. \n  And that brings us to exercise number six. You \ndidn't think we get to the whole video without   doing a face pull, did you? Well, here you go. \nHere's your obligatory face pull video. Guys,   you know I love this exercise. You also get the \nextra rotation built in to hit that rotator cuff,   there's nothing better than a face pull. Maybe \nwhipped cream, but these are good, too.\n  So, you have guys, whether you're an Arnold \nguy or a Stallone guy, the fact is--\n  Come on, Jeffrey, what about the Jesse guy? Like \nI said before, he's the star of the show.\n  Arnold, with all due respect, could \nyou please let me finish my outro? \n  I'll be back. \nLike I was saying, guys,   never underestimate the power of bands \nwhen it comes to building muscle,   if you know how to use them. Guys, hopefully now \nas far as your shoulders go, you know exactly what   to do. If you want to see more of these in this \nseries, make sure you leave your comments below.   Tell me what's the next and I'll make the video. \nIf you're looking for step by step programs, guys,   all of them are available over at athleanx.com. \nIn the meantime, if you haven't already done so,   make sure you click subscribe turn on your \nnotifications, so you never missed in a   video when we put one out.\nI told you I did back. \n  I'm gone, how about that?\nOh, come on Jeffrey. I command."
}