{
    "id": "nWFHk8VvEhQ",
    "title": "EXPLOSIVE HOME WORKOUT - Just Need a Dumbbell",
    "description": "More Home Workouts : http://athleanx.com/x/explosivehomeworkout One of the benefits of explosive home workouts is that you ...",
    "transcript": "Doing an explosive workout at home can be\nas easy as 1,2,3. I am going to show you how you can do that\ntoday, with just a set of dumbbells. [Music Intro] What's up everybody? Jeff Cavaliere AthleanX.com. Last we talked about-and I showed you-a leg\nworkout that you can do that was part of our Limited Time Sweat 16 Workout. We know this weekend it is the Final 4. I am a big NCAA fan. I love all sports obviously but I really get\nexcited this time of year with college basketball. So the Sweat 16 took you through one region\nof our workout, which was our lower body portion. We also have an upper body pull, an upper\nbody push and core region that are all part of that Sweat 16 workout that comes with the\nAthlean-X program now at Athleanx.com. Again, I told you it is not going to be there\ntoo long. It is going to go away. So if you haven't already got that, you should\nhead over there after this workout and go get that. There are a couple of questions about the\nexercises from my Team Athlean members that appear in the Sweat 16. So I figured why not pull 3 of them out and\nshow you, not only how explosive they can be, but put them into one 3-exercise circuit\nthat you can do with just a set of dumbbells, literally anywhere in just a little bit of\nspace. So it is an excellent home workout explosive\noption here for you. So what we do is 3 exercises. We have dumbbell thrusters, dumbbell high\npulls, and then we have an X-file push-up. Really covering every single muscle group\nin our body with 3 moves. Alright? So you are going to start here with our thrusters,\ndumbbells come up. We are going to come down, almost into a low\nsquat position, elbows between our knees, up and press, OK? [Exercises] You drive it up, everything drives up together.Nothing\ngoes in slow motion here. You are not going to go here, establish, and\npush. It is up, and explode up. OK? 10. Then feet even wider, dumbbell is down and\nbelow, almost a sumo- squat position, here, explode up and pull. So your hands are going to come up, and turn. Your thumbs are going to be out, just like\nthat. You want to do that. We don't want the thumbs in, because we don't\nwant to lead to any impingement at the top at our shoulders at the top of that movement. So if we start down here, up,-up and pull. [Exercises] OK? Again working through everything, up through\nour upper back, rear delts. Slide them away. Down into our X-file push-up. Hands out, feet out into an X position. Down, explode up, and in. Exercises] OK? 3 exercises: explosive, quick, but really\neffective. Again, pulling right out of the Sweat 16 workout\nthat comes right now with the Athlean-X training program. Guys, if you are not part of team Athlean\nyet, now is the time not just because of that workout that comes as a limited time exclusive\nwith the program. Guys, summer is coming. It is what, almost April now? It is getting warm here in the Northeast. Guys are already starting to think about getting\nin shape and looking great this year. Start now. Start on a workout program that trains you\nlike an athlete, that trains you explosively, that gets you building new, lean, athletic\nmuscle really, from the first week in. We have guys that show great results from\nas early as the first couple weeks and they carry it all the way through. Again, as always, we are going to measure\nyou through our Athlean challenges to be sure that you are not just guessing that you are\ngetting in better shape and looking better, but you know it because you have objective\nfeedback to tell you that. Guys, again, head over to AthleanX.com, become\npart of the team. More great stuff coming. We have a couple of exciting announcements. I know I have been telling you about that. We are going to let them start seep out one\nby one in the next few weeks. So if you are a fan of what we have here,\nI think you will be an even bigger fan as the weeks ahead play out. I will see you back here in 7 days."
}