{
    "id": "OcFCHdQHjVU",
    "title": "Lat Pulldowns (&quot;BAD&quot; FORM | BIG GAINS!)",
    "description": "The next time you do lat pulldowns in your back workout, you might want to start rocking. In this video, I'm going to show you how ...",
    "transcript": "JEFF: Jesse! Where you been, my man?! It’s\nbeen like a week. I haven’t seen you. JESSE: Oh, you know, man. Just coming up with\nsome new exercises. JEFF: That’s not a new exercise. That’s\na lat pulldown. JESSE: That’s not a lat pulldown. That’s\na Romanian pulldown. JEFF: A what? JESSE: A Romanian pull down. All right, so\nit’s really great because you take your femur, right? JEFF: That’s your humerus. JESSE: And you get up, and internally rotate- JEFF: External rotation, yeah. JESSE: And you can really abduct your elbows\ndeep into your sides- JEFF: You mean ‘adduct’ them, right? JESSE: And then on the way up, on the concentric,\nyou really, really slow it down. JEFF: Yeah, the real – eccentric, right. JESSE: Yeah, so it’s great because it works\nyour lats, it works your hamstrings, and your quads. JEFF: You’re a f***ing idiot. JESSE: Do I do anything useful?! JEFF: No! JESSE: Well, do you at least like my hair? What's up, guys? Jeff Cavaliere, ATHLEANX.com. It’s time to start rocking on those pulldowns.\nAnd no, I didn’t lose my mind. I’m not talking about this kind of rocking. You see,\nthis only gets you into an exercise fails video. Maybe not somebody else is, it’s\ncertainly going to get into mine. If you haven’t seen it, you can actually\nwatch that video here at the end of this one. It’s worth the couple minutes to see. what\nI’m talking about is starting to rock on your pulldowns like this. You see, this actually has a lot of benefits\nand as an advocate for doing the many, many types of pulldowns, this is one that needs\nto fit into your regime because it’s going to provide benefits that you’re not feeling\nright now. you see, when it comes to the lat pulldown, guys, this exercise is one of the\nbest ways to train your lats because it allows for the versatility of a lot of different\nhand grips, a lot of different bars that you can use, and a lot of different placements\non the bar to hit different areas of your back. The limitation comes if we don’t understand\nthe anatomy of the lats, and what we’re actually trying to accomplish. So if you look\nat the lat muscle itself, you can see that it has a pretty big sweep, and most importantly,\nit attaches to your arm. It’s not just on your back. So if our arm\ncomes in front of our body, we’re going to get more of a stretch on the lat itself. That’s a good thing to know because it makes\na big difference when we’re talking about whether we want to use an underhand grip – which\nwill take our arms out, in front of our body, and provide that stretch – or whether we\nwant to use an overhand grip, which limits that on every, single rep. But you might be thinking “Well, that means\nyou’re just going to go to the underhand grip.” No, because if you were to just do\nan underhand grip and perform your lat pulldowns vertically, as you see me doing here, then\nyou can see that you’re actually limiting the amount of extension – meaning your arm’s\ngoing back, behind your body – by being in that position. That’s not what we want, if we want to train\nthe lats. We want to have extension. We want the arms to get back, behind the body. So\nwe’re limiting that. what we normally do when we perform the underhand version is we\nstart to lean back, to allow that to happen. But what happens there? when we lean back\non the underhand pulldown, now we start to involve a lot of the other muscles in the\nback, as you see happening here. Anything that we can do to squeeze our shoulder blades\ntogether is going to start involving multiple muscle groups, and limiting the isolation\non the lats themselves. So your other option is, you go back to the\nvertically pulling, arms in front, hand over hand, lat pulldown. Now here, you can see\nthat we can hit the lats in that adduction range that we didn’t get from the underhand\npulldown because they’re already close to our body here. The overhand allows us to pull down and go\ninto this abducted, into adducted. Abducted, into adducted position, against our body.\nThat’s good, but what are we missing here? We’re not getting the extension. This is where some people make the mistake\nof leaning back on this overhand lat pulldown to get the arms back, behind the body. But\nthe elbow position is always going to be too high by doing this, and you can see this is\nimmediately shifting the focus. Not to the lats, but the rear delt. So where\nare we left? We’re left with the opportunity to stat doing the rocking pulldown. On the\nrocking pulldown, guys, what you’re allowing yourself to do is do a vertical pull to get\nthe benefits of the overhand, straight up, and straight down adduction going on from\nthat vertical lat pulldown. And then add the additional extension. The\nall-important key extension at the very end, by stopping the bar at about forehead height,\nand then driving down one elbow to take over the rest of the load. The elbow comes down,\ncontinues to come down, but it rides back, behind your body. You’ll immediately feel the difference here.\nNow, why is this important? Because you want to train your lats in as many key functions\nas they have. If your lats can extend, you want to extend. If your lats can adduct, you\nwant to adduct. If your lats can extend and adduct, as you can see here, then you want\nto do both. Now I will caution you. Do not just grab the\nbar here with arms straight and pull down on one side. This is not a hard exercise.\nThis is actually very easy. You’re not really moving. They’re just placing the stack very\nfar, and what you’re doing is you’re turning this into an elbow flexion exercise. You want to engage, and bring the elbows down\nso both sides are bearing that load into adduction, and then from there, you finish it down with\nthe tilt. It will be a much different feel for when you do this exercise. So there you\nhave it, guys. Sometimes a little anatomy goes a long way. When you can use it to your advantage to make\nexercises better then I think we’ve gotten what we were shooting for in the first place.\nThat is, better training. Guys, if you’re looking for a complete training program, head\nto ATHLEANX.com. We put the science back in every, single workout\nwe do because, as you can see, it all matters. And don’t just take my word for it, guys.\nPut me to the test. Try this exercise, do it without, then do it with this tweak, and\nI promise you, you’re going to feel more. All right, guys. I’ll be back here again\nsoon, in just a few days. Let me know what you want me to cover and I’ll do my best\nto do that for you in the days, and weeks ahead. All right, see you soon."
}