{
    "id": "oLwTC-lAJws",
    "title": "How to Fix Rounded Shoulders (GONE IN 4 STEPS!)",
    "description": "Rounded shoulders are one of the most common postural problems that not only makes us look bad when standing but it ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to show you how to fix rounded\nshoulders in just four steps. As you can see, Jessie, we fixed Jessie. We did fix Jessie. There we go. Jessie, actually, I'm making fun of him, but\nJessie had terribly rounded shoulders and you can see that in the before and after photo\nright here. This was Jessie just months before we started\nto train him and I know a lot of you that watch this channel have watched him physically\ntransform, in terms of the muscle he's gained, but there's been more to that. More importantly, it's sort of been focusing\non the framework first. I don’t believe in building a house off\na crappy foundation. You don’t want to do the same thing when\nyou're training. So at the same time we've been really working\non his posture. I'm going to show you how, exactly, he did\nthis so you can do the same thing. There are four parts to fixing your posture,\nbut maybe you're not even quite sure exactly if you have it yet. There's a quick way to do this, okay? Just stand up real quick and put your arms\nat your side. Without doing anything I want you to just\nlook down at the position of your thumbs. I wasn't trying to set you up at all, but\nI want you to look at the position of your thumbs. Jessie's thumbs, right here, if he were to\njust stick them out – just extend your thumbs – his were actually in this direction. At least they're pointing in this direction,\ntoward you. But a lot of you might find that your thumbs\nare pointing straight at each other because when they're standing in front, like this,\nyour arms are actually pointed here because your shoulders are too rounded. Now of course, you can look in the mirror\ntoo, and have validation of that, but the four things you're going to need to do is,\nnumber one: you're going to need to work on the joint. Number two: you're going to have to work on\nmuscles, in terms of the ones that are too weak, and you need to strengthen. Muscles that are tight, you're going to need\nto stretch, and then we're going to have work on habits, too. So let's get started right away with the joint\nitself. Okay, so we talked about 'joint' and you're\nthinking, probably, what? The shoulder is messed up. If it's rounded it's got to be the shoulder. But ironically, it's not. The joint that you're going to really want\nto focus on the most is your back. More specifically, your mid-back; the thoracic\nspine. What happens is, this gets really, really,\nadaptably tight on most of us, and when it does, and it starts to round out what does\nit do? It takes everything with it. Not just the head, but the shoulders come\nwith it. But if we can get an extension through the\nthoracic spine everything kind of goes back quickly. It's a lot a faster way to fix it. Now, if you're an athlete – which a lot\nof our viewers are – you can get a tight, posterior shoulder capsule. If that's the case you can do the sleeper\nstretch I'm showing you right here. That will help to attack the shoulder itself\nthat might be making the head of the humerus here kind of skirt forward, and be rounded,\nbut in most cases that's not necessarily going to be your biggest thing. It's more likely going to be this mid-back. So what we can do here – I'm trying to keep\nthis really simple so you don’t have to have a lot of equipment – you can get down\non the floor and do what we think is one of the most effective stretches you can do in\nmobilization for the thoracic spine. That is what Jessie's doing here. He simply puts his arms up, over his head\nat about a 45 degree angle, and as he rotates back he tries to rotate, and keep himself,\nand his chest wide open. What we're getting here is, we're getting\nelevation of the arms overhead, but at the same time we're getting this extension through\nthe thoracic spine. So that's opening him up. It's really easy. All he has to do is work on going to the left,\nand to the right side. You do this just a few times each day, or\nat least three, or four times a week, and you'll start to see a huge difference. That's one of the main things he did to start\nopening this are up. If you want to start using equipment you can\nfeel free to use a foam roller. Put it across the thoracic spine and work\non trying to mobilize through that are. But again, I don’t even think it's really\nthat necessary. I think if you're a little more consistent\nwith this you'd have a lot better effect from doing that. So now, if we're going to talk about muscles\nwe've got to see the muscles, right? I talked about Jessie actually making the\ntransformation, but what we're concerned about here is, we've got to decide what is tight,\nand what is weak. If you turn Jessie to the side, and you get\nin this position here you can see that we have a series of muscles that are going to\nget tight, and we have a series of muscles that are going to get weak. It's called 'Upper Cross Syndrome' because\nof the way that they cross each other. So as we get into the dysfunction here, you\nget tightness here through the chest, you get tightness here through these muscles in\nthe upper back. The levator and the traps. Then, at the same time, because all this stuff\ngets stretched out we get weakness through a lot of the muscles of the scapula, we get\nweakness of the muscles inside the scapula, and we get weakness and tightness of the muscles\ninside the neck as well. So what we want to do is, we want to correct\nthis. So let's start with the stretching. With the stretching, the two that I'm most\nconcerned about because he's got all this internal rotation here of his arms, is the\nsubscapularis, which is one of the four rotator cuff muscles, but it's the only one that internally\nrotates, as opposed to externally rotates. Then the other thing we get is the pec minor. So, the pec minor is actually a really interesting\none because it comes in from right inside here, and it comes down, and it connects to\nthe ribs. Now, what that would do – you can see, if\nthis got tight and I were to pull this down, it's going to pull the shoulder forward, around\nthis way, it's going to pull it down, and it's going to tilt it this way. It's going to bring it from here, to here. So all this stuff is obviously horrible if\nyou have a problem with your rounded shoulders. So we can actually address both of those. So let's go to the subscapularis first. What Jessie would do if he's going to stretch\nthat out is, we know, again, it's an internal rotator of the shoulder. So we've got to get into external rotation. So that means he's got to take his arm, get\nit out, into external rotation as much as he can. So reaching back this way. After he gets in that position he's going\nto hook his arm up, against something. The edge of a doorway is fine. All you're going to need to do all this stuff\nI'm going to show you is a band, and a doorway. Get into this thing here. I'm going to show you from below, here. You're striding out. Once it's hooked in here you're just going\nto rotate your chest that way, over there, and try to keep reaching back here. Like that. So Jessie, come on in. so he gets up into position here, external\nrotation. It should look like he's getting ready to\nthrow a baseball as a pitcher. He strides out, he's in here, he's externally\nrotated, and now he starts to rotate all this that way. And you can feel all that right inside the\narmpit, right? JESSIE: Yeah. JEFF: That's the thing. You just want to hold that for about 30 seconds\nat a time. Again, do it a few times a week. It's going to really help to loosen it up. Now, for the pec minor here. What he would do is, he would get himself\nin the position here, and he'd want to do the opposite of those three things I just\ntold you. If it's tilting it forward this way he can\nuse the edge of the doorway to actually keep it pushed back. So he's taking the door, pushing into this\nto actually hold it back. Once he's there, the next thing is, he can\npinch his shoulder blades together to get that activated. We'll show you again here what it looks like,\nmore in depth. As he gets there, the last thing he needs\nto do – if it's trying to tilt him down, this way – well, he can get it to go up\nby raising the arm up. So with that stretch he can feel the pec minor\nbeing stretched right there. JESSIE: Yeah, I can. JEFF: You can see here on the muscle marker,\nyou can see as he does it how this gets stretched, and elongated just by going through these\nthree positions. So we actually hit the two biggest problem\nareas. The subscapularis and then here, with the\ndoorway, and we've got a big dent into correcting the tightness that's causing this problem. Now we've got to attack the strengthening\nside of it. So now we've got to get to the muscles. The muscles we have are, again, they're weak. So if we strengthen them we're going to help\nget this stuff back. We talked about, if the internal rotators\nare tight that means, likely, the external rotators are weak. So if we can get the rotator cuff to work,\nwe'd be doing a good thing. If we can get the rhomboids – the muscles\nthat pinch the shoulder blades together – we'd be doing a good thing. We're getting the shoulders back. If we can get the lower traps to work, that\npull the shoulder blades back and set them down, nice and tall, then that would be doing\na good thing, too. If we could also get the serratus anterior\n– which is a muscle that's relied upon for stability of the shoulder blade to get it\nnice, and back – then we can do that, too. We need to incorporate all these things into\none exercise, or at least two exercises because I want to try to keep it simple. So we use a band. Remember, just a wall and a band is all that's\nneeded. The first one that we do is, you take the\nband and – it's a variation of a pull apart. A pull apart alone is not enough. If we do a regular pull apart, what we want\nto do here is make it better. So as we go to open the band up what we're\ngoing to do is, we're going to also try to externally rotate. So as he comes and pulls the band apart he\nkeeps trying to turn his thumbs back. So they're coming back in this direction,\nhere. So he doesn't just keep them here, pointed\nup to the ceiling, and just keep going back like this. He wants to go back, and at the same time,\nrotate the hands out. Perfect. Now do a couple of them. Now, on the way back he comes in nice, and\nslow. And go back again. He's making sure to not feed into the problem\neven more because I told you that these muscles get tight. So show them what would look wrong. If he shrugged this, if you shrug it up as\nyou go – which a lot of people do – you're literally defeating the purpose of what you're\ntrying to do. So you've got to keep these down, and then\nyou go back, externally rotate the thumbs, all the way back, behind you, and squeeze\nit as hard as you can here. Again, he's keeping this down, he reaches\nback, he's squeezing in through here, externally rotating the thumbs – basically pointing\nback toward you at the back there. Good. One more. Pull back. Right there. Good. Now what we're looking for here – and your\nrep scheme should always be – that's good, Jess, for that one. Your rep scheme should always be 20 sets of\n1, rather than 1 set of 20 because quality, quality, quality. The problem is your muscles. They're there, they're just not firing right. So if we can get them to fire right we're\nmuch better off. Now, the last one we want to do is, you want\nto work on the serratus. We want to work on the lower traps. So we've got to get the arms up, over our\nhead, and we can do it with the band. So here, now you turn to the side a little\nbit. For here, what you're going to do is, you're\ngoing to protract your arms out. So once you get in this tall position – get\nas nice, and tall as you can from here – now, once you're here you just reach your arm – right. You reach your arms out just a little bit,\nstill keeping this nice, and tall, just to get your arms protracted without rounding\nthe back, because we don’t want to do that. So we're here, protract. Now, maintaining that protraction there, he's\ngoing to turn the arms out again into external rotation, just until he has good tension on\nthe band, and now from here, he's just going to raise it up, overhead. Just like that. And down. And reset everything. So here, tight, a little protraction, externally\nrotate, screw it out, raise the arms up, and come down. Quality reps here, every, single time is going\nto be the key for correcting this, and getting these muscles to be fixed. All right, guys. Lastly, we've got to talk about the habits\nbecause remember; you didn’t' get this way in one day. I'm sure as a kid you didn't walk around like\nthis all the time. You probably walked around with good posture. You just did things to yourself over the years\nthat put you in that position. So I'm going to give you one thing, because\nI know it's really hard to overcome this. So you need some sort of feedback. One thing for standing – because we're going\nto spend half the day standing – and one thing for sitting down. When you sit down all you have to do is take\na tennis ball and put it behind your shoulder blades, right here, right there, up against\nthe back of the chair. What you're going to find is, the second you\nstart to fall into that rounded shoulder posture the tennis ball is going to drop behind you\nin the chair. So it's instant feedback that you did something\nwrong. So when you sit upright, and you put the tennis\nball back there it's going to force you to be in a better position. The next thing, when you're walking around. I always say one thing. \"Where is your sternum?\" We know the sternum is right here. Right there. Okay, but where's the top of it? If the top of it is angling down then you're\nin for some trouble because if it's going down, everything is coming with it. So what you want to do is, you want to try\nto lift your sternum. Pretend that the top of your sternum – right\nhere, at the top of your chest bone – that it's a glass of water. If you're letting it tilt, and fall out then\nyou're in a bad position. So always keep your sternum full throughout\nthe day. Keep your sternum up. You can check that throughout the day just\nby trying to consciously say \"Where am I?\" And you'll instantly know if it's down you're\ntilting that water. If it's up, the cup is level; you're in a\ngood spot. The last thing – it sort of makes obvious\nsense – but if you spend a lot of time behind your desk you're going to have to get up a\nfew times during the day. Just break it up every 15 minutes, every 30\nminutes; just stand up for a little bit. It just gives you a break in this positioning\nhere, and it gives you the reminder that, as you get up, you should be doing something\nelse, too. Which is either checking your sternum, or\nremembering to go get that damned tennis ball and put it behind your back, if you've forgotten\nto, at this point. But the fact is, habits will take some time\nto break. But if you're doing these other things I showed\nyou here – again, the whole thing doesn’t take that much time. It's only going to take you about five minutes\nto do a couple exercises, or a couple stretches, and a little bit of that mobility work. It's just the consistency of doing it that's\ngoing to pay off in the long run, and I guarantee you, you're going to be able to fix this. I thought this guy was a lost cause. He proved to be otherwise. You could do the same thing. Again, if you're lifting you want to build\noff a solid foundation. If you're trying to lift off this kind of\nfoundation, not only is it a bad idea, but you literally, physically cannot get your\narm up, over your head as high if you're lifting from here because of the block that comes\nfrom having rounded shoulders. So you're not even going to be as productive\nwith your lifts. So fix the foundation first, and everything\nelse will fall into place. If you're looking for a program that puts\nit all in place – because as a physical therapist I care about all these things, it\nall matters – all my workout programs contain all the building blocks that you need to put\nyourself in the best position, to not just look your best, but function your best. Those are over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Make sure you share it with somebody else. We all know somebody that's got rounded shoulders. Make sure you send it to somebody and help\nthem fix this problem once, and for all. All right, guys. See you soon."
}