{
    "id": "OuYeBkOx-Mk",
    "title": "Six Pack Ab “Hack” (ABS NOT REQUIRED!)",
    "description": "Get abs year round - http://athleanx.com/x/abs-365 Subscribe to this channel here - http://bit.ly/2b0coMW Getting six pack abs just ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we've got a muscle hack for you! It's the six pack hack. When you don't necessarily have that six pack\nyet, but you're looking to do anything you can to make it look like you do – okay. I'm not going to break out the muscle marker\nand draw. That could be way too easy, but we are going\nto make it easier by focusing on – not the six pack. You see, the six pack is the rectus abdominus\nand this muscle alone will never give you a good looking mid-section. If you don’t believe me, look at this picture\nright here. This guy clearly has some abs, but because\nhe's lacking obliques and serratus anterior – two muscle that I've covered in depth\na lot of other times on this channel – it just doesn't look that good. It's probably not what you were thinking of\nwhen you said \"I want to have a ripped six pack\". This guy here probably with a little less\nab development looks far better because he's got the serratus and the obliques tying in\nand visually creating and tapering, and narrowing that midsection, and framing out that six\npack a lot better. We've talked about this concept before. Well, today I want to give you one exercise\nthat you can do. Either with nothing at all if you're just\nworking out at home in an empty space, or with a single physio ball that you could actually\nget this working better. Here's what it looks like. You get down on the ground, you're going to\ndo a side crunch. Now there's a lot of people that do side crunches,\nbut they do one of two things. They either grab their neck and they just\nstart cracking away like this with no real care about what muscles are actually doing\nthe movement. Or they're just worried about what's going\non down here at the waist and they're not focusing on the other opportunity they have. That is to get the serratus working as well. So what you want to do is do your side crunch\nand instead of just doing it here where I'm focusing, gain, mostly on contracting the\nobliques. Which would be a good step up from just grabbing\nthat neck. We want to add that next layer in. We can do that by taking our arm, reaching\nacross our body, and then trying to reach out, away from us. That's going to activate the serratus. Now if you remember when we covered the chest\nwe have a pushup plus. The pushup plus is when we get to the top\nof the pushup and then try to push even further. Allow our shoulder blades to continue to protract\nand go around our body. The same thing is happening here. We crunch up, we work the obliques, we take\nour arm, and we press across our body. Not just to here, but as far as we can go. You can actually see the activation kick in. If you're wanting to do this resisting, like\nI said, if you want to do this in a gym you have the opportunity to use a physio ball\nas well, or even at home you can do this. You put the ball against something sturdy. Here, I've got a wall, and now as I come up\nand crunch, now I push into the ball which is going to provide resistance for me. So we get even a little bit more work for\nthe serratus. The idea here though is, you want to make\nsure that you're training these because these muscles that reside up here are actually going\nto be much more visible at a higher body fat percentages. We all know for guys one of the most stubborn\nareas is the lower belly. It's the last to come off and if you're relying\non that alone to be able to show off that impressive six pack, it could be a long, long\ntime. But if you had at least a little bit of visual\nmuscle popping through here – which can happen at higher body fat levels – if you\njust train them you could actually start to get some of that midsection tapering going\non to give you the appearance that you're at least heading in the right direction. As I said, that other video that I covered\nover here – the Holy Trinity of Ab Training – that, you're going to want to look at\nfor more advanced versions of this. It doesn't just start here and stay here. As always, with everything we do it starts,\nand it evolves, and it continues to evolve, and it continues to challenge. You always want to do that with all of your\ntraining. But this presents a great opportunity for\nanybody with no barrier of entry, no equipment needed at all if you want to just start getting\nthis working for you right now. Guys, if you're looking for a program that\nwalks you through everything step by step and progresses you as you're able, that's\nthe ATHLEANX training program. That's over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below and let me know what else you want me\nto cover here on this channel and I'll do my best to do that in the days and weeks ahead. All right. I'll see you soon."
}