{
    "id": "P01H0XpNpk0",
    "title": "Brutal Triceps Workout (SORE IN 6 MINUTES!)",
    "description": "Build a ripped, athletic body - http://athleanx.com/x/be-jacked Subscribe to this channel here - http://bit.ly/2b0coMW If your triceps ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The Sore in Six Minutes series continues today. This time we're hitting the triceps. For all of you out there that say \"I just\ncan't get my triceps to even remember that I trained them the day before.\" No more. You see, with the Sore in Six, it's just six\nminutes. I'm going to give you a routine that makes\nyour triceps remember that you worked them today. You're going to start feeling that as soon\nas tomorrow and the key is choosing the right exercises and doing them the right way, with\nthe right intensity. As you can see, I already just did. Here's what we're going to do though, to make\nsure that you're feeling the same way. You're going to grab two pairs of dumbbells. The first one is going to be a weigh that's\nlighter than what you would normally use on a dumbbell line extension. Here's why: you're going to do six minutes\nstraight of this stuff, okay? So I chose 20lbs here, which is probably about\nhalf of what I usually train with. We're also then going to take the weight that's\ndouble that weight. So you are going to use those 40lbs, but you're\ngoing to use it for a different exercise I'm going to get to. But you're going to start off here on an incline\nbench. Now, why the incline? Because some of you that train that have bad\nshoulders, if you're trying to get your arm all the way up here, to this much elevation\ncould become a problem. So if we're trying to stretch the longhead\nof the tricep and get a good stretch on an extension – like I'm showing you here – this\nis where I'd have to be if I was lying flat on my back. If I had the same position here, and had this\nbend in my elbow and I'm on an incline I don’t have to elevate my arm up as much, so it's\neasier on the shoulders. So to be more universal here and still guarantee\na great workout, we're going to set it on an incline. You're going to do the first exercise in 21\nstyle. So you're going to do the first seven reps\nat the top part of the range of motion and rep them out, but make sure that you achieve\nthat contraction. Remember, the arm will be slightly back beyond\nvertical to make sure the triceps are fully taking on this load. Then we're going to drop down to the bottom\nhalf of the range. The bottom 1/3, and rep out for seven there. these are all done for about two second a\nrep. so you should be 28 seconds in, or so, for\nthe first two portions of that. then you're going to go into a full rep. the full rep is done more with the classic\nSore in Six Minutes one second up, three seconds down, focusing on the tension with the eccentric. Remember, that's the whole key to the Sore\nin Six series; making sure that we're not avoiding the eccentric contraction, really\ntrying to prolong it. We're seeking it out, and you can see me doing\nthat here. As soon as I do that I stand up, I invert\nmy body on the same incline bench, and now we're going to do a kickback. Again, here we're going for peak contraction. You can get the arm back, behind my body. I'm trying to contract as much as I can. I realize, you're going to be a little sore\nand tired at this point, but that's okay. Keep going for as long as you can. You've got one minute to rep out as many reps\nas you can and when you feel like you can't anymore, see if you can hold that rep in that\nfinal contraction for the duration of that second minute. Now, here's the fun part because here's where\nwe actually drop those light weights, and we go and grab those heavier weights. Now, with the heavy weights we sit back and\nwe adjust this bench to now be flat. We lay on our back, back into another line\ntricep extension setup. What we're going to do here is, we're going\nto allow our chest to help us with the concentric and turn this into an eccentric only exercise. Again, to load up on the eccentric on the\ntriceps. We're going to press up like a dumbbell bench,\nand we're just going to let our elbows drop down. Sort of 'French-pressed' style toward our\nforehead, or a little bit beyond. As soon as it comes down drop the dumbbells\non your shoulders, pull your elbows back down, put yourself back in position for a press,\nand press them up again. So concentric with help, eccentric triceps\nonly. You keep that thing going for as long as you\ncan. That's the first round through. You take it one more time through all the\nway doing your best to get as many reps as you can and that's what produces soreness. Now you get to see me put myself through the\ntorture in real time. So there you have it. Another Sore in Six in the books. This time the triceps, next time, who knows? I'm reading your comments, I'm looking for\nyour request, and I'm lining up the Sore in Six Minutes workouts to make sure I make them\nfor you, but keep this in mind: the goal is not to string as many of these together into\na single workout as you can because we're not going to be talking about Sore in Six\nat that point. We'll be talking about Sore in 6000. That might be how long, and the number of\ndays that you're sore because there is a limit to what your body can adapt to. What we're trying to do here is break those\nplateaus, convince yourself that you're not one of those that can never feel X, or Y,\nor Z muscle group 'sore'. Now you can if you attack it the right way,\nbut you always have to prioritize a recovery. Especially as a natural lifter. In the ATHLEANX training system we manipulate\nthose variables in the right time, at the right place, with the right exercises to help\nyou to see those gains, and not interrupt your progress by shooting yourself in the\nfoot by doing the wrong things at the wrong time. If you're looking for that complete training\nprogram it's over at ATHLEANX.com. In the meantime, if you like this series,\nand if you like this particular series and you want to see more of it, again, let me\nknow what you want to see below and I'll do my best to cover it. All right, guys. See you soon!"
}