{
    "id": "p2fwzeu4f-k",
    "title": "Biceps Workout “Finisher” (HARDEST 10 REPS EVER!!)",
    "description": "Put serious size on your arms in 6 weeks with the Ultimate Arms program here http://athleanx.com/x/get-ultimate-arms-in-6-weeks ...",
    "transcript": "What's up guys? Jeff Cavaliere, AthleanX.com. I hope your biceps are ready because we're\ngoing to finish them off today, no doubt about it. We're going to continue our finisher series\nhere, this time for the biceps and all you're going to need to do is have three things with\nyou. You're going to need to have a piece of tubing\njust like this, you're going to need to have your dumbbells you would have used for your\n10 rep max on a dumbbell curl, and then the last thing is a pull up bar that you can jump\nup onto. Now, the easy thing, grab your band, grab\nyour dumbbells, put them right up under the pull up bar and you're ready to go. Here's how this finisher is going to work:\nyour goal is to complete just 10 reps of your 10 rep max on your standing dumbbell curl. Remember, the finisher is coming at the end\nof the rest of your bicep workout. All you have to do is start up on the pullup\nbar, do one of my favorite exercises; the negative chin hang. What you're going to do is jump up onto the\nbar just like this, you're going to pull yourself up and make sure that your biceps are engaged\nby making sure that your chin is not too close to the bar. If your chin is all the way up close to the\nbar, you're basically going to take a lot of the strain off your biceps and that's not\nwhat we're looking to do. Here, we're going to get ourselves away from\nthe bar so our elbows are about 90 degrees and then all you have to do is really squeeze\nas hard as you can as you fight the descent all the way down. It could take you 45 seconds, it could take\nyou a minute; it depends on how strong your biceps are and how much you have left in the\ntank. As soon as those are done you grab your tubing,\njust like this. Place it under your feet and now we're going\nto go and do our tubing burn out curls just like this, for as many as we can. All the way down and up, keep pumping them\nout until you can't get anymore, or your biceps pop; whichever happens first. All right, so as soon as I'm done there, now\nI've got to immediately grab my dumbbells and you shouldn't have much left here. You want to try to get however many reps you\ncan. One, down slow, two, and down slow, and three's\nnot happening. So I'm two reps in to my 10 rep failure. The next thing I have to do is shake them\nout for 10 seconds and then guess what? I’m headed back up here to the bar. Up, hold on, and I'm going the same thing. Lower myself down slowly. Fighting it and fighting it, squeezing my\nbiceps as hard as I can, even as my elbows extend. They're absolutely on fire. Grab the tubing, don't rest, go right into\nit right here, crank out as many as you can. All the way to failure. Pick up those dumbbells one more time. Three, four, and back up. This finisher probably won't take you more\nthan five minutes or so to get it done. The idea here is to finish your biceps the\nway you started it. If you start off your workout intensely then\nmake sure you finish it intensely. Guys, don’t leave anything on the table\nwhen it comes to training. Don’t leave the gym thinking you could have\ngiven a better effort because then you're going to wind up wishing you're getting better\nresults and waiting for that next workout. Get the best that you can out of everything\nyou do by giving your best every single time you do it. You could do that, guys, with the Athlean-X\ntraining system. Let me coach you through every single workout. Let me show you how to get it done and if\nyou're looking for a biceps and triceps intensive program on how to really get bigger arms,\nthen head to AthleanX.com and get our Ultimate Arms program. Of course, we don’t just stop at arms, we've\ngot leg training, whole level body training; everything involved in our program to make\nsure we create a complete athlete. They're all available over there. If you found this video helpful make sure\nyou leave your comments and thumbs up below, and of course we've got a lot of other finishers\nhere on this channel. Make sure you check those out, too. As far as this goes, consider these biceps\nfinished. I'll see you guys later."
}