{
    "id": "p2lOW0ndH00",
    "title": "The EASIEST Bodyweight Exercise (You CAN&#39;T Do!!)",
    "description": "Unlock all new muscle gains using just your bodyweight! http://athleanx.com/x/best-bodyweight-exercise-program Some people ...",
    "transcript": "What do you get when you mix one of the most\nfundamental bodyweight movements and requirements with time? You get the simplest bodyweight exercise that\nyou can do. Let's see if you can hang today. What's up guys, Jeff Cavaliere, ATHLEANX.COM Bodyweight exercises are done to develop the\nstrength necessary to control and manipulate our bodies in space. Now that doesn't always mean though that space\nrequires that we have our feet on the ground or our hands on the ground. In fact one of the most basic requirements\nof advanced bodyweight training is your ability to hold yourself up on a bar. All of our pull up exercises are going to\ndemand that you have a good solid foundation to be able to not only hang there but then\ndrive yourself up. However that basic movement can even be made\ndifficult. Matter of fact it's going to form the basis\nof this video. Because our simplest bodyweight exercise done\nfor a length of time is going to become one of the hardest ones that you can ever do. You know how I feel about challenges. At ATHLEANX we like to challenge you. Matter of fact we've put together challenges\nin all of our workout programs so that you can measure and objectively see where you\nstand. Not just today but then to use those results\nto push yourself and drive yourself to get even better. And you'll know where you stand against your\npeers. Well today is no exception. What we're going to do is have a Dead Bar\nHang test. Can you last up to two minutes and thirty\nseconds? Or even if you want to be more extreme, can\nyou last past three minutes? That said, I'm going to set the bar, no pun\nintended, by hanging from a bar and seeing how long I can last. And I want you guys to test yourself and put\nyour number and score in our comments down below. But before we do there's just a couple of\npoints I want to make sure that I cover with you. When you do the Dead Bar Hang you have to\nmake sure that you're, what we call, packing your shoulders. And all that means guys is not allowing them\nto be pulled, sort of that feeling of being pulled out of the socket. But actually being set back and down. So you pull your shoulder blades down and\nback. That has the sensation of actually they call\npacking in, tightening in the shoulders so that you add some stability to your joint. Secondly, if you have a torn labrum, right\na lot of guys out there do. Don't jump into this type of exercise. Because a labrum, when it's compromised loses\nthe suction ability inside of your shoulder that allows the humorous to actually come\nout a little bit. So we don't want you to be hanging from a\nbar when you don't have the necessary stability to do that. That being said, doing this in a progressive\nfashion, starting from a bench with one foot on the bench and actually allowing yourself to build up\nto full body weight is an excellent way to rehab that torn labrum. As long as you have those shoulders packed,\nyou have your grip on there, I prefer the overhand grip, right. we're going to make it universal for everybody. Then your only goal is to see if you can hang. So I'm going to take my shot here. Let's see how I do. So there you have it. Just over two minutes for me. Not my best effort ever but at least it's\na mark. Now what I want you guys to do is to take\na shot at it. And if you beat my mark or if you do something\neven more spectacular and get past the three minute mark, then post your video up on facebook\nguys. Go to facebood.com/athleanx, and put your\nvideo, upload it over there. We want to start seeing that. We want to comment on your ability to hang\nand how long you can do it. Now as you guys can understand from trying\nthis, this is a tremendous forearm builder. This is how you build functional forearm strength. Right, we've covered the fact that you can\ndo forearm work with a dumbbell, right just sitting on a bench, this doesn't become very functional, not when\nyou realize that advanced grip strength is really when you are holding your own body\nagainst gravity, ok. So either that or holding like a farmers carry,\nthe weight against gravity. It's a much more functional application. So this is a great way to test your true functional\nforearm strength. Beyond that as I mentioned earlier, this is\na tremendous shoulder stabilizer. You will build the stability inside the shoulder\nby having your shoulders demand that they be, again, in that packed position and fatigue\ndoesn't pull those shoulder blades apart. Because as you'll see as you get towards the\nend of the run here, your forearms will be burning. Your shoulders will start separating apart,\nshoulder blades will be apart and it will be tougher to hold. So, it's a great upper body shoulder girdle,\nentire test of strength, will and determination as well to see how much you've got. Alright guys if you haven't already, if you\nwant to subject yourself to challenges to see where you stand. Not just your grip strength but to be able\nto see where you stand in your overall abilities. Your muscle endurance, your strength, your\nspeed, your stamina. Then it's time to come on Team Athlean guys. We've got challenges each and every week. Where you see where you stand and again you\nobjectively get to see where you measure against all the other guys on Team Athlean. So head to ATHLEANX.COM, grab our 90 day training\nprogram. In the meantime, make sure you let me know\nhow well you've done, below and if it's that good, I want to see it over on facebook, facebook.com/athleanx. I'll see you guys back here in just a few\ndays."
}