{
    "id": "P5GFbW042c0",
    "title": "Fat Burning “Bro-Science” (SWEAT MORE | BURN MORE!)",
    "description": "Have you ever wondered if sweating more during your workouts burns more fat. In this video, I'm going to explain whether trying to ...",
    "transcript": "JEFF: Jesse! What the f**k are you doing now? And what are you wearing?! JESSE: I’m getting ready for summer, bro! I’m wearing a suit. Everybody knows when you’re wearing a suit\nduring your workout you sweat more, and that means you burn more fat. JEFF: Not a suit. Maybe a sweat suit, or a rubber suit. And you believe all that stuff? JESSE: Well, I mean, seeing is believing,\nbro. This 8-pack is going to be better than your\n6-pack by the time the summer comes around. All right, get back to work, chief! Woo! JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Jesse, you look great, my friend. JESSE: Thank you. JEFF: So why is Jesse wearing the suit? There are actually two reasons why Jesse is\nwearing the suit. One of which he’s aware of, and one of which\nhe is not. The fact is, we posted Jesse – this is his\nEaster outfit. Is that what you call it? JESSE: This is my Easter outfit. JEFF: His Easter outfit. He wore this for Easter. He thought it was cute. I kind of got a hold of the picture. We put it up on Instagram. I said “Look, you want to see if you can\nget away with that? That’s fine, but if our followers on Instagram\nlike this photo more than 30,000 times you’re going to wear this in the next video that\nwe do. JESSE: Yeah. JEFF: And they, of course, blew that away. If you guys aren’t over there already it’s\n@ATHLEANX on Instagram. You can take part in fun things like this\nand make Jesse look stupid…I mean good. JESSE: Come on, man! JEFF: The fact is, there’s a second reason\nwhy he’s here. The second reason is, he’s going to help\nus dispel a myth today because Jesse here believes that he’s wearing a suit – some\nkind of a suit – if he starts sweating he’s going to burn more fat and be ready for summer. We’re going to put that to the test, my\nfriend. JESSE: We are? JEFF: Yeah. JESSE: How? JEFF: You’re going to do a workout. JESSE: I’m going to do a workout? JEFF: Yeah. JESSE: In the suit? JEFF: In the suit. That one, right there. JESSE: That? On the board? JEFF: On the board. JESSE: There’s burpees. JEFF: There’s burpees. There’s jump rope. JESSE: Yeah, there’s just – burpees in\na suit? JEFF: Yeah. Box jumps, too. Don’t tear that, by the way. I like that suit. Be careful when you’re going down. JESSE: You are so- JEFF: Why don’t you do me a favor? You go back there, you start what we’re\ntalking about, and I’ll explain the myth itself. Does fat loss equate to sweating? Do you have to sweat in order to have any\nimpact on your fat loss? Guys, it starts by defining – get to work. Will you get to work? It starts by defining the difference between\nweight loss and fat loss. See, fat loss is what we’re really after. If you’re looking to get ripped for the\nsummer and you want your abs to show you’ve got to get rid of as much body fat as you\npossibly can. Weight loss, however, can come very easily\nin the form of simply water, that’s going to be replaced very quickly by the time you’re\ndone with your workout, just by rehydrating. By the way, before you think you can outsmart\nyour body, your body knows what’s going on. It needs the fluids. It needs to maintain blood volume. It’s going to stimulate your thirst to make\nyou want to go and drink more to replace the fluids. The fact is, you’re never going to outsmart\nyour body that way. What you really want to focus on is your caloric\nexpenditure. Can you create as much caloric expenditure\nas possible so at the end of the day you have a net caloric deficit that’s going to allow\nyou to start dropping body fat when you do this consistently? Workout, after workout, after workout, after\nworkout. Like my man here is doing. This is one. How you doing? Good. So now what we need to do is make sure when\nwe’re going for our caloric expenditure that we’re choosing exercises that allow\nus to do that. The tough ones. The ones that make us really work hard. Yes, while you’re doing these things you\nmay find that you sweat more. But what is actually happening? Sweat is simply a reaction by your body to\ntry and help you maintain your core temperature. Meaning, as you start to increase your elevated\ncore temperature over 98.6 your body starts to release some of the fluid on the surface\nlevel here, it evaporates, and it helps you cool back down. That’s all it’s doing. It’s not a requirement for fat loss. It’s not integrated in the same process\nas fat loss. It’s just a thing that happens, potentially\nat the same time. So, let me give you another illustration here. Jesse can maybe go sit in a sauna for 30 minutes\nand sweat. We know he’s going to sweat a lot. I, on the other hand, who doesn’t happen\nto sweat very much, can go back here and do the same, exact workout in the frozen tundra\nand maybe not sweat at all. Who do you think is working more? That’s what I thought. Who do you think is working more? Obviously, I’m doing more. I’m burning more calories. Ultimately, those calories are going to help\nme be in a hypercaloric state that will let me burn fat much more effectively than this\njack ass just sitting in a sauna and sweating for a period of time. So, you see, if you really want to start burning\nfat, guys, you not only have to be consistent with what you do, but you need to really start\nusing exercises that put you at a high caloric expenditure. Now, I’ll leave you with this one thought. Just because the harder exercises are likely\nto have a higher caloric expenditure, therefore increase the amount of muscles that are working\nto do the job you’re trying to do, therefore have a higher likelihood of increasing your\ncore body temperature, which therefore leads to a sweat; it doesn’t guarantee that’s\ngoing to happen in every case, guys. As a matter of fact, if you’re dehydrated\nthe fact that you’re dehydrated is going to make your body much more resilient to offering\nup more water to help bring your core temperature back down again. In that case, the overall effectiveness of\nyour workout is actually going to suffer. Your performance is going to go down because\nyou’re dehydrated. So, chasing the sweat is not always a good\nidea. As a matter of fact, as I’ve said in the\nbeginning here, it’s not related to your overall ability to burn fat. Keep those ideas separate. Guys – Jesse, why don’t you come back. Jesse. Jesse. JESSE: I’m here, bro. JEFF: What’s – what the hell? JESSE: I was listening to what you were saying,\nand it makes a lot of sense. So, I figured I’d change up. JEFF: That says ‘Thighway to the Danger\nZone’. JESSE: Yeah, dude. Yeah. Skies out, thighs out. JEFF: Guys, hopefully we’ve dispelled this\nmyth. I don’t know what I’m going to do about\nthis guy. The fact of the matter is, if you’re looking\nfor us to cover more of these things leave your comments and thumbs up below. I’ll do my best to do that for you. In the meantime, if you’re looking for a\nscience-based training program – don’t listen to him – science-based training program,\nhead to ATHLEANX.com and get one of our programs. All right, guys. I’ll see you soon. I’m out of here. JESSE: Come on, man!"
}