{
    "id": "PA3cFLjSNus",
    "title": "4 Lat Pulldown ALTERNATIVES You Must Try!!",
    "description": "The lat pulldown is one of the most classic lats and back building exercises performed in back workouts. That said, there are some ...",
    "transcript": "JEFF: Am I good here? JESSE: A little bit to the right. JEFF: My right? Here? JESSE: Yeah, your right. JEFF: Okay. JESSE: A little bit more. JEFF: Yeah. JESSE: Okay, now get your right hand up. JEFF: What do you mean? Why? JESSE: Just – just put it up. JEFF: Okay. JESSE: Like that. Yep. A little to your left. Now look to the right. JEFF: Oh, you f**k. What's up, guys? Jeff Cavaliere, ATHLEANX.com. God, it was so nice when he wasn’t here. He can stay in Italy next time, as far as\nI’m concerned. JESSE: Come on! They all missed me! JEFF: Nobody missed you, Jesse. Get out of here! But today I will tell you this. I’m going to show you a few things that\nyou’re never going to see – including that, right there. But I’m going to show you some lat pulldown\nvariations that you probably haven’t done before. You know, this lat pulldown machine is more\nversatile than you think. It actually helps work a lot more of the key\nmuscles than you’re maybe giving it credit for. I put a whole video out last week on some\nof the ways you can utilize it to progress the contraction in the lats. But it doesn’t have to end there. We can do a lot of cool things and I’m going\nto show you those variations starting now. Did you ever think, first of all, about disconnecting\nthe bar and putting the rope on here? You probably did, and you probably did some\nkind of close grip variation of a pulldown, but you can turn this into one of my favorite\nexercises of all time. That is the face pulldown. You guys know how much I like the face pull. I tell you to do it after your workout. Every time you train you should do the face\npull. But here, the face pulldown allows me to anchor\nmy body, get a little more stability from below, add a little heavier weight to the\nequation here, and we can take the face pull in a different plane. We’re not taking it horizontal, we’re\ntaking it on a more vertical plane. You can clearly see the benefits here. It still hits the rotator cuff as you externally\nrotate on the way back. It still hits the posterior deltoid. It still hits the upper traps. It still hits the missed scapular muscles. It’s hitting all the muscles that we’re\nbenefiting from in the face pull, but with more stability from below, and it gives us\na great option. Number two: we’ll stick with the rope. You guys also know how much I love the straight\narm pushdown. I program it all the time. I say how much it actually carries over, even\nas an accessory lift to the deadlift. What we can do in this pulldown position is\nutilize the rope, so we gain some extra travel. So, I don’t hit a bottm position with the\nstraight bar here. I can keep going until I get my elbow almost\ndirectly against my side, in a fully adducted position to activate the lats. We’ve taken the benefit of the straight\narm pushdown, added some stability from below, and given us that nice, controlled stretch\non the lats on the way up, to give us another weapon, and another way to use the lat pulldown\nmachine. Now we get rid of these guys. Jesse, can you hold these for me, please? Can you come reach for these? Can you cup them from the bottom? JESSE: Just like that? JEFF: Good job. Nicely done. All right. Now what we do is put the bar up. Now, with the bar we have some other options\nhere as well. We don’t always have to do the straight\nversions of the lat pulldown, or the underhand version. All the things I’ve showed you before. The variety of training can go back to something\ndifferent. That is the concept of straight arm scapular\nstrength. I’ve talked about how important this is\nin so many elements of athletic training. Once again, we can do this here. I featured this on Instagram. If you aren’t following me already, you\nshould. As a matter of fact, I had my longtime fitness\nidol, Sylvester Stallone, who actually follows and comments on our stuff because he finds\nit helpful. I really think that the stuff I post over\nthere is going to be helpful to you as well. This is one of them. This is a straight arm scapular pulldown. So, what we do is get our elbows out in front\nof our body, we do a traditional pulldown, but when we get to the bottom, instead of\njust riding it back up, here’s where you test your straight arm scapular strength. Try to extend your arms out in front of you. Immediately, because the moment arm is increasing,\nthat weight feels a hell of a lot heavier. And your ability to hold it there, parallel\nto the ground – it’s going to want to travel up. You want to see if you can hold it out there. Hold it for two or three seconds, bring it\nback in, and then let it ride up. Some people say “Jeff, this is kind of like\nthat headbanger pullup that you did.” It is. And, once again, it’s a variation to build\nscapular strength because of how important this quality is. It sets the foundation. It builds the foundational strength of the\nscapula that feeds into the shoulder. It all starts back here first. There’s a foundation on it. If you can’t do this, you’ve got to make\nsure you’re building this strength. The great thing about this exercise is, we\ncan scale it because we can go up the stack. You don’t have to be able to handle your\nbodyweight in full, as you do on the headbanger pullup. Last, but not least, we saved the little on\nfor last. That is the scap pulldown. Again, this one might get you some stares\nin the gym, but if they knew a little better they wouldn’t be. The scapular strength, once again, is one\nof the key components that you need to develop. More importantly, have you ever addressed\nthe muscles of the mid-traps and the lower traps? If you’re following ATHLEANX, you certainly\nhave because you realize the importance they play in keeping a sound, safe, stable shoulder. But a lot of guys don’t. This scap pulldown gives you that opportunity. What you do is keep your arms locked out straight. The goal here is to let your shoulders start\nin a nice, shrugged up position, up against your ears, as high as you can. Then your goal is to try and create as much\nroom and distance between your shoulders and your ears by pulling straight down with your\nshoulder blades, depressing your shoulder blades. The number one job here of the mid and lower\ntraps to help you accomplish that. This exercise done for quality reps is what’s\nkey. I don’t care how many you can do. I don’t care how fast you can do them. The key – and I don’t care how much weight\nyou can do. The key is racking up good, quality reps,\none after the next to get another option here other than the traditional pulldown that will\nhelp your long-term development of your entire shoulder and back. Not just your lats. So, there you have it, guys. There are four new ways that you can take\nthe once, one-dimensional lat pulldown machine and start tapping into the untapped potential\ndevelopment of your back. Guys, if you’re looking for a complete training\nprogram, step by step the ATHLEANX training program puts the science back in strength. They’re all available for you over at ATHLEANX.com. In the meantime, if you haven’t already\nsubscribed, please do so and turn on those notifications so you never miss a video. All right, guys. I’ll be back here again soon. In the meantime, I’ve got to go take a call\nhere. It’s from the Italian embassy. I have a deal I’m negotiating here. I have a deal to try and get Jesse out of\nhere for good. All I’m asking for is a little bit of homemade\npasta. That’s it. That’s it. JESSE: A little bit? How much is a little bit, Jeff?! JEFF: Just 30lbs. JESSE: 30lbs of pasta? JEFF: You’re worth it. Believe me, you’re worth it. You’re worth it all. JESSE: I think I’m worth more than that. JEFF: All right, guys. I’ll see you soon."
}