{
    "id": "PcThnQTTDAo",
    "title": "How to Increase Your Bench Press (FASTEST WAY!)",
    "description": "The bench press is one of the most popular chest and strength exercises performed. While many would like to continue to ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going to talk about the bench-press.\nWe're going to talk, again, about how to increase the bench-press by, guess what? Not actually\ndoing the bench-press. Not just doing the standard, traditional bench-press. You see, a while back – actually, a year\nago – K C Mitchell, that one-legged monster, came into this gym and shared something with\nme that was very interesting. Things that we've known about here, at ATHLEANX for quite\nsome time. That is that his biggest gains on the bench-press\ncame from, not necessarily doing bench-press, but by doing accessory movements that would\nhelp him to perform the bench-press better. As a matter of fact, he shared that time – as\nyou can see in this video – that he performed these accessory movements more often in a\ngiven training block, than he did the bench-press itself. There's good reason why these work.\nThey allow us to work through our weak points to get better at the overall standard performance\nof the lift. Now, we had KC come back again, and this time\nI put a video out a couple of weeks ago about some main points, and some main tips that\nyou can apply to the bench-press. However, he brought back some additional accessory\nmovements. I wanted to cover those with you because I\nthink sharing these, and why we do these, and why KC did them as well, is going to help\nyou in your lifts. Let's go through those one by one. First up is a bench-press, but\nwith a variation. That is the pause-bench. We've talked a lot about the benefits of pause-squats. In this case, the pause-bench is also providing\nits own. Namely, the time that you have to overcome a non-moving object. Overcome the\nforce of inertia to get that object moving again. It's going to require a lot of strength to\nperform it. That's one of the main benefits you're going to see KC talk about here, but\nin addition to that, we're also talking about going back to that video I mentioned, the\nimportance of leg drive. When you have that weight sitting on your\nchest, waiting to be lifted off, you'll find that if you struggle with leg drive you're\ngoing to instantly see how easy it is to recruit everything in your body to get that weight\noff you, if you incorporate pause-bench. Now I want to show you how KC does it, and\nI want him to be able to share with you some of the finer points that he's thinking about\nas he performs it. KC: So, pausing. Everything's the same, you\nguys. Everything's the same. You get yourself setup the same. You're setup. One, two, three.\nAnd then you come down. Then it's up to you on how long you want to hold the weight. Some\nguys do three second pauses, some guys do five, some guys do seven. Honestly, after\nseven I feel like you've kind of- JEFF: Exactly. KC: You're exhausted. Then, the one thing\nI was telling Jeff earlier that I've realized is, when I was doing bench-pauses like this,\nI realize that what happens is, my brain is like – right now, this weight is just sitting\nhere for a long period of time. And it's obviously fatiguing my chest fatiguing my triceps. So, to get it to move the way I'm wanting\nit to move, as you can see, leg drive is starting to move me. I'm going to engage this leg drive\nreally, really hard. Just like that. Do it again. Five, four, three, two, one. Like that.\nAgain, you can see the legs are really coming into play. Even more so than when I was just\nteaching leg drive. Just because I feel like that weight is just\nsitting on me and the muscles are getting tired. JEFF: Yeah. KC: So, the legs aren't getting fatigued sitting\nthere. JEFF: When it comes to – we know that acceleration\nof the bar is going to be a great tool for incorporating and recruiting more muscle fibers\nin that, too. KC: Absolutely. JEFF: So, the thing about that is, when you're\nin that pause, you're going to have to recruit a lot of power and force to be able to get\nout of that hole. But you're not necessarily taking advantage of a stretch reflex. KC: Right. JEFF: Right? Which is going to give us that\nopportunity to do that and accelerate the bar. This is done from that dead stop. So,\nbecause of the fact that it's done as a reaction to that intimidation of the bar resting on\nyour chest- KC: Right. Absolutely. JEFF: To get it off, it almost does it automatically. KC: It's the intimidation of that weight sitting\non you. JEFF: All right, the second exercise for your\nbench-press is going to be the dumbbell floor press. Now, it should look similar to something\nKC and I covered in that previous video, which you can see here, which was the barbell version\nof the floor press. It does provide us with an opportunity to\nwork that lockout portion of the bench-press to help with a weak point if triceps are impeding\nyou from getting into a good, full, strong bench-press. But I'll tell you this: it has\nsome additional benefits when we employ the dumbbells here. Number one: it's a little\nbit easier to perform in a gym. The setup here is going to be much easier\nto grab some dumbbells and get in position, than it would be to do it in a rack, like\nKC was doing. Beyond that, we have a couple of other things. We know that the adduction\nbenefits of the dumbbell bench-press is always going to be higher than it is with a barbell. A barbell is going to require a fixed hand\nplacement on a single bar, whereas a dumbbell is allowing us to approach more adduction,\nmore activation of the chest as we bring those dumbbells up to the top. Additionally, we\nhave a good safety net. Whether we're using the barbell or a dumbbell,\nthe safety net provided to us of the floor to decrease the risk of any kind of AC joint\ninjury that we could get from a bench-press that goes too low, or uncontrolled. Finally,\nwe do need to know how to get these dumbbells into position. That's something that KC went\non to show. Again, the ease of doing this. Something that\nJesse struggles with mightily, as you'll see, and of course, he's going to tell you how\nthe benefit of getting those elbows into the right position because the floor press demands\nthat to make sure the elbows are supporting the wrists. So, I wanted to share those two tips with\nyou here, so you can hear how he feels, or how he thinks about this as he performs it.\nSo, let's show them how you do it. Some people don’t even know how to get in. KC: Right. So, basically- JEFF: Like Jesse. Jesse? JESSE: Hey. Come on, now. KC: I asked Jesse to get these weights for\nme and he just couldn't do it for me. JEFF: So, show us. KC: Basically, I get the dumbbells, I put\nthem right here by my quads, set them up, and basically just grab one. Go here, right\nup high on my hip. Grab the other one, set it up high on my hip. Then all I do is get\nmyself ready. I get myself tight because once I go back,\nI'm there. I'm in position. So, I get my lats nice and tight, I roll back with it, and I\ntwist and set up. It's very simple. JEFF: Right. KC: It moves right into motion, once you setup.\nOnce you're here, just press up, just like a bench-press. Then down. Right here is basically\nwhere you want to get. If you watch, it's right where the cut of your triceps hit. JEFF: I find that the floor press barbell\nor dumbbell, it grooves the proper positioning. KC: Absolutely. JEFF: Because your elbows stay tucked more\nnaturally than it does any other way. KC: Absolutely. Yep. JEFF: Just to support the weights. That's\nawesome. KC: Let me tell you, it's a lot harder than\nthe barbell. JEFF: Yeah. KC: For sure. JEFF: So, the loads down here are comparatively\n– you're a lot lighter. KC: A lot lighter. Yeah. I can do 300 plus\non the floor press barbell here. I can maybe get up to about 120, 130 each arm. Significantly\nlower. Again, it's the whole control, and everything like that as well. JEFF: Our third, and final accessory lift\nhere for the bench-press is the incline static dumbbell press. This is something that KC\nshowed me and introduced to me, and you can see we did it here together. Synchronized,\ninclined, dumbbell static presses. It's a new sport in the Olympics. But I'll\nlose if they judge based on the amount of weight lifted, if I have to compete against\nKC all the time. The fact is, here's what it does provide. You're going to hear him\nand watch him perform it. Strength isn't just necessarily about having\nmore concentric strength. Having eccentric control of a weight and increasing your ability\nto control a weight eccentrically is an important part of overall strength development. Isometric strength and being able to control\na weight isometrically is another part of building the overall strength profile. This\nexercise combines elements of isometric strength and concentric strength, and also demands\nthe performance of your concentric strength in a fatigued state. So, I want you to see how it plays out in\naction here. Again, listen to KC as he describes how it feels and what his mind is thinking\nas he's going through this. KC: So I started incorporating these as the\nheavy lifts that I do, and accessories that I do. I feel like I just humped out quite\na bit. JEFF: Yep. KC: It's very hard to do. Again, the strength\nis – you'll see what I'm talking about here when I do them. JEFF: You've got 100s here, right? KC: We've got 100s. Let's see how they go. JEFF: All right. And Jesse got these for you\nagain? All right, here we go. KC: What I do is, I like to go up for one,\nand then what I do is, I come right here, and I hold one here while the chest is still\nengaged. It's not here, guys. It's not here. It's just here. Then this one, I'm moving. Then come down,\nhold. JEFF: Which is crazy. Guys, do you know how\ndifficult this is? KC: Then I come down. JEFF: Yeah. The pecs are constantly being\nchallenged here. Even in that bottom position. You could have paused at the top. KC: Yes. JEFF: When you pause at the top you're literally\n– it's not even the same- KC: The muscle's not engaged. JEFF: Not like it is when it's all the way\nat the bottom. KC: Not like it is when I'm holding it right\nthere. So when I first did that, I was like – that was obviously one of the first things\nI did. I was like, \"Oh, I'm just going to hold it here.\" JEFF: Right. KC: Then when he had me bring it down and\nI was squeezing – because when you're here, to hold this weight here you've got to squeeze\nthat. JEFF: Right. KC: That pec. JEFF: Yeah. KC: You've got to. So, it's engaged. Now,\nif it's here, I don’t have – my shoulder, all this will work it out. There's nothing- JEFF: We talk about that a lot of times. When\ngravity is basically acting straight through that. KC: Absolutely. The same here. This isn't\nengaged. The chest is no longer – now, if I'm here holding the weight, you can see the\nchest is actually getting engaged. So, it's challenging. JEFF: It's interesting that everybody wants\nto pick a school and stick with one school of thought. So, if you're a power lifter,\nbody building is not something you can dip into. I've never been that type. Especially when you're training an athlete.\nYou need to have a lot of different tools. KC: Right. JEFF: It's interesting that you're of that\nsame mindset. KC: Yeah. JEFF: You can take from different areas and\nthings that you know are going to work. And for you, this has helped you. Even with control,\nI'm sure this carries over to that pause-bench as well. KC: Absolutely. There's a lot of control in\nthat right there, if you didn't notice. That carries over. Period. Anytime you can build\nsome control, it's going to carry over into the bench-press. Absolutely. JEFF: So, there you have, guys. There are\nthree accessory lifts here to increase your main lift. Your bench-press. Remember, the importance of accessory lifts\nin that pursuit of a bigger bench can never be understated. If you want to increase the weight that you're\nlifting on your bench-press, you're going to have to, at some point, start to address\nthe other lifts that help you, not just work on those weak points, but realize the true\nstrength you have by working through the bench-press, into its components. Breaking it down into its individual lifts\nthat target better portions of that lift individually, to allow you to thrive at every single point\nin that lift. That is what an accessory lift will do for you. If you're looking for programs where we never\noverlook the value of those accessory lifts as they relate to the bigger picture, and\nwhen it comes to building strength, realizing that we want to build true strength from the\nground up throughout our entire body, so when we get into those bigger lifts we're strong,\nconfident, and not going to breakdown. You can find them all in our ATHLEANX programs.\nIf you've found the video helpful, make sure to leave your comments and thumbs up below.\nLet us know what else you want me to cover and I'll do my best to do that for you. If you haven't already done so, please click\n'subscribe', and turn on your notifications so you never miss a video when we put one\nout. All right, guys. See you soon."
}