{
    "id": "ps4snz1XjPU",
    "title": "Jinder Mahal &amp; Drew McIntyre (BACK WORKOUT!)",
    "description": "WWE wrestlers Jinder Mahal and Drew McIntyre joined me in the gym recently for a light back workout prior to wrestling later in ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Looking damn small today. In between two behemoths here. Jinder Mahal and Drew McIntire, WWE Superstars. Guys – Jinder’s been here before. JINDER: Yeah. JEFF: But today, we’re going to get after\nit a little bit more. JINDER: Yep. JEFF: A little more of a back workout. Take them both through it. I’m going to try to give you guys some tips\nalong the way. Even some of the more familiar exercises,\nI think guys sometimes screw them up. JINDER: Yeah, definitely. JEFF: I think there’s always more to be\nhad and you can squeeze that lemon a little bit more and get a little more out of every\nexercise. I’m hopefully going to do that with you\nguys today, and those guys watching. JINDER: Absolutely. And I hear – when it comes to weight – sometimes\nless is more. JEFF: Well, we’re going to- JINDER: That’s just my excuse. JEFF: The thing is, honestly, these guys are\n– there’s nobody that has a harder schedule than these athletes right here. As a guy who worked in Major League Baseball\nI can tell you it’s a pretty grueling schedule. 162 games in about 180 days and I didn’t\nplay. All I did was work it and it was hard for\nme. But you guys are on the road – how many\ndays? 200 and something? JINDER: Yeah. 200. Year-round. No off season. JEFF: There’s no off season. So honestly, sometimes what you do in this\nweight room does have to become a consideration. You can’t just come in here and try to set\nPRs every time you’re in the weight room thinking you’re going to be able to go out\nand perform. You’ll be able to figure out a way to make\nsome bulk. JINDER: More technique, yeah. JEFF: So, dropping down the weight and getting\na little more out of what you do is going to go a long way for you guys. JINDER: Exactly. JEFF: So, let’s go knock this one out. You need to be able to get it far enough over\nto be able to work the back. So, you guys are both tall. So that means your hips are going to have\nto go back. The taller you are, the more you’ve got\nto sit. I don’t have to sit nearly as far back. I could be right here, and I’m already bent\nover. JINDER: Yeah. JEFF: You’ve got a lot more torso that’s\ngot to get out of the way. So you’re leaning over. So you’re lifting this up. JINDER: A lot of these [inaudible 0:01:52],\nright? JEFF: Yeah. One of the things about this exercise that’s\nkind of cool; if you were to do it in a drop set, just go through failure, all you have\nto change is the angle of your body. So, if I want to be here, I could be straight\nover, and this way here. Like that. Now I’m pulling the weight straight up against\ngravity. Which could be the hardest. So, let’s say I get to the point where I’m\nfatigued, but I want to do a little bit more. I just come a little more upright. So now as I’m pulling in, I’m not really\ngoing straight against gravity anymore. I’m coming more at that angle. JINDER: Yeah. JEFF: So, I cut a little bit of that out. Drew actually had a little bit more of a movement\nwhere he comes a little more in. Try, Drew, when you do this one, sit – you\neven have a longer torso than Jinder. So, sit way back. So, if you can, the bar is almost like a deadlift\nright up against your shins. Now just stand up a little bit more. Stand. Drop the hips a little bit. Then give me four more. Go back, yeah. Now pull from the same – there you go. See? when you cut the angle you can still keep\ngoing. DREW: Yeah. JEFF: So, it’s a good way to drop set and\njust push through. DREW: Yep. JINDER: Is there anything to do while you\ngo-? JEFF: Go wide? JINDER: Yeah. JEFF: The more travel you’re going to have\nis when you have your arms narrower. JINDER: Yep. JEFF: Because they’re going to be longer. If you do this, it’s almost like doing it\nlike that snatch grip. JINDER: Yep. JEFF: Deadlifts. Your arms are shorter, so you can’t get\nas much pull. All right. So, the big thing here; don’t turn it into\na tricep exercise. For you – and just feel how your shoulder\nfeels because that’s key here. You want to flare the elbows. So, make that flare, get this back, and now\nyou’re pulling here. So, you move from there, to there. Do you feel it? JINDER: Yep. JEFF: So, it’s out, and you’re just shortening\nthis from here, to there. JINDER: So, I don’t need to go too, too\nlow? JEFF: No. You could – if you go low, it’s because\n– open your chest up. Get to the bottom. Again, your shoulder, I always have – and\nI told you this – but you open the chest up, that drops it. This is your lat. This is as far as your lats are going. JINDER: Yeah. JEFF: If you keep going lower, that’s just\nbecause you’re bending your elbows more. JINDER: Yep. JEFF: But that’s as far as your lats are\ngoing. Get a little – get your elbows a little\nstraighter. A little bit like that. There you go. But that’s it. And you keep the tension on by stopping them\nabout here. There we go. To there. If I let you come all the way up – come\nall the way to the top. JINDER: Yeah, that takes it off. JEFF: There’s no tension there anymore. So, if you want to do it, you get it from\nhere. Down, big stretch, to there. Out, and down. Try to not let those elbows extend at all. Then the more you drop your hips down here,\nthe more of a stretch on the ribcage because the lats actually attach down to the pelvis\nhere, and they attach here at the arm. So, if my hips are dropped and my arm is back\nhere, that’s as long as they can be. So, you get all that tension on your lats\non every rep. Now go. Feel? You’ve run out of room. DREW: Yep. JEFF: You’ve just stretched that out even\nmore. See, these are long? But the elbows aren’t – the triceps aren’t\npulling this. It’s all lats. The straight arm pullover. He stops it at the right angle, hips are dropped\ndown. JINDER: His arm position doesn’t change. JEFF: No. It’s all right there. Feel it? The biggest difference is that you – then\nthere’s no extra stretch or separation from the pelvis to there. DREW: Now I feel it is [inaudible 0:05:28]? JEFF: You feel it a little more? DREW: Yeah, I just feel like a dumbass. Now that I’m doing it this way, [inaudible\n0:05:31]. JEFF: It depends on what you’re really trying\nto train. If you’re trying to get more lats you’ve\ngot to stay upright more. JINDER: Yeah. JEFF: If you’re trying to get a little more\nof the midback with the row, then you just recline back. The key is, the chest should go out every\ntime you pull back. That’s the main key. As you pull back, the chest – force it the\nother direction. Now, as you come down, open this. Spread it. You feel that? JINDER: Yeah. JEFF: You should come up as your arms are\ngoing back. There you go. Yeah. So, as you go down, spread it open. Stick the chest out, up toward the sky. It’s like opposite direction. There you go. Opposite directions. You’re coming down, chest is going up. This level of focused work? JINDER: Yeah. JEFF: It makes a lighter weight heavier. Your body really, truly doesn’t know what\nthat weight is. It never does. It just- DREW: I didn’t even look. It feels the same. JEFF: Yeah. I can guarantee you, it’s less. So, you get in here, this way. Then you just lean, and then you pull straight\ndown. So, you’re going almost – it’s almost\nlike a pulldown, but you’re going right in at that angle. So, the cool thing about that is, as I was\nasking about your shoulder, you’re actually getting an overhead movement here without\nhaving to have your arms overhead. JINDER: Yeah. JEFF: So, if you ever get in the position\nwhere it hurts to get your arms up overhead, just because they’re sore from whatever,\nyou just change your body position in space, as opposed to your arms. Then you’re able to do the same movement. JINDER: Yeah. JEFF: Relative to your body, it’s in line\nwith your torso, which is what happened over there. It’s not having to have your arm get up\nthere because you’re not where your body is this way. Honestly, at the bottom of it, even though\nyou’re going straight up and down like a pulldown, you look at the position of your\nelbows, they’re back behind it. It’s a row. So that’s another way to do a row. JINDER: That’s a good one. I like it. JEFF: That’s cool, right? JINDER: Yeah, it is. JEFF: And it’s hard for me. I don’t know how much the load is, but if\nyou have the load right it gets tough. So, go straight down. Elbows down toward your side. Yep. Give them a little bit more flare. Out, as you come down. Yeah. You feel that? Okay, then when you… Go high. Use this right here. Stride out, pull back, and squeeze. Pull it nice, and tight. JINDER: Can I twist my body a little bit. JEFF: Yeah. So, this right here, you get the stretch,\nright? JINDER: Yep. JEFF: So, then you drop down. You should feel a good squeeze in there. You can go lighter and when you use some of\nthese – yeah. I think – you actually squeeze it and you\nfeel it. It makes the weight more effectively heavier. Do you know what I mean? JINDER: Yep. JEFF: Even though it’s not heavier than\nwhat you were using, it becomes effectively more heavier. JINDER: Yeah, less taxing on the joints. JEFF: Yeah, definitely lighter on the joints. I actually think this is one of my favorite\nback exercises of all of them. Just to go out here because you literally\nget the full stretch on your lat. You arm is coming out in front and up. Which is really how you stretch the lat out. Get it all the way there. Then you get this hip set all the way back. So, you have that big, long stretch. Especially if you’re going to drop the weight\na little bit, the range of motion should be as long as you can possibly make it so there’s\ntension across the whole muscle. It’s good that you’ve got a rotation because\nyour body wants to rotate. JINDER: Yeah? JEFF: But if you over rotate what happens\nis – because you want the arm behind the body. So, let’s say – you weren’t doing this,\nbut a couple times you came close. JINDER: Yeah. JEFF: You were doing it, and then you just\nkeep rotating- JINDER: Yeah. JEFF: It doesn’t really change and get back\nbehind the body. So, as long as you get back behind, if you\nwere to rotate then, that’s okay. But if you do it this way and you stop, and\nthen you rotate, you think it’s going back, but in relation to here, it’s still at the\nside. As opposed to behind it. So, you just – all you think about is hands\nand knees. Where are the hands in relation to the knees? If the hands are below the knees, it’s pushing\nthrough the legs. Once you get to the level of the knees everything\ncomes forward. So, if I’m here, you’re still getting\nthat tight position here, and here. Like that, I push through. Through. But then from here, push, drive through at\nthat point. Then back, you actually reverse it, then it\ngoes – when you’re at the top – hip, hip, hip, hip, hip, hip. It’s a hip hinge, all the way to the knee. Then once it hits the knee, straight knee\nback. So, you’ll see once you do that, the bar\nshould stay right up against your body the whole time. So, let’s try it. If his knees are there, boom, and when he\ndrives his hips through, meeting the bar on the way up. For me, it simplifies the cues. In terms of “when do I?” “How much hips, how much knee?” Let the bar tell you when you need to go because\nonce the bar is at the knees, then it’s good. The cool thing is, your knee height is different\nthan my knee height, but it works the same for both of us. You should be able to look down and not be\nable to see the ties of your laces because the bar should be- JINDER: Yeah. JEFF: The bar should be covering it. So, you can even be a little bit closer. Yeah, right there. Even though your knees are coming out in front,\nthe bar is still an inch or so away from your shin. Which is good. JINDER: So, I’ve just got to-? JEFF: Yeah, you’ll get your hips back, and\ndown. Yep. Then that will be visible, but obviously you\nhaven’t changed the relationship between your shins. So, try that. This is almost impossible to move it when\nyou start to get significant weight. Move it off the ground and break it from the\nground, if it’s not in position over the middle of your foot. JINDER: Yeah. JEFF: Otherwise you won’t have the leverage\nto pull. So, I try to do the liftoff on the bench-press. You can’t get it off and behind you, you\nknow? JINDER: Yeah. JEFF: That’s the same thing with this. So, there you have it, guys. A workout there with these two guys, again. I don’t feel that big, but I’m comfortable\nin my own skin. I realize that not everybody is supposed to\nbe 6’5”, 6’6” and be a giant. But the fact is, guys, everybody can be equalized\nby the weights. We can all be humbled by what we do in the\nweight room. I think if we’re doing it right, we will\nbe. I think nobody should be in here trying to\nthink they’re better than the weights, or that there’s something they can’t learn. JINDER: Yeah. JEFF: I’m learning every, single day. Every athlete that I work with, we’re all\nlearning and hopefully getting better. JINDER: Yeah, absolutely. It’s good to get down to the basics and\nbuild that solid foundation. You showed us some great things. Like the technique- [crosstalk] JEFF: Like with Sheamus. DREW: I dropped those weights and it felt\nway better. JINDER: With the deadlift and everything. That’s an awesome technique. And thank you for keeping your shirt on, by\nthe way. JEFF: Honestly, it would be the only weapon\nI have if I took it off. All right, guys. There you have it. If you’re looking for a complete, step by\nstep program; our ATHLEANX program is what that is. We actually take everything that we do with\nour athletes, and we put it out there for you guys. It’s available over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do that for you guys int eh days and weeks ahead. All right, see you soon."
}