{
    "id": "PSROJpBIZ4w",
    "title": "5 Red Flags for Weak Abs (FIX THIS!)",
    "description": "It doesn't matter whether you have visible abs or not, the strength of your core is not something that can be assessed by how they ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re talking about weak abs and it’s\nsomething you do not want because if you have weak abs, they’re going to wreak havoc on\nalmost every element of your training. So today I want to help you identify five\nthings – we call them “Red Flags” – five things that will help you to find out right\naway where you’ve got a weakness, and more importantly, what you can do to fix it. We’re going to knock them off one by one. Let’s get going. The first red flag that you’re dealing with\nsome weak abs is, when you do your ab exercises your hip flexors fatigue before your abs do. Let me show you an example here, guys. On a hanging leg raise, if I lift my legs\nup, and I find that after however many repetitions my legs are feeling heavy, and I can’t lift\nmy legs anymore, but my abs feel pretty fresh; that’s because I’m letting the hip flexors\ndrive the movement. That’s wrong. Same thing here. If I was on the ground, doing the scissor. Yes, this is an isometric hip flexor exercise\nwhere I keep my legs off the ground the entire time, but if that is what’s failing, if\nthat’s what fatiguing, once again, I’ve let them drive movement, as opposed to the\nabdominals. What you need to do is flip that around. You have to engage the abdominals. Up here on the hanging leg raise you curl\nthe pelvis. You curl the pelvis. If the pelvis is curling and flexing, we know\nthe abdominals are doing their job because that’s what they do. They flex the pelvis. We know that the hip flexors, on the other\nhand, can pull you into an anterior tilt, extending through the midsection. So, you want to make sure that you’re getting\nflexion on the ground. Same thing. If I’m going to do a scissor, I get my back\noff the ground to get us into flexion. That now activates the abdominals first, and\nthen allows the hip flexors to go along for the ride. Guys, it’s a very important point. Do not allow, on any ab exercise, for you\nto start feeling fatigue here first. If you do, it’s a major red flag. So, we mentioned the overactivity of the hip\nflexors, but that can lead directly to this next red flag. That is the presence of low back pain whenever\nyou do your ab exercises. That’s something you do not want to tolerate,\nand you definitely want to fix it. We can look at that and why that’s happening\nhere with a traditional sit-up. Now, this isn’t necessarily my favorite\nexercise, but it is something that’s functional, and you’re going to see that it relates\nto one of the red flags later on. However, in a traditional sit-up what are\nyou looking for? When you come up off the ground do you see\nthe following: first, do you need someone to anchor your feet down? Are you sticking your feet under something\n– I know who you are – under something to be able to perform the exercise? Because if you are, you shouldn’t need to. Second: when you come up, your shoulder trail. If you get a significant arch in your low\nback, you have weak abs. That’s something you cannot allow. The third thing is: if, on the way down, you\nslam down to the ground uncontrollably, that’s due to weak abs, once again. Those are all related to the one thing I mentioned\nin the beginning. That is a dominance of the hip flexors. The hip flexors taking over. So, here’s what we want to do. We want to make sure that we don’t allow\nthat to happen. The first thing you can do is change the way\nyou hook your feet. Instead of allowing them to be pressed down\nand hooking them under something, you want to put them over something and drag back. That does the complete opposite, anatomically. You’re activating the hamstrings by pulling\nyour heels into that, which is going to help shutdown the hip flexors, or at least decrease\ntheir activity. So now I’m not getting that pull on the\nlow back. I’m able to come up and perform these exercises. The second thing you want to do is, you want\nto be able to put yourself back down on the ground, one segment at a time. Literally paint your spine down one segment\nat a time. When you come off the ground you paint yourself\noff the ground, one segment at a time. That’s going to guarantee that you’re\nactivating the abs first, before the hip flexors. Why? Let’s take a look at one more thing. If we activate the hip flexors first, and\nI get my line of pull from here, I pull, and it pulls Jesse into extension. It puts a lot of unnecessary force on the\nlumbar spine, likely creating the pain that you’re feeling. However, if we can get the abs to activate\nfirst, if I were to simulate the line of pull on the abs, I’m pulling on segment at a\ntime off. I’m getting the abs to contribute. On the way back down, look at the control\nI have over his torso as he goes down. I’m the brakes applying this slowdown, and\nthis slowed descent back down to the ground. You’ve got to have that. You’ve got to have your abs driving first. You can’t let your hip flexors dominate. The next red flag is going to reveal itself\nto you when you perform any of your three big list. The squat, the bench-press, or the deadlift. We know that the role of the abdominals during\nthose movements is to stabilize, and brace your core throughout to add efficiency to\nthe movements. To clean up the bar path. What we’re not looking for here is dramatic\nincreases in strength. This is supposed to be somewhat of a background\nactivity and it’s more neurologically driven, more mind-muscle connection than overall ab\nstrength. However, there’s something you can do. What I want you to do is test yourself on\neach of the exercises I just named. The next time you perform them try to actively\nbrace as hard as you possibly can. If you notice a better bar path, more efficiency,\nall the things I already mentioned; good. I know your ab strength and your mind-muscle\nconnection is where it needs to be. However, if you feel like you could start\nadding 60lbs or 70lbs to the bar because you actively brace, what tells me is bad news. That tells me you were not doing that right\nnow. It tells me that unless you’re heavily focused\non doing that in the exercises themselves, you’re not getting that. That’s a significant weakness. Albeit, a mind-muscle weakness, it’s still\na weakness, and it’s going to rear its ugly head every time you perform these exercises. Especially, as you start to add more weight\nto the bar. Red flag number four can be revealed just\nby looking in the mirror. As a matter of fact, turning sideways and\nlooking in the mirror. If you see this distended lower belly here,\nyou’re likely suffering from a weakness that you need to address. This is a major red flag. This is not what I want. I want you to be here. Not here. But here. You’re probably saying “What’s the main\ndifference there? All you did was contract?” Yes, you’re right. But what I did was contract the transverse\nabdominus. I have the ability to contract the transverse\nabdominus because I have the strength to contract the transverse abdominus. That muscle is just like this weight belt\nhere, guys. Its role is to run, just like this weight\nbelt would, in terms of its orientation of the fibers. It does the same thing a weight belt does. As it contracts it cinches down. Here, contracts, it cinches down. It creates that smallness of the waist. It creates that tightness, inherently, by\nperforming like a weight belt would. Now, you want to make sure you have the ability\nto do that. You need to make sure you can do it by practicing\nand by ingraining it and integrating it into every ab exercise you do. So, if you see me doing the scissor here,\nyou don’t want to allow yourself to distend while you’re doing the exercises. That’s being too passive. That’s being lazy. Instead, you want to draw down, cinch down\non your belly – your lower belly – to create this flatness by contracting the transverse\nabdominus. Again, thinking about it like a weight belt\nand performing your scissors on every, single rep. The same thing here during a V-up. You don’t allow yourself to distend as you\ncome up. You pull down first, contract, and then you\ncome up. This might dramatically lessen the number\nof reps you do, but you’re increasing the number of quality reps you do. Over time, the more strength you get in the\ntransverse abdominus, the less you’ll see this distention here anytime you take your\nshirt off. Last, but not least is a little bit of a four-part\nred flag. This is going to be fun because you’re going\nto get a chance to do these things. It should step up in difficulty. See if you can keep and stay with me for all\nfour of these. The first one is pretty easy, as Jesse is\ngoing to demonstrate. All I want him to do is be able to get off\nthe floor. I want you to be able to do the same thing. How do you guys think you did? He’s pretty happy with himself. But as you can see, I’m not because Jesse\nused his hands. You see, I want you to be able to get off\nthe floor without ever using your hands. That goes for your elbows and your forearms\nas well. You should be able to get your center of mass\nup and over your knees into a standing position without ever having to rely on your hands. If you can’t, it reveals the fact that your\nabs are weak. Now, you can have strong abs and do this test. You will still feel your abs working to get\nyou there. That’s exactly what’s supposed to happen. However, if you can’t get up without the\nuse of your hands it’s a major red flag and you probably can’t go on with these\nother tests. If you did make it, let’s keep going to\nthe next level. Next you want to test each of the planes individually. The first one up is the frontal plane. Can you prevent motion side to side? The easiest way to test that is with a suitcase\ncarrier. All you have to do is pickup one dumbbell\nthat’s about half of your bodyweight and try to carry it for one lap around the gym\n– or 30 seconds – without allowing your shoulders to drop noticeably on the weighted\nside. In other words, can you walk, dynamically\nmove here without allowing your spine to bend toward the side that’s weighted? In order to do that you have to have good\nab stability and strength on the opposite side. If you don’t, it is a major red flag because\nwe need to be able to prevent motion. Not just in this plane, but all three. We have additional tests coming up now. If this is a problem for you, it is a red\nflag and it’s something you’re going to want to work on. If you’re good here, we’ve got two more\nplanes to go. Now we move onto our next exercise or test\nhere. It’s the cliffhanger plank. What we’re trying to find out here is, what\nis your anti-extension stability? What is your ability to contract through the\nabs and prevent an overextension of the midsection? Because that’s dangerous. That places a high amount of stress on your\nlumbar spine. It’s not something you want and it’s not\njust about being able to stabilize in a plank with your hands out in front of your body. You want to be able to stabilize for as long\nas your body can get. Especially as we apply this to athletes and\nwide receivers. If someone is weak or vulnerable in this position\n– especially as they’re going up for a catch, like Antonio Brown – you’re in\ntrouble. We want to make sure you can do this and hold\nthis position for at least 30 seconds with your arms up over your head and your abs firmly\nstabilized. If you cannot, guys, if you find that you’re\nsagging, or putting a lot of pressure on your lower back; you’re not strong enough. You’re going to need to address this before\nyou can move on. If you’re good, you’ve got one more to\ngo. Rotational stability. Last, I want to make sure you can prevent\nunwanted rotation. We can do that here with a cable setup. All you have to do is put half your bodyweight\non the cable. Step away with your hands close to your chest. Now extend your arms out away from your body. All the way, as straight as you can make them. You’re increasing the moment arm, you’re\nincreasing the weight, you’re increasing the demand of the core. You’re trying, at all costs, to prevent\nrotating even an inch back toward the machine itself. You want to make sure you can hold this position\nfor 10 seconds, each time, and try to repeat it for a total of two to three times in each\ndirection to make sure you have the ability to prevent excessive rotation. If you don’t, once again, it’s a red flag. So, there you have it, guys. There are five red flags to help you determine\nif you have some ab weaknesses that you’re going to want to address. I promise you, it’s not going to work trying\nto overlook them, or shove them under the rug thinking that one day you’ll get to\nthem. It’s more important that you see them and\nface them head on and do something about it right now. The fact is, guys, you might have visible\nabs. That is not an indicator of whether or not\nyou have any of these weaknesses. It’s not about what your abs look like from\nthe outside in. It’s how they inherently function and what\ntheir strength is from the inside out that matters the most. If you’re looking for programs that help\nyou do this and build it into everything we do because we know how important it is, all\nof our programs are available over at ATHLEANX.com. In the meantime, if you’ve found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you in the days and weeks ahead. Also, if you haven’t already subscribed\nplease do so, and turn on your notifications. You now have a chance to win some free programs\nfrom ATHLEANX if you do. Check the link below to find out how. All right, guys. I’ll see you again soon."
}