{
    "id": "PUrfhmHszU8",
    "title": "Bench Press for Upper Chest - (2 BIG MISTAKES!)",
    "description": "Build a ripped, athletic chest in 90 days here… http://athleanx.com/x/built-and-ripped-in-90-days The incline bench press is one of ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. We're breaking out Jeff's marker today to\nhelp you get more out of the incline bench press. No doubt, it's one of the best upper chest\nexercises you can do if you can figure out a way to minimize the front delt from dominating\nthe movement. You see, we know that these two muscles – the\nfront delt and the upper chest fibers – are really close to each other, which means they\ncan really start dominating one or the other if we don’t do the exercise correctly. So I want to carry over and show you the two\nbiggest problems with the exercise that most people are making. I can tell you, it was backed up with a recent\ntrip to the gym where our international chest day – Friday now, a lot of guys getting\ntheir swole on for the weekend – there were so many guys doing incline bench incorrectly\nat the gym that I felt like it warranted a video to recover this important topic. So first of all, what is the angle that you\nwant to use on the bench in order to hit the upper chest the most? Now, I'm not saying that you want to totally\nexclude the front delt, but the fact of the matter is, our front delts get a lot of attention\nfrom a lot of the other exercise that we not only do in the gym, but every day activities\nthat we do with our body. If I were to do a shoulder press you guys\nknow that an upright shoulder press is going to maximize the attention that the shoulders\nget – the front delts get. Why? Because it's straight up against gravity. You can see this muscle is working and shortening\nup against the force of gravity, right through here. Well, if I were to back off the angle of the\nbench 30 degrees to 60 degrees – which is one of the most common places that people\nwill do an incline bench press from – then you're going to shift the focus down a little\nbit. But you can see this muscle is a pretty large\nmuscle and it's not enough. It's not enough to put the focus down through\nthe mid-belly of the upper chest. So 60 is not enough. You might want to go a bit lower. You can see me make that adjustment here on\nthe bench, down to 45 degrees. Well, 4t5 degrees is better. Anytime you start going lower and lower, you're\nshifting that focus down. Remember, completely flat bench-press, 0 degrees\nwould represent one that's going to target more of the middle chest. So at 45 degrees you're still not really there. You've got a little more room to play. As a matter of fact, research shows that 30\ndegrees is the best angle for targeting the upper chest. Now, that leads to the second point. As you've seen me bang out a couple reps of\nth 30 degrees, notice the position of my shoulder. Now, the position of my shoulder is key. This is why the 30 degree angle works better,\nbecause when you look at these two muscles – again, I talked about the dominance of\nthe front delt. When the front delt becomes dominant our shoulders\ntend to round forward. I know a lot of people watching this are probably\nsitting here right now like this watching the video. That's common, unfortunately. What happens is, the front delt is actually\nput in more of a position of power in relation to the chest. It's actually here more willing, proud, standing\nout, willing and able to push more quickly and spring to the task more quickly than your\nupper chest. The way we can silence that is by getting\nit back where it belongs, allowing the chest to now being a better position to contract. The way we have to do that is through positioning\nour shoulders in the right direction. So we want to make sure that whenever we press\nthe shoulder blades have to be back and down, okay? Back and down. What the does immediately, you can see here,\nis it puts the front delt back in its place and allows the upper chest to be in a better\nposition of pushing power because we're laying back flatter, and flatter, and flatter on\na 30 degree versus a 60. We're actually allowing that to take place\nmore naturally. So you have to not only rely on the fact that\nthe bench is helping you get there, but you have to consciously be sure that you're contracting\nthose shoulder blades to ensure that it's there because a lot of us will continue to\npress. Over time, even as we fatigue, more and more\nwe're trying to recruit a little bit of help from the front delt and that's when the exercise\nfalls apart. So, guys, I hope you've found this detailed\nbreakdown of the incline bench to be helpful. Remember, this is about putting the science\nback in strength. I don’t like to just tell you \"Oh, do inclined\nbench because it's good.\" We all know it's good, it's why it's good\nthat allows you to get better results, faster when you follow our training. Guys, if you're looking for a complete training\nprogram, step by step, put the science back in your strength, you can head to ATHLEANX.com\nright now and get our ATHLEANX training system. If you've found this video helpful, if you\nlike Jeff's marker, make sure you let me know in the comments below and I'll make sure to\nbreak it out again and do more of these detailed breakdowns. All right guys, I'll be back here again real\nsoon."
}