{
    "id": "PxTPFT59Kgs",
    "title": "How He Deadlifts 3X His Bodyweight! (THE PLAN)",
    "description": "Today, we are talking about Jesse and how he deadlifts 3x his bodyweight. In this video, Jesse and I explain exactly how he was ...",
    "transcript": "That's right, I told you. That's 540. I got\nit. I'm surprised you haven't made that an intro\nyet. Oh, it's coming. What s up guys, Jeff Cavaliere, Athleanx.com. Jesse Laico, Athleanx.com. Also known as Dr.\nDeadlift. I'm just Jeff, by the way. So today I want\nto talk about the deadlift and most importantly, Jesse's progression up to today. 3.3 times my body weight. So that's just three times your body weight.\n3.3 times your body weight, an impressive lift by any standard. How did he do it at\na body weight of? 166. 166 pounds, which is pretty much phenomenal.\nSo, let's get into how we did it. Guys, I took some flack years back from the less educated\nwho basically thought that spending time working on fixing the foundation before jumping into\nthe big lift and piling the weights on the bar was a flawed approach. I still stick by\nmy plan, that's the best way to approach this long term. I talked about this pyramid, right?\nThere's a strength pyramid at the bottom of that pyramid is strength. It's the base of\neverything that builds off of it as you can see here. However, I said that the pyramid\nis also supported by something else. Therefore, the strength isn't the bottom of the pyramid,\nit's not the base of everything. Because if I can compromise your stability and there's\nways I can do that, by either having limited flexibility or mobility or in this case, postural\nissues, then I can undercut the entire pyramid. It's like a tree, if the root system sucks,\nthe tree is going to fall down no matter how big and strong it is. So, we spent quite a\nbit of time working on Jesse's posture. Right. And also some of the different issues you\nhave with flexibility and mobility. Thoracic spine was horrible. Yeah. Oh, God. All right. So, you can see some of these pictures\nhere, like Jesse didn't have really the prerequisite safe body, I don't think, to start stepping\nover heavy weights and try to lift them because he was just going to let the weights go up\nand up doing some of the compromised body. So, we spent a lot of time doing that. Yeah. Then what we did was move on to sort of those\nmuscular weaknesses or the component weaknesses that were going to undercut his deadlift anyway.\nRight? Yeah. So, we use some of the accessory lifts. What\nwere some of your favorite ones? So, my favorite ones were the Straight Arm\nPush Down. Getting you to activate the lats and engage\nthem and hold them tight throughout the whole lift. Yep. RDLs. Working on the hinge capability. Again, something\nthat didn't come naturally for Jesse was getting the hinge to work properly. But more importantly,\none of your biggest struggles was at the end of the deadlift to being able to finish. Yeah. So, you did RDL, next one. High Pulls, that was to work my upper back\nand upper back strength. Right. A lot of times again the thoracic weakness,\nright, to be able to hold your shoulders back tends to drive that forward rounding which\ncan work its way down the spine into the lumbar spine. And it starts with that lack of strength\nthrough the upper back, so we did those. Yeah. Hip Thrusts was big. So, another move like the RDL to sort of work\non that terminal hip extension. Lat Pull Downs. Okay. I love the Lat Pull Downs. So, when KC Mitchell was in here, KC told\nyou how much he liked to use the Lat Pull Down. Yeah. As another move to improve the Deadlift. And then finally Power Shrugs. Right. So, Power Shrugs, again, working that\nupper back and becoming explosive, especially off the floor. Yeah. You don t use straps? No. Grip work is something we've worked on a lot. Yeah, grip strength is a huge component of\nmy accessory work. You do a lot of carries. Yeah. Farmer's Carries. So, it was the Dead\nHangs and the Farmer's Carries were the probably the two biggest things that I did for my grip\nstrength. And just to give them an idea, how often are\nyou working, let's say your carries into a weekly routine? Well, like you had said in a previous video\nto do, I had done it almost every single workout. Now it's about 75% of the workouts that I\ndo. So now the specific plan, because people probably\nwant to know what your plan is. Right. Yeah. So, let's can I erase Dr. Deadlift? Yes, of course. Thank you very much. So, phase one 3 x 5. Yeah. So that was done as an ABCD structure\nwith B and D days specialized in the Deadlift with a 3 x 5. That was part of the old school\niron program that I did. By the way, guys, literally people wanted\nto ask, what did Jessie do? Exactly what we put together was the old school iron plan. Yeah. This is the first phase of that plan, which\nwas meant to sort of build strength in your bigger lifts and build those that foundational\nstrength. So, I was doing that one to two times a week\njust based on that structure, but I repeated phase one three times. So, I spent three months\ndoing phase one because I noticed that my strength was continuing to progress and progress\nand progress. Once it stopped progressing, that's when I moved on to Phase 2. So, I want to interject here and say that\nthe reason why I think he saw sort of those uncapped, faster progressions Yeah. is because the time was spent earlier on Yeah. to build up that foundation. I can't say enough\nguys, I've seen far too many athletes who jump the gun and go too quickly on adding\nthe weight, which is fine because they're capable of doing it. But when it's built upon\nthat cracked foundation, everything crumbles, right? Yeah. But if you have the foundation in place, even\nif you have to take some time in the beginning to set the stage for that, ultimately, I don't\nknow many people that are deadlifting more than Jesse is, especially at his weight. He's\nliterally in the competitive area. He can step into a competition and win it at this\npoint. I mean it's elite as strength standards would\nsay. Right. I mean, the other thing, I just spent\ntime at my next live event with Matt Wenning, who is one of the most respected and accomplished\npower lifters of this generation. And he actually pointed out the exact same thing, that unless\nyou spend the time to work on fixing your weaknesses and to fix this cracked foundation,\nyou're literally setting yourself up for disaster long term. And he actually has his Wenning\nWarmups that he uses to address this exact situation so that you're not stepping over\nthe bar or getting under the bar with a body that's not prepared to do it. Then we kind\nof shift the gears in Phase 2. Phase 2, that was what we call a Contrast\nWave Loading. Right. And that scheme was five reps, one rep, five\nreps, one rep, five reps, one rep. Like that. Yeah. So go ahead and explain that a little bit. So, with the five reps we were using, what\nwas it, 80%? 80%. 80% of one rep max and then shifting to the\none rep I was using 90, 92 92.5. 92.5 and then five again at 80% At 80%. Then it was 90 5. And then 80% again, and then 97.5. 97.5, right. So, the idea here is that from\nworkout to workout, the 80% with the five rep is going to stay the same. But with the\none rep, we're going to basically creep up the percentages. Yeah. So, the next workout, you wouldn't start with\n92.5, you d start with 95, then you go to 97.5 and then you go to 100. And then the\nnext workout you're going to go from 97.5 to 100 to that and then at that point 102.5. 102.5, so just establishing a new PR on the\nlift. Yeah. But this phase was one that really started\nto help you to bump up the numbers. Yeah, and it was cool because I was seeing\nnew masses every single every single time that I was going to 102.5%. Right. So now interestingly, in Phase 3 here,\nstrength is one component of the overall big picture. There are esthetic benefits that\nalso a lot of people want. Yeah, Jesse's one of them. Mr. 8 Pack. Right. But\noverall athletic performance, again, we just had the Athlean-X Games. We want people that\ncould be agile, have stamina, have power, endurance, have the ability to move in space,\nhave good flexibility, good mobility, be strong. But in Phase 3, also in old school, and you're\ntalking about continuing to maintain and build off of your key lifts that you're working\ntowards. Right. So you are able to sort of go back to getting\nsome of those esthetic benefits. So that was here. Yeah. So, after my hypertrophy work to start\nthe workout, I moved into a 5 x 5 and again that was increasing the weight by 5 pounds\neach workout that that showed up. Right. And then following the standard progression\nfor the 5 x 5 also. So, starting with the 3 x 5 and then increasing that volume by the\nend. And this approach has led you to the numbers that we see here today. Yeah. And I think is the most beneficial thing\nthat I've ever done to help increase my deadlift. Yeah. And not just that, but I also worked my other\nbig lifts, and it was really great for my strength to go up on my squat, I'm almost\nat four plates on my squat. So, you're not just a Dead Lift Specialist? Not just a Deadlift Specialist. You re just not built for Deadlifts? No. not just. You're just not built for deadlifts? No, no. I'm almost at four plates on my squat,\nI'm up to 380. Right. Last time I tested here. You can see it here. Yup. Yup. And it's moving, honestly, pretty easy\ncompared to some of my other maxes that I've hit. So, I'm hoping I'm going to hit four\nor five pretty soon. Again, not surprising, guys. If you build\nyour overall strength, you don't just become strong in one lift and one lift only. Yeah. If it's done the right way, it's transferable\nto a lot of different lifts. Yeah. So any other little nuggets or since you are\nDr. Deadlift. One thing I can suggest is that what I did\nis treating every single rep that you do like it s a max lift. Being explosive off the floor\nas fast as I could and power my glutes to the bar. Yup. Because if I didn't do that, I would be weak\nwhen it comes to that. Plus, first of all, it's like a motor unit\nrecruitment practice, right? Like you want to be able to at your at your highest totals,\nbe able to recruit your motor units to their full capacity. Yeah. So, if you start to do this from a lighter\nweight, Larry Wheels does this a lot. He basically explodes through every single repetition.\nI think that when you need it the most, you have the ability to tap into those motor units\nto allow you to move some pretty heavy weights. And if you don't do it and you only try to\ndo it when you need them Yeah. they don't have enough practice being engaged\nand being brought into action. So, it's a good it's a good tip for sure. So, I got to\nsay I'm going to say it right here on camera, proud of your work. Oh, wow. Wow. Done. Wow Don, done an amazing job. I can't believe it, he's giving me praise. It's like a proud papa, you know. I just got\nto say proud papa. So, if you guys want to do the same thing, we talked about Old School\nIron. It's available over at athleanx.com. If you're looking for more videos, how we\nput the science back in strength, because that is one of the components of it, but it's\nnot everything. Again, the complete picture to be Athlean, you've got to have some other\nelements to your training as well. Yeah. We do it all in Athlean-X you can find more\nat athleanx.com. All right, guys, we ll be back here again soon in just a couple of days.\nMake sure you hit subscribe turn on your notifications so you never miss a new video when we put\none out. All right. See you soon."
}