{
    "id": "pzy289wmsKQ",
    "title": "Ankle Sprain Fix and Prevention (IMPROVES SQUAT TOO!)",
    "description": "Build strong ankles and build ripped athletic muscle in 90 days http://athleanx.com/x/be-built-like-an-athlete Ankle sprains are one ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going to talk about the ankle\nand how it could be preventing you from having normal biomechanics to do big exercises. Things like the squat and the deadlift because\nyou know, you try to get down into a squat or a deadlift and all of a sudden your heels\npop off the ground or you feel pinching in the front of your ankle, or you just feel\ntightness that doesn't allow you to get any lower. Those can cause problems and we know that\nsince this is a kinetic chain, the problems move up into the knee, or up into the hip\nand we don’t want that. This is particularly useful if you are a chronic\nankle sprainer; someone who's sprained their ankle before or maybe you just had an ankle\nsprain recently. What I'm going to show you here today is going\nto help you actually get more movement. So what we do is, we look here at the ankle\nand we have to understand what we're trying to fix in the first place. I'm not talking about tightness felt on the\nbackside here in your calf region when you try to go down into a squat. If that's just muscle related we can work\non that through stretching. What I'm talking about is that pinching feel,\nor that tightness feel, or that jamming feel that you feel in the front of your ankle. You can kind of identify if because it's the\npart that moves on the fixed bones here and it's somewhat positioned in between the two\nbumps on the side of your ankle that you can feel. Those two big bumps are the fibula and the\ntibia, what they call the malleoli. We know that this thing moves right in the\nmiddle of those. It has to be able to movie backward. It kind of hides inside and behind the tibia\nas it moves up and that's what gets us into dorsiflexion. As we lower down you need to be able to get\ndorsiflexion to get your heel on the ground. If you're a chronic ankle sprainer, what happens\nis two things. Number one: you either lose the ability to\nhave this move in this joint; it doesn't go backward enough – and we can fix that in\ntwo ways like I'm going to show you. Or what happens is the fibular head, because\nof all the sprains, actually gets moved forward too much. It gets in the way. So you can see that if this bone right there\ngets jammed forward a little bit too much then it's going to get in the way of this\nmoving freely. So it's going to kind of jam into it. You could do this two different ways. Firstly, you can try to bring the tibia forward\non a fixed lower joint. If you do what I'm showing you here, you place\nthe band around the back of your tibia, clearly higher up above this area here – above the\nankle, 2\"-4\" above the ankle – you anchor it behind and you step away. Now when stepping away, the force is that\nit wants to pull your tibia forward. We know if we bring the tibia forward, that's\nactually making the joint in relation to it go backward, which is where we want it to\ngo – back. So you get into this position, the band is\npulling you forward and now you just lunge yourself down and all you're focusing on doing\nis driving your knee forward here – like this – driving forward to get more into\ndorsiflexion. You just keep working on that and you'll feel\nthat it loosens up. Maybe do it about eight to ten times. You step out, get out of the band and you'll\nnotice right away you should have more freedom of motion here to be able to go lower and\nstill keep your heel on the ground. The other way to attack this is to go after\nthe sub patellar joint itself. So you can see now I turn around and I go\nthe other direction and I really want to make sure that the band is low enough on my foot. So see as I place this band, I'm going below\nmy ankle joint. I'm going right here on the skeleton, down\nhere. Then I step away and I use my other foot to\nanchor the band downward sloping angle. You can see that the pull force is now going\nto be this way; down like this. Now when we go and angle out and drive our\nknee forward and down you can see that we're actually pulling this, again, down into a\nposterior glide. So we're using the sub patellar joint and\npulling down this way, which is the direction we know it has to go in, in order to increase\nthat motion. Now, if all that doesn't work, the next thing\nyou can do is work on that fibular head. Again, as a chronic ankle sprainer I will\ntell you, almost 95% of the time I find that the fibular head gets displaced a little bit\ntoo far forward. So you do what I'm showing you here. You put your ankle up onto a bench. You grab the band, you wrap it around itself,\nand you place it around the back of your ankle. Now, you can see here I'm being very particular\nto make sure I overlap that fibular head – the bony area – and I take the band, showing\nyou here first with my hands outside and I'll show you again as I demonstrate actually going. I'm trying to take the band, I wrap it around,\nI'm holding, I grab the band really tight right here – because I want to grab onto\nthat little bone, that little malleoli on the outside – I want to grab it and then\npull really hard with my right hand as I wrap around, put them both into this left hand,\nand then glide back. So now, what I'm doing is creating this posterior\nglide. I put my foot up on the bench and I lean my\nknee in to try to get a lot more dorsal flexion. See, as I do it, I'm doing the same thing\nhere and now as I just told you. I'm wrapping it around, I'm grasping with\nmy right hand, in this case, and I'm really trying to do that – focus my force on the\nposterior glide of that fibular head. I can guarantee you if you do that a few times\nand then step out and get down onto the floor you'll notice you have much more motion in\nthat ankle joint, especially if you have someone that's a chronic ankle sprainer that has a\nlot of cracking and popping in the ankle. You're going to notice that you're really\ngetting rid of a lot of that, if not all of it. It's temporary. You have to do it frequently throughout the\nweek – maybe two to three times – but over time, when you reposition and then strengthen\nin that new position, you'll have a much better chance of keeping it like that forever. So, guys, I know this is a little technical,\nbut I think it's going to help you out a lot in terms of gaining more mobility so you don’t\nscrew up the rest of your body here when you go to do those big lifts like squats and dead\nlifts that require you to go down low. So make sure that you work on these and I\nguarantee that you're going to find more mobility, less pain, ad hopefully an end to your chronic\nankle sprains. If you've found this video helpful make sure\nyou leave your comments and thumbs up below. In the meantime, this is putting the science\nback in strength. It is a little bit heady at times, but I think\nyou are looking for that kind of material or you wouldn't be here in the first place. If you're looking for a complete training\nprogram that puts the science back in strength and helps you to get bigger, stronger, faster\nat the same time keeping you safe; head to ATHLEANX.com and get our ATHLEANX training\nsystem. All right, guys. I'll be back here again soon. See you."
}