{
    "id": "QBJlJwvx8Xk",
    "title": "The Secret to &quot;Boxer&quot; Abs (FULL WORKOUT!)",
    "description": "Have you ever wondered why boxers have such amazingly ripped abs and core muscles that stand at attention? In this video, I'm ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Let me ask you a question. Take a look at these three guys and you tell\nme what makes their mid section so impressive. One by one. First up, marshal arts legend, Bruce Lee. Take note because I’m going to show you\nanother picture in a second. Next guy, famous boxer, Manny Pacquiao. Again, take a look, remember it. We’re going to look at another picture of\nhim in a second. And of course, my childhood fitness icon,\nSylvester Stallone here. Take another look. Good. Now, I’m going to show you another picture\nof each of these guys again. Let’s go back to Bruce Lee. What’s happened? Do you notice what’s not as impressive? What’s different? We’re going to go to the next guy, Manny\nPaquiao. Once again, take a look. What do you think? What do you see? Then finally, Sylvester Stallone one more\ntime. The difference – if I put these pictures\nside by side – in one picture we see the development of the serratus anterior, a muscle\na lot of us overlook. In the other picture here, we’ve taken it\naway. Now, you don’t want to take yours away. You want to make sure you’re developing\nyours as good as possible because you can see when the serratus anterior is developed\nit starts the tapering effect down, feeding into the external obliques, which then feeds\ninto the abs. If you want to have the best-looking midsection,\nit’s going to rely on this fan-like muscle that comes in here. Here, here, here, and it feeds down right\nout of the lat, down, and in. And guess what happens? Guess how we activate that muscle the most. We activate the muscle the most from punching\nbecause the protraction of the arm and getting that shoulder blade around the body to wrap\naround. It’s not just flipping your arm out like\nthis, but getting your arm extended as far out as possible. That gives us the ability to activate that\nmuscle. But you know what? We can do that and incorporate that into an\nentire ab workout. That’s what I want to do for you here today. I’m going to give you five exercises that\nwill not only take your arm through that protraction to get the major activation of that muscle,\nto help develop it, but secondly, incorporate the abs as well. So, you’ll have one, complete workout. Let’s kick off this boxer ab workout with\na pretty basic exercise, but we’re going to do it differently. This is a plank. We’re going to activate the serratus anterior\nand we can do it simply by not just resting passively on our forearms but raising the\nbar a bit and pushing through our forearms. We’re going to try to keep our forearms\nin contact with the ground to push our body away. By doing so, we’re getting that protraction\nand rounding of the shoulder blades around our body, which is key to activating the serratus. We’re not overlooking the impact that this\ncan still have on the abs. What’s great about this is we get that one-two\ncombo of incorporating serratus activity with the traditional rectus abdominus that we get\nfrom a plank. Next, we can take one of my favorite ab exercises,\nwhich is the ab-wheel rollout. Dust yours off. You can still use this thing, I promise you\nguys. It’s still good, but what we do is, once\nagain, we focus on how we’re using it. When we do the rollout a lot of us will sink\ndown into it and let it collapse on us. No! If you want to activate the serratus as well,\nwhat you’ll need to do is push that wheel out, actively in front of you. I get up on top of it. You can see me initiate by pushing my arms\ndown and lengthening them as far as I can. Then, holding that position – because that’s\nthe key; being able to hold that position the entire time – then execute your rollout,\nand come back in. Again, there’s no differentiation here. We’re still working the abs. There’s nothing we’re taking away from\nworking the abs. All we’re doing is adding to the fact that\nwe’ve now activated the serratus on top of that. Now this couldn’t be a boxer-ab workout\nwithout actually throwing a few punches, right? We know this is one of the best ways to activate\nthis muscle and we can make it more of a core challenge by varying the position of our body\nwhen we do this. So, I’ve anchored a band behind me, and\nwhat I’m focusing on to get the serratus activated is to push my hand out and even\nfurther. We’re reaching as far out, and away as possible. So, it’s not just about getting to here,\nbut it’s about getting to there. So, we can get the shoulder blade wrapping\naround. But I mentioned the feet. What’s going on down there? Well, we’re trying to narrow our base of\nsupport, so our core has to do more work to stabilize our body. Especially as we’re moving our arm against\nthe resistance of the band. So, you can see I’ve staggered my feet and\nput them in line with each other, and the back foot, I’m just going up onto a toe. So, I’m minimizing my entire base of support,\nand narrowing that at the same time to make it more of a core challenge. But as we talked about, the band and the pushing\nout in, and of itself is going to really hit the serratus as well. This next exercise here is one of my favorites,\noverall. It’s a variation of something we call our\n‘gymnast abs’ exercise. That is getting into a dip bar station and\nthen not just worrying about doing dips, and not worrying about doing knee ups, but working\non pulling our pelvis up into this posterior tilt, which we know is going to activate the\nabs. But, look what’s going on at the same time\nwith my hands. I’m not just pulling up. At the same time, I’m pushing down on my\nhands, and away as far as I can, really trying to round those shoulder blades, and get them\naround my body to activate the serratus. We call this a screwdriver. The screwdriver is a great way to incorporate,\nnot just the serratus, and not just the abs, but also to get the obliques involved as well. So, in the holy trinity of ab training – I’ve\nactually made a whole video on that. If you haven’t seen that yet I’ll link\nthat at the end of the video. But in the meantime, it falls in perfectly\nhere as yet another option to really hammer home the serratus. Finally, we have another popular ab exercise. The crunch pulldown. Not only do guys tend to do it incorrectly,\nbut I think, in this case, they’re missing out on a great opportunity to include the\nserratus in this move. It’s by simply changing the position of\nthe rope, in relation to your body when you’re doing the exercise. Most of us will take that rope right in front\nof us and go straight down, and crunch. Why not turn your body around? If we have the rope anchored behind us, and\nwe pull that weight stack, and we reach; now we’re getting the serratus activated against\nthe resistance of the stack. Then from there, then we execute the crunch\npulldown. We’re getting the serratus activated the\nentire time, we’re incorporating the abs again through every, single exercise here,\nthe rectus abdominus is getting a great workout. We mentioned in the beginning that the serratus\nfeeds into the external oblique, which feeds right down into the rectus abdominus. So, these muscles prefer to be engaged together. We’re going to finally allow them to do\nthat here, for the first time. So, there you have it, guys. There is your complete workout. Do each of these exercises. Focus mostly on the quality of every repetition. If you find that you’re losing the ability\nto contract your serratus, slow it down. Get a good, quality rep and if you can’t\nget anymore then that’s the end of that exercise. Take a rest and move onto the next. Try to go through two or three rounds of this,\nif possible. Guys, I’m telling you, if you want to look\nlike an athlete you’ve got to train like an athlete. You can’t overlook muscles that matter. The serratus, not only does it look good,\nand as it helped all those guys that I showed you in the beginning to have an entirely impressive\ncore. And even if you’re not a fighter, it’s\ngoing to lead to great benefits, in terms of shoulder stability, and keeping your shoulder\nmoving right. Especially so you can move it up over your\nhead. These are all things that matter. We overlook none of it when it comes to our\nATHLEANX training programs. If you’re looking for a program that tells\nyou how to do all this step by step, head over to ATHLEANX.com. In the meantime, if you haven’t subscribed,\nguys; make sure you do. And turn on those notifications so you never\nmiss a video. I told you I’d link one of those videos\nhere at the end of this video. I’m going to do that for you in just a couple\nseconds. In the meantime, I’ll be back here again\nin just a couple days. Let me know what else you want me to cover\nand I’ll do my best to do that in the days and weeks ahead. See you soon."
}