{
    "id": "qhuTSemCHFU",
    "title": "Insane Biceps Workout (CRAZIEST PUMP EVER!!)",
    "description": "Build your ultimate biceps and triceps in just 6 weeks here… http://athleanx.com/x/get-ultimate-arms-here A lot of biceps workout ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. Today it's all about the Arms. ULTIMATE ARMS now available at ATHLEANX.COM. And to celebrate that guys, we're going to\ndig right into it today and show you some of the behind the scenes of the training involved\nin the ULTIMATE ARMS Program. Guys, I said, we put the Science back in Strength\nin everything we do here at ATHLEANX. The ULTIMATE ARMS Program is no exception. Literally taking me from the skinny little\nkid that I grew up with that actually had no arms at all, or at least no development\nin my arms to now maybe them being my best feature. I'm going to show you guys exactly how to\ndo that. But today, one of the techniques that we use\nis combining concentric and eccentric failure. But doing it in a way that we're able to not\njust get ourselves to failure. I always talk about the importance of going\nthrough failure. And the great thing about Bicep training is\nthat you're allowed to go through failure a lot more comfortably than you might be able\nto on any other muscle group. If you think about going through failure on\na Squat or through failure on a Bench Press, the repercussions of the bar coming down on\ntop of you or on top of you, are a lot more than let's say, going to failure\non a Barbell Curl. So take advantage of that opportunity to do\nmuch more intense work and you're going to see the results, I promise you. So we do something here where we stack them\nall together in a CXC format, so we have concentric, eccentric and concentric again, and the idea is to go to failure, your 10\nto 12 rep max failure on a Barbell Curl. Go through what we have as a circuit or a\ndrop set within our eccentric, which is another technique I'll show you, then come back to the concentric again, same\nexercise, use half the weight and try to double your reps. So for me here, I've got a Barbell Curl, 10\nto 12 rep max, this is the hard one, the heavy one. And we just go for it. Again, I've got a couple left in me. No repercussions here, It's going straight\ndown if I can't make it. And down. Now we rest thirty seconds and we go right\ninto our next leg of our set here, it's all one set. It's our eccentric drop set and we're going\nto do a Negative Chin Hang. So what we do is we get up inside a Chinup\nBar, and try to get ourselves up and away from the Bar. You don't come all the way up close because\nyou'll miss an opportunity to get your Bicep working. Get yourself away from the Bar a little bit\nso that now the Bicep has to do more of the work. So come up here, 40 seconds on, 20 seconds\noff, ok, up top. And we just try to slowly let ourselves come\ndown. I'm not performing an isometric, I'm trying\nto do a slow eccentric to the tune of 40 seconds down. This is one of the best techniques I used\nas I was trying to develop my arms. So after 40, shake them out, don't get too\ncomfortable, 20 seconds rest. When you get back up on the Bar again, 30\non and 30 off. So shake them out, again, I don't want to\nget back up here but it's doing the things you don't want to do that leads to the results\nthat you do want. So I'm back up here again now. Slowing down on the eccentric, fighting it. Oh Shit!! Now you get a little bit of extra rest, 30\nseconds. Then I finish off with my 20 on 40 off and\nthen 10 seconds on to wrap that up. It's definitely painful but again, these are\nthe kind of things that you want to do if you want to push yourself and force new Arm\ngrowth. So then I come back after I turned all that\nand I switch up the weight to where I go about half the weight here, I'm a little higher. Now the idea here, is to get another set now\ntrying to double the reps that I did or just go to as many as I can with that less weight. So we wrap it up. And for me here that's 95. Or at least the same number. I would have been down actually closer to\nabout 60 pounds or 55 pounds if I was doing a true half. But these are the ones I had closest to me. Again the idea is, cut the weight in half\nthrough as many reps as you can. But the key here is, you can definitely force\nnew Arm growth, there's a lot of opportunities to do so. Now you just don't go run out and do 10 sets\nof this and think that your Arms are going to grow overnight, sometimes doing more will\ngive you less. Doing Arm workout 2 to 3 times a week is the\nabsolute biggest mistake you can make. Take it from me, a guy that literally struggled\nmy entire childhood trying to build better Arms, that's not the right way to go. I tried it, it did nothing. Controlling your volume in the right way is\nhow you get bigger Arms. Doing everything I tell you to in the ULTIMATE\nARM Program will definitely get you bigger Arms. Guys it's finally here, the ULTIMATE ARM Program\navailable at ATHLEANX.COM. If you found this video helpful make sure\nyou leave your comments and thumbs up below. Whatever else you want to see, tell me about\nit guys, I'll make sure I bring it to you here on this channel in the days ahead. I've got to get back to work. See YA!"
}