{
    "id": "qk97w6ZmV90",
    "title": "The PERFECT Abs Workout (Sets and Reps Included)",
    "description": "The perfect abs workout should consist of exercises for not just the six pack or rectus abdominis but other important muscles of the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we continue our perfect workout series. This time, with one of the most requested:\nThe Perfect Ab Workout. Guys, you have to realize we're not just talking\nabout the rectus abdominus when we're talking about an ab workout. A lot of times people use the all-inclusive\nterm of 'abs' to mean much more than that. To mean the obliques, to mean the transverse\nabdominus, maybe even to mean the serratus because all these muscles matter, and they're\nall going to be included, and worked in our workout here. But how are we going to dictate what's so\nperfect? Guys, you know I've said it before; there's\nno such thing as one, singular, perfect workout. But we have to include some features to make\nit a really damn good one. When it comes to the abs, it's less about\nthe exercises – because we know we have, literally, hundreds, if not thousands of opportunities\nhere to pick from different exercises. It's more about making sure we hit the main\nfunction and make sure we hit the main sequence of how we want to train these muscles. I'll start with the sequence. When you're training your abs, because the\nbottom up movements tend to be heavier and harder because the weight of your legs is\nalways going to be more difficult than lifting your torso, you want to start with those when\nyou have the most energy. You're going to find if you save your bottom\nup movements toward the end you're not going to get as much out of them. So, we work in this particular sequence that's\ngoing to work its way all the way through both variations of this workout. That's right. I said 'both' because I'm going to include\na beginner and a more advanced version of these workouts because I know people are at\ndifferent levels that want to follow this. As a matter of fact, to make it really easy\nI'm going to include the use of just a band and a pullup bar. So even if you're doing this at home, you're\nnot going to have a hard time following along. Guys, when we talk about the function, the\nabs do a lot of different things. They don’t just do this. That's what a lot of people think they do. They think they just crunch. As a matter of fact, they control motion in\nthe opposite direction. They'll pull you back and control that. We want to make sure we make that function\nif we're going to have a complete workout. They also control motion in other directions. They prevent us from lateral movement if it's\nunnecessary or unwanted. And we can work exercises that can do that,\ntoo. They'll also prevent rotation. We can stay right here in the middle and have\nsomeone push our arms left or right and not have them go anywhere, and the main function\nthere is attributed to the abs and the obliques. We also know that they can control rotation. They can let it happen but happen under your\ncontrol. As a matter of fact, they can become main\ndrivers of rotation. Explosive, powerful drivers of rotation. Any workout that overlooks this aspect of\nit isn't doing its due diligence. So, we want to make sure that we include that\nfunction as well. We're going to include all the proper functions\nand hit them in the right sequence, and go through all the anatomy here, so you guys\nunderstand what it is you're trying to accomplish, and get a peak at the muscles that are doing\nthe job for you. When it comes to the anatomy part, sometimes\nit can be confusing. But it's all made so much easier when we do\nwhat we always do with the \"Perfect\" series, and that is breaking out the muscle markers. As you can see here, the six-pack muscle,\nthe rectus abdominus, is pretty identifiable. As a matter of fact, what I want you to look\nat is not just how easily noticeable it is, but what is the direction of the fibers? What is it attaching? It's going up and down, north and south, attaching\nthe ribcage down to the pelvis. It's driving the movement of flexion of our\nbody, top down or bottom up. We know we can take advantage of this motion,\nat the same time realizing that it's not the only thing that happens because all you've\ngot to do is look at another muscle here, like the obliques. If you look at the external obliques, which\nare the visible muscles above the internal obliques, you can see that the direction is\noriented at an angle. At an oblique angle. That's where they got the name from. The driver of this is that it has a different\nfunction. It's going to be really good at helping us\nto rotate and control rotation like I talked about. So, we're going to have opportunities to do\nthat if we follow the fibers, like always. The internal obliques, ironically, run at\nthe direct opposite direction. But it does the same thing. It controls rotation in another way, again,\nworking in concert with the obliques on the other side to produce some really magnificent\nthings when it comes to rotation. But then we can look at another muscle here. That's the transverse abdominus. This one runs more like a weight belt. Literally, around your waist. With the idea being this is driving stability. We want to take advantage of that because\nwe can do that on certain exercises better than others to really get more out of it. I'm going to show you how to do that. Finally, the forgotten core muscle, as I've\nalways eluded to, the serratus. The interdigitation – that's right, I said\n'interdigitation' – of the obliques with the serratus itself is there for a reason. There's a reason why they work together and\nprefer to work together. If we can do that, we will achieve a level\nof perfection that other workouts that don’t do this are missing. So, we kick this off with a bottom up movement. Remember, we talked about wanting to do them\nwhen we're stronger or have more energy. The bottom up movement will drive this. If you look at the beginner version here,\nwe start with the iso reverse crunch, with the main function being focused on that pelvis. In the beginning I talked about how the attachment\nof the ribcage to the pelvis means we're trying to bring the pelvis toward the ribcage, not\nget a swing. You don’t see me doing this. You don’t see me swinging the legs down\nand up, down and up. That becomes a hip flexor driven movement. If we just isolate the lifting of the pelvis,\nwe're going to do a better job of hitting the abs and making them do what they're supposed\nto be doing. Now, if you want to make this more difficult,\nwe'd look over here at the advanced side. This is a hanging X-Ray. The advantage of the hanging x-rays is twofold. Number one: it's more difficult because we\nhave to lift the weight of our legs, as opposed to having a bent leg. Number two: we're lifting them for a longer\nperiod of time than we are when we're laying down. The strength curve of these exercises are\ndifferent. More prolonged tension on the hanging raise\nthan we would be in any variation of a laying down raise. More importantly, another thing we have is\nthe accessory movement of being able to bring the legs together, to adduct the legs, stabilizing\nthe pelvis from the bottom up with the activation of the adductors. So, the x-rays allow us to do that. So, either way, if you're starting to build\nthe perfect beginner workout, or if you're starting to build the advanced workout, this\nis where you want to start. Moving onto the next exercise here, this is\nour bottom up rotation movement. If you look at the beginner version here,\nwe have something called the seated ab circle. This is an exercise where we get some upper\nbody stability because we can keep our hands in contact with the ground, which is perfect\nfor the beginners doing these workouts. We're going to make clockwise circles and\ncounterclockwise circles. If you want to make it more difficult, we\njust step it up a little bit. We do these hanging leg spirals. Again, this is like a hanging leg raise, which\nwe know is more difficult with the extended length of the legs, but we're going to add\na little bit of a hip twist at the end to get that rotation. In either case what I want you to notice is\nthe rotational stability function. We mentioned it in the beginning. We're not trying to prevent rotation here. As a matter of fact, we're not trying to do\nanything explosive with rotation, but we are trying to control the amount of rotation we\nhave. Once again, as we glimpse back, we start to\nsee this ab workout take shape. Whether it be in the beginner's form or the\nmore advanced form, we're on our way to hitting both the functions and the sequence we're\nafter to make this thing work its best. Sticking with the rotational theme now, we're\nmoving up to the obliques. Again, this is where I like to situate these\nmuscles when it comes to the entirety of the workout. If you train the obliques too late, once again,\nI think you wind up feeling too fatigued to do them well. So, what we want to do at the beginner level\nis perform this recliner elbow to knee tuck. The main thing to focus on here is the function. We're driving rotation here and we're driving\nit in the direction of the fibers of the obliques. Remembering that both the internal oblique\nand external oblique are going to work together to drive rotation in one direction and then\nthe opposite pair are going to drive rotation back in the other direction. As we move onto the more difficult version\nhere for the advanced, now we're looking at something called the tornado chop. This is where we're going to first utilize\nthe band with the hanging pullup bar. What we want to do here is add some resistance. Driving the band down into the side. Again, creating rotation. The idea being, no matter what you do for\nyour obliques, you'd better be twisting or moving in some direction left or right if\nyou really want to hit them the hardest. This is a great opportunity and as we build\nout these workouts, yet again, here's the beginner, here's the advanced. You can start to see this is really starting\nto take shape. Now we start to move on and transition away\nfrom all the bottom up driven movements into some midrange movement. We're still involving the bottom up, but we're\ncombining with some top down motion. You can see at the beginner level we're doing\nsomething called the opposite side elbow to knee. This is a variation of the plank. You guys know I'm not a huge fan of a plank\nwhen it comes to using it as an exercise that's more remedial. If we know we can hold a plank for 2, 3, 4\nminutes then you're not doing a hard-enough version of the plank. This is the first place I would have a beginner\nstep up because what we're doing here is challenging some rotational stability and that anti-extension\ncomponent. That function of the ab to prevent our low\nback from caving in when we do lift two points of contact off the ground. If you want to do this for the advanced, we're\ngoing to move the top down and the bottom up, but we're going to do them at the same\ntime, and we're going to add a little bit of a twist to it with this scissor V-up. Here, we're just trying to keep the leg scissor\ngoing and the V-up going at the same time. This is a little easier than it looks because\nthe top down motion is going to help shorten that lever arm of the legs, in relation to\nthe torso. But don’t be fooled. This is not easy. But it is doable. Especially at this point in the workout. As you see, once again, we keep building up\nthese workouts here. No matter which one you're following, this\nis a challenging workout, but it will be rewarding. I promise. Here is probably my favorite part of the workout. Some of my favorite exercise choices occur\nright here with top down rotation because most of the time they are top down driven\nwith our feet in contact with the ground. The first exercise here, if you're more of\na beginner, is going to work on that anti-rotation component and function of the abs. That is this oak tree step out. Here you want to get the band out in front\nof your body, extended as long as you can. You're going to step out as far as you can\nwithout letting any movement of the arms go back in the opposite direction. If you're strong enough, if you can prevent\nrotation, your arms wont budge. If you start to see that they drift back to\nthe anchor point every, single time, then you're not strong enough. You either need to lighten the resistance\nof the band or you need to step out a little bit less. Now, when we move to the more advanced side\nof it, this gives us a great opportunity t become more explosive. Here we can do something called the sledgehammer\nswing, which is a very explosive rotational, ground-based movement. Again, why I love these top down rotational\nmovements. You can see here; I'm driving a lot of rotation. Even from – you can see the pivoting of\nthe foot on the ground to help me get as much power and force as I can. This could easily be a med ball throw against\na wall where you can express full power because you're getting rid of the ball. As I've said, we're not limited to just these\nexercises. There are so many options, but if you understand\nthe mindset of why we selected what we did here, then the opportunity to add different\nexercises in here will be infinite. Now that we've fully transitioned to the top\ndown movements, we have an exercise in common. Differentiating only between the beginner\nand advanced version by the resistance of the band you're using. Before you think you have to run out and buy\na different band, you don’t. You just have to wrap it in a different way. If I wrap it through itself like this, we\nhave the single band that we're going to pull down on, as you see me doing here in the beginner\nversion. If I want to make this more difficult, all\nI have to do is wrap it over the bar, and then grab one portion of it in each hand,\nand I've effectively doubled the resistance by shortening the length of that band. But either way, there are two things I want\nyou to focus on in these top down movements. The first one is how we're doing it. You will not see me doing this. I'm not sitting back with my hip flexors. I'm not just allowing my pelvis to drop down\ntoward my heels. As a matter of fact, if I do this right my\npelvis should never go toward my heels. We want to do what the anatomy dictates. That is, pulling the ribcage down, and forward,\ntoward the pelvis. Just sitting back in there is just cheating\nyour way through every, single rep and you're not going to get anything out of it. The second thing you want to focus on is what's\nhappening here with the transverse abdominus. Remember I talked about that muscle in the\nbeginning. This a great opportunity and place to work\nit. Can we create some stability of the core bracing,\nif you will, before we do that? As a matter of fact, you'll find less tendency\nto want to drop down into that hip flexor cheat if you do this bracing first. To do that, you just want to flatten your\nstomach out. What would it feel like if you just walked\nyourself into an ocean full of ice-cold water? You'd want to pull in and flatten because\nof how cold it is. You want to do the same thing here. You flatten, and tighten, and use that internal\nweight belt to create the stability. Once it's there, then you pull down and forward,\ntoward the pelvis. We are constructing these perfect workouts\nside to side so you can jump back and forth, if need be, or follow on one track. Either way, you're on the right track. Finally, where most ab workouts would be over\nat this point, ours is not quite there yet. We've got one more exercise. We want to work the serratus. I talked about its involvement in integration\nwith the obliques and why we want to do it. As a matter of fact, it's part of our Holy\nTrinity when we talked about this in a previous video. The fact is, we can do this pretty easily. If you're a beginner I want you to do this\nexercise here called the plank push away. What we do is get ourselves in that plank\nposition – but not to do planks, to do something more – and that is, we're going to drive\nour forearms down into the ground. Get the shoulder blades to be separated. Start with them pinched together and separate\nthem as far as you can by protracting them, by pushing through the forearms into the floor. You'll feel this activate the muscles right\nthere in the serratus, that will create some stability of the shoulder blades as they relate\nto your entire ribcage. That is important. That is a function of core stability. So, we can work that here and at the same\ntime, help develop the muscles that are going to be clearly visible as they work together\nwith the obliques. If we want to make this more difficult, we\ncan do this plank punch out. As I punch the band out and away from my body,\nit's that extra push. Don’t just get it out in front of you. Push out in front, and then another 2\" or\n3\". You'll really feel the serratus doing the\nwork. There you have it, guys. The perfect ab workout in the books. Regardless of whether you're following the\nbeginner version you see here, or the advanced version I'm going to show you in a couple\nseconds, the fact of the matter is, you have to understand there is no such thing as 'perfect'. We know we can have a lot of other ab exercises\nthat could comprise this workout, but when you understand why you're doing what you're\ndoing, and how to do what you're doing you can come pretty damn close to perfect. This is my best attempt. If you're looking for programs where we do\nthe same thing, we try to put the science into the selection of what we do because we\nknow how much it matters, all our programs are based on that same principle. They're all available over at ATHLEANX.com. If you're looking for more of the perfect\nworkouts, they're all available for you on this channel. You've just got to make sure you've subscribed\nand turn on your notifications, so you never miss one. At the same time, anything you want me to\ncover, I'll do my best to do that for you. Just leave it down in the comments below and\nI'll try to do that in the days and weeks ahead. All right, I'll see you soon."
}