{
    "id": "r5qUK8c5Y9g",
    "title": "The REAL Reason Your Pecs Won&#39;t Grow",
    "description": "If you ever wondered what the real reason your pecs won't grow is, this is a must watch video. Here I'm going to take you through ...",
    "transcript": "So, you're having trouble and your chest just \nwon't grow. Well, I can relate because actually   I never really had the greatest chest, and even \nto this day, it's not the best, but it certainly   has come a long way. And the reason why is because \nI figured out what I was doing wrong, and I want   to share that reason with you here today. But I \ndo have to ask you a couple of questions and the   first one is, are you even bench pressing? And \nsee, this foundational exercise has to be a part   of your program if you want to give it a fair shot \nand give your chest the best chance to grow. And   if you haven't done the exercise consistently \nfor at least the last year and a half,   then you really can't answer that question just \nyet. Alternatively, how's your strength on the   exercise? Are you at least at one and a quarter \ntimes your body weight? Because if you aren't,   again, I would suggest that you start here, make \nsure you incorporate in this exercise. But if you   have and you're still not where you want to be, \nwell then, we need to ask the next question. \n  And that is, are you supplementing? And no, I \nm not talking about what you re putting in your   body, I m talking about what else are you doing \nin your chest workout. And no, I m not talking   about what you're putting in your body, I'm \ntalking about what else are you doing in your   chest workout? Because obviously the bench \npress alone is not cutting it. So, what we   need to do is learn how else we could train the \nchest for maximal effectiveness. And when you   re struggling to build bigger pecs, it's because \nyou just don't have good activation capabilities   of your chest. Oftentimes, it's the delts \nthat dominate the movements you're doing. \n  So, what I encourage you to do is find exercises \nthat can actually help you to adduct the arm   across the chest, not just towards \nmidline like we get with a bench   press or maybe even a dip or a pushup, but \nactually bring your arm across the chest.   Because when we can train the chest to become more \nactive, to engage it on all the exercises we do,   well that's when the growth starts to happen. \nIf we don't have access to a cable machine,   then we would do something like a \nFloor Fly with dumbbells. Again,   I like the Floor Fly because we don't run \ninto the same vulnerability to the shoulder   that we do with the unsupported Bench Fly. But \nif you're doing some version of these adduction   exercises on your chest still will grow well at \nthat time. We've got to look in the mirror. \n  What's wrong, Jesse? \nI'm looking in the mirror   and I don't really like what I see. \nOh, don't be hard on yourself. Look,   you re getting some gains there. But he could \nactually help us explain what's going on. So,   when you're talking about the inability \nto grow a bigger chest, at some point you   have to look at your genetics. Now before \nyou go and start hitting on mom and dad,   hear me out. What we're talking about is just \nsimply how much chest muscle can you grow?   Because no matter how much Jesse tries, or myself, \nwe're never going to look like Larry Wheels.   Kind of think of it, not many people look like \nLarry Wheels. But we have to look at the skeleton   to understand why that is different. Skeletons are \ngoing to have different genetic potential to add   muscle. If your clavicles are only this long, \nyou're not going to find this type of skeleton   in a guy like Larry Wheels because his are likely \nto be a lot broader, a lot longer. And as they get   longer, you have a lot more room for chest muscle \nto attach to. So, when you have a smaller frame   and a smaller skeleton, you're genetically going \nto be limited to the overall size of your chest.   But before you use that as an excuse \nunderstand that every single chest can   look good if properly trained. Now, granted, \nit may not be as ridiculously full as Larry's,   but you can still optimize what you have a good \nlower pec line, good middle chest definition,   and of course that upper chest ridge. But in \norder to do this, we're going to have some   things that you're going to want to make sure \nyou're definitely doing in your workouts.\n  And it starts with just simply accepting the \nfact that, yeah, maybe you have a little bit of   genetically compromised pecs here, but it doesn't \nmean there's nothing that you can do. As a matter   of fact, if you learn to compartmentalize your \ntraining, well, that's where the gains come true.   Because you can look back at that bench press and \njust let it be a strength exercise. All right,   we talked about how maybe the adults were \nhelping you to push that bar off your chest   and gave you a good strength totals, but it still \nwasn't growing your chest. So instead, that's   what you're doing on those other exercises that's \ngoing to make the big difference. And what I want   you to do is simply change what you do, lighten \nthe weights, slow down the pace and learn to let   the muscle you're actually trying to grow do the \nwork. And one of my favorite ways to do that is   right here at a bench press. If I just activate \nthe chest at the beginning of every repetition,   it makes a difference. Instead of just having \nthe goal of being to get the dumbbells out over   my chest. I want to make sure my chest is what \ninitiates the upper portion of the rep every   single time. You can see that by pausing at the \nbottom of the rep, it gives me that opportunity to   focus just a little bit on the chest, initiating \nthe rep and keeping those shoulders back.\n  I could do the same thing with a dip. We \nknow the dip is a great lower chest builder,   but how are you pushing up? Are you rounding \nyour shoulders on every rep? Not only is that   dangerous, but it's actually again letting the \nshoulders do all the work. Instead, remember here   the goal is making the chest do all the work. And \nwe do that by slowing down the pace and initiating   with the chest out of the bottom of every single \nrep of the dip. And one of my favorite ways to   make the pecs take over if you have access, is \nwith a Cable Bench Press. And again, you're not   forgoing the regular bench press. That's a solid \nstaple of your workout because you're using it to   build your strength. But this exercise is being \nused to activate the pecs, and this is amazing   at doing that because it changes the angle of \npush instead of pushing straight up and down as   you would with either a barbell or dumbbells, that \nslight outward orientation of the cable's forces   your pecs to activate more again towards that \nabduction line of resistance. That makes this   much more effective at instantly engaging \nthat muscle that you can't grow right now. \n  And then finally, if you have no access to \nequipment, you still want to see the benefits here   a pushup. And the best way to do this, guys again \nslow down the cadence. I can cut down whatever rep   count you're doing right now by simply making \nyou go slower. But the real key lies in getting   that sternum up on every repetition. Feel as if \nyou're lifting it up as you squeeze your body   off the floor, rather than just simply pushing \nyourself off the floor. When you change the   way you do the exercises you're doing, guys. The \neffect is entirely different, and when the effect   is changed and the activation of the pecs is \nincreased, that's where the real gains start. \n  So, if you trust in the process guys and follow \nthe steps I laid out here, I promise you your   days of pec stubbornness are going to be long gone \nnow. If it's your lower chest, that's giving you a   problem. You know, some of that sagging is you're \ngoing to want to make sure you watch this video   here. Our lower test solution is your upper chest \nthat just won't stand at attention. You're going   to want to watch the upper chest solution here. \nAnd if you're looking for a full program, guys,   they're all available at athleanx.com. If you \nhaven't done so, make sure you click Subscribe   and turn on your notifications so you never miss \na new video when we put one out. See you soon."
}