{
    "id": "r7Arz53_f3c",
    "title": "How to Fix Tennis Elbow (PERMANENTLY!)",
    "description": "If you have tennis elbow, or lateral epicondylitis as it is officially known, you know one thing - it hurts and you'd likely do anything ...",
    "transcript": "If you've got a throbbing pain that \nyou can literally put your finger on   right there, that feels like someone's stabbing \nyou right in the elbow. Guess what? You're on the   right video and the right place because we're \ngoing to get rid of that once and for all. \n  What s up guys, Jeff Cavaliere, Athleanx.com. \nSo, if you ve got that pain right there,   Tennis Elbow. I don't care if you don't play \ntennis because most people that have this actually   don't. What can you do about it? Well, I made \na video a while back where I discussed what the   actual cause of tennis elbow was, and it wasn't \nactually your elbow just getting blamed for it.   It's coming from either mechanics of the shoulder \nand the shoulder blade that aren't in place,   or maybe even down below that at the hip or \neven somewhere distal here in the wrist that's   not functioning the way it should that causes \nthis elbow to bear the brunt of the issue. \n  Well, as I mentioned before, most \npeople get this not from tennis,   although it came from the fact that when people \ndid the backhand, they would experience that pain.   But we're talking about what's \nhappening right here in the gym   because our problem is oftentimes caused right \nhere in the gym, and I can almost point my finger   at one particular exercise that does this. \nIt s the side lateral raise. I love the side   lateral raise. I program the side of lateral \nraise in almost every single program I do.\n  However, there are some key points that you \nwant to make sure that you're focusing on   to do it right, so let me show you what we're \ntalking about. When we do that side lateral raise   one of the things, I preach so many times is \nthat this zone right about here for most people,   it's sort of the dead minute zone, right? Because \nwhat happens in this range is we try to take a   weight that's basically appropriate for what \nwe're trying to accomplish, which is a raise   on the dumbbell out to the side. But it exceeds \nthe ability of these extensor tendons to manage   that way, especially as the arm gets longer and \nlonger and held out further from our body. \n  Whereas down here, it's really where we \nwant to focus your efforts, the light side   of the rack. But when you do that, as I pointed \nout, you use these intensity techniques that   take the light weight or the weight that feels \nmaybe a little too light to you right now, and   it ups the overall intensity of the effort you're \ndoing so you still get the gains you're seeking.   Things like one and a half reps, right? Slow \nmotion reps, that's where you want to live. I   will also show that when you go down this end of \nthe rack, you actually can handle that as well.   But there's ways that we do that with a cheat \nlateral that actually is almost pointing towards   that ultimate solution for tennis elbow because \nwe're getting some other things contributing.\n  You can see that right here. Hips, lower body, \nother things contributing. So, if I were to take   a weight that was too heavy for me to handle as \nI go out here, I'm basically asking for isometric   contraction here of the wrist to hold that weight \nfrom falling down, right? We could see it could go   into a really light weight so I could demonstrate \neven better. Right here, I'm preventing this from   falling so that isometric contraction is wholly \nresponsible from the extensive here, the risk that   all bundle up and attach that that one point that \nends up hurting you. And it doesn't have to happen   over the course of many, many, many, many \nworkouts. You can exceed the capacity of these   extenders, a one single rep which can cause this \nproblem. So, it's not necessarily an overuse more   of an over taxation of these muscles that can't \nhandle that. So, what I've told you before to do   is turn the arm up a bit, right? No longer poor in \nthe pitchers but turn the arm up a little bit. And   we talked about the benefits of what that does \nfor the shoulder by creating more room and less   impingement. But what it also does is it takes the \nextensors from being what are primarily preventing   that dumbbell from falling down and it now turns \nit a little bit like this, which allows more of   the radial deviations of the wrist this way to \ntake off some of that load. That change alone   will help most people who are doing the exercise \nwho feel like it's causing pain in their elbow.\n  But again, let's say you already got the problem. \nYou've already got the pain. How do we solve that?   That's where we interestingly go back when we \nlook at something like the cheat lateral for   the true solution. So here it is. Instead, we want \nto grab this. You can use a dumbbell if you want,   but a kettlebell works perfectly here. And the \nexercise that you want to start incorporating   three times a week. If you already have a \nraging case of Tennis Elbow, believe it or not,   is a kettlebell swing. And why this works is \nbecause we need to start training the body to   work as the kinetic chain that's intended to be. \nMeaning that this spot here that was overloaded,   that was thrown the responsibility of maintaining \na weight that it couldn't handle because the   rest of the body wasn't participating. \nWe need to start to reintroduce the rest of the   body to that move. And the best way to do it is to \ntake it from the side and bring it to the front,   which still causes the same stress here at that \npoint of the elbow and give it the support that   it needs with the other muscles. So, what the \nkettlebell swing does is it loads us into hip   flexion, right? We're getting into this hip \nflexion position and then allowing the extension   of the hips to assist the weight as it comes up, \nkeeping the isometric control here, but again,   offloading this and giving it some additional \nsupport. So if we can continue to do something   to work on getting over the injury \nrather than putting everything away,   packing up your gym bag, going home and \nstaying home and hoping it gets better.   Or worse, rubbing on it, icing, ultrasounding \nit, throwing a brace on it. Everything   I said not to do in that last video. \nThat's not going to be a long-term solution.   That's why you keep going back and getting this \nproblem over and over and over again because   you're never working on actually strengthening the \nmuscles that need strengthening and incorporating   the entire kinetic chain. So, what we do is \nwe start with two hands on the kettlebell,   right? In this position here. You can see that \nwe have to have this neutral wrist position,   which requires activation of the extension of the \nforearm. So, if I'm in here and I perform a swing   where I load up and here load up posteriorly, \nyou can see at the top, it's driven by the hips.   But the arm is staying in this extended position \nand the wrist is staying in this extended   position, which is creating that stress. But \nthe good form of stress to that extensor tendon   wad up here and the elbow and maintaining the \nmechanics in the support from below. So I do   swings, I do them three times a week for, let's \nsay, 50 swings at a time, increasing it to 75,   100 swings, gradually increasing the \nload that you use each time you do it,   or at least the volume of the swings that you \ndo and then gradually increasing the load.\n  But one thing you can do without \nhaving to actually increase the   load of the kettlebell you're using is then \nswitch to a single arm version of it. So,   the same thing here load through the hips and \npop up. Again, even if you have a raging case   right now of a lateral epicondylitis or Tennis \nElbow, you'll find that that doesn't really   stress that. It gets blood to the area, it's doing \nmuch more for you in terms of a long-term solution   than doing any of that rubbing or throwing \na brace on it a short term Band-Aid.\n  The next thing you could do comes from looking \ntowards that cheat lateral again. Why are people   able to handle loads, even if again, you \nhave a raging case of Tennis Elbow right now,   you could likely do a cheat lateral with heavier \nweight far more than you could do strict lateral   with that middle of the road weight, like I \ntalked about here. That's because you're getting   the assistance of the lower body in terms of \nloading and assisting that weight on the way up,   supporting those extenders, not leaving them \nout on an island. So, if we know that we can   get help by rotating and loading into a \nhip, you could also do an offset version   of a kettlebell swing. So, I drop it down \nto the side and I come up like that.\n  So now I'm loading these hips to be able to \ndrive up through internal rotation and then   forcibly into external rotation here at the \ntop. The fact is, how you perform your swing   is going to be up to you. Again, to handed \nto start single arm down the middle,   single arm off to the side. But the more you \nstart to incorporate kettlebell swings into your   overall routine, the faster you're going to get \nto not only a permanent solution to this problem,   but actually some immediate relief. Because these \nmuscles need to still be worked, they just have   to be worth the right way, and they need to get \nthe support that they're looking for in need in   order to function the right way without pain. \nIf you guys are looking for programs where we put   the science back in the strength, we put the \nthought into how we program the things we do.   Make sure you head over to Athleanx.com \nand check out our plans. In the meantime,   to find the video helpful, please leave a \ncomment. Let me know how incorporating the swings   have helped you to finally get rid of this \npain once and for all, despite all the other   things you've tried. I really want to make sure \nI hear from you below. If you haven't done so,   make sure you click Subscribe \nand turn on your notifications,   so you never miss a video when we put one \nout. All right, guys, see you soon."
}