{
    "id": "RMBLUjJblM4",
    "title": "Stop Doing Abs Like This! (SAVE A FRIEND)",
    "description": "When it comes to doing abs, people every day are making some big ab workout mistakes that are making it take longer to see ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to show you some things I\nwant you to stop doing when you're training your abs. As a matter of fact, this is one of them. If you're looking at this saying, \"I don’t\neven know what's wrong with that\", then that's even more of a reason you're going to want\nto stay tuned here and watch what I'm going to show you. Now, these kinds of mistakes are being made\nacross every single gym, every day. I guarantee you're going to see people doing\nthese things. The good thing is, after you watch this video\nyou won't be one of them. As a matter of fact, you're going to become\nthe disseminator of the good information so you can help out a friend. Let's get to saving your ass right now. We're going to start with the first thing\nyou need to stop. All right, the first thing you're going to\nwant to make sure you're not doing is speeding through your reps. Guys, I'm sure you've seen people do repetitions\nlike this in the gym all the time. Some people would say that they have to do\nthem this fast to prevent their body from swinging during, let's say, a hanging leg\nraise. That's not true. The thing is, they're putting all the effort\neverywhere, but on their abs. All I care about is high quality repetitions. If you accumulate more high-quality repetitions,\nthen the number of repetitions you do will not matter. When it comes to your abs you want to make\nsure that the focus is coming from and deriving from the area that you're trying to train. So, when you see me doing a hanging leg raise\nit doesn’t look like this. It looks more like this. This is what we're trying to make the abs\ndo the work. As I come up slow, I'm really focused on curling\nthe pelvis under, flexing the trunk, making the abs do the work. I can take it down to the floor as well in\nmore of a beginner exercise. We could still screw these up. Guys pump their way through these like they're\ngoing out of style. I don’t care how fast you go, I only care\nabout accumulating one good rep at a time. I promise, if you're start to do the same\nthing your results will be significantly better. This next one up is one that might have tripped\na few of you up in the beginning of the video. That is: do you know what's wrong with this\nexercise? It's a crunch. I don’t hate the crunch. There's a purpose for doing the crunch. If you do it deliberately and slowly, yeah,\nyou're going to get better results from it. But there's something else wrong with this. There's an abbreviated range of motion. This is not a full range of motion repetition. For some reason, when it comes to ab training,\nwe fall in love with cutting short the repetition distance. You can go back to the hanging leg raise. Go back and look. What do people normally do? They just pump their legs in that mid-range. They don’t take it through that full range\nof motion. So, get your legs all the way down. Go through that full trunk curl. Just like I'm doing here. Do the same thing when you're doing your crunches\non the ground. Go all the way to the ground. Let the abs actually extend, or at least get\nto neutral with your back on the floor. Don’t just stay up in that crunch position. There is so little range of motion as it is\nwith the crunch. When you take half of it away, you're really\nminimizing the type of results you can see from your training. So, do me a favor, guys. Start to elongate and be more conscious of\nthe full range of motion on all ab exercises and I promise, you're going to see better\nresults. This next one is one that I've covered on\nthe channel before, but it bears repeating because it's very important. Especially to the type of look you'll see\nfrom your abdominals if you do this wrong. That is screwing up your breathing. We're not just rushing through repetitions\nand abbreviating them to get them done as quickly as possible. We're probably also holding our breath or\nbreathing entirely backward. You see, when you do an ab exercise like this\nfloor crunch you don’t want to do what I'm doing here. You don’t want to be breathing out and sticking\nout your belly at the same time. You do want to exhale as you come up into\na repetition. We know that. But as you exhale you should be trying to\nbring your belly down and in. You do that by activating the muscle called\nthe transverse abdominus. Guys, we know it's the muscle that runs around\nour waist this way and acts to cinch down. Sort of like the stomach-vacuum idea. Pulling it down and flat. As you engage in doing a repetition you want\nto feel as if you can bring your stomach down and flat while you breathe out. So, while it's flattening. You don’t want to breathe out and blow out\nat the same time. And blow like that. A lot of guys will do that. All that's doing is teaching poor muscular\ncontrol in the abdominal area. So, you don’t want that. You want to make sure in every, single repetition\nof every exercise you're doing, when you breathe, aim to get that cinching down or tightening\neffect of the transverse as you exhale. I promise you, again, not only will you have\na better execution of the exercise, but a better look and end result of all the repetitions\nyou're accumulating. This next one gets really under my skin because\nI hear it far too often. A lot of people who are trying to train their\nabs will do so but skip their obliques because they've heard that training their obliques\nis going to make them blocky. Guys, please stop doing that. As a matter of fact, if you do one thing,\nmake sure you do train your obliques. I've shown you this demonstration before. Your obliques, when covered with fat, will\ntend to look blocky. But when your obliques, at a lower body fat\nlevel, are revealed they do an incredible job at tapering the entire waistline down,\ngiving you that v-cut look that a lot of guys will talk about wanting. So, the idea is this: you've got to start\ntraining your obliques. More importantly, you've got to be very conscious\nof how you activate them. It goes back to the original point in this\nvideo. That's being aware of how you're performing\nevery, single repetition you do. Don’t just swing around thinking \"Okay,\nI'm twisting, so I'm getting my obliques.\" Don’t just do these bicycle crunches and\nthink you're getting your obliques because people tell you they're good because you're\ntwisting. Be more conscious of what you do. If you do something more advanced like this,\nremember, it's not about speed and just trying to execute this rotation from the obliques. They're initiating it. You can literally see them starting this movement\nevery, single time I go from right to left, and right to left. I want you guys to become more aware of that. But overall, big picture, I don’t care what\noblique exercises you're doing. Make sure you're doing them. I promise you guys, the end result is going\nto be much better if you do. Last, but not least, when it comes to what\nyou're doing for your abs, and what you shouldn't be doing, one thing I always want you to remember\nis to include at least a little bit of calf work and some jaw work. That's right. Some calf work. You see, the next time you're thinking about\npulling off into a McDonald's parking lot you want to slam your damn foot down on the\ngas pedal, activate those calves, and drive past as fast as you possibly can. The next time you think about eating something\nyou know you shouldn't, you want to do three steps to keep your damn mouth shut so you\ndon’t. Guys, nutrition is that critical. I promise you. The results of your hard work will never be\nseen unless you commit to eating better behind the plate and what you put in your mouth. It's very, very critical and I can't underscore\nthat enough. So when you think about the type of ab exercises,\nor even all the tips I've just shown you here, and what you're supposed to do; they'll become\ninfinitely more effective if you can commit to the thing that I know is the most challenging. That is becoming more aware of what you eat. Guys, it doesn’t have to be impossible. You can literally eat things you like and\nI'm encouraging you to do that because there's no way you're going to stick to this long\nterm if you don’t find a plan that allows you to eat the way you like. As a matter of fact, we have plans like that\nall over at ATHLEANX.com, included in all our programs. I make it simple, I make it realistic, I make\nit something you can actually follow. Not just for a few days, but you can follow\nit for life. Guys, the same way I eat now for years, and\nyears, and years to stay at the body fat levels I do, without any suffering and without any\ndeprivation. It wont last long term. All those are over at ATHLEANX.com. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know if there's anything else you want\nme to cover and I'll do my best to do that for you. If you haven't already, please subscribe and\nturn on your notifications so you never miss a video when we put one out. All right, guys. I'll see you again soon."
}