{
    "id": "RQF4ERQdU88",
    "title": "Underwater Abs Workout (BETTER AB WORKOUT!)",
    "description": "Get six pack abs by training like an athlete here… http://athleanx.com/x/six-pack-abs-start-here Getting someone to do their abs ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. It's that time of the year; summertime. Where you can actually get out and get in\nthe pool and maybe get your best ab workout ever. You see, under water ab training provides\nyou with a unique opportunity to train your abs in a way that you're not likely training\nthem at the moment, and it gives you the conveniences of not having to have equipment around you\nin order to do it. Here's what we're talking about: when you're\nin the water, as you can see me here, you can actually do a lot of different movements\nto train you abs and it goes back to what we talk about all the time when it comes to\nab training. That is the importance of rotation. You cannot fully train your abs if you're\nnot working on A) producing rotation; B) controlling rotation; and C) preventing rotation. The good thing about water training is that\nyou're actually creating force in both directions on the same rep. so as you see me move here from left to right,\nyou can see that I'm creating resistance become I'm overcoming the force of the water, or\nthe drag of the water as I move across. Now, more importantly, because I've done that\nI've created momentum of the water in that direction. So if I immediately move back in the other\ndirection, I've now got to overcome that momentum of the water. So it's actually an increased force on the\nway back. That's not something we actually have the\nopportunity to do when we're training on land, unless we get more of an elaborate setup. Back to these exercises, I don’t just have\nto do a left to right plane of motion here. I can use diagonals and go from top, upper\ntop, down to lower bottom. I can move myself in those directions in crisscross\npatterns. I can move in a combination of these. The idea is that using your own arms here\nas resistance creates an opportunity to train your abs in both movements, or both directions\nsimultaneously. Now, if you're on land – and I get it, you\ndon’t want to train under the water, or you don’t really feel like getting wet – no\nproblem. You can come into the gym and you could try\nto recreate this. Keep in mind if you use just one band you're\nnot going to get that resistance in the direction back. You can get eccentric control, but you're\nnot going to get this concentric that you have to overcome unless you do what I'm showing\nyou here, which is a little bit more of an elaborate setup, which will require two bands\nanchored on each side of you. You rotate to one direction – obviously\nyou're using the resistance of the band on that opposite side – and then you rotate\nback in the other direction and you're using the resistance of the other band. Now, keep in mind one last thing when it comes\nto this type of training. If you're training on land, if you're using\na cable machine, you're going to have to increase the weight to increase the resistance over\ntime. If you're using bands you're going to have\nto increase the thickness here of the tubing to increase the resistance over time. If you're in water, all you have to do is\nincrease the surface area of whatever you are moving through the water. So I don’t have to just use my arms, I can\nuse something bigger. I have a kick board here, or a paddleboard,\nthat could move through the water. That's going to make that a lot harder. You can see me doing that right here. So no matter how you decide to train your\nabs, guys, remember the important thing is making sure you have a hefty dose of rotational\nwork built in. It's not just producing the motion of rotation,\nbut it's also controlling and at times preventing it as well. I cover all these things in our ATHLEANX 6-Pack\nPromise app. It's actually the top rated ab workout app\non the market. It's available for both iPhone and Android. You can get it in the links below. In the meantime, if you're looking for a complete,\nstep-by-step plan, you're not just getting abs, but you're building the entire athletic\nbody; head to ATHLEANX.com and get our ATHLEANX training system. If you guys found this video helpful make\nsure you leave your comments and thumbs up below and I'll be back here again in just\na few days with another video for you. See you!"
}