{
    "id": "RUkfBaDvBUg",
    "title": "The Shoulder Workout “Master Tip” (EVERY EXERCISE!)",
    "description": "If I could give you one tip for your shoulder workout that would improve the results you see on every shoulder exercise you do, this ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to show you how to improve\nall your shoulder workouts by improving every, single shoulder exercise you do. I'm unleashing the master tip. The one tip that can make every, single one\nof your shoulder exercises more effective, and therefore improve the results that you're\nseeing from your shoulder workouts. Here's what you have to do. We're going to start with a demonstration. I want to start with a side lateral raise\nbecause it's the easiest place to see this. If you take your arm and you raise it up to\nyour side like this, just lift your arm out to your side as if you just did a dumbbell\nraise. Now take your other hand and reach up, and\ngrab your trap. What do you feel? You probably should feel some tension here,\nin this trap, in this position. But you shouldn't because we naturally, just\nas we did in our chest workout master tip, we let the upper trap become too active in\neverything we do, and it's pulling away the possible results you should be seeing from\nthe muscle you're trying to target. So if we're looking here, and we grab here\n– that's what you do – do me a favor from here. Now try to depress this shoulder. Try to get the trap out of it. Try not to shrug. You should see a drop like that. At least you should be capable of a drop like\nthat. If you are, then you're making the mistake. So what you want to do is see if you can do\nthat now on every, single exercise. And you can! I don’t care if it's pressing, I don’t\ncare if it's front raises, I don’t care if it's rear lateral raises, I don’t care\nif it's for your side delt. If you look at the problem here you can see\nit up close, first and foremost. If I were to go and raise my arm up you can\nsee the contribution of the delt. Yes, it's working to pull my arm up, but the\ndelt, the upper trap here is also working to pull my arm up. So if I don’t control that, this is the\nlevel of activation that I get from the middle delt. But if I actively depress my arms, I try to\npull my shoulder blades down, and now I raise, you can see how much more the side delt has\nto work. Yes, you might have to drop the weight and\ndrop the ego too in order to be able to execute this. But that's going to lead to much better gains\nin your shoulders. I did a whole video on how lighter weights\n– I'll link it right here – lighter weights with shoulders is going to increase the hypertrophy\nand the gains you see in your shoulders because it's one of those muscle groups that tends\nto get dwarfed by the contributing muscles around it. It's right here, next to the chest. The chest likes to contribute when we're doing\nshoulder pressing exercises. The triceps like to contribute when we're\ndoing shoulder pressing exercises. It never really gets an opportunity unless\nyou force the opportunity for it to get more isolated tension, and we can do that by getting\nthat upper back out of it. So here are some more examples. If I do the side lateral raise, I'll go back\nto this one. You actively start by pushing down and depressing\nthose shoulder blades, and then reaching out. You almost want to feel as if you're reaching\nout, and under a fence. Never allow the trap to sneak back up, even\nif you start to get fatigued. That just means you might have to lower the\nweight a little bit. I've even showed you before. If you want to add some more tension here\nyou can stop halfway down and then reestablish, and then go back up again in one and a half\nrep style to really drill home the tension on your middle delt. The next thing you could do is you could bring\nthe dumbbells around to the front. You can do the same thing here. If you want that front delt to work then you'd\nbetter make sure you're getting the other muscle groups out of it. So again, actively push your shoulders down\nand then lift. It's almost like a scooping motion. You should feel it go down first, and then\nscoop up. Down, and scoop up, keeping that downward\ntension as you go up. You're not going to stop the rotation of the\nscapula, which is going to allow the arm to raise up, but it's going to stop the contribution,\nand the over-activity of the upper traps, and the levator that are pulling your shoulders\nup, and cheating the front delt. We can do the same thing here, as you've seen\nme doing before. The rear delt. Here you just want to push your arms back\ntoward your butt. You're sliding them down. Same thing, depressing them, but sliding them\nback down because your torso is now parallel to the floor. Now, can you do this on presses? You actually can and it makes it a hell of\na lot more effective for targeting the delt. Yeah, we press, and we press with no mind\ntoward 'is this actually even working our delts?' We just know that we're getting the weight\nup, and over our heads. That's fine if you want to just develop big\nshoulders because we need to do an element of heavy lifting to just develop the overall\nstrength, but what you're left with is just a big mass of a shoulder, but without the\ndefinition, and the roundedness that you're looking for in that delt for a little bit\nmore of an aesthetic look. So you have to drop the weight here and focus\non how you press. So the same thing here. I can press, as you watch me here. I can press with my arms up, and overhead,\nbut what I'm doing here is, I'm getting the same over activity of the upper traps as I\ndo that. Instead what I want to do is, I want to pull\ndown, and let the arms go for the ride. So when I let that happen, now the delts are\ndoing a lot more of the work to have to do the pressing. What you want to do here is, not just look\nat keeping down and pressing, but then let the biceps lead the way. So if I keep this down and pressed, and I\nbring the biceps up, toward my ears; now we know that we're doing more of the pressing\nhere through the delt, and getting as full of a contraction as we can. But the key is still the same. You've got to get down before you go up. I don’t care what movement that is. It's down before it goes up. Yes, it's the same master tip as we have for\nthe chest, and all the exercises for the chest. But there's a reason for that. Like I said, these muscles are all in the\nsame area. They're all trying to help us push. So they're all trying to find the same cheat. The same cheat is doing this, and we don’t\nwant that to happen. Guys, if you've found this video helpful make\nsure you leave your comments and thumbs up below. Let me know what you want me to cover here\nin future videos. Of course, I'll cover more of the master tip\nseries. Also, if you're looking for a way to get more\nout of every, single workout you do by doing every, single exercise you do better, not\nleaving really untapped potential on the exercises by making small, little mistakes; head to\nATHLEANX.com. Click on the link below this video and use\nour program selector to find whichever program it is that meets your goals. We're going to put the science back in strength\nin all of those programs. Once you determine what it is you're trying\nto accomplish you can be assured that you're going to be getting all the best tips that\nI have to make sure you get the best games ever. All right, guys. I'll be back here again in just a couple days. See you."
}