{
    "id": "RwwcNfsgTXg",
    "title": "I Lost 1” On My Arms By NOT Doing This ONE Exercise!",
    "description": "In the past year, I've lost an inch on my arm size. The good news is, I know how it happened and I can make sure it doesn't ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I'm going to talk about an issue that\n– I can hear it already – some people are like \"If this isn't body dysmorphia, I\ndon’t know what is\". But honestly, there's a real valuable lesson\nin here. I did lose some arm size over the course of\nthe last year. I wasn't quite sure of what I was doing differently\nthat might have led to it until I started to look back a bit. Specifically, into the timing of this and\nwhen this might have happened. Bringing it back a little further in history,\nI had a labrum tear in my right shoulder that's been well documented here. Me and Carlos Beltran from the New York Mets,\nAll-Star Outfielder. He made a bet with me that I couldn’t throw\na ball from right field to third base on the fly. I thought it was easy because it looked a\nlot closer than it was and my labrum knew the opposite. I literally felt it rip as I tried to throw\nit and lose my bet. But I dealt with that for a very long period\nof time. That was back in 2008. I've worked around that to the point where\nmy shoulder now feels great, but my left arm, as of last year – my two boys, my twin sons\n– were running around. One came this way and one came that way. I started to fall and I didn't want to land\non them so I awkwardly reached out, landed on my arm, and I could feel that same, recognizable\nburning, searing pain inside my shoulder where I knew I had hurt my labrum on my left side. So, the last year I've been dealing with it\nand training around it. As I always tell you guys, you want to make\nsure you train around your injuries and don't just stop training because there are always\nthings you can do. But the things you can't do, the things that\nare very aggravating, are the things that you need to pull back on because you're just\ngoing to continue to aggravate the problem. And therein lies the issue. What was I doing differently in my training\nthat was pulling me away from the exercises that were more aggravating, but at the same\ntime, more rewarding? We know since stopping it I've lost this size. We have to look at the arms to figure out\nwhat's going on anatomically. We know when we talk about arm size, if you're\nlooking for a place where you're lacking in size you should go to your triceps because\nthere's more mass in your triceps than there is in your biceps. Some people have said '2/3 of your arm'. Specifically, I've made videos on this, too. 2/3 of the 2/3 should be dedicated toward\nyour longhead because that is going to occupy the majority of the size of your arm. The longhead is the meatier area on the inside\nhere, closest to your body. What we want to do is see what we could to\nimpact that. We know that training the longhead you've\ngot two things you need to focus on. Number one: it has an attachment that's different\nthan the other two heads of the triceps and it has an attachment here on the scapula. So, it starts here and then it crosses the\nelbow as the other heads of the triceps do as well. So, to get this to be fully trained you want\nto be able to A) bring the attachment here closer. And you do that by bringing the arm into extension. I've brought them closer to each other. But also, you want to be able to have some\nseparation and stretch. So, I need exercises that do this. I'm sure you've heard about that. It brings it up overhead. You can see if I take the triceps from here\nand attach it down here, and bring it up, there's that stretch being applied to that\nband that's absent from the other two heads of the triceps. So, I need to get my arm up. Well, that's the problem. What do you think is a problematic position\nfor a labrum? When you bring your arm up overhead, you're\nclosing down the joint space in here and creating some issues with labrum problems, if you have\nexisting labrum problems. So, I've gone on record saying that my most\neffective exercise I built my arms up with were the bicep cheat curl and then this right\nhere; a tricep extension done with an easy curl bar. So, when we get with the easy curl, obviously\nwe can load it up a bit. But I want you to take a look at what it does\nanatomically. First of all, the positioning here when you\ngrab the bar, your arms are going to internally rotate a bit. Your shoulders internally rotate to get into\nthis overhand position. Then, to put the stretch on the longhead you've\ngot to get your arms bent – elbows bent – and then back, and down. We've got to get as much elevation as we can\nhere of the humerus as we just demonstrated up over on the skeleton. So, when I'm here, now I come up and I extend. Now, you don’t want to take this all the\nway to the top. I made a video a long time ago where we pointed\nout how our friend Dick here, he does it this way. But you don’t want to be a 'Dick', right? So, we want to make sure we do it right. We keep it back here. You can see Dick did it like this. So, don’t be a 'Dick'. We haven't used Dick in a while because we\nhave Jesse now, so we don’t really need him. But instead what we do is- JESSE: What the hell does that mean? JEFF: We keep the arms angled backward. So as long as they're angled backward there's\nstill work being done by the triceps here, up, and extend. But this is the best way to hit the longhead\nof the triceps and get it on that big stretch. Down, stretch, up. Down, stretch, up. So, guess what \nI haven't been doing for the last year because all that extra motion – back, up here – is\nuncomfortable for my shoulder? But if your shoulders are healthy it doesn’t\nmean you'd want to avoid that. I think it shows the significance this exercise\nplays in adding arm size to that 2/3 of the triceps to that 2/3 of the overall arm size. It's significant. So, you don’t want to do that. Now, if I had to look back and make a modification\nwhat I would have done was switched to dumbbells and changed my grip. This is why. If I take dumbbells, number one, I have more\nshoulder freedom anyway because I'm not locked in on a bar. But number two, what I want to do is, instead\nof being overhand – because we know internal rotation of the shoulder happens when I do\nthat – I would just go and turn this way. It's not just forearm supination because I\ncould supinate my forearms and do nothing with my shoulders. But what tends to happen is, when I supinate\nmy forearms, I can turn my shoulders into external rotation as well. So I have an underhand grip. Now I come back and do the exercise and get\nthe same benefit here. But you have to sacrifice the amount of weight\nyou're using because with this underhand grip, externally rotated at the shoulder you don’t\nhave as much strength as you do in the overhand, internally rotated position. So, would it have been a perfect compromise? No, because I would have had to drop the weight\nthat I was using. So overall, the amount of stress I had on\nthe triceps is still going to be decreased. The fact is, I wanted to show you how this\nhas that significant of an impact on the overall size of your arms and through my exclusion\nof it, because of training around the discomfort, I learned that lesson. Now my shoulders are feeling good because\nI did the right thing, because I took the smart steps to allow it to heal. Now that I'm feeling good again, I'm able\nto go back in this exercise and anticipate quickly being able to – because of muscle\nmemory – being able to regain that lost size. Again, it may not be that significant to you\nor you may not notice it so much, in terms of me, but I've showed you some clips here\nas well. You can see the differences. The fact is, it's impactful no matter what\nthe size of your arms are. If you do this exercise, you're going to have\nbigger arms. If you don’t, you're not. So, I hope you guys found this video helpful. In the meantime, if you're looking for programs\nwhere we program this exercise and show you how to do it the right way so you're not sacrificing\nany gains in the process – remember, not like a 'Dick' or Jesse – you can head to\nATHLEANX.com right now and get them all in our programs. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you haven't already done so, make sure\nyou subscribe and turn on your notifications, so you never miss a video when we put on out. All right, guys. See you soon."
}