{
    "id": "RXN1ew6XctY",
    "title": "Why You’re NOT Losing Weight (RED FLAGS!)",
    "description": "If you wondered why you're not losing weight despite the fact that it feels like you've tried everything, then this is the video you are ...",
    "transcript": "So, you've done absolutely everything, \nbut you just can't lose weight.   Look, it's time to pull up a \nchair, you may need to talk.   What's up guys, Jeff Cavaliere, Athleanx.com. \nSo, if you're struggling to lose weight,   we have to do something about it and that's why I \nwant to sit down and have this conversation with   you today. Because there's two categories that \nyou might find yourself in right now. Number one,   maybe you really want something to happen, \nbut you're not willing to put in the effort   to get there. And if that's the case, \nI understand what the struggle is,   but you know that until you start to do \nsomething about it, nothing is going to change.   But oftentimes I find people are in the \nother category actually doing something,   they're trying, but it's still not working. And in \nthat case, there's five things that I listen for,   five key phrases that I listen for. What I do \nis I call my red flags because if I hear them,   they're instantly alerting me as to what your \nproblem actually is and why you're not where you   want to be. And I have to throw the red flag if \nI hear them. If I can raise your awareness here,   I can make the change you're looking to make. So \nthat said, guys, let's start breaking them down   one by one. Are you saying any of these things? \nBecause if you are, I'm throwing the flag. \n  What's the best exercise to \ndo to get rid of this? \n  So, we have to start right here, because this \nquestion I've heard probably a million times.   And don't worry, if you've asked it yourself, it's \nokay, because today we change these things. You   see if you've ever pointed here and said, \"What \ncan I do for this?\" Or you put it over here,   and said, \"Is there a good exercise, Jeff, that \ncan help me with this?\" Or maybe you've pointed   over here and said, \"What's the best exercise \nfor this area?\" The line of thinking is flawed   and that is what's holding you back. Because \nwe know not only is that exercise not going   to be capable of targeting any specific \narea on your body, but more importantly,   it's not about exercise at all and it never \nwill be. It's about nutrition. If you don't   create a hypercaloric state, you're not going \nto lose the weight that you're seeking to lose.   Even if you took an exercise like a Burpee that's \npretty metabolically demanding, it only burns 13   calories per minute and that's requiring you \nto do it minute after minute after minute. The   changes you need to make have to happen in what \nyou're putting in your mouth every single time.\n  I don't understand. I do \nfasted cardio every morning.   What the hell?\nAll right. So, this one might   come as a surprise to you because you're thinking, \nJeff, I know better. There's no crunch is going   to get rid of my midsection. But I do know that \ncardio is important, and I know that fasted cardio   is even better. Not really. You see, not only \nis cardio not the main driver of your results,   nutrition is, but fasted cardio is actually no \nbetter than cardio itself. As a matter of fact,   research shows that though you might burn a higher \npercentage of fat within the session, you actually   burn a lower percentage of fat after the session \nversus a fed cardio session. And when it nets all   out, you're actually burning about the same. No \nmatter when you do your cardio guys is going to   allow you to create some additional energy deficit \nto help you with creating that hypocaloric state,   but even then, the contributions are minimal. \nInstead, you should think of cardio as a way to   strengthen your heart and focus your efforts \non cutting the deficit through what you put   in your mouth. It's always going to come \ndown to nutrition because even an intense   calorie burning cardio session might get you a \n600-700 calorie deficit, that can all be undone   by choosing the wrong foods at the next meal. \nIt's certainly not my diet, I'm a clean eater.   Okay, what the fuck?\nAll right so there's one that   makes my ears perk up more than any others, this \none right here. As soon as someone defines their   way of eating as \"clean eating\" I know right \noff the bat there's something wrong. You see,   they might be trying though, and that is they'll \nsay, \"Jeff, I eat chicken, fish, oatmeal and   salad.\" And I say, \"Wow, that's a great start.\" \nUntil I realized that when I think chicken, they   think chicken parmesan. And when I think fish, \nthey're thinking sushi. And when I think oatmeal,   they think Quaker Maple & Brown Sugar Oatmeal. \nAnd when I think salad, they think salad. You see   semantics matter here. The difference in words \nmatters because it's the difference in a lot   of calories. If you want to compare these foods \ncalorically, you'll see that they're not at all   the same other than sharing a single ingredient. \nIf you want to get this right, guys, educate   yourself as to the differences between these \nfoods and realize that the differences matter,   especially if you're looking to create \nlong-term permanent weight loss. \n  I'm totally locked in, I'm following the Atkins \ndiet. I mean, I'm doing the South Beach Diet.   I'm actually Paleo all the way. \n  Look, whether it's South Beach, Atkins, Keto \nor Paleo, the fact that you have a name for   how you eat is an indicator to me that you've got \na short-term solution to your long-term problems.   You need to figure out how to make this a \npermanent lifestyle if you're looking for   that long-term permanent weight loss. I mean, \nask yourself how many times in the last five   or 10 years have you had a different name for \nhow you eat? If you ask me that same question,   I can go back 30 years and the answer will still \nbe the same zero. Because what I do is more of   a lifestyle, it doesn't carry a name with it. We \nall know that names are oftentimes associated with   diet plans and diet plans by nature are short-term \nfixes because you even call it that yourself.   I'm on this diet or I'm off this diet.\nNever, I'm on this for the rest of my life.   And oftentimes we know that what you do to get \nto where you want to be in terms of your weight   loss goals is what you need to stay with to stay \nyour weight loss goals. Look, the key here is   say the names for kids and puppies and \nnot for how you eat and I promise you,   you'll find the long-term permanent \nweight loss you're after. \n  I just want to get my beach body ready for \nthe summer this year. Not this time. \n  Now look, I would never begrudge somebody from \nsetting a goal, that's a good thing. Especially   for establishing motivation to get you going. \nBut when your goal date has an expiration to it,   you're setting yourself up for failure. Look, \nmaybe you talk about a summer cut, but summer is   eventually going to turn to fall to can be over. \nThen what happens? Or maybe you want to get ready   for that family vacation and you want to look good \non the beach, but the vacation is going to end at   some point. Or maybe you just want to look good \nat that reunion again. But when the reunion is   over that night, then what happens? Oftentimes we \nfind ourselves going back to exactly what we did   to put ourselves in the situation where we're \nlooking to get in shape again for the next event.   You have to look deeper than that, guys. You've \ngot to look for that internal motivation if you're   looking for that real long-term success. I know \npersonally, for me, I got a lot of people who   depend upon me for motivation and information.\nThat's a good deep driver for me. But more   importantly, all I have to do is look to my \ntwo sons. I realize that they look at me as a   role model and I want to make sure that I don't \ndisappoint them in the long run. I have a deep   inner drive and a motivation to keep me where \nI want to be. You need to do the same thing,   find what lies beneath the surface, literally. \nAnd I promise you, that's where you're going   to find your permanent weight loss success. \nAnd then you have a guys, my five red flags that   I listen for that allow me to get to the bottom \nof your weight loss issues so that you can finally   get there. And remember, if you've asked any of \nthese questions yourself, don't be embarrassed.   Instead, be inspired, because with the awareness \nwill come the long-term success. If you're looking   for programs, guys, we have all laid out over at \nathleanx.com. Complete deli meal plans. If you're   looking for my daily meal plan of what I do every \nsingle day, I'll link that at the end of this   video. If you haven't done so, guys, make sure \nyou leave a comment below so I can hear what you   want to hear in future videos. And also make sure \nyou click subscribe, turn on your notifications so   you never miss a new video when we put one out. \nAll right, guys. Got you bitch! You're dead. "
}