{
    "id": "S0ZAPSKhWRM",
    "title": "The 8 Best Chest Exercises (NO BENCH OR DIPS!)",
    "description": "The best chest exercises are not determined by the ones you can lift the most weight on but rather the ones that work best for you.",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So I'm sure you've been told to do lots of\nincline bench press if you want to build your upper chest. Of course, if you want to get that lower chest\nyou're going to want to make sure you do lots of decline bench presses as well, and you\ndon’t want to forget the all-important flat bench press to work the overall development\nof your chest. And of course, don’t forget to do dips because\ndips are a great way to build your chest. Now that's all great, but what if you've already\ndone all those exercises? You continue to do them, but you're not happy\nwith your chest. Today I want to show you 8, non-bench, chest\nbuilding alternatives that you can start using to get better results from your chest training. So first, it makes sense to look at what might\nbe wrong with the other exercises that you have been doing, and why they're not working\nfor you. The fact is, you can look really easily and\nsee that when we do, say, a dip here, look at the position of the hands. At no point do they get closer to each other. They're fixed on the handles, and you're simply\nmoving up and down. No matter what variation of the bench-press\nI'm doing, whether it be incline, flat, or decline my hands don’t really get that much\ncloser together. Especially if I'm using a barbell that's literally\nfixed on the bar. But even when we do the dumbbell variations\nwe're not getting them anywhere more than to each other, or meeting each other in the\nmiddle. They're not going across each other. What I'm going to argue for you is, it's not\nalways about the weight that you're pushing, but the amount of activation that you're getting. Simply getting more activation by getting\na full chest contraction is going to provide a much better stimulus for you to start seeing\nbetter results, and guess what? It's going to make those even better. By the way, I'm going to show you a way you\ncan make your bench-press even better. I'm going to hold that for the end of the\nvideo. Let's start with our firs exercise. Let's start with a simple one. It's a bodyweight exercises that we can all\nstart doing right now, and actually start feeling the difference. It's a twisting pushup. What you'll see here is, we can get that arm\nmore across our body. Not by changing the position of the hand,\nor the fact that the arm is actually still fixed in place on the ground, but by changing\nthe position of our body, in relation to the arm. So you can see that a regular pushup here,\nI'm fixed in space, but with this twisting pushup I'm actually turning into the arm. So as I turn in, look what's happening here. If I hold my arm out in front of me, and I\nturn my body into it, I've got this relative adduction. I've got the crossover that I'm looking for. You can literally alternate sides, left and\nright, and feel the difference in the contraction, and I promise you, if you've struggled to\nsee your chest grow, do these – to at least get yourself activated and have your chest\nstart working more – and you're going to see better results from doing them. The next one here is called the plate squeeze. This is actually really fun to do. We can do it either as a chest activator right\nbefore the workout, or you could even do it in drop set fashion after some of those big\nbench exercises. Remember, we're not going to abandon them\ncompletely. We're trying to make them work better for\nyou. In the plate squeeze, what I'm trying to do\nhere is, yes, I'm only getting the plates to be able to touch in front of me, in the\nmiddle, but I'm thinking about trying to push them through each other. If I can crush them right into each other\nthat would be ideal. What we're doing is, we're getting maximum\nchest activation here because we have this very strong isometric, and again, the heavier\nthe plates you use, the stronger you're going to have to push because that weight is going\nto want to slide and drop down. For an added challenge, you turn the plates\naround. Make sure you use the smooth sides on both\nand that's going to make you really have to push hard. Again, no matter where you program it, this\nbecomes a great option for you to get better chest activation. Okay, I kind of lied on the next one here\nbecause you do need a bench for this one, but not to do a bench-press. We're doing a dumbbell pullover. Again, you might think \"Wait! Dumbbell pullover? A back exercise?\" No! It can be a great upper chest exercise because\nlook at how I'm doing it. The key here is not to pull with your elbows. You're not trying to lead with your elbows\nand let your elbows stay flared out on the sides of your body because that becomes a\ngreat lat exercise. But what I can do is, I can take my hands\nand squeeze them together. I'm actually trying to turn them in like this,\nas I pull down. So I'm squeezing my hands together, trying\nto adduct my hands into each other, to pull the dumbbell forward. And I don’t come all the way up. I'm trying to maintain that tension on the\nupper chest. That happens in that fully stretched position,\nand then up, only about 30, or 40 degrees. If you've never tried this exercise with the\nintention of using it for your upper chest, try it. I promise you guys, you'll be surprised at\nhow much you can recruit the area of the chest that usually seems to be hard to recruit for\na lot of people. The next exercise up here is a dumbbell floor\nfly. Now you're probably saying \"But I've done\nlots of flys before.\" But if you're not doing them on the floor\nyou're losing an opportunity to create a stimulus for more growth. Here's the deal: when you do an unsupported\nchest fly on a bench your shoulder becomes instantly jeopardized, and the health of your\nshoulder becomes a high risk for doing that exercise because it's simply too much load\nfor it to handle. With this arm in this outstretched, unsupported\nposition. But when we do it on the floor we don’t\njust get support, and therefore a safer alternative, but we get a better option for building a\nbigger chest, and better recruitment. We know we can still take advantage of the\nbenefit of the fly. Meaning, the adduction component of the exercise\nthat's lacking in the dip, and the bench-press; but we can do this here with a heavier weight. Because we have the floor to absorb our arms\non the way down we can eccentrically overload each, and every rep. And if we have to, even cheat the dumbbells\nback up by pressing them to the top, and continue to work on the eccentric portion of that rep\nto get better, and better results. Guys, this one should definitely be in your\nroutine. Especially if you've been doing the other\nflys and either hurt yourself doing them, or you haven't seen the results that you wanted\nto get from doing them. The next two exercises up here are going to\nbe in the crossover category. As you can see, right here on the 3D crossover,\nwe are getting that adduction we are looking for. We're going beyond midline, which makes this\na great way to get peak contraction of your chest. I like this variation because I can actually\nload up here. You can see that it's not just my chest that's\npowering this movement, but I have a lot of core activation here too, that helps me to\ndrive through. My hips are rotating as well. This gives me a chance to do an overloaded\ncrossover. A heavier version of a crossover. For all those that say \"But Jeff, you need\nthe bench for the heavier weights! You need the dips for the heavier weights!\" Guys, you can load up any exercise. If you incorporate your body to allow you\nto push more weight it's going to allow you to have the heavy exercise in your arsenal. This is a great way to do it with a crossover,\nto get that adduction, and the heavy loading at the same time. Now, on the lighter side of things we have\nthe X-crossover. So we go lighter on this. The focus here is not to try to move as much\nweight as possible, but to get that contraction. Again, this is another one that can be used\nlike the plates we used, as either an activator, or at the end of a set as a drop set, to try\nto burn out. The key here is – what we're actually targeting\nhere – is more of the lower chest. We can get down on lower chest. There is such thing as the abdominal head\nof the pectoralis muscle. We can get there by letting our hands start\nhigh, and then finish low. Of course they're crossing over each other. That's the goal to get peak contraction. But this high, to low works more of the lower\nchest the same way that a dip works the lower chest because we know the hands start high,\nand they wind up going down low as we finish out the dip. You want to recreate that here. But the goal here is – I don’t care what\nweight you need to use – you need to feel the contraction. That is the whole key here, of what this entire\nvideo is about. These are non-bench alternatives and sometimes\nthat means lightening the weight. But I promise you, the overall end result\nis better chest development because you've finally activated muscles you haven't been\nable to with the other big exercises. This next one, like the dumbbell upper chest\npullover, is going to help us hit that upper chest. We know that we're not getting enough of that\ncontraction, and squeeze from the dip, or even from the incline bench-press. But here, we can. The UCV raise allows us to bring that dumbbell\nup, and do what I always say you should try to do. That is, follow the fibers. You see, the upper chest fibers are going\nto start here, at our collarbone, and ride down, in this direction. So if we can let the dumbbell come up, and\nacross in that direction, then we are following the fibers. We're getting a maximum contraction. We also have that component of getting across\nour body because the dumbbell allows us to do that. Now, you can do this as an alternative with\na cable, or a band as well, for a more consistent resistance throughout the range of motion,\nbut either way, I promise you this is a great exercise, and can be done anywhere in your\nchest workout to improve your ability to contract your chest, and in the long run, get better\nresults from your chest training. Finally, we have the one that's being called\nthe \"Cavaliere Crossover\". I started to do this years ago. This is now going to leave the delt out of\nit entirely. What you're doing here is, you're taking that\ndumbbell, and you're going to drive it across your body – as you see – and we're getting\nthat all-important adduction, but we're not getting the elevation from the UCV raise. So let's say you still feel that your shoulders\nare dominating that last movement. Then this becomes your alternative, here. You want to make sure, again, you do this\nexercise – I love doing it as a burnout – but it doesn’t mean you have to go light\nhere. You can take a heavy, heavy, heavy dumbbell\nand drive across your body, and try to hold it for even a split second on every, single\nrep to really enhance, and to enforce the contraction that drove that dumbbell there\nin the first place. If you get better at this guys, I promise\nyou, with this, and with all the other exercises you're going to start seeing better results,\nand they're going to compliment those even bigger exercises that haven't been performing\nfor you as well. Like, the bench-press and the dip. While we're on the topic of the bench-press\nand the dip, I promised you I would give you a tip at the end of the video that would help\nyou to get even more out of those exercises. This is it. Don’t think about your hands. Don’t think about what your hands are holding. Whether it be the handles on the dip, or the\ndumbbells in your hands during a press. You think about your biceps. If you can take your biceps and squeeze them\ntogether in any variation of that bench-press, or squeeze them together while you're doing\nthe dip; you're going to get way more activation in your chest, and those exercises are going\nto become far more productive for you. Especially as you start to combat them with\nthese exercises. Guys, it's all about how you do the exercises,\nnot just the ones that you're doing. A lot of times you might have to check your\nego at the door and start going for some of the lesser known, big exercises to help those\nbig exercises get better, and do more for you in the long run. These 8 are some options I want you to start\ntrying. Guys, if you haven't already, subscribe to\nthis channel. You don’t want to miss the videos. Make sure you turn on your notification bell\nhere, and if you haven't already checked out one of our programs, we put the science back\nin strength in all of them. They're available over at ATHLEANX.com. Finally, guys, check out any of our newer\nvideos here. I'm going to link one here for you now to\nmake sure you keep your education going here. All these videos are meant to help you to\nlearn more about how your body works so you can get more out of every, single exercise,\nin every, single workout you do. All right, guys. I'll be back here again soon. See you."
}