{
    "id": "S298ziysRdI",
    "title": "The Better Chest Fly (MORE GAINS!)",
    "description": "Build a ripped chest in 90 days - http://athleanx.com/x/great-results Subscribe to this channel here - http://bit.ly/2b0coMW The ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The fly. No, not one of my favorite exercises, as I've\ntalked about here many times here on this channel. But mostly because of the risk-reward ration. As someone that trains professional athletes,\nrealizing that the overhead thrower, the quarterback, a pitcher; anything that's going to potentially\ninjure their shoulder, it's not that great of an exercise. If I had better options – and I feel I have\nbetter options that can do this. However, that has led some to question me\nand say \"Jeff, could I do a floor fly? That would eliminate some of the things that\nyou don’t like about the exercise.\" The answer is \"yes\", and not just that. There's actually an additional benefit the\nfloor fly will provide that will allow you to start gaining even more from the exercise. So let me show you what I'm talking about. When we talk about the fly itself what is\nit that I didn't really like about it? If we're on a bench, unsupported here, when\nI do the exercise the advice is to keep your elbows bent. Not to allow them to straighten out so much,\njust going to increase the moment arm, and therefore increase the feel of the weight\nthat you have in your hand. A 10lb dumbbell held way out here will feel\ndifferent. So what we want to do is keep the elbows bent,\nand then lighten the weight, is what they'll tell you. But the problem with that advice is, if you\nwant to build muscle you want to be able to overload that muscle and essentially, you\nwant to be able to overload it eccentrically. Negatively. On the way down because that is going to allow\nyou to do some more of that micro damage to allow for more muscle growth. That's not really conducive to doing this\nexercise this way because unsupported, if at any point in time you were to fail on the\nway up without completing the rep, and you had to dump the weights – which I see a\nlot of guys do in the gym – you're instantly compromising the anterior shoulder capsule\nhere. The AC joint, and potentially the pec, in\nterms of suffering a pec tear. So by doing it on the floor, what we're able\nto do is get in the same position, almost simulate the same amount of depth because\nwe can arch the low back here this way. Keep the butt in contact with the ground. Shoulder blades pinched together. Chest out. Keep the elbows bent again, but now we have\nthat pretty decent depth here, but we've got a bottom point. We've got a safety net underneath us here\nthat allows us to not – even if we had to – dump it down without having to risk the\ninjury to the front side of the shoulder, or the pec itself. So we can do the fly in this manner and we've\nactually, now, fixed that. But what am I talking about? What's the additional benefit? Well, if you want to gain more muscle you\nwant to be able to overload and those that are avoiding the heavier weights because it's\nnot a \"good idea\" on flies – even on those that do flies to a degree. By the way, Arnold Schwarzenegger, this is\nhis favorite exercise. I get it, but even he tore his pec with the\nexercise. So there are certainly risks to it. So what we do is, with the heavy version,\nor basically a weight heavier than you would normally lift because you don’t want to\nincur an injury on the bench, you could lift that here now, on the floor because I could\ndo the eccentric overload knowing that I have this safety net below me here to catch me. If I can't necessarily press it back up to\nthe top, and I don’t necessarily have all the strength to do that, I can just shorten\nthat arm by bringing my hands in, press it up now, and now go back into another eccentric. So I could do continuous eccentrics here and\nget a really good overload on the chest, with the safety still intact of the exercise. Again, a benefit that the floor provides that\nthe regular bench does not. So it looks like this continuous motion this\nway. I'll go one more. You're getting this eccentric, horizontal\nadduction which is one of the key components of the chest. Like I said, that dumping of the weight doesn't\nmake my shoulder vulnerable like it would otherwise. So guys, I hope you can see the difference\nhere and realize that it’s not just doing exercises. It's about doing the exercises that allow\nyou the best benefit while not compromising your longevity in the gym. I don’t care. Maybe you're not an athlete. There's a lot of people that watch this channel\nthat aren't athletes, but you still want to be able to stay healthy so you can stay in\nthe gym and train for the long term and continue to see gains month after month, year after\nyear. That's what this channel's all about. In the meantime, if you're looking for a program\nthat puts the science back in strength, takes into consideration not just the ways to help\nyou build more size and strength, and power, but in a safe way so you can continue to do\nthis for years on end; then head to ATHLEANX.com to get our ATHLEANX training program. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover on this\nchannel and I'll do my best to do that in the days and weeks ahead. All right, guys. I'll see you soon."
}