{
    "id": "SHgQeBk7zIs",
    "title": "Stop Squatting Like This (AWFUL!!)",
    "description": "If you are looking to improve your squat, then this is a must watch video for you. When it comes to a well executed squat, bar path ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. You’ve got stop squatting like this. Here’s the thing: there are so many causes\nof this and many other squat problems that a lot of times, it’s very difficult for\nus to come to grip with the fact that we’re actually making this mistake when we squat. One of the most helpful things you can do\nis film yourself when you’re squatting so you can see what’s happening here and be\nvery objective about it. But I can tell you this: as a physical therapist\nthis is a complex problem. There are a lot of potential reasons, but\nI’ll tell you, regardless of what your cause is, you do need to fix it. We know that the most important thing you\ncan do when you’re squatting is to try to establish a vertical bar path. Which means, the bar needs to go straight\nup and down. I'm not talking about the angle of your torso\nbecause that will change whether you’re high bar squatting, or low bar squatting. What I’m talking about is, no matter what\nposition you get that bar in, you need to be able to move it vertically. That’s for a lot of different reasons. I don’t care whether you’re training just\nto be stronger. There, we need to make sure we’re being\nefficient because a bar path’s efficiency is going to be critical to your strength. You want no waste in strength. Even just for overall athleticism and performance\nin the gym, you still want to have, and perform the exercise correctly. So, let’s talk about, if you’re someone\nthat does this. Here’s what could potentially be happening. First and foremost, where is the setup of\nthe bar when you start? Potentially, you’re starting a posterior\nthat’s setup too far. Meaning, the bar, if you were to drop a line\nstraight down, is not going through the center of your foot. We know that the best balance point for your\nfoot is going to be the center of your foot. Just slightly behind the ball of your foot. And we know if we can get that bar setup there,\nand then establish that pattern of straight up, and down, we’ll be in a good position\non the squat. But a lot of times, we’ll get that bar a\nlittle bit behind that, a little more over the heels. It doesn’t come back to bite us until we\ntry to get out of there. That’s because, if the bar is sitting back\nfurther, when I go to push up against it, I’m pushing into that positioning. I’m pushing up, where? From the back of the hips. The low back goes up first, as opposed to\ndriving the entire torso up. That almost encourages my hips to do the initiating\nof that. Where, if my hips go up – we’ll talk about\nthat a little more in depth in a second – then my torso, and the rest of my thoracic spine\nis going to fall forward. But we want to make sure, if we’re going\nto setup properly, we’re going to be setup over the center of our foot. The next thing we could be dealing with is\na dorsiflexion immobility. Meaning, we lack the ability to get our ankle\ninto dorsiflexion, as you see my ankle moving here. We know as we go deeper into the squat, the\nrequirement of our ankle to get into more, and more dorsiflexion are higher. In order to get to the bottom of the squat,\nat a proper depth, that dorsiflexion has to be there. If we don’t have it, what happens? As we’re going down into the squat we start\nto lose the ability to deepen into our ankle, and therefore, our knees go a little bit more\nforward, the body gets thrown offline, and you’d actually see this floor-bar path happen\na lot sooner. Really, more toward the descent, and not what\nI was showing you in the beginning here, where it seems to go down properly, and then make\nthis drastic alteration. So, if we’re talking about that drastic\nalteration where we can actually get down straight, and then we see this big “U”\nshape on the way up; now we’re dealing with one of three other things. The first thing I would start to question\nis quad weakness. Why is that? Because when we get down to the bottom, that’s\nwhen our quads are going to be the most in demand. Again, even if I’m doing a low bar squat,\nwhich is less quad dominant, it’s still going to be the point in that squat that the\nquads are most in demand. So, I have to have adequate strength there. If you don’t have the ability to get down\nhere with good strength, then what happens is, your hips – the stronger posterior chain\nmuscles – are going to be recruited instantly. Your body is smart. It knows how to get out of the hole. So, it’s going to lean your forward to recruit\nthose muscles more efficiently, and then start driving up. Of course, as you come up you’re going to\ntorso correct. Your body will come up, and then straighten\nback out again. Now, if you’re able to get to the bottom\nof a squat, however, and hold it, and perform pause reps; then you’re likely not dealing\nwith a quad weakness. You have good stability and strength under\nheavy load at the bottom of a squat. You’re not likely dealing with quad weakness. That’s actually why I encourage the use\nof pause reps a lot in our training. So, we can make sure that we’re not dealing\nwith quad weaknesses here. But it doesn’t take away the fact that there’s\nsomething else wrong. The next thing I would look for is weakness\nin the retractors of the scapula. Your ability to hold your scapula tight the\nentire rep. So, what often times will happen is, people\nwill go down, and they’ll be good, they’ll be nice and tight on the setup. And they’re either forgetting about the\ntightness as they get down to the bottom because the focus becomes more “What am I going\nto do to get out of the hole?”, or they simply don’t have the strength to maintain\nthe tight torso, the retracted scapula as they initiate out of the hole. This is something that goes back to a point\nI made before. I said the one thing you should be doing every,\nsingle day – every, single day – after your workouts are face pulls. Why? Because face pulls are incredibly important\nin reinforcing the number one strength deficit we probably face as human beings. Because of what we do posturally, all day\nlong. That is, pretty much, try to counteract any\nbenefits of having scapular strength. All the things we do are in front of us. The weakness is apparent in most of us because\nof the posture that our shoulders assume from doing all this stuff. You need to work on your ability to get there. But, I said – very importantly – you might\nbe someone that thinks you’re doing the right work because you’re doing 100s of\nreps. Maybe you’re doing 100 reps of face pulls,\nyou’re doing 100 reps of band pull-aparts, and you think you’re doing the right thing. I would argue, that means nothing. I want you to do high quality, focused contraction\nreps. You’re better off doing 20 sets of 1 than\n1 set of 20. That’s something I’ve said many, many\ntimes before. If you find that you’re getting to the bottom\nand you’re exhibiting this squat pattern that I showed you in the beginning here, I\nwould focus much more on, first of all, including both band pull-aparts and face pulls if you\naren’t already. But more so, concentrating on how you’re\nperforming them. Squeeze every, single rep as if it’s the\nonly one you’re going to do. Focus on getting a good contraction, hold\nit, maintain it, get better at being able to sustain those contractions. So, when you do go through a squat it’s\nnot a momentary ability to do it, but a consistent ability to do it. Up and down, throughout the squat. Then finally, we get into this situation where\nit could just be habitual pattern. So, let’s say you had an ankle mobility\nissue that you never worked on. By the way, I have a whole video on how to\naddress the ankle immobility. That dorsiflexion and mobility. I’ll link it for you guys to make sure you\ncan see that, because that is a very popular and common problem. But let’s say you had it in the past. You’ve addressed that, and now you’re\ngood, but you’ve learned this pattern of relying on, and initiating with the hips on\nthe way up. That’s a problem because, here’s what\nhappens. I have a demo here for you. Let’s say I have this jump rope and it’s\nreflecting my hips, and then the rest of my spine up here. Just like a whip, if I were to initiate movement\nhere, and drive up with the hips first, what happens to the rest of the rope? It goes from being relatively straight, to\ndown because it’s a connected chain. Just like our whole body is a kinetic chain. Just like our spine is a connected unit. When I move the pelvis up, the rest of it\ngoes down. So that means you’re going to throw and\nlurch your shoulders forward. Very much like that weakness in the mid-back,\nif the mid-back is giving out, the bar is going to go – your body is going to go forward\nwith your head, with your shoulders. That’s going to cause that forward lurch. The same thing happens here. Just by initiating movement with the pelvis,\nI can cause that. But this goes back to what I said was the\ngreatest squat tip I could ever give. That is going to help a ton of you guys if\nyou haven’t applied it to this problem in particular. That is, when you get to the bottom of your\nsquat, the number one thing you can do is try to visualize your pelvis and your ribcage. Your pelvis and chest, and your sternum. Whatever it is that kicks in for you. If it’s your whole chest, you can envision\nthat scapular retraction, too. So, you can make sure you’re staying there. But this, and this need to move together. So, if I were to take this rope, and now I\ntake it, and I tighten it, and I keep that tightness, and I move it together, now it\nmoves up as a unit. First of all, it moves a lot more efficiently. Secondly, it has no more of that drag, which\nwill cause that forward lurch. So, lots of different things you can do there,\nguys. It really comes down to whether or not you\nare aware of your own problems. Again, as I’ve said in the beginning, the\nnumber one thing you can do is record yourself. Try to get on the sides. That’s where you’re going to see these\nthings most visibly. Or have one of your buddies or somebody at\nthe gym film for you, so you can watch it back. The thing is, these things become readily\napparent. If you need an app to do it, guys, I downloaded\nan app. Iron Path is the name. I get nothing for recommending them. Although, Iron Path; if you’re listening,\nmaybe a trip to Hawaii, or something. I’m sure you’re going to get quite a few\ndownloads today. But the fact is, it’s a great app, guys. At least it’s a tool. It gives you, if anything else, some feedback\nas to how bad it is for you, and how much you’re doing this. That will at least give you a jump off point\nto correcting it. Guys, I hope you’ve found this video helpful. If you’re looking for a program that puts\nthe science back in strength – all this stuff matters. As a PT and a strength coach, guys; it ALL\nmatters to me. Both ends of this. I’ve got to make sure that you guys perform\nthese exercises the best, you’re getting the most out of them, and ultimately, for\nthe athletes that follow me, take it out onto the field to perform better than ever. All this stuff is built into all our programs. It’s over at ATHLEANX.com. In the meantime, guys; tell me what else you\nwant me to cover. I’ll do my best to do that for you in the\ndays, and weeks ahead. All right, see you soon."
}