{
    "id": "sIvJTfGxdFo",
    "title": "The Official Pull-Up Checklist (AVOID MISTAKES!)",
    "description": "To perform a picture perfect pullup, there are few things you need to keep in mind. This checklist will lay the foundation for proper ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. What's that? Sh**. Sh**. No. I know, Jesse. I fully agree. Oh, you want them to know about pullups? All right, guys, look. He doesn't – I agree whole heartedly what\nyou said about Jesse. But he doesn't think you're doing your pullups\nright. So, what I want to do is – I tend to agree. I think pullups are one of those things that\nare very challenging. They're an enigma, really, because they look\nso easy when everyone knows how to do them. And it can be so damn hard when you don’t\nknow how to do them. But we can make it all easy here today. I'm going to point out the official pullup\nchecklist. What I want to do is show you guys exactly\nhow to do it by covering some of the prerequisites that are going to make it a lot easier for\nyou to do, right now, if you focus on these things. Number two: the setup. Everything in the setup will determine how\nthe rep itself goes. So, if you get these things right, I promise\nyou'll get better as well. Finally, the actual rep. How you perform the exercise itself is going\nto make a big difference in how well you do them. Finally, one giant caveat that you're going\nto want to make sure you pay attention to as it relates to the impact this exercise\ncan have on your shoulder, in a bad way, if you don’t do them correctly. With that being said, let's start breaking\nthem down, one by one with the help of Raymond. The checklist. To kick off this checklist we have a prerequisite\nlist. These are the things that can enhance your\nability to attack the pullup itself. I want you working on these things because\nwe're going to have an amazing transfer on your ability to do pullups. The first thing is having stronger abs. Guys, I've relayed this story many times here\nbefore. When I had my hernia surgery, the most difficult\nthing for me to do was not doing a plank, or a crunch, or any direct ab exercise. As a matter of fact, I was doing that a couple\nof days after surgery. What I wasn't able to do, even months after\nthe surgery, was hang from a bar and keep my body still. Your abs are heavily relied upon to create\nstability and stillness under the bar when you hang on it. So, what you need to do is start incorporating\nmore hanging ab exercises into your routine, to start to strengthen your abs in that environment. You're going to have a tremendous transfer\nright over to the pullup when you decide to do them. Next, you have to have a strong deadlift. Now, I know this is a bit counterintuitive. You're thinking to yourself, \"I'm pulling\noff the floor, versus pulling up overhead?\" The point is, you're pulling in both environments. The stronger you are at pulling, the better\nyou're going to be. I put together a complete deadlift checklist\nvideo that you're going to want to check out that covers exactly how to perform the deadlift\nfor maximizing your strength and getting the most out of that lift. I promise, as you watch your deadlift numbers\nincrease your ability to do more and more pullups will go up as well. Third: scapular strength is one of those elements\nthat people tend to overlook. Your scapulae need to be strong. They need to be stable. One of the best ways you can do this is by\nimproving something we call your 'straight arm scapular strength' with an exercise like\nthis. The straight arm pushdown. Work on including this into your routine and\nI promise you're going to develop a lot more stability through your scapula. Which will, as you see quickly here, become\nvery important to your ability to do pullups. Last, you want to make sure your body fat\nis in check because we know a guy who's heavier and doesn't have the strength to match that\nextra weight is going to have an incredibly difficult time doing pullups. So, having a good strength to bodyweight ratio\nwill always be in your favor. So, work on getting that body fat down, which\nwill improve your ability to knock out more pullups than you can right now. With that being said, now we've got to start\nthe checklist on what you actually need to do when you put those hands on the bar. Now, the setup. When we get to the bar there are some things,\nwe can do here that are going to make the exercise so much easier, if we get them right. It starts with how we grab the bar. As you see here, I have some options. I could grab with a narrow grip. I could grab with a shoulder-width grip. I could grab with a very wide grip. The fact is, there's only one grip that's\nreally good. That is this one right here. Slightly wider than shoulder-width. Why? Because it places my shoulders in the right\nposition to do a lot of things that are going to be needed in the rest of the exercise. Namely, it gets my elbows out in front of\nmy body. It puts a bit of stretch onto the lats that\nwill allow us to gain more power from them, and it takes some of the smaller muscles that\nare ill-equipped to do what we're trying to do out of the equation. That is, pulling our entire body up to the\nbar. If I went incredibly narrow, as you see here,\nmost of the focus is going to shift to the forearms and to the brachialis to try and\nget my body up, and over the bar. They're not as equipped and strong to do that. I really need to get my lats involved. To do that, as I've mentioned, you've got\nto go a little bit wider. By keeping the elbows out in front of our\nbody, it prevents us from wanting to go too far. You can see as I go too far, my elbow starts\nto go out toward the sides. Raymond is going to show you why that's not\na good idea in just a little bit. The next thing we can do is talk about the\ndepth of our grip. Where are you gripping the bar? Are you gripping it in the end of your hand,\nup in your fingers? Or are you gripping it really deeply here\nin your palm to do the exercise? Now, I'm going to tell you this, right now:\nyou will do more pullups if you grip it really far away, in this 'hook' grip, with your fingers\njust resting over the top of the bar. But you're inviting some long term problems. You're going to place too much stress on those\ndeep finger flexors that will radiate all the way down in here, placing so much stress\non that medial elbow, eventually turning to that really stabbing pain of the medial epicondylitis\nif you always do them this way. Now, if you're in a pullup competition and\nyou just have to get as many as you can in a single effort, then I'd probably recommend\ndoing it this far in your fingers. But, if you're going to do your pullups routinely,\nand you want to do them right, without irritating your elbow; you're going to want to grip a\nlittle deeper, as you see me doing here. Last, we talk about the position of the legs. Believe it or not, it matters. Most of us will do it like this. We'll bend our knees, bring our feet back\nbehind our body, and do our pullups. I'm not really understanding what we're trying\nto accomplish by doing that because the weight of our legs is the weight of our legs. We're not unweighting anything whether we\nbend them or keep them out straight in front of us. What we are getting when you put your legs\nstraight out in front of you is a plugging of the energy leaks. This is a concept I've covered many times\nhere. It's a miracle, if you've never tried it before. You'll see instant changes in how many pullups\nyou can do. You position yourself where your legs are\nout in front of your body. You're going to actively engage your calves\nby pointing your toes down toward the ground. You're going to squeeze your quads and straighten\nyour knees as hard as you possibly can. You're going to squeeze your glutes behind\nyou. You're going to tighten your abs as well. All of these things – you're plugging all\nthe potential places where the force that you'll generate down to the bar can leak out\nof, realizing that your whole body is one kinetic chain with that energy flowing up\nand down. If you plug those, there's nowhere else for\nthat energy to go, other than right back up into the bar, down through your arms, and\nexecuted in a better performed pullup. You'll see instant strength increases if you\ndo what I'm doing here. You get those legs out in front of your body. You stay tight, you stay straight, this is\ngoing to help you tremendously. Now it's go-time. It's time to do your repetitions. The thing you want to do first, and foremost,\nis look up. Look right at the bar. Guys, if you're looking where you're going,\nyou're going to get there faster. But don’t mislead yourself into thinking\nthat your eyes are the target for the bar. You still need to get that bar at least to\nyour chin, if not to your sternum. But if you look in that direction it's going\nto give you that target. It's going to help you visually set that goal\nand get there easier. The next thing is, now you're going to initiate. When you do, I want you to squeeze. I want you to squeeze the bar. But not just through the entire hand. I want you to focus on squeezing through these\ntwo fingers right here. Your ring finger and your pinky finger. Why? Because those are the two weakest fingers\nin your grip. If you can consciously squeeze down through\nthe weaker fingers, you're going to bring the rest of the grip along for the ride. A stronger grip, and the ability to exert\nforce into a grip, into a bar is going to initiate the process of pulling with a good,\nstrong force downward to get your body up. So, I want you guys to make sure you're doing\nthat. Now, what is the mindset here? Don't think about pulling your body up to\nthe bar. I always say to think about pulling the bar\ndown to your body. But while you're doing it, I want you to attack\nthe bar with your chest. Meaning, as you go in this direction, reach\nfor it with your chest. Open your chest up. This does something incredibly important. It establishes thoracic extension. Thoracic extension is not only going to make\nthis repetition easier, but it will increase the safety of this exercise when it comes\nto your shoulder. Which leads us to our final caveat. So that brings us to this controversial point,\nwhen it comes to the pullup. I'm going to give you guys the best advice\nI think I can. Do you need to go full out, dead hang on every\npullup's rep? Yes. You should. That means you should straighten your elbows\n– if your elbows allow you to – on every, single repetition. But that does not mean you should do this. This is called 'unpacking the shoulders'. This is what some people interpret as a dead\nhang. This would be a bad pullup tutorial that teaches\nyou to do this. Why? Because this is actually destabilizing your\nshoulder in a pretty bad way. 'Dead hang' does not mean 'destabilize'. That's why I talked about Raymond helping\nus out here and why it's so important to get into that mindset of attacking the bar with\nyour sternum to get into that thoracic extension. Let me explain. When I go into this dead hang position, I\nraise my arm up overhead. When there is no engagement of the muscles\nhere of your upper torso and back, you get this traction stress up here on your arm. If you have a torn labrum, like I do, this\nis going to be a really negative thing for you to do, in terms of how it feels on your\nbody. You don’t even necessarily have to have\na torn labrum. Just the lack of stabilization that this creates\nis going to place a lot of force and impingement stress up here in the joint itself. As you see, it rises up and pulls up into\nthe AC joint. So, what we need to do is learn to keep ourselves\nengaged, as you see me doing here. All that means is pulling down and back. Now, we don’t want to lock into this position. What we want to do is be able to create stability\nhere, but still move. As you can see, as the arm goes up over the\nbody, the shoulder blade will go with it. This is what's called the Scapular Humeral\nRhythm. This wants to move. It has to rotate upward in order to allow\nthe arms to get all the way up overhead, as you would in the downward position of a pullup. So, you want to do this instead. Just create enough space. Don’t let your traps go up near your ears. Instead, just pull them down. Get them away. Create some space between your shoulders and\nyour neck. When you're in this position, if you allow\nfor thoracic extension something really helpful happens here. It allows the shoulder blades to do that rotation. Remember, if you just try to force your shoulder\nblades down and back, you'll get none of that movement. You're getting two crossed signals. One of them is to stay tight, and the other\none is to be able to move. We can't do two things at once. What we can do is stay stable and have it\nmove the right way. As you'll see, if this spine were to bend\nforward, if I were to be kyophillic or lose some of that extension through the thoracic\nspine, this shoulder blade can't really rotate smoothly on this curved thorax. Around this curved ribcage here. But when I get nice and straight, if I come\nup straight here, now you can see the amount of play that's available here in the scapula\nfor rotation. Again, if I move forward it doesn't want to\nmove as much. It's locked in place here, in terms of how\nmuch it can rotate. Just getting myself up straight you can see\nhow much more play I get around the scapula. So, that is the most important thing, guys. Don’t trick yourself into thinking that\ngetting completely lax at the bottom of a pullup is a good thing. Get straight at the elbows, keep the tightness\nthere, keep the stability, and then allow that extensions through the thoracic spine\nto still allow for the movement that's going to be required to execute the pullup properly\nevery, single time. Guys, there you have it. The official pullup checklist. Hopefully, it's now allowing you to not only\ndo more pullups, but to do them correctly every, single time. If you've missed the others in the checklist\nseries, make sure you click on these and watch them. I linked them at the end of the video. In the meantime, if you're looking for programs\nwhere we put the science back in strength – as you can see, how we do what we do matters\nand helps us get to where we want to be a lot faster when you do those things right. All that is worked into every program we have\nover at ATHLEANX.com. If you've found the video helpful, leave your\ncomments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you haven't already done so, click 'subscribe'\nand turn on those notifications so you never miss a video when we put one out. All right, guys. See you soon. JESSE: And you guys thought I was bad at staring."
}