{
    "id": "SOzvii-6DOE",
    "title": "6 Reasons You’re NOT Building Muscle (FIXED!)",
    "description": "If you're not building muscle and are getting frustrated with your lack of muscle gains, then this is a video you need to watch.",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. So today I'm getting up close and personal. I want to have a conversation with you and\nyou directly. Because we're going to talk today about something\nthat we both have in common, and that is a struggle to build muscle. Maybe you're not building muscle right now\nor you're not building it fast enough. And guys, I can relate. There's been many times in my life I've talked\nabout a lot on this channel where I was never the biggest guy in the gym. I will never be the biggest guy in the gym. I always will try to continue to put on muscle\neven as I get older, though it becomes a little bit more difficult. The fact is, we all who strive for more muscle\nmass are going to kind of run up against a wall from time to time. I think I have the answers as to why you're\nnot right now. And they actually ironically could all be\ndealt with and captured in one series of clips. You ready? Let's watch them together. Here is just a Bench Press, I'm going to perform\nit htree different times. Here's the first one here, just doing a Bench\nPress. Okay, racking it, putting it back, done. The next set here, I'm doing a Bench Press. I get to the end here, I rack it and I'm done. And the third clip here, I think I'm doing\na Bench Press, it kind of looks like a Bench Press, I do get to the end of the rep here,\nI rack it and I'm done. Okay, now no judgement yet, let's move on\nto one more exercise, a Bicep Curl. One of my favorites, I admit. We're doing a Bicep Curl here, a couple of\nnice reps, finish it out and I'm done. Next effort here, I lift it up, a little tougher,\nI put it back down and I'm done. And then the last set again, something that\nresembles kind of like a curl, sort of. Look, I've done this too, I know I have, I'm\ndone. So, now guys the thing that's in common about\nall of these is effort. I mentioned the word, it's effort. Right? Even though one becomes a complete bastardization\nof what the exercise was intended to be, it's all about effort. Everything that you do, in terms of getting\ngains in the gym because there are things we can do outside the gym, but in the gym. We're talking about hypertrophy muscle gains\nhere. We're not talking about strength, we're talking\nabout just muscle hypertrophy gains in your training right now, can be boiled down to\neffort. And that's what brings me to this video, and\nthis is why I kind of want to have this personal talk. Because a lot of people have been talking\nabout this ad nauseum right now about what your effort is supposed to look like. There's a magic effort level, supposedly,\nthat's going to deliver gains and anything less than or above that is not going to. To the point where you might even be confused\nbecause you've heard it defined some way, different ways that you don't even know what\nit means anymore. I can tell you this, there are specific ways\nwe can make this feel so much more easy to understand, okay. The first mistake, though, is hiding behind\nscience. And you guys know that I'm a big advocate\nfor science. I believe in science. I like to apply it to everything that we do. However, things like RPE, which is a method\nof communicating effort in training, can become something that's going to hold you back from\nyour own games because you're hiding behind the terminology--Rate of Perceived Exertion,\nor, as I like to say, Really Poor Excuse. Because when it's beginners that like to apply\nRPE to their training, they're hiding behind the fact that they don't want to go towards\ntheir max exertion levels. So, they push in an RPE six or an RPE seven,\nwhich means they're leaving three in the tank or four in the tank. Likely you are not. Likely you can double that number, right. You're not leaving three in the tank, you're\nprobably leaving five in the tank. If you're a beginner and you're utilizing\nRPE, you don't have enough experience to understand what it's supposed to feel like. You don't know what true max exertion is supposed\nto feel like. Now, I can appreciate the intent of RPE. I love it as a mechanism for advanced trainees\nto employ in their training because it provides that subjective variation that we bring to\nthe gym with us on a day in and day out basis. Maybe we can't hit 90% of our one minute max\nevery single time we go in or whenever it's programmed to do so. But on a given day we can give our best effort. We can equalize those efforts by having a\nlanguage that does it for us. An RPE 8 is an RPE 8. That being said, most of us aren't there in\nour training yet. We're not at that point where we can benefit\nfrom that. So, don't hide behind the science as a way\nfor you to hold back in your effort, because that first clip here that you're seeing is\nreally what we would call one of those RPE 7s. And by the way, before I even turn the page\non that, there's a lot of variation in how people define RPE. Some people will say that RPE 10 is just your\nmaximum effort, grinding through a repetition. Others will say that your RPE 10 is your maximum\neffort to get the repetition done, but can be done however you do it to get it to the\ntop. In other words, you can bastardize that wreck\nlike I showed you before. If this here is a 10, then this is a nine,\nbecause this is a good repetition, though it's a grinder. It's done in good form, but it's a grinder. Well, that's a nine. Well, then an eight would be just a little\nbit less than that. All of them are hard. There's no instance here where the effort\nisn't hard. If you want to make changes, you have to challenge\nyourself. And that means that everything you do must\nbe hard to some extent. Not that it gets to the point where your form\nbreaks down, not to the point where you start to look like you're not even doing the exercise\nanymore, but you still have to be putting in effort. If it looks like you're whistling Zip-a-dee-do-dah. [Video Clip: \"You'll be whistling Zip-a-dee-do-dah\nout of your assholes.\"] you're not training hard enough. Which brings me to these other points, the\nthings that are all encompassed in those clips that are going to help you to make sure you\nget this right every single time. Like you go into the gym and every time you\ntrain, you're doing all your favorites. I talked about this before, you shouldn't\nbe doing all of your favorites. This is not a greatest hits album that you're\nputting together here, guys. You should be looking for exercises that challenge\nyou, right? It's not always about doing-- the favorites\nmean that you're good at them. Let's start doing some of the things that\nyou're not so comfortable with and get better at those things. Which leads me to the third thing, and that\nis the absence of nerves. At some point you should have nerves before\nyou go train. See, as an athlete, when I used to compete,\nI was scared before I would step on the field, I was nervous. I wasn't nervous about getting ready to actually\ngo play. I wanted to play. I couldn't wait until the whistle so I could\nstart playing. But I was nervous. I was nervous about screwing up. I was nervous about missing the tackle, about\ncosting our team the game. I was nervous about the outcome, what have\nwe lost? I'm going to have to deal with that. Well, it happens here in the gym, too. When you're serious about your training, you\nshould be nervous about the lift you're about to perform. Not all the time, but in some instances, because\nwhat that means is that you care about it, number one, care about it enough to give your\nbest effort and actually have nerves. But secondly, you care about missing the lift. Not for the next day or two or a week, like\nit's going to ruin you, but it should mentally put you back a little bit where you're disappointed\nthat you didn't get to lift, that you were prepared, or you thought you were physically\nprepared to do. So, there should be nerves because it means\nthat you care and if they're not there, then you're not training hard enough. Which brings you to another point, that ugly\nface. No, no, no, not this one, no, no, that's just\nthat's always there actually Jesse. I'm talking about like this when you're training,\nlike, do you ever get that ugly face? If you don't, I don't care what you're doing,\nyou're not training adequately enough with enough stimulus to create any type of muscle\ngrowth. Remember, we're talking about building muscle\nhere, forcing new muscle growth. It's not something anybody wants to do. It needs to be pushed. You've got to get comfortable being uncomfortable\nand along with being uncomfortable comes that uncomfortable looking face. Don't just make the face, make sure the effort\nis causing the face. But if you make that face, because the efforts\nthere, you know, you're on the right track, it should never look like you're going for\na walk in the park or like Jesse here, just it out bench press rep after rep after rep,\nthat's not how you should look. Which brings me to two more points here, and\nthat is the actual effort within a set and then the effort within a workout, The effort\nwithin a set, you should never stop when you're tired, you should stop when you're done. You see, there's a big difference between\nthat. There's a lot of people who are not making\ngains that stop when they're tired. When they start to get a little bit burned,\nwhen they start to feel like, oh, this is getting tough. If you stop, then I promise you you're not\ngoing to see any worthwhile results for the time that you're spending in the gym. Because I don't understand the effort you're\nputting forth, because you're not. But the time that you're spending in the gym\nbecomes wasteful. You could be doing so many other things. You can be spending time with your family,\ndoing something, picking up a hobby and becoming productive at something, maybe you find a\ncure for cancer. But you'll be doing something much more productive\nthan what you're doing in the gym. Because if you're just stopping when you're\ntired, it's not an adequate stimulus. Again, getting comfortable with being uncomfortable. That's key. So, we want to make sure that we're pushing\nourselves to the point where we're getting the work done and then only at that point\nare we stopping, not when we're just starting to feel fatigued. Which brings me to the last point here. And it's when you're wrapping up your workout,\nright, and it's all said and done, if you leave feeling refreshed rather than accomplished,\nyou've done it wrong. I have never left the gym with the intent\nto try to build muscle in that workout feeling refreshed. Not a single time. I leave there feeling that I've given my best\neffort and I feel like I've accomplished something, but I feel drained. Now, not so drained that the next time I come\nback I can't perform, then you would be doing too much. You still need to be able to come back to\nthat next workout because you've got to realize that this is a big picture. No matter what you do in today's workout,\nit still relates to tomorrow's workout and yesterday's workout, and how that big plan\nfits together and the pieces fit together in succession, it all matters. So, if what I did today compromises my ability\nto come back tomorrow and do anything worth a damn, then I did too much. But that's not what I often find, I find people\nleave feeling refreshed. This is that's exercise, exercise makes us\nfeel refreshed, training does it. Training makes us feel like we've worn our\nass out and it should. So, what I'm saying here, guys, you can boil\nit down to one thing, and here's the last point I'm going to leave you with. I always say this, when you have taken from\nyour body what it wasn't willing to give you in a workout and you've likely trained hard\nenough. It's as simple as that. If you go in and you just take out of that\nworkout, whatever your body was willing to give you for that day, ah, I don't feel like\ndoing much, that's it, I'm done, then you've likely not done enough. You need to take what your body was unwilling\nto give you that day and when you've done that, you've made an impact, a positive impact\non change in your ability to start growing muscle. And only when you do that and get comfortable\nwith those steps here, guys, will you start to see growth. And if you do, I promise you, you will see\ngrowth. I promise you. So, guys, I hope you found this video helpful\nagain, if nothing else, truthful. But that's what you can expect here. guys, I will tell you exactly what you need\nto do, you just need to work on it. If you're looking for programs guys, we break\nit all down step by step. And I try to build in these incentives so\nthat you push yourself. We have challenges built into all of our workout\nprograms because I want you to be able to push yourself objectively and compare yourself\nto your peers and yourself objectively against yourself. Not just objectively trying to pull some random\nnumber out of the air, but objectively against yourself. That's where changes are made. They're all built into our programs. They're all available over at Athleanx.com. You found the video helpful, make sure you\nleave your comments and thumbs up below. And also, if you haven't already done so guys,\nmake sure you click subscribe, turn on your notifications so you never miss a new video\nwhen we put one out. All right guys, see you soon."
}