{
    "id": "Swxk_btfWwk",
    "title": "How to Get Brutally Strong at Home (WORKS FAST!)",
    "description": "If you want to get strong fast but you think it's impossible because you are working out at home, you are definitely going to want to ...",
    "transcript": "What's up, guys? Jeff Cavaliere. Athleanx.com. So \ntoday I'm going to show you how to get brutally   strong away from the gym, like in your own \nhome. You see, because whether or not you're   training at home right now because of current \ncircumstances or whether you choose to train at   home, the beauty is if you do plan on going back \nto the gym, and you want to resume lifting big   again, what you do right here after watching this \nvideo is going to set the stage for all new levels   of strength and all new gains because you're \nfocusing on the things you might not be focused   on right now. I'm going to cover some of those \nsmaller things that pay big dividends in the long   run. With that being said, guys, let's dive in. \nAll right, so when it comes to building strength,   you have to always remember that all strength \nneeds to be built upon a solid foundation. Because   I've mentioned many times before in other videos \nhow if you're simply chasing numbers but you're   not necessarily building them upon a solid \nfoundation, eventually it's going to crack.   And when it cracks, those numbers don't mean \nshit anymore. See, if you can squat 600 pounds,   but you feel like a 600-year-old man the day after \nyou do it, it's not really serving its purpose.   So with that being said, the first area of focus \nhere is actually one that's going to impact   more of the dead lift if we do this right and it's \nstraight arm scapular strength. And what we mean   by that is the ability to have stability through \nour shoulder girdle whether or not you're moving   your arms here in space on a solid rigid torso or \nwhether you're able to move your torso in space on   a solid rigid arm positioning. And we know that \nin the deadlift this is required to perform it   properly and to have good bar path and stability \nof the bar as it travels up during every single   repetition. Well, that being said, what can you do \nat home? This is the beauty about this video. You   could do these things without equipment. You could \ndo these separate from your regular gym time.   Because if you don't do these things often enough, \nyou're not going to get the volume that you need   to actually make a long-standing corrective impact \nhere. So with straight arm scapular strength, the   first thing I want you to do, if you have access \nto a band is to simply do this: hang it over a   pull-up bar and do this straight arm push down. \nAnd again, this is just simply working on building   the strength in through the shoulder girdle as you \nmove your arms through space trying not to buckle   at the elbow or let the triceps take over. But we \ncould take it a step further here. This is a more   complicated body weight exercise it's the front \nlever raise. And because it is more difficult,   you could just simply utilize the band to assist \nyou and take away some of that weight to allow   you to do this. And all I'm doing is exerting the \nforce through my arms down into the bar to allow   my body to raise up. This is not simply trying \nto lift up with my abs. This is trying to move   my body by pushing down through those straight \narms, which again, is what translates over to   the dead lift where you need to have the same \nability to stay tight as you lift the bar of the   ground. And then finally, if you don't even have \nany equipment at all, if you don't have a pull-up   bar and no band, it doesn't mean you're out of \noptions here. You could do this, this is a sliding   body weight pull down. The principle is the same: \ncan you move your body through space, once again,   with that rigid arm set up here not sacrificing \nthe stability. Doesn't matter which one you pick,   guys, just make sure that you do pick one and \nyou start to work on this. Because, again,   this is a golden opportunity for you to build that \nnecessary strength that's going to translate back   over to the bigger lifts whenever it is that you \nget back to the gym. Next we move on to our second   area of focus, and this one's going to be very \nobviously when we think about what it is we're   trying to improve. This is horizontal pressing \nstability. Thinking about the bench press, right.   And we know that the bench press is one of those \nexercises that doesn't automatically come to mind   when we think about stability because we're laying \ndown on our back. But there's a huge amount of   stability required to do this right. And if we do \nit right, guys, that means that we're going to get   contributions from the shoulders at the bottom of \nthe bench press. You see, we need stability there   because the bar actually does travel in space. \nIt doesn't go straight up and down. The natural   arc of the bar is to be able to come a little bit \nlower on the chest line during the descent and go   back up more towards the head on the travel back \nup to the top. So if we can reinforce that and   work on stability through the delts, that would \nbe something we would want to work on. So how   do we do it? Well, we can simply do this push-up \nsaw variation. And what it does is when I come up   from the top of the push-up, and I actively move \nmy body forward, basically simulating that the   bar is going to be traveling closer down to the \nlower pec line because the hands in this case are,   you could see that the front delts fire up \nthere. They're need to control that forward   momentum. Right, if I were to exaggerate that \nand let my hands drift all the way down here,   my front delts would be trying to stabilize and \nkeep the bar a little bit more in its proper path   so they have to fire and stay engaged in order to \nprovide that stability. So we can mimic that in a   body weight scenario here that's going to help \nus to train that when we go back to the bar.   The second thing is I can actually just changing \nthe positioning of my hands here, rotating them   back about 45 degrees, to get that long head of \nthe triceps more engaged by bringing my arm both   closer to my torso and back into extension \nto have this translate a little bit better   over to the close grip bench press. But then the \nlast thing I could do is work on something else,   like the other side of my body, and there's \nwhere we know we need that stability of the   shoulder girdle back and down during any bench \npress to do it in a safe way. So the back widow   is an exercise here that comes in really handy. \nYou could do these either four repetitions, or   you could do them in a static hold. The fact is, \nit gives you a chance here without any equipment   at all to work on the key ingredients that are \ngoing to be necessary when you get back under   that bar. So while we're on the topic of the big \nthree, we might as well round them out and talk   about the squat. And what is it about the squat \nthat often times cuts the legs out from somebody   while they're trying to do it? It's the inability \nto maintain proper positioning of the upper   body actually. And to maintain proper thoracic \nextension. And I don't care whether you're doing   a high bar squat or a low bar squat, you still \nneed to be able to have good thoracic extension   to maintain the proper bar path that we mentioned \nfor the dead lift on the squat too. If you want to   do a front squat it becomes even more imperative \nbecause once that load gets out in front of you,   any additional thoracic rounding because you're \nlacking mobility is going to be disaster for what   it is you're trying to accomplish. So how do we \ndo this? Once again, we break out that minimal   equipment. And the first thing we can do is wrap \nit up around the top of the pull-up bar again and   just do this. This is just a banded walk back. \nAnd the idea is by putting our arms up overhead,   it becomes a little bit easier for us to get into \na thoracic extension position. Okay, so we get up   there, and we maintain that, we engage the muscles \nthat are responsible for holding that. And as we   walk back, the tendency is going to be for the \nbands to want to pull your arms forward and take   you out of that good thoracic extension. Being \nable to maintain that nice rigid upright torso is   what's being worked here and that's what you want \nto try to do. But ultimately, we're talking about   squatting. We want to be able to carry this over \nto the squat better. So all we have to do is when   we get back in that position, stay there, and now \ndo your squat so you're doing an overhead squat.   And we know how challenging it can be to keep your \narms from falling forward because once we start to   round the spine, as we go down into the bottom \nof the squat, it becomes really challenging for   people that are limited in thoracic extension \nto maintain it. So this is where you're trying   to reinforce that. And finally, let's say you \ndon't have any equipment. I like to do this,   this is just a simple wall slide. And all I'm \ntrying to do here is slowly try work my hands   up higher and higher and higher on the wall as my \nmobility allows me to. This engages the muscles   of the posterior chain and gets the rotator cuff \ninvolved to keep the arms externally rotated and   back up against the wall. And I slowly try to \ncontinue to reach up, up, up, never allowing to   sacrifice that thoracic mobility. Because as you \nsee here, as I do, I start to pull my body away   from the wall and around my upper back away from \nthe wall. That's not allowed here. You just simply   take what your body will allow you and work on \nit over time. And this in particular is something   you can do multiple times a day, multiple times \na week to continue to improve this. Moving on,   we're actually not talking about things \nthat impact everything we do. Actually,   anything that we do on our feet. And this is \nwhere I think that our hip weaknesses come and   bite us every single time. You see, because most \nof the things that we do, even the two big lifts   I just mentioned for the lower body, are sagittal \nplane driven. Meaning we're moving in this plane.   But our hips are so responsible for the stability \nand actually supporting our overall strength they   work in other planes. They work namely in the \nfrontal plane controlling the ab and adduction,   and they also work in the transverse plane, and we \nneed to work on the hip rotator strength as well.   And these are things that you just don't get if \nyou tend to ignore these smaller exercises. So if   we started off with a little bit of equipment, the \nfirst thing that we can do is just this clamshell   exercise. You just take a band, you put it around \nyour knees. Here, I've doubled it up, and all I'm   trying to do is work on isolated external rotation \nof the hip. Just trying to overcome the resistance   to the band, I'm not trying to lean my torso \nback into it, and I'm not trying to cheat it.   Now you'll be surprised at how weak you probably \nare here. You might not even be able to tolerate   much of an external load from the band. The next \none here is one you can actually choose to either   wait or not wait. The fact is it's determined by \nyour level of strength and the adductors. And I'm   going to bet that your adductors are actually \nprobably pretty weak or a lot weaker than you   think they are. And the irony of that all is that \nthe adductors are actually incredibly relied upon   to get you out of the most difficult portion of \nthe squat, which is the bottom. So what you can   do is you can take this exercise here an either \nhold a dumbbell in a [inaudible 09:09] position if   you're capable, or just do it the way I'm doing it \nhere, body weight only, and you allow your leg to   simply drift out to the side. And when you get to \nthe bottom here, I'm not just pushing through the   grounded leg that I have for my stable leg, I'm \nactually allowing the sliding of the outside leg,   the elongated straightened out leg to pull me \nback to the top. I want to feel as if I'm almost   squeezing my body back up to the top as opposed \nto pushing my body back up to the top. And then   finally we move on to that last component where \nwe want to work on the other side of the hip,   the abductors, we can do something like this. And \nthis one's great because it doesn't require any   equipment at all. It's just called the abductor \nhip drop. It's something that I've talked about   many times before on the channel and the value \nof this. And it acts to isolate that glute   medius, it's helping to give us that hip hiking \nability. I simply stand on that outside leg and   I try to allow myself to just get comfortbale, \nrelax, let the hip drop. But now in order to   overcome that, I have o squeeze in this frontal \nplane. No more of the sagittal plane stuff,   the frontal plane to be able to get my hip back \nup to the top. It's relative adduction because   my foot is still in contact with the ground, but \nit's still targeting the same muscles that tend to   get weak, and derail our overall performance in \nthe gym, and it's so simple to address, we just   have to remember to do it. Here, with no excuses \nand no equipment requirements, you're going to be   able to do that. And then finally here, we've \ntalked about how all these things transition   over to those bigger lifts. But the one thing that \nwe've left out is how do we improve that vertical   pressing stability? Right, to get back to doing \nthe overhead press in bigger numbers than you are   right now and making sure that you're staying safe \nat the same time. Because any time you lift your   arms up over your head, the tendency is to set \nthe stage for dysfunction because we don't pay   enough attention to what we're doing to prepare \nthe shoulders to do that, especially with heavy   weight. So here's a great opportunity to do it. \nWe know that when we put our arms up overhead,   the scapula itself has to be able to rotate in \nspace. And to do that well, we need to have good   active engagement of the lower traps. Beyond \nthat, we also know that when we raise our arm   up over our head, impingement looms if we don't \nhave good strength and stability and contribution   of the rotator cuff. So the first couple things \nI want you to do actually won't really require   much equipment at all. The first one is some \nvariation of a face pull. And I've showed you guys   here in this channel before that there's a lot of \ndifferent ways you could do a face pull. Ideally,   you'd do it with either a cable at the gym or \nsome type of band, but ideally you add some   overhead pressing component to the end of every \nrepetition that's going to have a better carry   over to what it is we're trying to train right \nhere. But it doesn't mean that you have to use   a band or a cable. I showed you that you could use \na bag, a duffle bag from the ground, or you could   even just throw a weight inside of a towel, still \nmimicking the same action of the face pull with   that overhead press component. The next thing you \nwant to do is work on that lower trap engagement,   and this is where I like the high to low band pull \napart. And I like the high to low as opposed to   simple at eye level because it helps to get those \nlower traps more engaged. Once we get the arms up   overhead and we had the rotation of the scapula, \nthe lower traps are going to be more active. So we   can do that high position down to low position, \nmaintaining good stability throughout every   repetition. But then I like to take it up one more \nnotch, and we do this because we have the ability   to incorporate closed chain training for overhead \ntraining transition. Which means we can put our   hands on the ground. And just by putting our \nhands in contact with the ground, we're getting   the additional benefit of proprioceptive stability \nof the shoulder. So what we do is we do something   like this. This is just a hand stand push-up. And \nof course we're not getting the range of motion   that's going to carry over to an overhead press \nknowing that we want to bring the bar down more   to the chest level. But we still have the ability \nto get that compression inside the shoulder joint   while we're doing the pressing overhead, which \ngives us the added stability. But we could take it   a step further, this becomes more dynamic. This is \na wall walk. And what we're doing is we're walking   out nice and controlled and slow. And there's \na moment here where one hand is going to be off   the ground to allow the other one to move forward \nor backwards. That provides a little additional   demand on that stability of that one arm that's in \ncontact with the ground. But the key is going nice   and slow, walking yourself to your chest is all \nthe way in contact with the wall, and then walking   yourself back out. And then obviously these \nare pretty difficult variations here for those   that are at more of a beginner level, but that \ndoesn't mean that you're out of options. So you   could do the pipe push-up. You still get the same \nbenefits of the closed chain environment here,   and you're simply taking away some of the demands \nof the exercise by keeping your feet in contact   with the ground. Get as steep of an angle as you \npossibly can and still work on slow repetitions,   controlled repetitions to continue to train that \nstability that's going to pay of big dividends   when you go to push that bar back up over your \nhead. Let's face it, guys, strength is the base   of the pyramid whether you're trying to get better \nat a sport or whether you're trying to get better   at lifting. The fact is, there's more to the \nstrength pyramid than just the pyramid. You see,   it's more of an iceberg, and that's what we're \ntrying to get at here. Beneath the surface is   where stability resides. Because if you don't have \nthat stability, as that top end strength continues   to build, lacking stability you're asking for \neither an injury or you're never going to realize   your true strength potential. And that's why you \nneed to start focusing on the things that build   that stability even if they seem boring, even if \nthey seem small, even if they seem unimportant.   And guess what, when you know you can do them at \nhome, it gives you an opportunity to get this work   in either separate from your gym session or when \nyou're forced to be away from the gym there's no   excuses. Guys, if you're looking for a program \nthat never overlooks any of these things because   we know how important they are, you can find them \nover at Athlean-X, built into all of our Athlean-X   programs. In the meantime, if you found the video \nhelpful, leave your comments and thumbs up below,   let me know what else you want me to cover. \nI'll do my best to do that for you. And if   you haven't already done so, guys, make sure you \nclick subscribe and turn on your notifications   so you never miss a new video when we put \none out. All right, guys, see you soon."
}