{
    "id": "t0_lZGmo9ag",
    "title": "Shoulder Workout Finisher (WORKS EVERY TIME!!)",
    "description": "Finish every workout the way you started it - the right way http://athleanx.com/x/next-level-training-here Not all shoulder workouts ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. Today I'm going to show you a perfectFfinisher\nfor a Shoulder Workout to help take you not just to the end of your workout but through\nthe end your workout. To that point where we create muscle overload. And that's the most important thing if you're\nlooking to add size. Now you don't have to be a Seismologist to\nunderstand this technique because we call this the tremors technique, and you don't have to have a real background\nin earthquakes to figure that out, but it actually works very similar to an earthquake\nand how it affects your muscles. We know that with an earthquake there's an\nepicenter and that's where all the action's occurring, that's where the brunt of the earthquake is\nand then people will still feel tremors around the area of the earthquake usually a long\ndistance away. Well we can do the same thing here by actually\ncreating sort of the epicenter in the weakest area of our Shoulders. In this case it's going to be most likely\nfor you your rear Delt, your Posterior Deltoids. So we'll take the weight that we'd normally\nfail in, in a 10 to 12 rep range for a Bentover Lateral Raise, ok. That is the guiding weight that we'll use\nfor the rest of this set, this tremor set. And from there you move then up to a Side\nLateral Raise. Well we know that a properly executed Side\nLateral Raise will actually have your Arms traveling in a position here, because again I'll actually put the whole\nvideo out on this if I have to in the future, but the proper position is actually with our\nthumbs a little higher than our pinkies, not the opposite way around, which will actually get a little bit of external\nrotation in at the Shoulder and still keep some work going in those Posterior Deltoids. So you're going to still feel a little bit\nof that tremor in the back even though you've traveled a little bit forward to the Medial\nDelt. Then of course once you go to failure there,\nyou're going to now go up into the Front Raise. And now the Front Raise, we've moved the focus\nnow into the Front Deltoid, but we're going to feel a little bit of that\ntremor carrying through into the side Delt and of course all the way back to the rear\nDelt because we haven't rested between any of these\nlegs of this journey. And then finally we go the the all so simple,\nOverhead Press, except at this point, fourth in line in our\nexercises, it becomes pretty damn hard. And yes, guess what, when you do these you'll\nstart to feel some of those tremors still going on in the back side, all the way back on the other side of your\nShoulder because of this cumulative fatigue. So I'll actually demonstrate it for you, exactly\nwhat this looks like in action. We're going to take our Dumbbells again, I'm\ngoing to use the ones that would allow me to fail in the 10 to 12 rep range on a Rear\nDelt Fly. Ok, so I'll position here so you can see what's\ngoing on. I'm just going to come up and back. I'm trying to make almost a 'W' here with\nmy arms so that this positioning here alright, so that I get a little bit of that external\nrotation at the top as well. Let me go lay up now for the sides. Alright from here and up. I can feel it in the back too. 10, 11, 12. And now up to the front, catch your breath. 1, 2, 3, 4, 5, 6, 7, 8, god 9, 10, 11, one\nmore 12. And now, got to finish them off with that\nreally light 20 pound Overhead Shoulder Dumbbell Press, but it's already killing me to get them in\nthis position right here. And press up and I can already start to feel\nthat way back in the back of my shoulders as well. 6,7,8,9 ohhhh. And guess what, you rest about 30 seconds,\nthose were 20's. I come back down here, I've got my 15's and\nthen I repeat it all over again. And this is your finisher guys. You go until the last set. I've even performed some, where I take my\nhands and I go through the motion with just as hard a squeeze as I can possibly get, through here and the Rear Delt, up here again\nfor the Sides, really trying to squeeze as hard as I possibly could right at the top. And then come up to the front here and try\nto squeeze as hard as I possibly can. And then go back up to the Press one more\ntime and squeeze as hard as I possibly can. And I can tell you, right after a hard shoulder\nworkout, it doesn't get any better than that. That is a great way to finish off a high intensity\nShoulder Workout capable of taking you to that next level, capable of producing growth\nfor you. Guys, if you're looking for a way to train\nintensely in a much shorter period of time, you've got to start being willing to trade\nin some of that workout length for intensity. You can't just keep coasting through your\nworkouts, thinking that doing the same thing over and over again is going to give you better\nresults. Unfortunately it's going to give you the same\nresults that you've been getting. If you want that jolt and you're looking for\nme to coach you through every step of the way, I'll do that. Head to ATHLEANX.COM, get our ATHLEANX Training\nSystem, and I will walk you through every workout,\nevery technique I've got in the next 90 days. I hope you guys found this video valuable. If you want more like, let me know. We've got finishers for other areas as well. I'll make sure I can bring them back to you\nhere, right here on this channel. Alright guys, I'll see you back here soon."
}