{
    "id": "T3NHYjGhAkk",
    "title": "Chest Workout (SORE IN 6 MINUTES!)",
    "description": "Sculpt a chiseled chest here - http://athleanx.com/x/sculpted Subscribe to this channel here - http://bit.ly/2b0coMW If you are the ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. The Sore in Six series continues and this\ntime we're hitting the chest. Once again, we're out to prove that if you\ncan trade in a little bit of workout length for intensity we can get any muscle to respond\nbecause no muscle is safe in the Sore in Six series. We're going to start with a single pair of\ndumbbells that you can do right here on the floor. So this makes it available to everybody. Home, or at the gym, regardless of where you're\ntraining. The first exercise you're going to do is a\nfloor fly, which provides us with two big benefits. First and foremost, you know that I care about\nthe integrity and the safety of your shoulders and joints. We're going to be able to do that with this\nversion here because we have the safety net of the floor which allows us to do the more\ncritical thing here, and that is using heavier than normal dumbbells for this exercise. We want to overload the eccentric portion\nof the lift. In other words, we want to have as much tension\nas we can with elongation of the muscle without jeopardizing our shoulder. So we can do that here. As you see, I'm going to move my elbows in\nto press them back up to the top, to basically get myself in position to perform the next\nrep. We keep doing that for a minute straight and\nthen we move onto the next exercise, which is the dumbbell pullover. You're probably thinking \"Jeff, I thought\nthis was Sore in Six chest, not back.\" It is if you change the way that you do this\nexercise. Instead of allowing your elbows to flare out\nand leading, and initiating the contraction with your elbows on the way back that would\ntarget more of your back. Here you want to get the upper chest. So instead we try to keep our elbows tighter\ntogether and more importantly, you're almost trying to squeeze your biceps together here\non the dumbbell. When we initiate the contraction and focus\nin right here, on the upper chest, pulling from there by contracting and adducting our\nhands together as we pull the dumbbell we can increase the tension even more by performing\nit in one and a half rep style, as you'll see us doing here. We move on, again, with no rest after doing\nthat for a minute to the next exercise. Again, with one dumbbell. Now what you want to do is grab the ends of\nthe dumbbell. You can see me doing it where I'm hooking\nmy thumbs underneath. I have a nice, secure grip here. If you're not comfortable with that you can\ndo what I'm showing you here instead, which is a crush grip. The bottom line is you want to squeeze the\ndear life out of that dumbbell so you can activate the chest – again, the adduction\ncomponent of the chest function – we're going to squeeze the end of the dumbbells\nas I'm doing here and then rep out as many reps as we can. We've got to go a little bit faster, we want\nto increase the volume here, we want to basically take an exercise that normally would be a\nlot easier to do. But because it's third in line after doing\nthe other exercises we've used the mechanical drop set here to make this much harder than\nit is. So we're going to continue to increase the\nvolume here for that one, final minute. Then finally you get a break of one minute. Then you go right back into the next three\nexercises. Again, we're going to work our way out again. One and a half rep on the dumbbell pullover. One more time on the dumbbell flies, and then\nfinally we're going to finish with this variation here with the Spiderman pushup. You don’t have to do the Spiderman where\nyou're picking up your leg, but what it does is, it allows us to increase the rotation\nbecause look what we're really focused on here. It's the rotation of our body away from one\nshoulder, or the other to increase the eccentric stretch on the chest. So if I'm rotating to the right as I go down,\nleaving the left pec more stretched and under tension. If I rotate the other way we're doing the\nopposite. You want to go as slow as you can alternating\nyour reps here. See if you can finish this out. Maintain it for one minute straight, alternating\nreps if you can. Now, as always in this series I promise to\nput myself through the torture, too. Here it goes, for your enjoyment. So there you have it. Another Sore in Six in the books. Guys, remember, as I said, no muscle is safe. Especially if you're willing to put a little\nbit of science back in what you do, and secondly if you're willing to trade in some length\nfor intensity because intensity is going to be the key whenever you're trying to illicit\na response out of a muscle that maybe you're not getting to respond for you now. In the ATHLEANX training program we do all\nof that. I try to manipulate your training intensities. I try to get you to put the science back in\nstrength and more so, I'm just trying to get you the best results that you can get from\nyour hard earned effort because I know there's nothing more frustrating than wasting time\nin the gym and seeing nothing for it. If you're looking for a program that will\nput the science back in strength and lay it all out for your step by step head to ATHLEANX.com\nand get our ATHLEANX training program. In the meantime, let me know what you want\nme to cover here on this channel and I'll do my best to do that in a future video. All right, guys. I'll see you soon."
}