{
    "id": "TdzrYvgvv3o",
    "title": "Do This EVERY Day for a Flat Lower Belly (GUARANTEED!)",
    "description": "If you want to flatten your lower belly you actually have to do more than just diet. In this video, I'm going to show you how even if ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. \nSo today I'm going to show you something that   you can do every day. As a matter of fact, best \nin the morning, that's going to guaranteed help   you to flatten your lower belly. Now, here it is, \nyou ready? Eat less every day than what you burn   off? That's it. Done over video done. Actually, I \ngot a lot more to show you than that. The fact is,   though, when it does come to getting a defined \nmidsection, that becomes a body fat issue and   heavy nutrition in check is going to be the number \none determinant of getting your body fat levels   down. However, what I'm going to show you here \ntoday will work no matter what your body fat level   is right now, because we're talking more about a \nmuscle dysfunction than we are about anything else   and we're talking about the transverse abdominis. \nSo, we break out the muscle marker here to show   you what we're talking about. This muscle actually \nuniquely runs this way, okay? It doesn't run this   way like the six pack muscles do, it runs this way \nand it goes all the way around our back. And what   happens when a muscle contracts? It shortens. So, \nwe're thinking about how that muscle contracts,   I've used this description before, it does \nthat. When it contracts and this is in its   loosened state, when it contracts, it tightens \nup. You can do the same thing for your waist   and particularly down here in the lower belly \nand lower abdomen if you train this muscle.   And just like a muscle that is untrained, it's \nusually going to go to its length in state. So,   if we think about the muscles in our upper \nback, when we don't train them, they become   more lengthened in a relaxed state and that makes \nour posture become more forward, really rounded   shoulders, slumping upper back. The same thing \nhappens here a lack of tone in the transverse   abdominis is going to create a distended \nlower abdomen. Again, no matter what level,   I'm going to show you and prove to you in a second \nhere how it works on any body fat level. \n  So, what we need to do is something called a \nvacuum. Now, you don't have to be an all time,   Mr. Olympia, to pull this off. You just have to be \nable to do this consistently and you can do it in   less than a minute every single day. It's easiest \nto do in this position here leaning forward so,   I think it's a perfect thing to do right when \nyou get up in the morning off your bed and I'm   going to show you how to do it when you stand up, \nbecause you need a little bit more control. The   idea is, can we shrink this down, get control \nof this so that we can feel it contracting. If   you do this right, you're going to probably \nfeel like a cramp right around the bottom   here. Again, anybody at that level, you can \nactivate this muscle. So, the goal is this.   I'll explain it first and I'll do it because \nit's hard to talk when you're doing it. \n  You want to take a huge deep breath in and then \nexpel it all out. All out. And when you find that   you have nothing left in your lungs at that \npoint, you then will easily be able to create   this reverse pressure, this vacuum back where \nyou could pull your abdomen in. When you do,   it's going to demand that this transverse \nabdominis does exactly this. It does that. And   when it does that again, you'll feel it almost \nlike a cramp in here, but you just want to be   able to hold it. It will be difficult to talk at \nthis point because if you've done it properly,   you've gotten rid of all the air in your lungs. \nSo, part of this exercise is actually learning   how to hold your breath for longer and longer \nperiods of time. I'm happy with even just five to   ten seconds in the beginning and do it in terms of \nrepetitions, three or four, and you're done. \n  As you can hold it for longer and longer, \n20 seconds, 30 seconds, you'll get better   and better control here and it will become easier \nfor you to do this. You wouldn't obviously try to   hold it for much longer than that. And by the \nway, you will be able to start incorporating   some breaths as you get better at this so you \ncan hold it for longer periods of time. So,   here's what it looks like. All right. I'm going \nto do it actually first standing and then I'll   show you how to do it here. So, again, I'll \nstart with a big, deep breath and then I'll   blow out. Once it's out, I'm going to pull it, \ntry to pull my bellybutton back towards my back,   just like this. And through that, and again, \nI can feel it cramping right here. Now,   I actually had some issues with this a while \nback when I had an inguinal hernia. Being able   to be consciously aware of doing this was causing \nsome pain because I was pushing down on the area   that I that I was herniated. When I got that taken \ncare of, I had to sort of readdress this and that   is just showing you once again that if you pay \nattention to it, it could actually benefit you.   If you don't pay attention to it, you're not \ngoing to do it. There's no other way to train   this muscle than to actively try to do it. So, if \nwe do it against, let's say, the side of a bed,   it's just easier for people who don't have a \nreal ability to contract this muscle to do it   from this position. So, what I would do is I just \nget here like this and the same thing applies,   going to take a big deep breath and expel it all \nout and then pull up. So, it looks like this.   And breathe out. \nSo if you do this every morning,   maximum a minute is going to help you immensely. \nJust it's not about having to do a lot of volume   here, it's just the consistency of training this \nmuscle and alerting it that you have the ability   to contract it. If you don't consciously address \nthis, you're never going to get the benefits of   this muscle. And again, here's someone doing it \nthat doesn't look as lean as me. But the fact is   you're still seeing that noticeable decrease in \nthe waistline. We're talking about a conscious   contraction. If you don't feel something inside \nyou doing that, having that shrinking effect   there, then you're not getting this muscle here to \ndo its job and that's what we're focused on. \n  I hope you guys found this video helpful. Make \nsure you leave your comments and thumbs up. Let   me know how it's working for you as you do it. \nIn the meantime, if you're looking for programs   where all the things matter, we actually have a \nbrand-new program called Core4 because the core   is made up of more than just the abs. I know \nthey're the area a lot of people focus on,   but the obliques, the transverse, the low back, \nit all works together. That program's over at   Athleanx.com. In the meantime, if you found the \nvideo helpful leave your comments and thumbs up   below. Let me know what else you want me to \ncover and I'll do my best to do that for in   the days and weeks ahead. If you haven't \nalready done so, click subscribe and turn   notifications so you never miss a new video when \nwe put one out. All right guys, see you soon. "
}