{
    "id": "TgrLuHOLXf4",
    "title": "You CAN Increase Your Pushups (JUST DO THIS!)",
    "description": "If you've ever wondered if it was possible, it's true; you can increase your pushups. In this video, I'm going to show you how to ...",
    "transcript": "And so if your dream has always been to be able to \ndo some really cool things with pushups like this,   well, you're on the wrong friggen video \nbecause I can't do any of that shit.   But I do promise to help you find the right type \nof pushup to help you build more muscle today. \n  What s up guys, Jeff Cavaliere, athleanx.com. \nSo look, unless you are in the military right   now or your goal is to simply do more \npushups, I think we could all agree,   pushups are more of a means to an end to something \nbigger and in this case, a bigger chest. If you're   looking to build a bigger chest through pushups \nI would ask you not to try to simply increase the   number of pushups you're doing, but to actually \nincrease the difficulty of the pushup that you're   doing. Think about it this way. When an athlete \nis trying to build more muscle in the gym,   they have the option to simply add more weight \nto the end of the bar in the form of progressive   overload, which is a tried-and-true method for \ndoing that. But what is the calisthenics athlete   do? Or what is somebody that's just looking to \nbuild their body through pushups? You have to   find a more difficult version of the pushup. \nSomething that mechanically challenges those   same muscles in a more difficult way to provide \nthe progressive overload that you're looking for.   In this video, I'm going to show you exactly \nhow to do that from beginner to advance,   what level of pushups should you be \ndoing, and how do you progress yourself   to make sure you're building muscle? Let's \nstart breaking them down one by one.\n  So when you're trying to build muscle with \npushups, you need to make sure that the volume   that you're accruing is effective volume. In \nother words, the reps that you're doing or   doing something. And when we're talking about just \ndoing a certain number of pushups or increasing   the number of them, you're not ensuring that. And \nthere's a big relationship between the overload   that you create through choosing more difficult \nversion of the pushup or more challenging for you   and the number of reps that you do. So what \nwe have to do is pick a rep range, and for me,   I always say somewhere between 20 and 30. If \nyou can get to 30 of any variation of a pushup,   it's time to stop doing that pushup and instead \nfocus on something more challenging. \n  So what would the beginners do? Well, let's \nsay we start all the way at the bottom a knee   pushup. If you can do 30 knee pushups, it's time \nto move on. But if you can't do them like this,   you need to focus on doing them correctly. And \nwhat we're doing is keeping that straight back   and keeping that butt down. Because far too \noften people do this and it makes the exercise   not even really that effective for the chest, \nit turns out almost more to a shoulder exercise.   But instead, if you keep that butt drop down \nand you will lower your chest down in every   rep and importantly, on all these pushups you'll \nsee extend your elbows all the way out. At that   point when you can hit 30, it's time to move on \nto the next exercise, which would be this. \n  And this would now be the classic pushup. So \nwe get those knees off the ground and again,   lower yourself all the way down, touch your chest \nto the ground and come up. And the key here,   as always, is to get that full extension of \nthe elbows. I've made videos all about this   in the past. In fact, Pushups are Killing Your \nGains, and that is because people always cut   off the last two inches here, which is the most \nproductive part of the exercise. If you can get   through full extension and you can work your way \nup to the point where you can do 30 of these, then   it's time to move on to the next variation. \nWell, now the next challenge will become the hand   release pushup. And what's interesting about this \nis that slight little additional movement at the   bottom is going to do a few things to make this \na lot more difficult and challenging. Number one,   it's going to slow the tempo down, and \nany time you slow down tempo on a pushup,   it becomes more difficult. And the tendency is \nto rush through our reps to get to that number   again. But with the focus now on increasing the \ndifficulty level to drive that muscle growth,   this is now an option for you. And here again, \nwhat it does is also challenges some different   muscles to the rotator cuff. The simple \nact of lifting your hands off the ground   is going to engage the rotator cuff, which is \na shoulder stabilizer muscle that's important   to the move. But more importantly, it's \njust increasing the range of motion of   every single repetition that you do, ensuring \nthat you get your chest down to the ground. \n  But if even 30 repetitions of the hand release \npushup is below your ability level, well, it's   time to now start doing something different and \nthat is playing with the tempo of the exercise.   I mentioned how slowing them down makes them \nmore difficult, well, if you do a pause pushup,   you're going to have a more challenging time \ndoing the exercise. But again, challenging equals   more muscle growth. In this case, you simply go \ndown to the bottom and you pause for about three   seconds on every rep. Again, it's actually more \ndifficult to hold this pause in this very shallow,   low depth position because your muscles are still \nfiring to hold you there. But when 30 repetitions   of these aren't even able to make your arms quiver \nanymore, well, we still stick with the same theme   of tempo, but we move on to a more challenging \nexercise and that's the one and a half pushup.\n  In other words, for every one pushup you're doing, \nyou can do an extra half. You have to go down,   have the body control to lift yourself up halfway, \ngo back down again to the hardest, most difficult   range of the pushup and then push yourself back \nout of it again. Again, we're playing with the   tempo, but more importantly, here we are, playing \nwith the overload and tension felt by the chest,   and that is the main driver of the exercise s \nability to build more muscle growth for you. \n  But if even those are now no longer providing a \nchallenge for you, what are you going to do now?   Well, again, we have another option for tempo, \nand this time we take it to the extreme. These   are slow motion pushups, and what we're talking \nabout is five seconds down and five seconds up.   And what makes this more challenging is the five \nsecond eccentric or the lowering portion of the   rep. And why that's challenging is because that's \nactually an additional driver of muscle growth.   Well, now you've got two things working at \nonce, you've increased the difficulty level   and you've added that extra component. But once \nagain, your goal here is 30 when you can do 30   of these, once again, it's time to move on. \nAnd at that point, the best thing you can do is   actually start to decrease the number of points \nof contact that you have with the ground. The   pushup is done with four points of contact on the \nground, two hands and two feet. But when we start   to lift one of those off the ground, the exercise \nbecomes instantly more difficult because now the   remaining limbs are in control of more and more \nbody weight. So what are we talking about? Well,   we have exercises like the prowler pushup, which \nis going to again take one of those feet off the   ground, shifting more of that load, especially as \nwe anteriorly shift our whole body weight forward.   Then we have the spider man push pushup, which is \ngoing to open up that hip, take it out to the side   once again, creating more overload for the muscles \nthat are pushing the rest of your body weight up   with one less limb helping out. And of course, \nwe can do the step three push up. This requires   maybe a little bit more flexibility and the leg \nthat steps through and across. But once again,   it's still doing the same thing, decreasing those \npoints of contact on the ground and making it more   challenging. And finally, we have the cross knee \npushup, which might be the easiest of these for,   but it doesn't really matter whatever \nversion you choose, choose one that's   going to provide that challenge that once again \ntakes whatever pushup count you were doing before   lowers it down to that more challenging level \nso it can produce the growth you're after.\n  But we're not done yet because we can actually \nkeep the challenge coming by increasing the   challenge on the chest alone. Meaning taking away \nsome of the assistance that we're getting from the   triceps. And the best way to do that is what \nthey wider and pushup. The wider the hands go,   the less elbow extension we're getting to perform \nthe pushup, the less tricep contribution to the   exercise. That means the chest is going to have \nto do more work here. And so while the traditional   version of the pushup may be more efficient, \nit's inefficiency that you're seeking when you're   trying to drive new muscle growth. Remember, if \nit doesn't challenge you, it won't change you.   To change your chest, you've got to challenge \nyour chest, and this is a great way to do it. \n  But we can become even more challenging and \ndynamic than that and that's with the archer   pushup. And here it's the same wide arm approach, \nwith the same effect of minimizing the tricep   contribution here and making it more difficult. \nBut the dynamic nature of it shifting the load   from left to right and left to right is going \nto definitely make this more difficult for you.   Every move from right to left is considered a \nseparate repetition, so when you can do 15 to   the right and 15 to the left, you've reached your \n30 count. Well, you still got one more step to go,   and that is something much more explosive.\nAnd for explosive we're talking about plyometric   variations of the pushup. And we all \nknow how difficult that can become,   but again, they can drive muscle growth through \nthat difficulty. Whether it be just simply a   regular plyometric clearing yourself off the \nground, or an additional clap that's going to make   you get a little bit higher off the ground, and \ntherefore you have to push a little bit harder.   Or actually taking it to an extreme level with \nthe superman pushup, having to get yourself   even higher off the ground. Or finally, something \nmore athletic like the Hannibal push up here. The   idea is find that key variation that drives the \nmuscle growth through the increase in difficulty   and not just an increased focus on reps. \nSo let's do a quick, helpful recap here. If   you're currently doing knee pushups, then you can \ndo 30 of those, it's time to move on to pushups.   If you're doing push and can do 30 of those in one \nset, it's time to move on to hand release pushups.   If you could do him release pushups for 30 reps, \nit's time to move on to the pause push up. \n  Once you can knock those out, increase that \nrange of motion to one and a half pushups.   From the one and a half pushup, once you're able \nto do 30, it goes on to the slow motion five   seconds up, five seconds down pushup. From here, \nlook to take one of those points of contact off   the ground through some variation of a three-point \npushup. From there, you're going to widen those   arms out to take the triceps out of the equation \nfor a wide arm pushup. Next, we're going to make   it more dynamic through an archer pushup. And \nwhen 30 archer pushups can be done, you're going   to move on to something much more explosive, \nsome variation of a plyometric pushup. \n  But if at the end of the day, you still insist on \ndoing traditional regular pushups, well, for God's   sake, do one thing for me, stop doing one hundred \npushups a day. Watch this video over here for an   explanation of why. And also, if you're looking \nfor a complete pushup workout, the perfect pushup   workout is one you can watch there. If you're \nlooking for a complete step by step program,   guys, you can find them all over at athleanx.com. \nAnd also, if you haven't done so, click subscribe   and turn on your notifications so you never miss \na new video when we pull one out. See you soon."
}