{
    "id": "TqXwI1MWZks",
    "title": "Ab Exercises Ranked (BEST TO WORST!)",
    "description": "There are many different ab exercises, but which are the best of the best and which exercises for abs should you avoid? In this ...",
    "transcript": "So, you see these Russian twists, well, \nyeah, they're going to have to go. \n  What s up guys, Jeff Cavaliere, athleanx.com. \nWhat you see behind me is a bunch of different   ab exercises that you likely recognize because \nyou're either doing them right now or you have   in the past. However, after today's video, \nyou're going to get rid of a few of them.   Today, I'm going to rank the ab exercises from \nworst to best, and there can only be one best.   I'm going to help you to find the exercises that \ngoing to give you the most bang for your buck and   give you the results that you're looking for. \nSo, in beginning our ranking here, we start   at the bottom. And unfortunately, the bottom here \nmeans the ab exercises that you might want to stop   doing. And the criteria for all of these exercises \nin terms of grading them is to consider A. How   multidimensional are they? Are they hitting just \none single area or are they helping us to do more   than just one thing because the abs are capable \nof much more? Do they have scalability to them,   allowing beginners all the way up to advance, \nto be able to work within their ability level   on that exercise? Or do they require a lot \nof equipment that might make it something   that is not possible for a lot of us to do? So, \nthat being said, I start with another criteria,   and that is the exercises that people screw up \noften and the first one is the Russian Twist.\n  Now, I like the Russian Twist, but again, this \nis done wrong more often than maybe any other ab   exercise in the gym. And because it's so popular \nand common, we have to put it in this category.   And the reason is that people turn this into \nsomething called a Russian Tap. They don't do any   rotation at all and we know that the abs prefer \nto control and produce rotation on their own.   However, if you're just tapping your hands left \nor right, all you're doing is an isometric hold,   which is not going to get the job done. \nIf you can ensure that you were getting the   right rotation by driving your elbow back behind \nyour body, almost as if you're rowing your arm   back and then therefore turning this exercise \ninto the way it should be performed, then sure,   it's going to bump up into a higher category. \nBut once again, many people don't get this right,   even when they know the cue, they still can't \nexecute the right way. So therefore, we have to   put the big red X through the Russian Twist. \nThe next exercise in this worst category is one   that suffers from the same problem unfortunately, \nit's the Bicycle Crunch. It's supposed to be a   rotational ab exercise as well. It's supposed to \nalso tie in some of the obliques. But if you just   flip your elbow side to side and pistoning your \nlegs up and down with nothing more than your hip   flexors, that I'm sorry, you're not doing what \nyou should be doing for your abs. Of course,   there's another way to do this exercise as \nwell and I pointed it out many times before   that would jump this up into a much better \ncategory. And that would be by concentrating   on the actual rotation of the shoulders and not \nworrying about the elbows. But many of us still,   even with that proper cue in mind, don't get \nthis right. And because of how commonly performed   and mis performed, it is we have to put the big \nred X through the Bicycle Crunch as well. \n  And so, if you watch any Athlean-X ab \nvideo before, by the way, if you have it,   where the hell have you been? You likely \nknow how I feel about the Dumbbell Side Bend.   I don't like it and there's a lot of reasons why \nnot. It belongs in the worst category because it's   an inferior ab exercise. As a matter of fact, it \ndoes more for your obliques than it does your abs.   And even there is not effectively the best thing \nyou can do. And if you even put two dumbbells in   your hands to perform this, you're just turning \nyourself into a human seesaw. But more so than   that is what happens at the low back when people \nperform this. You can create some compression on   the side that you're leaning towards and you \ncan create tightness in the muscle called the   quadratus lumborum, which oftentimes gets \ntight and leads to chronic low back pain.   For all these reasons, guys, you should \nprobably have expected the Dumbbell Side   Bend is also going to earn the big red X.\nSo, the exercise behind me are dwindling and   we're still not out of the worst category, which \nshould be a bit of a wakeup call. And I target   next to one that's right here, dead center in the \nmiddle of the screen and it's the Plank. And look,   I understand that this exercise can be beneficial \nfor some, but that some is very few. And what I   mean by that is this exercise tends to be far \ntoo remedial to provide any benefits in terms of   advancing your level of core strength. If you \ncould do a play for more than a minute and a half   or two minutes, you are way beyond the ability \nto do this exercise. You need to move on to   something else. Not to mention the fact if you're \nnot being conscious about contracting your glutes,   this exercise can turn into nothing more than \na hip flexor tightening reinforcement exercise   because you're driving and keeping yourself off \nthe ground by pushing through your hip flexors   and not through the appropriate muscles. We have \nto put the big red X through the basic Plank. \n  And finally, we get to wrap up this bottom of \nthe barrel category when it comes to making   our ab exercises with one sitting up here in the \ncorner, the Lying Leg Raise. Now, I like exercises   that challenge the lower abs by using the weight \nof your lower body to do that. However, when you   limit the action to just lifting your legs up and \ndown, relying on the fact that this will create an   isometric stress for the abs, it's not going to \ncut it. What we're doing here is this causing a   hip flexor over dominant exercise. Simply raising \nyour legs up and down, using only the hip flexors   is going to lead to an arching lower back, which \ncan cause a low back pain or just overactive hip   flexors, which can lead to low back pain. So, for \nthose reasons, this two gets the big red X. \n  And with that I finally get to break out my \nblue marker, which means we're moving to the   next level. Better. And I mean better and not \ngreat. Meaning better than the last category,   but still not where we ultimately want them to \nbe and there's reasons why. And we start with   the Hanging Leg Raise. And for very much the same \nreason as the Lying Leg Raise, this exercise can   be challenging for some in different ways. \nNumber one, if you are limited in your ability   to hold the bar, then this exercise could cause \nfatigue in your hands before it does your abs,   which would lead to less desirable results. The \nsecond thing is, if you still have the tendency to   want to just lift your legs up in space and you're \nnot focusing on your pelvis, then this exercise   would not be very desirable, and some tend to do \nthat. If you want to make this exercise better,   it could jump to a better category if you do \nit properly, and that would be by moving the   pelvis and curling it underneath. I've used a \ntip before. Show your ass to the person standing   in front of you if they can see that then your \npelvis is curling. But for now, I have to break   out my blue marker here and give it a circle \nas one that's better, but not yet best. \n  And giving the Hanging Leg Raise some company \nin the better category is the Ab Wheel Roll Out.   And this exercise is one that I actually like a \nlot, but it tends to be another one of those that   people don't perform properly. And when you don't, \nit goes from being a good option to a not so good   option, which makes it fall in this category \nfor now. When done correctly, this is a great   anti-extension course stabilization move. Right? \nOne of the key functions of the abs. And the   further you roll out, the more work your abs are \ngoing to have to do to prevent you from dropping   in like this. The other thing people do is they \njust tend to roll themselves all the way back   and take all the stress off of the abs. And that's \nactually making the exercise less effective too.   You want to pretend there's a line right behind \nyour butt from the starting position that you   never want to cross in order to keep the attention \nfocused on the abs to do this properly. And when   you do that, it is in the better category. And \nfor that reason, it gets the blue circle. \n  And so let's keep our journey going up the scale \ntowards best with our even better still category,   slightly better than the exercises we \njust showed you and for good reason why.   And we start here with the Hanging Knee Raise. \nAnd different than the Hanging Leg Raise,   we get to shorten the momentum by keeping \nthe legs tucked closer to our body. So, A.   It becomes instantly easier for those that might \nbe to challenge like keeping the leg straight. At   the same time is going to decrease the tendency \nfor us to try to dominate and lift with the hip   flexors because it's easier to focus on curling \nthe pelvis up and under. Both of the things I   pointed out before. Once again, though, it has its \nlimitations of demanding that you have enough hand   grip strength to maintain this hanging position \non the bar for the duration of the exercise. So,   meaning you have to have stronger hands that abs \nto ensure that your abs are what fail first. That   being said, the yellow marker comes out now as an \nimprovement to mark the Hanging Knee Raise. \n  I talked about the multi dimensionality of an \nab exercise and what makes it a better choice   when you're looking at one versus another and the \nHanging Corkscrew does just that. It doesn't just   focus on the rectus abdominis, but it gives us \na chance to tie in the all-important obliques as   well. And with just a slight twist and I mean \nslight twist in the motion, literally. You're   just trying to turn your legs a little bit and \nyou're just focusing on moving the pelvis alone.   This is not a leg lift, it s a pelvis lift and \nby doing this, you can see how concentrated and   effective it is. But the same limitation being the \ngrip strength is going to be required for you to   do this. But it's still a great exercise \nthat belongs right here smack dab in the   middle of a ranking chart and therefore, the \nHanging Corkscrew gets that yellow circle. \n  Speaking of the obliques, another ab exercise that \nhas that ability to bring the obliques into it   strongly is the Single Sided Slow Carry and beyond \nthe fact that it needs a piece of equipment. It   only needs one single dumbbell to do this right. \nAnd by holding the dumbbell in our hands here,   we're working on controlling that pillar strength, \nnot allowing this to turn into that dreaded side   bend by moving in that direction but preventing \nthe side bend with that heavy weight held on our   side. And we can challenge this even more by \nperforming the exercise slowly. Each time you   pick up one foot off the ground, you now have more \ninstability by being on only one leg at a time,   which is going to demand that the opposite side \noblique contract and contract hard in conjunction   with your core to provide a great stability \nexercise. This here gets that yellow circle as yet   another better still exercise for your abs. \nAnd so now, with plenty of ab exercises left up on   the board, we get to move up into the Almost Best \nCategory, not the best, but right up there as very   good and solid ab exercises. And we start with the \nSide Bridge Twist. And what I like about this is   it's sort of the anti-side bend, right? This is a \nbetter way to perform that lateral flexion, we get   to do it from the bottom up. So, I do as I lift \nmy trunk up off the ground to create that lateral   flexion pillar strength with the assistance of the \nobliques, but also to introduce another component   here that rotational control instability. \nRemember, if we can layer on benefits. We   have a better exercise controlling both rotation \nand lateral flexion is a better exercise. It   gets the green marker here, the first of the \nAlmost Best Category, the Side Bridge Twist. \n  Moving on, improving that ab exercises \ndon't have to be elaborate to be effective,   the Levitation Crunch is one of my favorite \nways to train the abs. It's a very simple and   small movement when done properly, all your goal \nshould be when you're trying to perform any crunch   is to simply lift your shoulder blades off the \nground. All too often, people want to crunch   pulling their head closer to their knees, \nthinking that they're doing more of a crunch.   That's not the range of motion of the abs. You \nneed to only lift those shoulder blades up,   so stop cranking on your neck and instead think of \njust levitating your body up towards the ceiling   by putting your hands back behind your head and \nletting the shoulder blades guide the way. For   these reasons, the Levitation Crunch earns the \nsecond spot and the Almost Best Category on the   ranking of our ab exercises from worst to best.\nIf the Limitation Crunch is a great minimalist   exercise for the upper abs the Swiper is a great \nminimalist exercise for the lower abs. Because   once again it relies on a very slow and easily \ncontrolled movement to make sure you're getting   this done right. All we have to do to work the \nlower abs is get the pelvis off the ground. I   alluded to it before. I talked about the lying leg \nrace. It's not about the legs it's about getting   the pelvis to curl back. And the Swiper allows \nus to get that feedback that we're doing it right   by making sure you can swipe your hands \nunderneath your tailbone. This is one of   my favorite easily performed type exercises that \nanyone can do with no equipment at all. It belongs   here in the Almost Cest Category for sure. \nAnd as we get down here to the bottom to remember,   only one can be the best. The almost best of \nthe almost best is the Gymnast Ab Tuck. And this   one here is one of my favorite ways to work once \nagain, those lower abs proving once again that you   don't have to worry about what's happening with \nyour legs, but rather with your pelvis. The focus   here is unfolding your trunk right at the level \nof the pelvis, creating a posterior pelvic tilt.   The all-important posterior pelvic tilt that is \nresponsible for the flexion of the spine that   creates the activation of the abdominals. And \nthe thing that this exercise provides us over   any of the hanging ab exercises that work your \nlower abs is the fact that we don't have to hang.   You simply push your hands down into something \nlike a captain's chair or even on the countertop   if you do this in the kitchen counter corner. This \nhere is one of my favorite ab exercises, it's the   almost best of the almost best right there up \nin the number two spot, the Gymnast Ab Tuck.\n  And that brings us to the top of the top, the best \nof the best. In this group of exercises is called   the Sliding Tuck. And what you should notice here \nis a lot of the same similarities with the Gymnast   Ab Tuck minus the requirement for equipment, \nwhich is what places this one at the top.\n  Once again, we want to curl that pelvis into the \nposterior pelvic tilt, not by driving with the hip   flexors, but instead pulling into posterior tilt \nwith the abdominal muscles. And when we do this,   we have the benefit of doing some extra things. \nWe don't have to allow ourselves to slide straight   back. We could do it as somewhat of an angle to \ninvolve the obliques as well. And if we want to   really drive the lower abs into this, we can \nadd some additional knee tuck like a Hanging   Knee Raise to make this an all-encompassing \nexercise that does pretty much everything. Guys,   there can only be one best and only one worthy of \nthe top prize, the green star when we're talking   about the best of the best in ab exercises. \nAnd so there you have it, guys worst of first,   the best ab exercises, the great to the ugly. \nIf you want to see me do this with other ab   exercises, make sure you leave a comment below. If \nyou want to see me do this with other exercises,   just let me know below, I will make sure I \ndo that. If you're looking for programs that   select only the best of the best so you can get \nthe best results, you can find them all over at   Athleanx.com. If you haven't done so, make sure \nyou click subscribe, turn on your notifications   so you never miss a new video when we put \none out. All right guys see you soon.   "
}