{
    "id": "ttVHGlApt3w",
    "title": "Don’t Ignore THIS Early Warning Sign - MUSCLE LOSS!!",
    "description": "If you want to avoid muscle loss or wasting time in the gym you need to pay attention to your body's natural early warning sign.",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. What if there was a warning sign that told\nyou that your training was about to go off the rails? Not necessarily that it's gotten to the point\nwhere you're either losing strength on your bigger lifts or you're not seeing any size\ngains anymore, or there's a noticeable plateau, maybe your desire to train is down, or if\nyour goals are completely different. Maybe fat loss, if you've begun to plateau\nthere even as you drop your calories. Something's not working anymore. What if there was something that could happen\nahead of those signs and symptoms that would give you an opportunity to intervene before\nthat? So, the reversal of that would be a little\nmore effective. Well, you probably see me waving this thing\naround here. There's a reason why we can implement some\nother method for this. The thing is, it's very, very simple to do. It's measuring our grip strength. Look, you don’t have to go buy this device. I'm going to show you a very cool correlation\nthat I uncovered, by accident, that shows you that you can do this a lot cheaper. This costs $300. This a gold standard for physical therapists\nwhen it comes to measuring grip strength. It's a hand grip dynamometer. There's a procedure that we'll follow. Both with this device and with the alternative. By the way, what's the alternative? It's this cheap, little Detecto scale that\nI got at Bed Bath & Beyond for about $10. It does the same thing. You're going to have to make a little conversion\nfrom pounds to kilograms, but I think we can handle the math. The idea is this: we know that grip strength\nis neuromuscular driven. When you have variances in your grip strength\nand how tightly you can grip something it's not necessarily that you've lost grip strength\nfrom one minute to the next, or from one hour to the next, or even one day to the next. You've probably already felt this yourself\nwhen you've been sick, or when you're extra tired, or when you wake up in the middle of\nthe night. Try squeezing your hand next time and see\nhow much for you can generate. You'll feel like you wish you could do it\nwith more force, but you can't. It's because you don’t have – again, you\ncould be over fatigued from a neuromuscular level. The central nervous system sending signals\ndown to your muscles just aren't firing appropriately. Well, we know when this fatigue starts to\nset in that it's a sign that what you're doing in your training plan is probably too much. You're under-recovering. You're not giving yourself a chance to recover\nfrom this. I know why a lot of it happens a lot of times. You see a lot of cool things. Hell, on this channel we cover a lot of great\nthings and you guys want to try all of them. You can't try all of them, all the time. It's one of the fastest ways to find yourself\nin this state. Maybe at the later stage where you've already\nnoticed the more serious signs and symptoms. So, you want to make sure you're testing yourself\nfrequently with your grip. If we can easily do that then we're going\nto be able to this and intervene faster. So, if we take the grip dynamometer – I'm\ngoing to show you how we do it this way. We're going to apply it to the scale. You test yourself with your arm at your side,\nelbow bent 90 degrees, and you're going to squeeze as hard as you can. We want to see what our peak output force\nis. I'm going to get ready to squeeze. 1, 2, 3. Squeeze, squeeze, squeeze, squeeze. And I'm about 50 at that point. Now, I've been higher at times as well. With that being said, that's 50kg of force\non this device. Why is that important? We also know that grip strength itself, the\noverall level of grip strength, is important when it comes to your performance on some\nof the bigger lifts. We know that grip provides additional stability\non those lifts and it also provides a radiation effect. It allows other muscles to contribute to the\nperformance of that lift which is going to be essential when you're talking about your\nbigger, compound lifts. Now, I take this and say, what would happen\nif I come over here with this little, cheap device? Can I do the same thing? Now, instead of talking about kilograms we\nlook for pounds. Now we're looking for the same, or equivalent\nmeasurement in that kilogram on the device, with pounds on this scale. So, all we have to do is take the scale in\nthe same way. We're going to hold it this way. We don’t want to hold it like this because\nif we hold it like that, we're talking about more of a pinch grip. That's a different type of grip and different\nstrength level. You want to hold it this way so you're measuring\nthe same type of effect that we got on the gun there. So now we grab it here, we're going to stabilize\nit on our body like this. So now we're going to take a look – Jesse,\nwhy don’t you come around? I'm going to show what happens here. I've got to make sure this is starting at\nzero. Now, I'm going to grip it here. Again, same way. 1, 2, 3. Squeeze, squeeze, squeeze, squeeze. And you can see, it's topped out right around\n50, 51, 52. The cool thing is, there's a good correlation\nin a much cheaper, easier way. So, if you have this scale you can measure\nthis over time, consistently, and quickly. It takes two seconds. If you start to see a drop – we're talking\nabout more than a 10% drop. So, 50 would go down to 45. You've got to do something about your training. I don’t care if you haven't already seen\nthose other things. That's the goal. Not to have to see those other, more serious\neffects in your training. You need to start taking some additional time\naway. You need to start dropping some of the volume\nin your training. You need to start incorporating some additional\nde-load week into what you're doing. Maybe you've been banging away at it for months\nat a time now. You'll find that when you do that, and you\ncome back, and you retest, and your levels are back to where they were; you hit your\ntraining again and you're going to find out that you're not going to plateau as much. Your strength levels will probably start to\ngo up again. You haven't reached this overall, max capacity. I can pretty much guarantee you that, guys. We have a lot higher capacity to become bigger,\nand better, and faster than we probably give ourselves credit for. But a lot of times we believe that because\nwe get ourselves stuck in this rut here and we're not early enough to intervene. So, this is a simple, easy way to do that. I promise, if you do it yourself, you're going\nto find this can be a very important warning sign way ahead of the things that are going\nto become more apparent. Guys, if you're looking for programs – because\nthat's what matters. How you program things. There's a difference between exercising and\ntraining. I say it all the time. Training is a plan. It's a progression. There are planned points where we have to\nbring it back a little bit and there are planned points where we have to step on the gas. Knowing that and doing that the right way\nis what gets you to a bigger, and better, and faster level a lot faster and more efficiently. That's what we do with all our plans and those\nare over at ATHLEANX.com. If you have some questions about the process\nand you want to measure yourself, leave your grips strength measurements down below so\nwe can all check them out. No one's going to laugh. Even Jesse. He's only about 10. That's not true, right? What is yours, Jesse? JESSE: I have no idea. JEFF: All right. It's low, but the fact is, leave your comments\nand thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you haven't already done so, click 'subscribe',\nturn on your notifications, and never miss a video. All right, be back here again soon. See ya."
}