{
    "id": "TWJY6EDg9lQ",
    "title": "Best Push Up Ever (PERIOD!)",
    "description": "Get the best complete bodyweight workout ever here… http://athleanx.com/x/best-bodyweight-workout-plan There are hundreds ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. It is Bodyweight Wednesday and I’ve got\nthe best pushup ever for you today. I’m telling you, it’s the best pushup\nfor a number of reasons. Number one: one of the limitations we have\nwhen we do pushups is that we’re not fully contracting the chest because you don’t\nhave the opportunity to get adduction at the shoulder. If we look at a regular pushup here, you can\nsee that my hands are actually fixed into the ground. So when I come up I don’t have any movement\nof my hands that I can actually achieve any type of adduction across my body. We know that a full chest contraction is going\nto require that you come across your body to do that. So we can fix that by looking at the relative\nposition of your arm, in relation to your shoulder. What do I mean by that? I’ve covered this topic before. It’s extremely important to understand that\nyou don’t always have to move your arm on your body to get motion at a joint. You can move your body on your arm to get\nthe same motion at the joint. Therefore, involve the chest. So what we can do is, we can do our pushups,\nand we can add a rotation to it. I’ll get into the second reason why this\nis the best version of the pushup you can do. When we come down we do our regular pushup\nhere, and as I come up I favor one side. I’m pushing mostly 80% through my left arm\n– you’re right on the camera there – but I’m going to come down, and I’m going\nto push up, and rotate my body in that direction. By rotating my body in that direction I’ve\nnow got the horizontal adduction at the shoulder to fully contract the chest. I’ll show you again. I’m going to come down, I’m going to come\nup, and I’m going to rotate. This is a little bit of the kickstand, this\nis doing more of the work. So that’s the second reason why this is\na better pushup. You can overload your pecs more. Yes, it’s one side at a time, but there’s\nnothing stopping me from alternating left here, like that, and down, and then right. Again, I’m pushing, and moving my weight\ninto my right side to come across. Watch again why this works. I’m down, and I’m across. Now, I’m not going to move my arm at all. I’m going to come up here. You see how much horizontal adduction we’ve\nachieve here at the chest. What I did was, I didn’t move my arm on\nmy body. I can’t do that with my hands fixed on the\nground. I move my body on my arm, but it’s still\nthat motion at the shoulder joint. Therefore, the chest is getting the full contraction. So one more time up close. You can see that we have the arm, we come\nacross the body – so we’re right here – come down, come up, rotate, working more\nof the inner chest. Again, down, up, rotate. Again, you can see the inner chest working. Down, rotate, down, up, and rotate. We’re getting that horizontal adduction. Now, is there an inner chest? No, guys. There’s no ability to contract the inner\nchest. It’s more of an ‘upper-lower’ thing. But, do realize this: in order to get a peak\ncontraction of the chest you’d better have some horizontal adduction going on. Secondly, we’ve talked about it before in\nprevious videos, the non-spending chest fibers that sometimes don’t make it all the way\nacross. The best way to engage them and ensure that\nyou’re getting a peak contraction is to fully complete the contraction of the chest. So this is the best pushup you can do. How do you work it? I don’t care if you need to load it up and\nadd more weight to your body with a weighted vest; whatever you have to do. The idea is, you’re getting a one-sided\noverload – which is great – and you’re also getting the ability to reach that full\ncontraction. Guys, if you’re looking for more innovative\nways to train your body with nothing but your own bodyweight; head to ATHLEANX.com right\nnow and get our ATHLEAN0 program. We don’t use anything to train your body. Just your body, and space, and we can help\nyou to build serious muscle by doing that. if you liked this video, and of course these\nBodyweight Wednesday videos, make sure to leave your comments and thumbs up below, and\nI’ll continue to make these for you guys in the coming weeks ahead. All right, I’ll see you back here soon."
}