{
    "id": "TXh1oLXb6zk",
    "title": "Quadratus Lumborum Stretch (DO’S AND DON’TS!)",
    "description": "Build muscle without creating imbalances here - http://athleanx.com/x/no-imbalances The quadratus lumborum is one of those ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So if you've got low back pain, especially\nthat kind that feels like it's in this deep area that you just can't get at, I'm going\nto tell you it's probably this muscle right here. Your quadratus lumborum and I'm going to show\nyou today two things that you're going to want to do to try to get rid of that discomfort,\nand one thing you're not going to want to do – although some might tell you to do\nit. You see, this muscle right there can get you\npretty jacked up if it's jacked up. The fact is, at the top it attaches to your\n12th rib. So if it's pulling down and it's tight, it's\ngoing to actually affect your whole torso because your rib cage is going to move. On the bottom here is connected to your pelvis. So obviously if it's tight there it's going\nto jack up one side of your pelvis and give you that unequal pelvis, which can play havoc\nwith everything in your entire body, realizing that this is one big kinetic chain that you\nmove on. Then of course, to cap it all off it's connected\nto your lumbar vertebrae. So if it's tight there and pulling on your\nlumbar vertebrae you're going to have some problems, too. So what is it that you want to do? I'm going to show you how to stretch it, I'm\ngoing to show you how to work on the soft tissue, and I'm going to show you that one\nthing you never want to do to it. Okay. So let's start with the stretch. First of all, how is this muscle getting tight\nin the first place? Easily. You see, when you sleep, if you have a side\nthat you like to sleep on – let's say you like to sleep this way – this hiking of\nthis hip up here, right, relative to the rest of our pelvis is going to tighten the QL on\nthat side. So if you sleep on one side all the time,\nthe one that's up in the air is going to get tight. Same thing happens here if you like to sit\nand you sit in your seat and you sort of sit on one side. Like this, if you're working on the computer,\nor if you're sitting on the other one. You can see that this hip is hiked up in relation\nto the rest of the level pelvis and the rest of my spine, which means that QL on that side\nis going to get tight. So what you want to do is, you want to set\nyourself up in this 90-90 position. If your left hip – your left QL – is tight\nyou want to put that one behind you. So you get 90 degrees here. Okay, so my leg is going to be bent at 90\ndegrees at the knee, and 90 degrees at my hip, if I can. So I get in this position. So my front leg gets here out in front of\nme at 90 degrees, here at my knee, and about 90 degrees here in relation to the rest of\nmy torso. From here I'm going to lean forward, and now\nI want to open up this hip, right? So the idea is to drive the top of this pelvis\ndown and back as I get the rest of my body and my ribcage going in the opposite direction. Here is the line, right here. So if I drive that back by leaning forward\nand then I lean in this direction, I can already feel that muscle opening up. Now if I want to intensify that even more\nI'm going to rotate down and over the top because I'm rotating my lumbar vertebrae,\nnow, away from the direction that I'm going here so that the muscles are stretching even\nmore. So I'm reaching over, twisting this way, and\nthen leaning forward. And I can feel that and the more I can drive\nthis leg down and back in that direction there, as I do this, I'm going to even feel more\non that stretch. Okay, now the next thing you want to do is\nwork on that soft tissue. So you can't just pull on the ends of something\nand hope that the middle of it is going to get worked as well. You've got to work on the tissue quality between\nthe origin insertions. So what we can do is, we can take anything\n– this is literally the end of a battle rope because I have it her next to me, but\nyou can use a lacrosse ball, or other – I've used a fat grip before to mobilize. What you're going to do is get in this position\nright here. First of all, as I go into this position here\nyou can see that I'm actually stretching the QL again because I have the hip being pulled\ndown here and the ribcage being pulled away from it. But I'm going to get this and I'm going to\nput it right on that area of muscle that I showed you earlier on Raymond. Okay? In there, once I'm on top of it I should already\nstart to feel it. I've already got a little bit of a pre stretch,\nI'm on here, and now what I want to try to do is, with compression on this thing, floss\nthe muscle back and forth through there. So I could do that by taking this leg and\ndriving it up here – it's bringing up, again, hip hiking, all the way up, actually working\nthe muscle – and external rotation, accessory motion of the hip, and then down, and point\nit, and turn it in. So, extending it all the way out, pulling\nmy hip down as much as I can with it, you press in that pelvis, and then get that internal\nrotation accessory motion. So up, and down, and point it up, and down,\nand point it. And you can roll just a little bit on that\nspot lateral to the spine, okay? That's going to lead to the last thing that\nyou're not going to want to do. That is, try to foam roll this area. So, what not to do: get rid of the foam roller\nif you're trying to get the quadratus lumborum. It's not a huge muscle group, and no matter\nhow much you try to be precise with this you can't be as precise as you can with something\nsmaller, like is suggested before. What winds up happening here is, I'm doing\ntwo things. Even if I stay lateral here and I get away\nfrom the spine, this thing is so wide that it's actually driving up into my ribcage. You can actually have a lot of discomfort\njust from doing that. You'll never actually be able to release the\nmuscle because you're too much in discomfort from having this drive up into your ribcage. The next thing people do instead is they'll\ntry to go over the back this way. I can tell you the fastest way to have your\nback hurt is to try to roll your lumbar spine. It's okay if you want to use it up here with\nthe thoracic spine, but trying to drive through extension with a foam roller of the lumbar\nspine is a sure recipe for disaster and more pain. So I hope you guys got the tactics that you\nwant to use here and can use them now, and apply them to getting that QL to release. I'm telling you, most of us have one side\nor the other that's tight because of the things that we do every day, or at night when we're\nsleeping. You've got to address them because they're\ngoing to rear their ugly head when you try to go squat with a tilted pelvis, or when\nyou try to deadlift with one leg being able to drive more force into the ground than the\nother. It's just not pretty. All right, guys. If you've found this video helpful make sure\nyou leave your comments and thumbs up below. Let me know what other types of videos you\nwant me to cover, what other issues you might be having that I can cover for you here on\nthis channel and I will. If you're looking for a complete program that\nputs everything into a complete training program, putting the science back in strength to allow\nyou to train at your highest level, then head to ATHLEANX.com right now and get our ATHLEANX\ntraining system. All right, guys. I'll be back here again real soon."
}