{
    "id": "U1hIHwLsiq8",
    "title": "Top 3 Rotator Cuff Exercise Mistakes (FIX YOUR SHOULDER PAIN!)",
    "description": "Fix your shoulder pain by working out like an athlete here http://athleanx.com/x/fix-your-shoulder-pain The rotator cuff muscles are ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. So Rotator Cuff Exercises, by now you should\nknow how important they are. If your watching our channel for any length\nof time, you realize how important they are. You see, most poorly written workout programs\nhave such an imbalance between the number of exercises that internally rotate our shoulders\nversus those that externally rotate our shoulders, there's no surprise that we're winding up\nwith so many guys that wind up with shoulder pain from working out. But it doesn't have to be that way. But if you understand that you have to do\nyour shoulder external rotation exercises, that's only half the battle. You see because a lot of times, what we're\ndoing is we're doing them wrong. See there's three big mistakes that people\nwill make when they're doing the rotator cuff exercises, or externally rotating exercises. And I think we need to address them here today\nso that we're making sure that you are not. You see the first is, when we do our external\nrotation, you have to make sure that you're really keeping your elbow tucked tight to\nyour side. As tight as you possibly can. If you have to, you put a towel up under your\narm to reinforce that. Now why the towel? Because the mistake is, when people go do\nthis, they try to cheat and get a little bit more room and a little bit more motion, so they let their elbow drift away from their\nbody. And what's happening here is, they're not\nusing their rotator cuff in isolation any more. Now they're using their deltoid in addition\nto their external rotation and a lot of times what will happen is, the deltoid will take\nover and dominate. So it becomes more of a side lateral raise. The towel will drop on the floor the minute\nyou do that though. That's why it's a good idea to have it as\na visual feedback. The reason why that's a problem is, the rotator\ncuff in general is supposed to keep the heavy humerus centered inside of the glenoid. So inside the ball and socket you're supposed\nto have a centrally located ball. As you raise your arm up, whether it be through\nan overhead press or a side lateral raise or a front dumbbell raise, that head needs to stay in the middle of the\njoint, so that you don't get a migration upwards that can cause a banging into the roof of\nthe acromion there, and a pinching of that rotator cuff tendon,\nwhich will lead to that impingement. If you have the deltoid doing all the work,\nall your doing is contributing more and more to the problem because the deltoid in the\nfirst place wants to pull the head of the humerus up. The only muscles we have that counteract that\nupward pull and keep it centrally located, are those boring old, three little rotator\ncuff muscles. So let them do the job in the first place. Let them actually work. The second mistake that we have to consider\nand fix, is the position that we have with our upper body when we do the exercises. You see any external rotation exercise is\ngreat but not if you're doing it at a piss poor posture. You see if you have rounded shoulders like\nthis, you've just completely negated all the freedom you're trying to create by keeping\nthe balance and strength in the rotator cuff muscles in the first place. See try this quick test with me. Get yourself into bad posture. Allow your shoulders to round forward, let\nyour shoulder blades round, protract around your body. Get your shoulders rounded forward, exaggerate. Now take your arm and try to raise it as high\nas you possibly can. This is it, this is as far as I can go before\nit mechanically gets blocked. It's literally hitting the roof of the acromion\nhere, inside my shoulder joint. Now if I put my shoulder blades in your back\npocket, all things will change. Now by just setting my shoulder blades, like\nI said, down and back. You just want to let them be tight up against\nyour rib cage. When I do that, now I raise my arm up I've\ngot way more freedom. Because I actually allowed the roof that was\nleaning forward here and blocking the head of the humerus to now sit back, so now that humerus can come\nup and actually move freely inside that socket. The third and final mistake is actually related\nto the second one, and that is an inattention to the other half of the equation here. What is the actual shoulder blade doing? We just covered how important the position\nof the shoulder blade is to the overall function of the shoulder joint, so if you're not worried about the position\nof your shoulder blade at any point in time, then you're really ignoring a main key component\nof the goal of your shoulder external rotation exercises. So, we need to fix that. We need to realize that two muscles will actually\nreally position the shoulder blade where we want it to be, that down into your back pocket\nposition. That's going to be your Serratus Anterior\nand your Lower Trap. We can actually train these two muscles very,\nvery easily. And with very little extra work in your workout. Here I'm demonstrating a Plank Plus. And it's actually done with a slight tweak. I have my arms, my forearms on the ground and I have them palms up, with my shoulders\nand elbows in and my hands and forearms out a little bit, to get a little external rotation\ninto my shoulders. And from here, I'm trying to just push my\nbody away from my arms, keeping everything nice and tight and fixed. We're getting a protraction of the shoulder\nblades around my body and I'm just trying to push away, but again leave everything nice\nand tight and stable. The Serratus Anterior is what's getting the\nfocus of that work there and it's trying to hold the shoulder blade nice and tight here,\nas you can see on our skeleton. Nice and tight for the rib cage, because you\nneed that stability down. The second thing we need to do is to work\non the Lower Traps so that we can get the proper rotation of the shoulder blades, because when we raise our arm up, there's\na huge amount of rotation that's needed by the shoulder blade to do that. If your shoulder blades stay fixed, you'd\nonly get your arm up about two thirds of the way. So you need to make sure that you're getting\nthe rotation of the shoulder blades and it has to stay tight to your rib cage. So you can do some of the exercises I'm showing\nyou here. The first can actually be done in two different\nways, either using the bar or using equipment. But it's the same goal here. You can see me hanging from a pull up bar,\nit's that natural upper rotation that's occurring here from the pull up position right as I\nhad my arms up and hanging over my body. But I want to just try to pull my body up\nwithout allowing my elbows to bend. But now we're getting in control and contribution\nfrom the Lower Traps to help develop some strength and stability into the scapular component\nof back lateral humeral joint. And I can do the same thing with a cable,\nlike a Lat Pull Down Setup, where I'm just trying to do that real bottom position there\nand keeping my arms straight the whole time. You don't have to do a lot of these guys,\nyou've just go to make sure you're doing them right and you're allowing the right muscles\nto do the work. And that's what it is guys, it's not about\ndoing a whole lot extra. Matter of fact, we have ways that we combine\nthe rotator cuff into the exercises that we normally do. We realize that this big over reliance on\ninternal rotation in most programs is not going to cut it. And that's why as a Physical Therapist, I've\nput together the ATHLEANX Training System. So it's not just about getting you big and\nstrong, we'll do that, I promise you. But we'll also do it in a way that we protect\nyour joints and help you get there safely. Guys, if you're looking for a program to build\nmuscle but at the same time, realize and respect the longevity that comes with it so we can\nactually do this for a long time. Then head to ATHLEANX.COM and get our ATHLEANX\nTraining System. In the meantime if you found this video helpful,\nmake sure you leave your comments and thumbs up below and we'll keep making them. Alright guys, we'll be back here again in\njust a few days."
}