{
    "id": "u1sfPfsESDQ",
    "title": "Stop Stretching Your Hamstrings (UNTIL YOU WATCH!!)",
    "description": "Build muscle without imbalances here - http://athleanx.com/x/no-imbalance Subscribe to this channel here - http://bit.ly/2b0coMW ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So we're going to address a very important\ntopic here. We want to find out if you are an ass, or\nan ass not. I'm serious because if you were to look at\nyourself in the mirror and be serious with yourself and honest, would you be someone\nwho has your butt sticking way out – and therefore an ass – or are you sort of an\nass not where everything is tucked underneath? I've got to admit, I'm a little bit of an\nass not. It's because of the position of our pelvis. I've covered this in a video on anterior pelvic\ntilt – which is a very common problem. If you haven't seen it, you've got to watch\nthat video right here. It will tell you a lot about what to do to\ncorrect that. However, hamstrings are going to be tight\nin people that have anterior pelvic tilt, or posterior pelvic tilt. Asses, or ass nots. So we have to figure out a way to address\nthat hamstring tightness. Or do we? Because in that video I said you're going\nto likely have tight hamstrings if you have an anterior pelvic tilt, but it's not something\nyou want to address. As a matter of fact, you want to do the direct\nopposite. You want to continue to strengthen them and\nnot stretch them. So first of all, how would you tell if you\nhave an anterior, or posterior pelvic tilt? Most of all, you want to look in the mirror,\nlike I said. If you were to look and just lift your shirt\nand look here, you want to focus on the waistline. So whenever you're wearing your shorts, or\nyour pants, what position is the waistline? It's normal to have a little bit of a downward\ntilt to it. A little bit. About 3 or 4 degrees. If you had this severe downward tilt, then\nyou're dealing with that anterior pelvic tilt here, and that's actually not a good thing\nto have. I know it looks better, but it's not a good\nthing to have. It's an adaptive shortening that you want\nto correct. At the same time, if you have a posterior\npelvic tilt you're going to likely see a level line here of the pants, or worse; it could\neven be tucked under. So it starts to tilt up at the top. The second thing you can do is do an excursion\ntest. How much room do you get? So let's say I am an anterior tilter. If I tried to go into a more anterior tilt\n– in other words, if I try to tip my pelvis down – I would only be able to get a few\ndegrees because I'm already anteriorly tilted. I have that much motion left to go in that\ndirection, but if you asked an anterior tilter to go posterior tilt, look what happens. I've got all that extra room because I had\na lot left in that direction. Same thing. If I'm already a posterior tilter. If you tell me to tilt and tuck my butt under\nI'm not going to be able to get much further because I'm already there. That's where I walk around. I'd be an anterior tilt. I could probably get a lot more. Of course, it would probably feel tight, but\nit's something I could actually move in. so do that test and figure out what you are. But now when you come over here, do you want\nto stretch, or not stretch? Well, think about what's happening. Again, I said tight hamstrings, regardless\nof whether you're anterior or posterior, if you are anterior, look what's happening. Your hamstring are attaching from the back\nhere – of your pelvis – down to your knee. To the outside of your knee, or behind your\nknee. It may actually cross the knee. If my pelvis was anteriorly tilted and pushing\nin this direction what's happening here to the hamstrings at the origin? They're getting longer, right? Because as this is tilting forward it's coming\nup, and over, and it's causing my hamstrings to be tight. But guess what? The hamstring tightness is not causing this\nanterior tilt. The hamstrings are being stretched because\nof the anterior tilt. So the tight hip flexors on the other side\nare pulling this down this way. That's making the hamstrings feel tight, but\nyou wouldn't want to stretch these because all that's going to do is let the hip flexors\non the front side do more damage, pulling you more into anterior tilt and causing the\nproblem to become worse. What you'd want to do is relieve the hip flexors\n– which is what I made that video about – that will show you then how to reset the\npelvis back. Guess what happens? All of a sudden all this extra stretch goes\nback down nice, and there's no more tension on the hamstrings. On the other side though, if you're a posterior\npelvic tilter you've got problems. You've got really tight hamstrings because\nwhat's happening is, they're pulling down from here and we're pulling down more, which\nis going to take our pelvis down into this posterior pelvic tilt. That 'no ass' look where it's going to tuck\nunderneath here. Your main problem is going to be tight hamstrings. Guess what else? Because it crosses the knee here it's going\nto shift the focus – I'll show you right here – of your body to do this. I tuck under, I start leaning a little bit\nmore forward, my weight is going through my toes, by pushing through my toes what's active\nas well? My calves. I start getting shortening in my calves and\nmy Achilles. So now I can't even get into dorsiflexion\nof my feet here because my calves are tight. So you want to figure out a way to stretch\nyour calves at the same time that you're stretching your hamstrings, at the same time that you're\nnot allowing yourself to be in posterior tilt. You've got to go out of that. So how can we do that? Well, we can do what I'm showing you here. We can get our foot up against anything. Something that allows me to have elevation\nhere. Then the next thing I can do is, I want to\nget my knee straight, obviously. So I'm getting stretched here, back through\nthe hamstring, and then back through the calves. Then I anteriorly tilt this way. So now the big key is, I put one foot back\nwhich allows me to tilt more this way. You can see, I can go more into anterior tilt\nright there. I don’t even have to do anything. I don’t have to do anything at all. I actually can just stand right there and\njust feel the stretch, but then I want to reach up in front of me. Why am I reaching up if I'm trying to stretch\nmy hamstring? Because as I go down, I still want to be able\nto keep my upper back elongated here. Because what happens when we get posterior\ntilt? Everything rounds. You walk around like this. So we've got to get elongation through here. So I'm here, and I'm leaning up as I go – I\nswear I must've ripped my fucking leg off – I'm going up here. I have tight hamstrings. Going up here, and I could already feel the\nstretch. Again, we're stretching all the issues all\nat one time. But that's only if you're dealing with the\n'ass not' condition because if you are an ass, don't stretch them. Do something else. Worry about strengthening them. Guys, I hope the differentiation was made\nhere and made clearly. Again, I made that other video about anterior\npelvic tilt and a lot of guys found it helpful. You're going to want to see it because there's\na common problem, but this differentiates. I kind of glanced over it and I wanted to\nmake sure I went into it a little bit more in depth so you understand it. If you're looking for training programs that\nteach you how to do these things the right way so you're not left guessing and you're\nfiguring \"Oh, I guess I should stretch because the guy told me hamstring stretching is good. My hamstrings are tight, stretch them.\" Not all the time. You stretch them when you're supposed to stretch\nthem. You can find that over at ATHLEANX.com in\nthe ATHLEANX training system. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know: ass, or ass not. It doesn’t really matter. You've got to figure out what the right thing\nfor you is to do. All right, guys. I'll be back here again in a few days. See you."
}