{
    "id": "u6GVYTsxEhw",
    "title": "The PERFECT Obliques Workout (LOSE LOVE HANDLES!)",
    "description": "If you want to lose love handles then you better start doing an obliques workout so you can be sure they look good when you drop ...",
    "transcript": "What s up guys, Jeff Cavaliere, Athleanx.com. Today, we continue our Perfect Series, this\ntime The Perfect Oblique Workout, or some like to call it the love handles. But there's no such thing as perfect love\nhandles, they're just fat obliques. So we have to do today though is attack them\nand I'm going to give you a step by step game plan for doing just that like we have in all\nof our perfect workouts. That being said, guys, we know that there\nis a body fat accumulation issue that happens here, particularly in men, because we tend\nto store fat here pretty readily. And I want to make sure I help you there,\ntoo. If you're looking for some nutritional guidance,\nbecause that's going to be the only thing, not a few AB exercises or oblique exercises,\nthat's the only thing that will get the body fat to disappear. Head over to athleanx.com/carbs, I've laid\nout a little nutritional guide for you over there where we breakdown each of the macronutrients,\nyes, carbohydrates should be part of your overall game plan. I'm going to show you the healthier ones to\nchoose and guide you through a plate division technique that I use that makes measuring\nand counting calories a hell of a lot easier. Again, I don't want to leave you stranded. You can head over there and get that free\ninformation. Now, where we have to do here, we've got to\ndo the work so that when you get rid of that body fat, your beliefs are actually looking\ngood. To do that, let's start breaking down the\nworkout step by step. As I mentioned in the open, to train the obliques\nfully you have to make sure that you're tapping into all of their capabilities, and they do\nmore than just rotate. As a matter of fact, they can control rotation\ndriven from the top down or from the bottom up. Or they can flex you to one side or the other,\nbut from the top down or the bottom up. Or they can prevent lateral flexion altogether\nor prevent rotation altogether. There's a lot of functions here, so we want\nto make sure that we hit all of them. And in terms of their anatomy, they're actually\nequipped well to do this because of the direction of their fibers. If you make your gun just like this and you\npoint it right back in your holster, you'll see that the finger that points down towards\nyour junk, that's aligned right with the external obliques. And they have a function that brings them\ndown and across in this direction and functions in that way. We have the thumb that points up across this\nway perpendicular to that, that's the internal obliques is how they work in concert here\nthat makes it so unique and why we want to make sure we tap into them with all those\nfunctions, with specific exercises to do just that. So the first thing we do in our workout here\nis attack the main rotational function of the obliques, the one that you're probably\nmost familiar with. And the one I like to do first is the bottom\nup rotation, because we know once we start using the weight of the legs, the exercises\nare more difficult so we stick them in the beginning of the workout when we're most fresh. And the one I like here is called the Archer\nTuck. And we're not just again pulling our knees\nin towards our chest we're actually sliding our body from one cheek to the other to position\nourselves with a better capability of creating a nice, strong contraction when we bring those\nlegs into our chest, maximizing that intense contraction through rotation both right and\nleft. And from here, we're going to go and we're\ngoing to work the other way. Now we're going to go top down rotation and\nhere we re going to do a basic Russian Twist. And what I like to do here is actually take\nthe legs out of it. I don't want to fatigue the hip flexors. So in this particular workout, I'm going to\nkeep my feet on the ground. But now driving that rotation from the top\ndown. Right. The hips stay stable now, but it's the top\nthat's twisting on it. And what I really like to do to reinforce\nthe proper mechanics here is have you focus on what you're doing with your elbows. Turn this into a row. Pretend like you're doing a Cable Row and\ndrive your elbows far back behind you as you can to reinforce that you're actually getting\ngood rotation from the shoulders up on the torso and you re not just tapping your hands\nback and forth. We don't call these Russian Taps, they're\ncalled Russian Twists for a reason. Each of these exercises gets done for 45 seconds\napiece with a 15 second rest before you transition to that second one. Now, listen, if you can't do it for a full\n45 seconds, that's fine. The way this workout is structured is you\ngo for as long as you can even rest/pause if needed to get through the 45 seconds and\nthen take that definitive 15 second rest before moving on. That brings us to the third exercise here\nin the workout. In this time we're focusing on that lateral\nflexion and again from the bottom up and the top down. And from the bottom up where we focus our\nefforts is with the Side Plank Bridge Twist. I actually covered this exercise a long time\nago on the channel, but it's no less useful now. What you do is you create this sort of eccentric\ncontrol as I drop down with a little bit of rotation. But when I come back up to the top, I drive\nup into that side plank lift, really trying to drive my hip up, creating that lateral\nflexion we're talking about. But again, the shoulders are staying stable\nin the hips are what are doing the work here - bottom up. I do this for 45 seconds on each side and\nthen I move on to the next exercise here we work from the top down and this one's called\nthe Side Cycle Crunch. And all I'm doing here now is leaving the\nhips in place and focusing on flexing my torso from the top down. Each time I bring my knee in, I flex my trunk\nlaterally towards it, bringing my elbow down towards that knee. Really go for the good contraction here. This is not about speed, it's about getting\ngood quality contractions 45 seconds at a time. Once again, you approach both the right and\nthe left side before we move on to the next exercise. And this is where we start to do the part\nthat most people forget to do. And it's the anti-stuff or the anti-lateral\ncontrol and the anti-rotational control. And we start with the anti-lateral movement\nhere. I love this one. It's called the Side Plank Walk through. I'm getting into a static Side Plank position. And no, I don't like static anything, as you\nknow, and planks in terms of what they provide you, we can do so much better than that, and\nthis gives us the chance to just do that. We get on that Side Plank Hold, but we make\nit a little bit more dynamic below. So we're walking our feet in this way. And you can see when I get this other leg\nup and driving it up towards my chest, I'm actually supporting the entire weight of the\nside plank through just one leg as opposed to the foot contact of two. That obviously makes it harder. Your job is to stay as rigid as possible on\nthe bottom side, not allowing your body to collapse into that flexion. Hence the anti-lateral flexion component of\nthis. We work each side once again for 45 seconds,\nresting if needed. This can be a little bit difficult, but because\nit's an isometric exercise, you're better equipped to handle it at this stage because\nyou're stronger there than you are concentrically. Which brings us to the final exercise here,\nthe anti-rotational control and this is something called The Wall Lock. And what I do here is I plant my hand in contact\nwith the wall and then my opposite hand on top of that wrist locking myself in place. And what this is doing is, it's now challenging\nyou to maintain a rigid torso facing straight ahead, because what it wants to do is give\nin and twist towards the wall. To prevent rotation you're going to have to\nactivate that oblique that's on the opposite side of the wall and hold it strong. Again, this is an isometric exercise, challenging\nbut capable of being done at this spot even when fatigued, because it's easier than the\nconcentric exercise. So we lock in and we maintain position there\nfor 45 seconds on one side and of course we flip around to the other side for 45 seconds. If you put this all together guys, you're\ngoing 45 seconds at a time for 10 exercises. Fifteen seconds rest in between for a total\nworkout of 10 minutes. For those of you looking to take it up a notch,\nyou have access to a band. The two exercise you can make a good band\nswap out. We'll start in reverse order for the anti-rotational\nexercise, try this banded step out, we call an Oak Tree Step out. Get that band in position in the center of\nyour chest and you simply step out, increase the resistance to the band and its tendency\nto want to twist you in the opposite direction. Don't twist it all, resist that and perform\nthe repetitions again on both sides for 45 seconds. And of course, that lateral flexion that we\ndo from the top down, I love this Banded Elbow Thrust. You can really get a good intense contraction. You take this for 45 seconds for each side\nto get the job done with the additional use of that band. And there you have it guys, the perfect oblique\nworkout, which yes, will help you with those love handles. Because as you develop the muscle underneath\nand you go to athleanx.com/carbs to get your free nutritional guidance I'm providing you\nwith, you're going to have the perfect one two combination to get rid of the fat that's\ncovering them up right now and get them to looking better. And as always, guys are going to give you\nthe screenshot here. For the full step-by-step plan guys to make\nsure that nothing is overlooked when it comes to a training. Putting the science back in strength always\nguys. If you're looking for a step-by-step plan,\nwe have day-by-day nutritional plans available for you as well, you can head over to athleanx.com. If you found the video helpful, make sure\nyou leave your comments and thumbs up below. If you like the perfect workouts, tell me\nwhat else I can help you with and I'll make sure I do just that. If you haven't already done so, make sure\nyou click Subscribe and turn on your notifications so you never missing a new video when we put\nit out. All right guys, see you soon."
}