{
    "id": "UaKcv6A88Dk",
    "title": "Oblique Workout for Ripped Obliques (7 EXERCISES!!)",
    "description": "Get ripped abs and shredded obliques (meal plan and workouts) http://athleanx.com/x/complete-system-to-a-ripped-core Oblique ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.COM. It's Washboard Wednesday. That means we've got another ab workout for\nyou here today. But guess what? This one's not going to focus on those visible\nwashboard abs that you may be looking for, but maybe the most important thing to help\nto show them. Yes, we know that diet should come first and\nforemost because if your diet's shit, you're not going to see anything underneath that\nlevel of fat that you've got there. But, if you've got your diet in check, you\nbetter make sure you've got some impressive looking obliques because the obliques are\ngoing to help. Because of their shape and the direction that\nthey run, they're going to help to taper down your waist. Even if you have abs, you could have a blocky\nlooking midsection if you don't have killer obliques that come in and etch out and frame\nout that 6-Pack. Today, I'm going to show you an oblique routine\nthat you can do to help to start getting those obliques to show. OBLIQUE WORKOUT CRUSHER CYCLONE LEG RAISES OBLIQUE TWISTS REVERSE CORKSCREWS THREAD THE NEEDLE 1 LEG PLANK HOP TWIST FLOATING SCISSORS HI-LO WOODCHOPPERS So, there you have it guys. There's an oblique routine that you can start\ndoing right now to help those abs start looking better. Remember the importance of the obliques in\nframing out those abs, you're going to want to make sure that you incorporate oblique\nwork in everything you do. Guys, we already have you covered here at\nATHLEANX. The obliques are a part of every single ab\nworkout that we do in our Training System because they're 1 of the 3 major functions\nthat we have here for the abs in our 6-Pack Progression. So every single ab workout that you do, and\nthere's over 120 different ab exercises in our program, every single one that you do\nwill include some work for your obliques. And of course, we know that in order to show\nthem guys, you're going to have to have your nutrition in check but I've got you covered\nthere as well. ur ATHLEAN X-FACTOR Meal Plan is included\nin our ATHLEANX Training System. That's going to help you get that body fat\nlevel down to where it needs to be so that you can see the results of all your hard work. If you found this video helpful, make sure\nyou leave your comments and thumb's up below, and in the meantime, if you're looking for\na training program to help you to get them to show, not just for a short period of time, but 365\ndays a year, then head to ATHLEANX.COM right now. And I'll see you guys back here again in just\na couple days."
}