{
    "id": "ui0KSWOPTIw",
    "title": "Shoulder Workout in ONE Set (137 INTENSE REPS!!)",
    "description": "Are you training hard enough to see muscle gains? Make sure here... http://athleanx.com/x/train-hard-here A good shoulder ...",
    "transcript": "So you think you can get a full shoulder workout\nin with just one set? Well, it all depends on how hard you're training.\nI want to show you how hard hard really is today. What's up, guys? Jeff Cavaliere, ATHLEANX.COM. The one set shoulder workout, is it even possible?\nIt all comes down to how hard you train. And one thing I say here over and over again\nis, you can either train hard or you can train long, but you can't do both. And what I mean by that is, if you're applying\nthe proper intensity to your workouts, they don't have to be long. And you can certainly be overloading, right.\nWe're not talking about overtraining, guys. Overtraining does NOT mean overloading. I've addressed this so many times that it's\nalmost-I get nauseous by now. There is no such thing as overtraining being a good thing. It's just a misdefinition of the word. Overloading\nis good, and that's what we're trying to do in this workout. And you can do it in one set. There's a big\nadvocate of this we talked about before, Mike Mencer, who said one set was enough. We think if we can do a hard workout and get\nit done in an efficient amount of time, a lot quicker, right, then we can get a more\neffective workout. Because we're going to condense the time period\nthat it takes to do our work, and therefore have a more effective workout. I think we can demonstrate that today with\none series of exercises in one compound set that can accomplish that. And we're going to do it through 7 different\nexercises. We're going to start with a regular Dumbbell Overhead Press. Ok, then we're going to drop it down to a\nPush Press to get a little bit more assistance from our lower body. Then we're going to do a High Pull, ok, which\nis going to give you again a little bit more of a transition, a step-down transition, from\nthe pressing exercises. Then we'll drop one dumbbell and go into our\nplate-eight, into our Plate Press Combo, so if you haven't already seen, a lot of these exercises, guys, are right\nfrom the Deltoid Dozen that we did last week, and I'll link that video up over here because\nyou're going to want to see these in action. Well, we're going to put them to the test,\ndrop 'em down, and finish out with bodyweight, and see-How long can I extend this one set? And I want you to see the level of intensity\nbecause that's what important, right. And I'll address it if I can talk when we're\ndone to tell you, and wrap it all up. So, we start here with our dumbbells, and\nwe start cranking away. And away we go. Still going. One more. Ok. Let's start all over again. You can either work out hard, or you can work\nout long. How hard are you working out? If you think\nthat you can do what I just did and repeat that now for 2 or 3 hours? Because we'll get the comments. 'You're crazy.\nThere's no such thing as overtraining. I work out 3 hours a day. You don't work out hard\nenough.' If you can put this kind of effort into your\nsets, now it doesn't have to be this big, long, extended drop set like I just did. The point is to illustrate that for some beginners\nthat would crush them. They wouldn't be able to do another set. And for me, that's fine. Workout's over. You\nstimulated enough muscle to assure that you will grow the next time, ok. So, you want to make sure you're progressively\nchallenging yourself, so you go through that again, do it 2 or 3 times, 4 times. But I can guarantee you, you sure as hell\nain't going through this thing 10-15-20 times. Not with the same level of intensity and effort. And that's what we're talking about, guys.\nStart making your workouts more efficient. Maybe not one set, but if you're in the gym\nfor longer than 40 minutes, 50 minutes, an hour tops, you're probably not training hard enough.\nYou're certainly not training with the intensity that's required to see results without overdoing\nit. And that's what we're trying to illustrate\nhere. If you guys haven't already, and you want\nto start trading in workout length for intensity and therefore better results, then head to ATHLEANX.COM right now. Let me\nbe your coach. Let me show you how we train, and how we get things done. That's at ATHLEANX.COM. In the meantime, leave\na thumb's up. I would normally lay it all out here for you in these videos, but I felt this one isn't necessary. I gotta'\ngo rest up though now. I'll see you guys back here in a couple days."
}