{
    "id": "UIDaXSXjuGc",
    "title": "I HATE PLANKS (and why you should too!)",
    "description": "Do this instead of planks - http://athleanx.com/x/full-program Subscribe to this channel here - http://bit.ly/2b0coMW I hate planks.",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. I fucking hate planks. There, I said it. I've got your attention too, probably. The fact of the matter is this: it's not that\nthe exercise is that bad. It's actually a good exercise for those that\nit's challenging for. And that might be a very, very small subset\nof the people that are watching this video because I feel that the plank has become the\nnumber one reason for mediocrity when it comes to functional ab strength. We spend so much time on the ground mastering\na variation of a static plank. Whether it be in a forward position, or with\nit being a side plank position; the fact of the matter is, you can handle this, and you\ncan handle a lot more. If you're not challenging yourself with more\ndifficult variations of this exercise, then we have a problem. So what we need to do is, we need to show\nyou other variations of this exercise that are far more challenging than a standard plank\nthat will allow you to get much more out of it. Including, hip strength and stability, ab\nand core anti-rotation stability, things that are much more important than just being able\nto stay like this for as long as you possibly can. As a matter of fact, if you can hold this\nposition for a minute you don’t need to be doing static planks anymore. So what should you be doing? Well, you could start doing what I'm doing\nhere. The first thing I want to target, if I want\nto take my planks to a much more functional and productive level is I've got to start\ncontrolling rotation. By doing so, I'm actually getting the obliques\ninvolved as well. So what I can do here is this thread the needle\nvariation. Now, as I come through I'm getting top down\nrotation. I'm keeping my legs static, and I'm moving\nfrom the top rotating from the top on the bottom. This is challenging, okay? We could come in here, reach all the way through,\nand come up to the top. Now, it doesn't have to always be top moving\non the bottom when we can get the bottom moving on a fixed top. We could do that here with these alternating\ntoe taps. The key here is not to fall forward and fall\nbackward, but slowly tap forward, and tap backward. You can see that you're controlling the rotation\nhere, and yes, I'm working really, really hard. We could also elevate the plank a little bit\nhere too, and have a hip drop. Now when we do the hip drop here I can get\nrotation of just the hips. So now we're focusing on a hip rotation down,\nand then as I'm lifting up, I'm not just lifting statically straight up and down. I'm getting the rotation component here, too. That is overlooked, and I'm telling you, you\ncan do this. You can do this, but you have to start opening\nyour eyes to the possibilities that you can do a lot more than just hold a static side\nplank. Beyond that, hip strength. My God! We have the weakest hips going. So it's an epidemic, along with glute weakness,\nthat we have to be able to address this weakness in our hips. We could do it with a side plank. What you do here is you stagger your feet,\nand now you move your bottom leg, and we move our bottom leg to work the top leg because\nyou can see here that the top leg – the adductor on the top leg, on the hip – has\nto stay really, really strong and contracted here to be able to hold us up into the side\nplank as we move that bottom leg. We could do the reverse as well. We could keep the bottom leg there, and now\nmove the top leg. We're now working the abductor; the outside\nhip muscles of that bottom leg. If they were to give in I would simply drop\ndown to the floor. So we can move our top leg dynamically. Again, much more involved than a static plank,\nand get so much more out of it. I mean, even a few reps of this and I feel\nit burning in my hips because I too suffer from weaker hips than I want. So you want to make sure you address these\nas well. Again, back to the other variation, too. We can add combinations to this exercise. Make it more interesting. Make it more fun. This is a plank press. It's kind of like a pushup, it's kind of like\na plank, it's not like a standard plank. So we rotate down, we let our chest come down\ntoward the floor, and we push ourselves back off of it. You can see the different variations here. The idea is that standard planks are most\nlikely not challenging you. As I said in the beginning, if one minute\nyou can hold a standard plank – whether it be on your elbows, or forearms, or even\nup on your hands, or on the side plank position, you can do them all – forget it. Move on. It's going to hold back the level of strength\nthat you can develop. More like I said in the beginning, your functional\nab strength, because they're meant to do a lot more than just hold us in one position. As I said, don’t let them bring you down\nand cause you to have mediocre ab strength when you have so much more in you. Guys, I hope you've found this video helpful. If you're looking for a program that will\nchallenge you in many, many, many ways, all three planes of motion – not just sticking\nus on one and saying \"Stay there and hang out. We'll be back in a while.\" I'm saying training like an athlete. Then head to ATHLEANX.com and get our ATHLEANX\ntraining program. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what you want to see and I'll\ndo my best to do that and cover it for you here in a future video. All right, guys. I'll see you soon!"
}