{
    "id": "uRK9psEpF-E",
    "title": "The ONLY 2 Shoulder Exercises You Need (NO, SERIOUSLY!)",
    "description": "What would you say if I told you that there were only two shoulder exercises you need to do? In this video, I am going to show you ...",
    "transcript": "When it comes to shoulder exercises, \nthere are no shortage of options. However,   which exercises do you focus on? If you're \nstruggling to build your delts right now,   you're going to want to watch this video to \nthe very end because I'm going to give you   the two exercises that you need to focus on if \nyou want to start seeing your best results. Now,   others may want you to believe that there's only \ntwo exercises that you need and that all other   shoulder exercises just don't even provide any \nadditional benefit. That's not what I'm saying.   But if you don't have these two boxes checked \nin combination with each other, you're going   to struggle to build your best shoulders \npossible. With this bare minimum approach,   you can be assured of the fact that you're going \nto have an effective combination of exercises to   use and more so be able to focus on fewer things \nso you can get to where you want to be faster. \n  What's up guys, Jeff Cavaliere, Athleanx.com. So, \nyou might be surprised to hear me say only two,   especially when it comes to shoulders, \nwhen we've got the front, middle and rear   delts. There's a lot of choices, but if you use \nscientific selection of the exercises you do,   you can make the right choice. Now, when we talk \nabout the only two, they're not just the only   two you need. If you're only going to do two, \nthen these two need to be on your checklist.\n  And the first one has to be some variation of \na press. And we know that the Barbell Press is   providing you a great opportunity for shoulder \ngrowth, and that's all-around shoulder growth   hitting all three of those heads. But what \nif you've actually maxed out your gains here?   Right? You just plateaued. You can't add weight \nto the bar anymore. We've got other options. And   that would be something like a Z Press where we \ntake away some of the momentum of the legs and   maybe drop the weight just a little bit to work \non that pure shoulder overhead pressing strength   that when you take back with you to an overhead \npress, it's going to be a lot stronger. \n  Now, it's also no secret that I like to take \nmyself outside the rack and tell you guys to   just grab a pair of dumbbells and do a standing \nversion of the Overhead Press. This is a great   option except for those who start to use heavier \nand heavier weights trying to get the weights to   clean them up to your shoulders from a standing \nposition is a hell of a lot harder than it is from   a seated position. So, here's the option I'm going \nto provide you, just a One Arm Dumbbell Overhead   Press. Because the clean is a lot easier to do \nwhen you've got two hands to help you get there.   And we get this additional benefit of shoulder \nstacking and joint stacking, which will allow you   to have optimal strength and efficiency while \nstill overloading one shoulder at a time.\n  So, what I talk about is as I press up, I can \nlean just a little bit and keep my wrist over   my elbow over my shoulder. If I have any \northopedic issues at all, I can adjust the   weights from side to side and still make sure \nI'm getting the appropriate overload. Remember,   guys, the list of only two has to start with \nat least some version of an overhead press. \n  But that's just one. We still have one \nother. And when it comes to shoulders,   it's pretty damn hard because you're forcing me to \npick between one that targets more of the middle   delt or one that targets the rear delt. That's \nlike asking me to pick between my twin sons. Well,   luckily, I don't have to make that pick, and \nneither do you, because I've got an option   that's going to actually help you to hit both \nand it's going to be a version of a Lateral   Raise. And when we talk about this, guys, that \nis the movement. Some form of a lateral raise   needs to be in the equation here, but we don't \nwant to have to pick between the rear and the   middle delt. And for me, that's where the side \nlateral raise is done with the cable because   we get some really unique benefits here.\nNumber one, I can get my arm across my body   to get a pre-stretch on the middle and rear delts \nthat isn't really there in any other variation.   But then what we want to do is focus on the \nfeet, because if we can just turn our body,   all importantly, just about 45 degrees, we're \ngoing to change this exercise and we're going   to target both the rear and middle delts \nbecause of it. So, I get this resistance of   abduction because of the angle of my arm against \nthis line of resistance in the cable. But I also   am setting up a bit of a row where I'm resisting \nextension of the arm behind the body. And as any   heavy rower will tell you, with huge rear delts, \nthat's what drives the growth of the rear delt is   the extension of the arm and heavy resistance to \nextension. So, by having this slight tweak of my   body in this direction, I've turned this Lateral \nRaise into more than just a Lateral Raise. I'm   getting the benefit to the middle delt and the \nrear delt at the same time. With that stretch in   place that I talked about from the very beginning, \nit's just a great variation of a lateral raise.\n  Now, if you didn't have this cable set \nup, you're not out of luck. Try the Cheat   Lateral again. Because the Cheat Lateral is \nan exercise I always talk about being able   to give you that heavy resistance that has the \neccentric component and overload too. But you   can turn it into extension with that slight \nleaning of the torso extension and external   rotation at the shoulder. You get all of these \ncomponents that are allowing you to get growth   in both the middle and rear delt. Regardless \nof which one you choose, the Lateral Raise,   in some form or fashion, is going to be what \nyou need to do. You pair it up with the first   exercise, you got a powerful combination. \nAnd remember, don't let others flaw this concept   of only two for you. If you only think you need \ntwo exercises, you're doing it wrong. But if   you choose to only do two, then these two have \nto be it. If you're looking for other shoulder   exercises that will complement it well, make \nsure you check out this video, I actually rank   all the shoulder exercises for you. If you're \nlooking for a complete program from Athlean-X,   you can find it at Athleanx.com. Guys, remember to \nclick, Subscribe and turn on your Notifications so   you never miss a video when we put one \nout. All right, guys, see you soon."
}