{
    "id": "uwX2KUW_k8c",
    "title": "Should You Train to Failure (THE ANSWER!)",
    "description": "Exactly how to train here - http://athleanx.com/x/what-to-do Subscribe to this channel here - http://bit.ly/2b0coMW The question of ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. I'm here at Winter Meetings 2016 and I wanted\nto bring you guys a video. More importantly, a topical video because\nhere this year I have a chance, as always, to get together with some of my great friends,\nmy colleagues, strength coaches in Major League Baseball. One of the topics that we're talking about\nthis year was occlusion training. Constant training. I've covered this topic here on our channel\nbefore, but here you can actually see me going through the protocol. Yes, it blew me up. Yes, I think they asked me to do this because\nthey think I have human balloon arms. I'd be the perfect demonstration for this. The fact of the matter is, this protocol relies\non three different types of failures that you would either stop your set based on reaching\nany one of them. That would be a change in tempo, a change\nin your tolerance to the activity that you're doing, or a change in the technique, or the\nform that you're using. Now, that brought me to the question that\nwe get a lot of times here. That is \"Jeff, should I be training to failure\nall the time?\" We advocate here, all the time you should\nbe training to failure. The big difference is that there is different\ntypes of failure. So, like we just talked about here. Tempo failure, tolerance failure, technique\nfailure, and how you incorporate them and what you're training for will dictate the\nentire difference. So I jumped right down into the hotel gym\nbecause I figured this would be a great opportunity for me to show you what it is I'm talking\nabout. So here I am doing a pullup. Not a pullup. This is more of a strength based, hypertrophy\nbased exercise that I'm doing here to try to reach typical, or usual failure. That would mean that I would do this until\nI reached a failure in my technique. I want to go as hard as I can. If my tempo hadn't have slowed down – as\nyou can see it happening here – that's okay, as long as I continue to follow good, and\npractice good form, and follow the same technique. You can see me struggling to get reps here,\nbut I'm still doing that. Tolerance wise, this is burning. This is killing me, but I'm still pushing\nthrough this because I'm trying to train to failure. Now, what I don’t want to do here is change\nmy technique and actually drop down from the bar, or actually continue to do my reps by\nchanging my technique to just plain-ass, shitty form. Which is what you can see me doing here. That wouldn't be training to failure because\nthat's not really productive reps at that point. Moving on, we can extrapolate this out. If I was doing something with tubing, something\nthat is high rep in nature, what you're trying to do there is rely on your change in tolerance. So we know that we're going to be able to\nmaintain the tempo, most likely. As I rack up rep, after rep of this. We know that I'm likely going to be able to\nmaintain the technique. The weight's not hard enough for me to really\nstart struggling with technique, but my tolerance level will change. How much can I withstand the burn? At what point does the burn get so much that\nI have to let go and fail? That is actually what we're looking at here. I finally have to just give in because I can't\nmaintain my resilience to that burn, and therefore I've reached failure again. This time in terms of my tolerance. Finally, we can look at an exercise like this. Here I'm training to be explosive. When we talk about athletes, explosion training\nis actually very, very key. Power training. With power training there is certainly a component\nof speed built into every rep. if you're not hitting the speed, if you're\nnot getting the proper tempo in less than 1.2 seconds per rep, you're not getting that\ntempo; then you're not training for power anymore. So guess what? If your goal was to build your power, you\nshould stop that step. So here you can see that as I start to get\nslower and slower, that is an indicator to me to stop it and quit. Again, the goal dictates that you have reached\nfailure. Understand what you're training for, and that\nwill dictate what type of failure you're training to. But understand this: if you want to make change\nyou'd better train to some type of failure. Those that tell you not to don’t necessarily\nunderstand the varying types of failure, and I want you guys to make sure that you understand\nthat because if you just show up and just do sub-maximal sets, not touching any of these\ntypes of failures you're literally just spending time in the gym not doing anything productive. You're not challenging yourself in any way\nto come back bigger, stronger, and better. So guys, I've got to get back to work here,\nbut I wanted to make sure I cover this for you. Again, coming here live from 2016 Winter Meetings. I'll be back here again in the gym next week\ncovering all of the things that you want me to talk about. If you're looking for a program that puts\nall the science back in strength the way we do here – and what I try to bring here to\nthese meetings – then head to ATHLEANX.com and get our ATHLEANX training system. In the meantime, I'll see you guys back here\nin just a few days."
}