{
    "id": "uxE4NtMPTJA",
    "title": "I Did HIS Chest Workout (AT HIS GYM!)",
    "description": "If you want to build a bigger chest then you'll want to use a chest workout that checks all the boxes and delivers the pec gains that ...",
    "transcript": "What s up guys, Jeff Cavaliere, athleanx.com. And Jesse Laico, athleanx.com. I'm letting him actually train me today. I\nsaid, you let me come to your gym, you train me. I'm taking you through International Chess\nDay today. So, you haven't learned very much? I'm a little nervous here because I don't\nwant to I don't want to hurt you because if I do, I'm in big trouble. Or show me up. Okay. I would love to show you. Okay, so what are we doing? You're at the\nhelm. We re starting with the flat bench press dumbbells. All right, go. You're up. Wow. Is that your\nwarmup? Maybe. Now the real work starts. Making it look easy. All right. You re going to show me up, so let s what\nyou re going to do for I think I might jump. I feel good. Nice, warm now? It s a great chest workout Jesse. Very creative\nso far. So far. So, I'm going to go with the 80s here,\nI'm going to try and get more reps if I can. All right. So, you re going to try to get\ntwo sets to this? Two sets. The Master s always got to stay a little ahead of the Apprentice. You re going to start on four reps here. Okay. I m going to go up. You re going to go up? I m going to go up. Now what you say we make this interesting? Oh boy. As many reps as you can do. Okay. All right. I go to the 85. Okay, I like it. What s the penalty? Can we\nshave your beard again? No. Absolutely not. You gotta grow a beard. Twenty bucks. Twenty bucks? I paid twenty bucks to get you\nin here. Twenty bucks. That s nice. There you go, we ll add an incentive. All right, fair enough. How many am I getting\nhere for that twenty? You tell me. There you go. Come up. Oh, you got another\none, keep going. Come up. Oh boy. Is that five? That s five. That s it. Oh, you just made things harder. I ve got\nto get five, right? Five. Or somehow six to get my twenty bucks back. How about this, five you got the twenty bucks. Thank you. Four, five. Oh, you got this. That s enough. Thank you, I'll take that back.\nNow, where to now? What's the next stop on International Chest Day? It is Wednesday you\nknow. Every day is International Chess Day. Okay. So, we re going to go three sets, 10 to 12\nhere. So, a little higher, okay. So, a little bit higher. I m not sure I like what you re doing to my\nshirt there, by the way. Suns out, guns out. See, what I m going to do to protect myself,\nbecause I m going to lean to this side first, then lean to this side, so I don t have to\nexpose my shoulder too much. I mean, what I do like about it is there is a bottom to\nit. Unlike the bench fly. Yeah. Feels good. Rotate it back into the starting position. You want to go a little heavier? Yes, I do. Yeah. Here you go isn t that nicer? Oh, that's way better on my shoulders. I'm not playing around anymore. All right, it's getting serious. All right,\ncome on, let s see what you ve got. As our boy Seamus says Last set, best set. There you go. I don't know if you noticed,\nI went up again in weight. I like to kind of open my hands to squeeze the hands together.\nOkay, feels good. Now what? Now get some adduction, some true adduction,\ncable crossovers. You're learning, little man. Where do we go? Who you calling little? You going to go one side? One side at a time. All right. All right, you re up. I  like the no rest in between arms, obviously.\nI have this here so I can feel it so I know what I m working. I put my hand here, It s\njust to make sure that I'm starting it from here. Yeah. And not diving on my shoulder. Right, keeping yourself out of it. Yeah. I think, the guideline is form failure, so\nyou re still resembling the exercise that you're doing, you know? Yeah. Get that arm out in front of you and across.\nThere you go. Still want to drive all the way across, but don't stay in nice and tight.\nGet it out and through. I'm really trying to-- Drive across. Drive across. I mean, in a way, it's obviously\na process, but it s an acute across the body press. Right. You know, I m not going to lie, it s kind\nof nice that we re doing it the same weight in the crossover. I was actually thinking about going down. Now Incline Machine Press. I haven't really done this in a long time.\nYou got a curveball? I got a curveball. I'll take a curveball. Don't tell me yet. I ve got two sets of these. Okay, don t tell me the rest. Eight to 12 reps. Okay. All right? All right. I like the angle of the bench, that 30-degree\nangle. That's kind of heavy. How many did you get? Eight. All right, you said eight to 12, right? Yeah. All right, throw that 25 on. I only\ngot seven. You got seven. You know what, I ll give it\nto you. All right, I ll take it. All right. What s the curve ball now? Curveball? I know you like weighted dips,\nbut we're going to do weighted dips my way. You have to try to get at least half as many\nat each step. At least one dip? At least one and a half. Get two, round it\nup. Keep going. There you go. That s it. All right. That s all I got. Here you go. That was nine. All right. So, let s get five here. All right,\ndo three. You go this. One more, come on. Woo, that fun. It s good right? Pretty simple, Pretty easy. I m feeling it. You feeling a good pump there? I m feeling it. Don t hit too much. All right,\nyou passed the test. I passed the test. So, uh, what do you got on Monday? Monday, my favorite, legs. Back at my gym. I ll see ya."
}