{
    "id": "uYG3CneV-Pw",
    "title": "The BEST Dumbbell Exercises - LEGS EDITION!",
    "description": "Dumbbell exercises do not have to be less effective when it comes to building your legs - as long as you choose the right ...",
    "transcript": "JEFF: Today we continue our best dumbbell\nexercise series. This time, bringing you the legs edition. Let's get this out of the way right off the\nbat. Your best exercise options, when it comes\nto your legs, are likely going to involve a barbell. Squat and deadlifts, to name a few. However, that's not the rule of the series. As we've continued from the very beginning,\nthere are some rules in place. I've got select dumbbell exercises, but I\nrequest a favor in return. I need to at least be able to categorize them. Based on training goals, I need to be able\nto slot in those exercise choices for strength, hypertrophy, power, a metabolic exercise,\na total body option, a corrective exercise option, and one of those miscellaneous that\ndoesn't really fit into any of those other categories. So, what I'm going to do is break those down,\nexercise by exercise and I'm going to- JESSE: Whoa. Whoa. JEFF: Can I get through a video without you? JESSE: Whoa. I think I should be taking care of this video\nbecause, as we know, I've made some serious leg gains. JEFF: Okay. Freddy Mercury? JESSE: Thank you for the compliment on the\nmustache, by the way. JEFF: It wasn't a complement. I think I can handle this, as I always handle\nmy videos. But I wouldn't call myself – why do you\nthink you can do this? JESSE: Because I think you should be calling\nme the 'King of Quads'. JEFF: The King of Quads? JESSE: The King of Quads. I think that's a better nickname than Freddy\nMercury. JEFF: I don’t think it's really King of\nQuads. JESSE: You know, it looks more like the Queen\nof Quads to me. JEFF: See? I agree. That's a better name for you, actually. JESSE: I can't win, can I? JEFF: NO, you can't. All right, guys. We're going to kick it off with our strength\nexercise. I'm going to give you two because I want to\ngive you one anterior chain, knee dominant exercise and one posterior chain, hip dominant\nexercise because it matters. JESSE: Whoa. Pardon me, pardon me. When you say, 'posterior chain', are we talking\nabout the glutes? Like a fat bottomed girl? Because, as we all know 'Fat bottom girls,\nyou make the rockin' world go 'round'. JEFF: Are we going to have to do this the\nwhole video? Guys, let's start with the anterior chain,\nknee dominant exercise. We're talking about the reverse lunge. One of my favorite exercises you can do. I love unilateral training, but I also like\nthe fact that we can load this one a little bit heavier. You can use 100lb plus dumbbells if you want\nand if you can manage them. The fact is, it's how you perform the exercise\nthat matters. Here, for anterior chain, because we can sit\nback and upright, we can really load up on the quads in a big way. Now, you can see when Jesse does this he's\nstepping, not just straight back because that would narrow his base of support and make\nthe exercise vulnerable to someone that has a weak balance. But we don’t need to do that. As he steps back you can also step a little\nbit out to widen that base of support, widen his stance, and give himself the best opportunity\nto continue to load the exercise for the purpose of building his strength. Now, if we switch over to the other side here,\nwe're going to go posterior chain. My exercise for this is going to be the Romanian\ndeadlift. Again, what we do here is perform this in\nthe same way we would with a barbell. We let the dumbbells slide down and the main\nfocus here is allowing the hips to hinge backward. I’m not even caring where the dumbbells\ngo. Their travel should be straight up and down. The main thing you should be focused on is\nthe movement in the sagittal plane of the hips. Get them to creep back as far as your hamstring\nlength will allow you. When you get there, you initiate the return\nby squeezing and driving with the glutes back up to the top. If you're limited in the depth that you can\ngo because of the flexibility of your hamstrings, it shouldn't compromise the fact that you\ncan still load them with as heavy dumbbells as you can possibly hold here, still getting\ngreat benefits from the exercise. Moving on, we go to the hypertrophy exercise\nselections. Once again, I'm going to give you two. One more for the anterior chain, one more\nfor the posterior chain. My anterior chain selection is always the\nBulgarian split squat. JESSE: I'm sorry, did you say, 'Bohemian split\nsquat'? That's a part of my favorite song \"Bohemian\nRhapsody\". JEFF: I said we're not doing this the whole\nvideo. JESSE: Do you want me to leave? JEFF: I want you to leave. Desperately. JESSE: I'm just a poor boy, I need no sympathy. JEFF: The Bulgarian split squat is a great\nexercise for the anterior chain. Why? We're able to do it two ways. We can do it in a more anterior-dominant,\nor posterior-dominant way, depending upon how we align our torso. Let's check out the anterior chain first. If you're going to load your quads and train\nyour quads here, your main focus should be keeping an upright torso, as much as possible. Chest out, shoulders back, drop straight down,\nand load the quad. Now, what we can do, if we want to get more\nout of this and make this even more of a hypertrophy overload, we can add in some intensity techniques\nlike the one-and-a-half technique, which is one of my favorites. You go down to the bottom, you go only halfway,\nyou have to go back to the bottom again, and then you return up. We can also change this exercise, like I said,\nto become more posterior chain dominant. All that requires is a change in torso position. You can see Jesse leans his torso a little\nmore forward to lower that posterior chain. Nothing changes from this point on. As he goes down, the back-angle stays angled\nforward. He drives up, and back. You'll immediately be able to feel the difference\nin the load shifting toward the glutes to perform the exercise. Again, the same techniques could still be\nused here by prolonging the amount of tension we focus on those muscles to create more of\na hypertrophy benefit. Moving on now, we're at the category of power. To choose an exercise properly here, you have\nto have one that allows you to accelerate the weights that you're moving. Power is going to rely on your ability to\nmove the weights you're moving quickly. My favorite exercise here is the dumbbell\njump squat. This exercise is designed to not only become\nmore explosive but carries over well to some of the more explosive exercises, like the\nhang-clean and power-clean. The key here is to choose a weight that's\nnot too heavy, which will slow down your ability to perform this properly. I like to aim for a weight that's combined\nto be about 25% to 50% of your bodyweight. So, if you're a 200lb person, you're looking\nat a combined weight of 50lbs. So 25lbs in each hand. Remember, you want to make sure you're achieving\ntriple extension. Meaning, you want to extend through the ankles,\nthe knees, and then the hips in that sequence to allow the kinetic chain to pass that power\nfrom the ground up, into this explosive jump. But it doesn’t just end there. You also have to make sure you can eccentrically\ncontrol the landing, reset, recoil, and prepare yourself for another high-quality repetition. It's not about training to failure when you're\ntraining for power. It's not about training to a certain level\nof fatigue. What you're trying to do is accumulate only\nhigh quality, powerful repetitions in a defined period of time to maximize that speed output\nand maximize your overall power generation. Moving on now, we have an option for a metabolic\noverload. JESSE: Whoa! Whoa! JEFF: Knowing that we can- JESSE: I know this one! I know this one! We're talking about bicycles, aren't we? Riding a bicycle. Because I want to ride my bicycle. JEFF: I said no more Freddy Mercury. JESSE: No more? JEFF: No more Freddy Mercury. Please. JESSE: Do you really want me out? JEFF: I want you out. Bye. Bye. Bye. JESSE: Bicycle! Bicycle! I want to- JEFF: Okay. Thank you for hanging with me. We're talking about something called 'walk\nthe box'. This is a brutal, ball-buster. I’m going to call it what it is. I use this, as you can see here, when the\nUsos and Seamus from the WWE came into the Xbox here to train. What we're doing here is trying to build our\nmental fortitude. We're trying to get to that metabolic burn\nand then figure out a way we can savor that and prolong that. It's not easy, but it delivers different overload\nbenefits. So, what we do is get down in position with\ntwo dumbbells in the front rack position, and we walk the box. You're really just tracing a square around\na small area of the floor in front of you. We really focus on proper placement of the\nhips. You don’t want your knees caving into internal\nrotation of the hips. What you want to do is stay down at the bottom\nof the squat, still maintain proper form, maintain good thoracic extension through your\nupper back, and be able to walk around. It's good because we're getting three-dimensional\nmovement as well. But you'll see you're going to light your\nlegs up in ways you never have before. It's whether or not you can withstand that,\nand for how long, to see how much benefit you get from doing this. How much of the metabolic burn can you tolerate? I promise, give it a try. Maybe don’t try dumbbells if you can't in\nthe beginning, just to get the form down. But add those dumbbells in. I promise you a real ball-buster. Next up, our total body option. What we can do here is utilize the dumbbells\nin a very similar way to what we would do with the barbell. We can use a clean variation here. One of my favorite exercises, when we're talking\nabout total body force generation is a squat clean. What we do is have a pair of dumbbells. And these can be pretty heavy. There's no reason why you can't load up 100lbs\nhere if you're that strong. I guarantee you're going to find that's pretty\ndamn challenging. So, start lighter. The idea is that you clean them from the floor\nand try to get them into that front rack position. One of the best things you can do to ensure\nyou do this properly is try to time your stomp with the catch of the dumbbells onto your\nshoulders. The good thing is, if you catch the bottom\nportion of the dumbbell on top of your shoulder, it's going to get your elbows into that proper\nfront rack position. The key here, this is a great exercise. It builds the strength of the entire kinetic\nchain, once again, and it gives us another option to utilize some dumbbells that could\nstill challenge us, regardless of the fact that we don’t have access to a barbell. The next exercise is tailor made for the use\nof dumbbells. That is when we select our corrective exercise. When it comes to the lower body, one of the\nmost overlooked muscle complexes is going to be the adductor complex. Five muscles on the inside of your legs here\nthat are not only going to provide stability to your pelvis but assist you in getting out\nof the hole at the bottom of a squat. Like some of our traditional barbell exercises. They work perfectly with the lighter weight\nof a dumbbell. What we do is get one of our feet that we\ncan slide on a surface. I don’t care if you have a hardwood floor,\nif you have a tile floor like this. You get into some socks, you put your one\nfoot on a stable surface and allow the sliding foot to drop down as you shift all your weight\nto the other leg. When you get down there, how do you get out? The entire movement up is going to be generated\nby allowing the stretch that was created on the adductors on that side to allow you to\ncome back to the top. By squeezing and shortening back up to the\ntop. You don’t realize that these muscles are\npretty damn weak. The purpose of the corrective exercise is\nto allow us to attack that weakness with a very specific attack plan. I promise, you're going to find this to be\nan incredibly effective exercise at targeting weakness you maybe never knew you even had. We finish up here with our specialization\ncategory, or our miscellaneous/potluck category, where we can apply other exercises that don’t\nfit neatly into these other categories but are still very important. What I'm going to show you here is going to\nallow you to target those hips once again, but instead of the inside out we're going\nto go from the outside in. We're going to target the glute medias. A muscle just as overlooked and underworked\nas the adductor complex. The best way to do this is with this offset\ndumbbell lunge. What we do is load the dumbbell on one hand\nand step out and lunge with the opposite leg. Of course, you're going to work both sides\nof this. The fact is, what we're creating is this demand\non the glute medias to maintain a level torso and a level pelvis throughout the exercise. As the weight is places in this opposite hand\nand I step out with the other leg, we have a tendency to have the weight pull on us in\nthat direction. Especially if we're using something incredibly\nheavy. To counteract that, we have to use the glute\nmedias on this side to pull us back, to get ourselves back up to level, or prevent us\nfrom falling in that direction in the first place. That's a tremendous exercise option to do\nthat. Again, you're going to feel that burn in your\nhip you probably haven't felt before, but that's a good thing because it's exposing\na weakness you've already allowed to take place. There you have it, guys. The best of – wait. What are you doing here? I told you to leave. JESSE: Oh, you know. You can't stop me now. Don't stop me now! JEFF: Guys, back to the list here. Hopefully you find these dumbbell exercises\nhelpful. Again, it's important to break down the exercises\nthat we select here because there are different types of training purposes in what you're\ntrying to train for. Hopefully, these will fulfill those different\ncategories for you. If you're looking for a step by step program\nwhere we build out all our plans based on the science and selection of what we do – not\njust in the exercises we choose, but how we lay them all out from day to day – you can\nfind them over at ATHLEANX.com. In the meantime, if you haven't already done\nso, please- JESSE: Hey! Did you see Freddy Mercury here? JEFF: I did. JESSE: Did you get his autograph? JEFF: No, did you? JESSE: I didn't see him. I saw him go out the door. JEFF: Oh. Yeah. No, I didn't get it. JESSE: Oh. JEFF: I didn't get it. Can you tell them to subscribe, at least? While you're here. JESSE: Hey, guys. Don’t forget to subscribe and turn on your\nnotifications. It's really important. JEFF: Okay. All right. Where can they find our programs? JESSE: ATHLEANX.com. JEFF: And what should they do? JESSE: Leave a comment and thumbs up below\nand let us know what you want to see in the future. JEFF: He said it all, guys. All right, be back here again soon. See ya. Bye, Freddy. JESSE: Bye!"
}