{
    "id": "v07X1a7nOAE",
    "title": "10 Min | Home Biceps Workout (SETS AND REPS INCLUDED!)",
    "description": "If you have just 10 minutes and want a home biceps workout that will let you build big biceps at home, then this is the video for you ...",
    "transcript": "What's up, guys? Jeff Cavaliere. Athleanx.com. \nIf you've got ten minutes then you've got plenty   of time to get this bicep workout in. You see, \nI'm going to give you two options that you cold   do either at home or at the gym that are going to \ndestroy your biceps in ten minutes flat. You see,   I talk about it all the time, you can either \ntrain hard or you can train long but you can't   do both. If we train in some of that workout \nlength that maybe you're accustomed to for a lot   more intensity, you're going to feel first-hand \nexactly why it's possible to build muscle in a   short period of time. So with that being said, \nlet's start breaking down the lighter version   of the workout, and by no means does that mean \neasier. All right, so when we're talking about a   lighter workout here, remember, first of all this \nis relative. It doesn't mean necessarily light,   it means lighter than the heavier version of the \nworkout we're going to show you later. And vice   versa when we're talking about the heavier one, \nit doesn't mean absolutely heavy where we would   actually be training for strength if we got to \nthe low rep ranges with more rest time. We're   talking about heavier than the lighter workout. \nBoth of them, however, are geared at hypertrophy   and muscle growth. And right here when we \ntarget the biceps, one of the best ways to   do it was with a single band. Now I know what \nyou're saying, band workouts are easy, maybe,   until you try this one. The fact is we're going to \nstart here with a single exercise and you're going   to perform it for 45 seconds on and 15 seconds \noff. Now the goal would be to be able to perform   it nonstop without resting through the duration \nof the 45 seconds. If you had to stop, you stop   briefly, and you get right back into it again and \nyou keep going. Because what we're trying to do   here is go after a metabolic fatigue. We're trying \nto use metabolic stimulus as a way to create   muscle growth. And if we keep pushing ourselves \nthrough that burn we're going to get there faster.   But we don't just have one exercise here, we \ntake that first exercise for 45 on and 15 off,   and we repeat it for a total of two times. That \nmeans two minutes for the first exercise. We then   go and we repeat four other exercises in the same \nfashion. So what do the exercises look like? Well,   we start with this one here and this is a no money \nbanded curl. And what the advantage is the band   supply here, well it's not just the fact that \nwe can resist ourselves through flection of the   elbow through the curl itself, but we can also \npull apart. And you can see as we pull the band   apart we're getting resisted external rotation. \nSo we're not just getting biceps focused here,   we're getting biceps with external rotation \nin the rotator cuff. Which is actually an   extremely powerful combo when you realize that \nthe biceps tend to be an integral part of the   shoulder joint itself gets additional benefit \nfrom having the balance of the rotator cuff to   keep that shoulder in good health. 45 seconds \non, 15 seconds off, two rounds. From here we   move on to the second exercise, and now this is \nthe banded drag curl. We shorten the moment arm,   we bring the elbows back, we take our \nhands, we bring them closer to our body,   and we curl from this position, which shifts the \nfocus actually to the long head of the bicep,   the outside portion, which is what's responsible \nmore for that bicep's peak. And you could see I'm   just trying to drag my hands up my torso as much \nas I can, allowing the elbow bend, the flection   part that attacks the biceps to happen mostly \nback behind my body. You should feel a tight   contraction as you get as high as you possibly \ncan. From here you lower the band back down,   repeat, again 45 seconds on, and 15 seconds \noff. We next move on to the third exercise here,   which is called the step back curl. And for this, \nall I have to do is anchor the band to anything   that's a little bit higher than me. Ideally, if \nyou have a pull-up bar in your doorway, this would   work perfectly. With the band anchored in place, \nI grab onto it, I step back to get good tension,   and I curl. But I'm not done yet. From here now \nI have to take a giant step backwards. And what   that does is it places an additional isometric \noverload to maintain that elbow flection in that   position through the duration of the step back \nwhen I'm getting more tension here on the band,   and then come back in and repeat it again. Now the \nextra benefit here is the fact that I'm getting my   biceps into a state of complete contraction. I've \ngot elbow flection, I've got supination, and I've   got that all important third component that we \noftentimes overlook, which is shoulder flection.   So this set-up sets us into the position for \nhaving that complete bicep contraction. Remember,   45 seconds on, 15 seconds off. Again, two rounds \nof this. We move on to the fourth exercise here   in the workout, and this is the cross body banded \nhammer curl. So the slight positioning difference   here is instead of being in the neutral position \nthat you would normally perform a hammer curl out   of, we go into a fully pronated position. And \nwe know that if we go into a pronated position,   we actually activate the brachialis a little bit \nmore than if we do it from that mid-position. Now,   why is that a benefit? Well, there's two reasons. \nNumber one: we know that the brachialis is the   muscle that we want to develop if we want \nto have a fully developed upper arm as it   lies underneath the biceps. But more importantly, \nthink about where this is in this workout. This   is the fourth exercise in. You're already likely \nburning and cursing my name out. We got to offset   that bicep load a little bit and give it a little \nbit of a break. At a key moment in the workout,   and this is why this is placed in here perfectly \nat this time. Remember, as always, once again,   the 45 on, 15 off, two rounds. And then we wrap up \nour workout here in this final two minute stretch.   This one reserved for the leaning stretch curl. \nAnd to perform this you want to angle our body   forward with our biceps facing almost directly \ndown towards the ground. This is going to place   an enormous stretch in the biceps because we have \nour arms here back into extension behind our body   as opposed to, remember we talked about, flection \nof the shoulder. Now from here we want to try   to drive our hands down towards the ground and \nstraight forward. They should almost be facing   directly forward if you've done this properly. \nAt that point, you should feel a pretty intense   bicep contraction, but most importantly, you're \ntaking advantage of that stretch reflex. You have   an opportunity here to get a strong contraction \nin the fifth spot of the workout because you had   the added stretch reflex that's going to be used \nto your advantage. Make sure you take advantage   of it if you want to get through the remainder of \nthis workout. And with that, in just ten minutes,   you've managed to torture your biceps with a \nsingle band, probably in the comfort of your   own home. And more importantly, you've convinced \nyourself that good things can happen if you're   willing to put the work in. Let's say you want \nto go the other route, you want to go a little   bit heavier, but you still just had those ten \nminutes. Well, in that case, all you need is a   single pair of dumbbells, and you do this instead. \nIf the option you chose was to train a little   bit heavier, then the goal should be a little bit \ndifferent. The focus is not using metabolic stress   to drive hypertrophy muscle growth. The goal here \nis to use tension overload as well as eccentric   overload to create that stimulus for growth. And \nwe could do that, like I said, with a single pair   of dumbbells. And in some cases, here in the last \nexercise, a single one of those dumbbells from   that pair. But what we start with is the following \nexercise, and it is the dumbbell straight bar   curl. So we're going to mimic a straight bar by \nplacing those dumbbells end to end like you see me   doing here. What that does, is it demands that we \nmove them at the same pace, which actually exposes   any muscle imbalances you might have between \nthe right and left side. But more importantly,   it just gets us into simulating the movement of \nthe bar, as opposed to two independent dumbbells,   which as you're going to see here in a minute, is \ngoing to actually become a little bit easier for   you when we need it the most. You do this for a \nminute. If we could get through the entire minute,   you've done your job. If you can't and you have \nto rest, just like we did in the light version   of the workout, you would take a momentary rest \npause, get right back into it, and finish out the   entire minute. Now for these types of exercises, \nhowever, because the load is higher we're going to   get a one minute rest period. So we've got a one \nminute work period, one minute rest period. And   as you can see, the workout is structured with \nadditional exercises, all the way down until we   get towards the end, where I have a special \nsurprise. But that's not here yet. The next   exercise up is what we need to discuss, and that \nis the dumbbell drag curl. So for the drag curl,   just like we did with the banded drag curl, \nthe goal is to try to hit the long head of the   biceps by bringing those dumbbells in closer to \nyour torso, getting the elbows back behind you,   and simply trying to ride those dumbbells up the \nfront of your body as tight as you possibly can.   You can see the contraction here on that outer \nportion of the biceps. You can feel the intensity   of the contraction if you're doing it right. \nThe fact is, in the second spot here actually is   beneficial because it's offloading some of the \ntension that was on the biceps from the first   exercise by the change in the moment arm to allow \nyou to continue to do this ideally without rest.   But this is only going to last you for a minute \nbecause we're going right back to the curl again,   as you can see here in exercise number three, \nthis time to the dumbbell standing alternating   curl. So now how is this going to be possible if \nwe already fatigue the biceps through the first   two exercises? Well, the big difference here is \nthat you're able to move a lot more weight when   you move them individually than when you move \nthem together. And a lot of it has to do with   your ability to control your torso via your core \nstrength. When you move two dumbbells up together,   let's say they weigh 50 pounds apiece, your body's \ntrying to stabilize 100 pounds moving in this   direction. So you have to have a stronger core \ncontraction and more stability to do that. In the   case of a single alternating dumbbell curl, you're \nonly having to do half of that. Not to mention   you can actually lean into the arm and actually \ncreate a little bit more leverage for the working   arm that makes this exercise possible, even though \nit's put in that third spot. And we continue here,   again, after a two minute time period to go to our \nfourth exercise, which is the cross body dumbbell   hammer curl. And once again, just like we did \nin the banded version here, we're going fully   pronated to force that brachialis to do more of \nthe work. You can see that even as we crank out   rep after rep. It would feel like it would be \nvery difficult here. But we're not just relying   solely on the biceps. We have the help it needs \nin the brachialis. We want to make sure that we   use it to get the job done. And this brings \nus to the ninth minute of the workout here,   right when your biceps are ready to pop, we kind \nof stick the final dagger into them with this   bicep waiter curl. And the water curl's job is to \nactually take the forearms that probably want to   kick in at this point, and dominate the movement, \nsay no, you can't. You're going to stay out of   this thing and let the biceps finish this off. \nSo you get into this wrist extension position to   support the dumbbell where the top of the dumbbell \nbasically stays level with the ceiling that you're   curling in for the duration of the exercise. \nNow this was only being done for 45 seconds,   but it doesn't make it any easier. Your goal is \nto simply lift that dumbbell straight up to the   ceiling by getting those wrists taken out of it \nto prevent the forearms from kicking in too much.   If we can make it through the entire 45 seconds \nhere, you get a brief 45 second rest before we   hit our last combination here, and this is our \nburnout. I had mentioned this special surprise,   the goal here is to try to make it through the \nentire minute without resting, or at least doing   some type of contraction. Because you got an \noption here, you either start with holding this   isometric contraction in the midrange of the bicep \ncurl, which by the way, is the most difficult   portion of the curl. You hold it there as long as \nyou possibly can. Now at this point in the game,   it's likely you may not be able to hold it for \nthe entire time. But it doesn't mean that you   stop. You can actually try to force the eccentric \noverload of this exercise, and that's being done   by just simply delaying and slowing down the \nstraightening out of your arms as they start   to become overcome by the weight of the dumbbells \nin your hands. Don't let them just drop. Slow it   down with every bit of effort you have remaining. \nIf you make it through the end of the minute here,   it's a job well done, and believe me, you've \nearned it. And once again, in ten minutes now,   you've got that workout here laid out in front \nof you step-by-step with just that single pair   of dumbbells that's going to get the job done as \nwell. It doesn't matter which path you choose,   different stresses all leading to the same goal \nof more bicep growth, more hypertrophy. Remember   guys, it doesn't mean that you have to train long \nin order to get results. All you have to do is   be willing to train hard and you can train in a \nlot of that workout length if you're willing to   up the intensity level at which you train with. \nIf you're looking for a program that encourages   that and shows you how to do it step-by-step, you \ncan head to Athleanx.com right now and find the   program that's best suited to your current goals. \nIn the meantime, if you found this video helpful,   if you like series, let me know below what \nelse you want to see. I'll do my best to do   that for you. And if you haven't already done so \nmake sure you click subscribe and turn on your   notifications so you never miss a new video when \nwe put one out. All right, guys, see you soon."
}