{
    "id": "V0x4pf1J9eM",
    "title": "How I Build Muscle WITHOUT Weights!",
    "description": "If you want to build muscle and do not have access to weights at the moment, this is the way to do it. I'm going to share with you a ...",
    "transcript": "Grow. Come on Grow. Ah, fuck it s not working.\nWhat s up guys, Jeff Cavaliere, atheanx.com. Today I m going to show you how I build muscle\nwithout using any weights at all. And the fact is you're going to do the same exact\nthing. But unfortunately, it's not as easy as just staring in the mirror and hoping for\nit to happen, you're going to have to actually put in some effort here and you'll see here\nsoon, a lot of it. But it may not take you a hell of a lot longer than what I did in\nthe mirror there, because when you apply the technique that I'm going to show you is going\nto work and you're going to feel it quickly. That being said, a lot of us make the mistake\nof thinking that we have to use either dumbbells or barbells to stimulate new muscle growth.\nBut your own body weight is an amazing way to build muscle if you know how to use it. I'm going to show you here seven exercises,\nthe best of the best, for building muscle without any weight at all. And importantly,\na technique from the great Bruce Lee that if you apply it to each of those exercises,\nthe ones that you might be used to doing, maybe 10, 15, 20 or more repetitions on, prepared\nto be humble. You're going to bring those down to maybe the single digits. But along\nwith it, a whole new stimulus for muscle growth. So I mentioned a legendary Bruce Lee and a\ntechnique that he used to amplify the effectiveness of all the bodyweight exercises he did. And\nI do exactly this. So instead of just doing a push-up where we focus on the number of\nrepetitions we get, we want to find a way to make them the most miserable push-up we've\ndone where the number of reps becomes almost irrelevant, and how they feel is what we focus\non. Well, this is a constant tension push-up. And he started by focusing on driving as much\nattention through his chest because that's what he's trying to grow. But he realized\nthat he's going to feel it all the way through his arms, into his shoulders and through his\nback. He wanted to generate as much tension as possible\nthrough his entire body and slow down each repetition to increase the amount of stimulus\nhe got from it. I will tell you this, as I said in the open, you might be used to doing\na lot of push-ups, when you do him this way, you're not going to be doing as many. Not\nnearly as many, but you're going to increase the ability of the exercise to create a stimulus\nfor new growth. Now, he didn't stop there. He kept the tension\ncoming and I do too. In between sets, instead of just resting, he would get out of the push-up\nposition and then get those arms into a fully contracted position with his arms crossed\nover midline in front of his body. And you can see here that I've now got an intense\ncontraction on the chest again. And you hold this for six seconds with each second trying\nto build the strength of that contraction. You're going to hit a point at around the\nsix second mark where you're just going to feel like tapping out and you should. But\nthen you come back again for another contraction. Get into that position, you squeeze the hell\nout of it. You stop it around six seconds and you either do one more or you stop right\nthere. You rest the remainder of the time between sets. You come back to your next set\nof push-ups. Again. You're taking an exercise you might be used to doing a lot of numbers\non and you're bringing them down and humbling yourself, but at the same time increasing\nthe effectiveness of what you're doing. So when it comes to building your upper body,\nthe next best option we have is a Dip. And again, we're not going to stray from the best\nexercise of the ones that are most capable of delivering muscle growth where we're sticking,\nbut it's how we're doing them that matters. So on the Dip, I'm really squeezing in on\nthe handles. Once again, not just performing it like I normally would, but really squeezing\nin to try to create that isometric adduction and activate the shoulders, and in this case,\neven activate the biceps. I want to generate tension wherever my body is willing to give\nit to me. And who cares what the number is? You go up, you go down, you do it slowly,\nyou do it with quality in mind and wherever the number lies, that s what you take. But\nunderstand, the effectiveness of the movement increases substantially by doing this. Now, once again, instead of stopping right\nthere in between sets, we have another opportunity to add additional tension. And this time instead\nof crossing the arms across the chest, we go down at a low angle from high to low to\nmimic the mechanics of the Dip. We're going to hit more of those, a dominant head fibers\nof the lower chest. But again, the key here is to go for the strength of contraction,\nincreasing it every second to six seconds and do either two or three of these that put\nthe final nail in the coffin. Now, we don't have to focus on just those\nmirror muscles guys, we ve got to focus on that posterior chain and back, most importantly.\nAnd here we do a regular pull-up. Now, I understand the pull-up can be challenging for people\nall by itself, but you can make it even more effective if you're willing to put more tension\ninto it. So what you want to do is not just go up and down. Again, great exercise on its\nown, but when you re really trying to drive muscle growth and you don't have access to\nyour weights right now, this is the way to do it. You slow down the speed and you increase\nthe tension throughout your entire body. So here's what I try to do, is start by squeezing\nthe bar as hard as I can. I want to generate tension down through my wrists, through my\narms, into my back, through my core. And I want to make sure that I'm squeezing the muscles\nI'm trying to work, most importantly, which is the lats. And as I come down to the bottom,\nI go back up at the same cadence. Up and down concentrically and eccentrically I'm trying\nto make sure that I'm generating as much tension as possible. And of course, when I tap out\nhere, which is going to be at a no far fewer than what you're used to doing on a pull-up,\nit's okay. You come down and you keep the tension going between sets, two or three repetitions,\nthis time of trying to squeeze the back. How do I do that? I just bring those elbows back\nand I really just squeeze and hold for that six seconds, three times, we call it a day. When it s the biceps I m trying to build,\nagain, my favorite way to do this is with a chin-up. But even here, I want to make sure\nthat I can get a little bit more activation in the biceps. So I treat it as a chin curl,\nas I'm coming up I almost want to close down the angle just a little bit. However, we do\nthe same thing we've been doing here. We don't just go up and down like you see me doing\non a traditional chin-up, you do the constant tension version of a chin up. So I go down\nreally slow and I try to fight the eccentric, but at the same time generate as much tension\nthrough my entire arm and back as I can. And as I come up to the top, I'm really focused\non closing down the angle of the elbow and really trying to flex the bicep as if I'm\ncurling my body up to the bar. Same thing when I come down, I want to take advantage\nof the fact I can generate even a little bit more tension in between sets. The six second\nbicep squeeze here is enough to make sure that I feel as if I left everything on the\ntable with a traditional chin-up that's now taken to another level. And we go back to the pushing muscles now\nand here I want to focus on triceps. But again, instead of doing the traditional Cobra push-up\nlike you see me doing here, you guys get the drill at this point. How can I turn this into\nsomething that s a hell of a lot more horrible? Well, we got to do the constant tension version\nof this. So I get into this position and I squeeze every last bit of effort I have out\nof my elbow into extension into the top of the Cobra push-up. I'm not worried about what\nthe next repetition is going to be. I'm not trying to save myself for the next repetition.\nI'm only going to follow the same cadence up and down on every repetition until my body\ntaps out and says no more. And again, I'm not just isolating it to the\ntriceps, however, my focus is to make sure that at the top of the rep I'm squeezing as\nhard as I possibly can to my triceps. The tension is felt everywhere on every single\nrepetition. And of course, when I'm done, I get those elbows back behind my body and\nstraighten out to get that intense contraction on the triceps. Six seconds at a time again,\ntwo or three repetitions, take my normal break before attacking my next set. Which brings me to one of the most grueling\nand difficult, but one of my most favorite exercises of all where I'm just using my own\nbody weight and it's a Handstand push-up. So I position myself up against the wall and\nas you probably can imagine, this by itself is hard. But I can even take this even if\nI can only do nine or ten of these, and I still have the option of turning these into\na constant tension variation that I may only be able to do two or three repetitions on.\nBut when we're talking about trying to apply as much effort and intensity to an exercise,\nthis is how we do it, no matter how many repetitions it winds up giving you. So you want to make\nsure that you're doing this exercise with intent. I'm thinking about almost pushing my hands\noutwards on every repetition here to activate the delts even more right into abduction.\nAs soon as I do however many I can, I come out of it, I get my hands together like this\nand I pull apart. I do isometric contraction here of the delts to further drive home the\nintensity in the effort to take this exercise that yes, is already hard, but we take it\nto a whole new level. And of course, no workout is complete without\nhitting the lower body as well. And one of my favorite ways to do this is with the eccentric\nstep up or step down, we're going to hit both the glutes and hamstrings to drive it on the\nway up. And we're going to hit that quad as we eccentrically lower on the way down. The\nkey, as always though, is not just stepping up and down. Yes, that's a good exercise on\nits own, but we're really trying to push the envelope here on muscle growth we need to\nincrease the intensity to a whole other level and constant tension works its magic once\nagain. I push up at a slower cadence, really trying\nto drive tension through the entire leg from the calf all the way up to the pelvis. And\nas I come down, I'm focusing my effort through the quad, but I've got tightness in tension\nthrough the glutes and hamstrings as well. Slow cadence, not counting the reps, but making\nthe reps count. As always, I come down here, I could drive tension through the quads by\nsimply taking that flex knee and straightening them as hard as I possibly can. And so they have it guys, when I don't have\naccess to weights, what I do is I use my own body as a form of resistance. And if I want\nto make it even harder, I drive additional tension through what I do. It works and it\nworks every single time. And as I said, prepare to be humbled because your numbers and your\nrepetitions are going to come dramatically down. But I promise you, the results you see\nfrom doing what you're doing are going to go dramatically up. If you're looking for an entire body weight\nprogram, we do nothing but use our own body weight -- no bands, no bars, no bench, nothing,\nit's our zero program. You can see the results that our guys have gotten in just six weeks\nusing this plan, it's over at athleanx.com. If you want more of these videos guys, anything\nI can help you with make sure you leave your comments that thumbs up below. Let me know\nwhat I can cover and I'll do just that. And also, if you haven't done so, make sure you\nclick Subscribe, turn on your Notifications so you never miss a new video when we put\none out. All right guys, I'll see you soon. And I apologize for what you're about to feel\nahead of time. You're welcome."
}