{
    "id": "vj-iZGUrAs4",
    "title": "The 6 Best Lifts for NEW Muscle Growth (GUARANTEED!)",
    "description": "Even if you've been performing the best lifts and exercises for muscle growth, you may not be seeing all the gain you should be ...",
    "transcript": "Today I'm going to show you six seldomly performed\nexercises that are going to help you patch up those weak links in the big exercises that\nare making up the foundation of your training program. More importantly, I will help you see all\nnew gains from them. What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to show you six exercise that,\nagain, you probably aren't doing. There's one you should be doing every day. That's a hint. But they serve an important, complementary\nrole to your main, foundational exercises. If you're not doing them, I feel that you're\nleaving some gains on the table. In every one of our bigger lifts there's a\ntendency for the weak link in that lift to hold back the overall progress you'll see. However, if I told you that these exercises,\nI'll show you are going to help you address those weak links, I think you'd want to listen. That being said, I want to break down the\nfollowing exercises. A deadlift, a squat, an overhead press, and\na weighted pullup. So, let's start first with the deadlift. When it comes to the deadlift there are two\nexercises that apply here because I feel that there are two issues we have, just trying\nto get the bar off the ground. That is: do you have adequate leg drive through\nthe ground to get the bar going? And second, once you do, do you have adequate\nupper body strength and stability to keep the bar where it's supposed to be? Especially on that proper bar path tied to\nyour body on the way up. A lot of times we lack one or the other. If we were lacking in the upper body stability\nand strength, then what you'd want to do is this right here. This is the chest supported row. Not only did I put this up on Instagram a\nfew days ago, but I also shared that this is something I struggled with a great deal,\nwhen I started the lift a long time ago. I felt like I had the ability to drive through\nthe legs to generate force into the ground to get that bar going in the opposite direction. But I didn’t have the ability to keep that\nbar nice and tight because the weakness through my upper body and shoulders allowed the bar\nto drift down, forward, and away from me, making me lift a lot harder. So, what this does is demands that you learn\nhow to pull from a no-momentum state without the help of your legs. You can see I've practiced this a lot and\ntried to get myself a lot stronger on this so I could pull with no legs. So, when I got back into the position of a\ndeadlift and had the benefit of my legs, I'd be able to pull a lot more. The next thing is that some people don’t\nhave the ability to drive into the ground, or as I've pointed out before in our deadlift\ntutorial video, they don’t even know that the legs are really supposed to be driving\nthat initial part of the movement. At least to the level of the knees. It's like a standing leg press. So, you want to be able to train your body\nto know that the leg drive is important. But when that's established, how do you do\nit with an exercise? How do you get better at that? This is where I like to break out the reverse\nlunge or the dumbbell lunge, in general. What the lunge makes you do, if nothing else,\nit makes you learn how to drive hard into the ground through one foot at a time here. The fact is, I like to do mine with a step\nback, in reverse because it takes the anterior stress off my knee. So, for somebody that has knee pain or discomfort,\nparticularly from patellar tendonitis, the step backward takes off some of that strain. But it doesn’t diminish the main benefit\nthis exercise provides and it teaches you how to push hard through that forward leg,\nso you can get all the momentum of your body back up to a standing position. Again, if you had taken this into a forward\nlunge there's even more demand. When you step forward and have all your momentum,\nplus the weight going forward, and now you've got to push to drive back and get back up\nto a standing position; you will quickly learn, if you don’t know already, that you need\nto learn how to push with great force through your legs, one at a time, into the ground. So when you come back into the deadlift and\nsetup with both feet able to contribute now – again, with that tight upper back – you've\ngot a great combination to help you rip that bar off the ground and get it going in the\nright direction so you can complete the lift. Next, sticking with the leg movements here,\nwe've talked about the squat. You guys have heard me talk before about the\nvalue of the glutes when it comes to performing the squat. Again, the sticking point in a squat is most\nlikely going to be the bottom of the lift. You're not half repping it. You've got to go down low enough to not only\nsee benefits from the exercise, but more importantly, you need to be able to activate the glutes. Set them up to contribute to the lift. Put them on a stretch. The only way to put them on a stretch is to\nget deep enough. But when you're deep what's the consequence? A lot of times you can't get out of the hole. This is a great exercise to help you do that. This is a variation of the glute-ham raise\nbecause we're not completing it to the point where we're doing the hamstring curl. What we're doing is preloading the glutes\nby putting us into relative hip flexion here at the bottom of lift, weighting it if possible. You may not be able to. If you can't, you can go without. You can work your way up with dumbbells. The fact is, you can overload this exercise. But with that pre-stretched glute, the main\ndriver of getting out of that position into hip extension has got to be the glutes. You want to focus on initiating the contraction\nby squeezing your butt cheeks together. I know the low back is going to want to contribute,\njust like it would in the bottom of a squat. That could become a very faulty movement pattern\nwhen you take it into your squat. You want to teach your body that, like everything\nelse, we start from the ground up. We drive our strength and force through the\nground first and it goes up the kinetic chain. Therefore, the glutes are going to encounter\nthat force first and you want to make sure they're doing that. So, you squeeze and initiate every, single\nrepetition by the squeeze of the glutes. Let the low back contribute after. Hold in full extension and come down. If you do a few sets of these guys and start\nworking them into your routine you're going to have a stronger lower back. More importantly, you're going to be neurologically\nwired to utilize your glutes right at the moment they're needed the most. Moving onto the upper body. One of the foundational pressing exercises\nyou should be doing is an overhead press. With that being said, we know there is some\nvariety in how we can perform that exercise, depending upon how much of the lower body\nwe want to involve, and what the purpose of our training is. If you're trying to be more powerful and explosive,\nyou'd want to incorporate the lower body because we know how much that can contribute to generating\nforce, like we just said, 'from the ground up'. But we also have the alternative to try and\nstrict up our form, to try not to get the lower body to contribute. But here's the thing, our bodies are pretty\ndamn smart. As soon as you put yourself on your feet,\nthey're going to find ways to rely on ground reaction forces to accomplish what it is we're\ntrying to do. So, what we can do, if we're trying to get\nourselves even stronger in this exercise, is sit our asses down. Literally. On the ground. Like you see me here in a Z-Press. The Z-Press is one in which our legs are literally\nremoved from the equation here. They're just out in front of us not contributing\nto the force generation of the lift. Now we have to use the strength of our shoulders\nto get this barbell up. It's another one of those chest supported\nrow, no-momentum type setups where we're demanding that the muscles we believe are being compromised\nby the more quick to participate lower body, and we're making them do all the work. So, if you're finding that you're not lifting\nas much on the overhead press as you feel you probably should be, you're probably not\nas strong as you think you are, directly where you need the strength the most. And that's where this exercise comes in perfectly. So, when it comes to the upper body pulling\nexercises, a foundational movement for you – at least one of them – should be the\nweighted pullup. We've talked about the benefits of this movement\nmany, many times before. However, it's how you address your weaknesses\nin trying to get stronger in this exercise that's probably holding you back some because\nthe area you're going to want to work, more so than the areas that you can see moving,\nshould be the areas you cannot see at all. That is this foundational strength and stability\nof your shoulder blade. As I've talked about here before, the glenoid-humeral\njoint is an interesting joint. It's got a lot of mobility to be able to allow\nour arms to get into a whole lot of positions. From all the way down here, to all the way\nup over our heads. It's obviously valuable when it comes to performing\na pullup. We also know that the shoulders themselves\nhave a lot of strength capacity, i.e. on the overhead press, to allow us to do some things\nwhen we move them through space. Obviously, the lats as well. But it's the strength of the scapular stability\nthat is going to ultimately undermine your ability to do a weighted pullup if you're\nnot strong enough. Why? Because, as I've used this analogy many time\nbefore, if you try to jump as high as you possibly could, and you try to do it off this\nhard surface here, or off a lot of sand, I can tell you right now you're not jumping\nhigher off the sand than you are here. That's because the base where you're trying\nto generate force from is moving. It's giving. It's weak. Not like this firm floor. So, if you want to do something for yourself\nthat's going to help you get better at the pullup, you'd do these. These are weighted scap pulls. All you're trying to do here is a straight\npullup. In other words, your elbows are not bending. You're just allowing the weight of your body\nto pull your shoulders into upward rotation, and then you're trying to drive them down\nand back by doing nothing but pulling down with those lower traps. Really trying to squeeze and strengthen the\nstability of those scapulas from the bottom up. The movement here is very, very small. Maybe you can't handle weight. That's fine. I can tell you if you're incredibly weak in\nthis area, even a bodyweight variation of this is going to be challenging. And if you're somewhere in between there's\nnothing stopping you from going over to a lat pulldown machine and using the weight\nthat's in between the two with the same mechanics and idea in mind. You want to try to initiate that pull straight\ndown through the scapula. Learn to stabilize them because once they're\nstable, once you have that stable base, once you've gotten rid of the sand and replaced\nit with a stable base, now you want o generate force? Go for it. You're going to be able to do a lot more things\nand you'll find a lot more reps when it comes to the weighted pullup. Finally, I don’t know how I feel about this\nexercise because I feel like it shouldn’t be one of those that's a surprise to you. If you've watched this channel for any length\nof time you're going to realize \"Jeff? He kind of likes face pulls.\" As a matter of fact, they make their way into\nthis video another time for a very good reason. If you could think of one exercise that's\ncomplementary, that's an accessory movement that you'd want to include, that could benefit\nall your lifts – in fact, all the lifts we talked about here – what would it be? You know the answer. It would be the face pull. You can see me doing it here. The variation I'm showing you here is where\nI add the additional press to the top because it requires additional stability of those\nmid-scapular and lower scapular muscles to perform this the correct way. There's not an exercise you'll perform that\nwon't benefit from this movement and getting stronger in this movement. This is not meant to be done with just 5lbs. You're supposed to get stronger at this movement. The fact is, you'll be doing it frequently\nso you won't have to worry about frequent jumps in weight. Just go for an overall progression in the\nweight that you're using. Try to get stronger here. How could it help? Well, think about it. Is this going to help you in your pullups? Of course. Is this going to help you with stability on\nthe deadlift? Of course. Is this going to help you with maintaining\nthe tightness in your upper body throughout the squat? Of course. Is this going to help you perform an overhead\npress with proper mechanics? Of course. Is this going to help on the bench-press to\nmaintain tightness through your upper body on the exercise? Of course. Guys, the face pull is one of the best exercises\nyou can do. Do not forget about it and start including\nit after all your workouts like I've asked you to do before. So, there you have it, guys. There are some additional lifts that I believe\nyou should be doing, especially if you're finding yourself struggling to break through\nsome plateaus on your bigger foundational lifts. You can't keep banging your head against the\nwall, guys. There's a saying. \"If you keep doing what you're doing, you're\ngoing to keep getting what you're getting\". You want to have some strategy to allow you\nto breakthrough and I believe these exercises give you a strategy to breakthrough in a powerful\nway. They're addressing those weaknesses in the\nkinetic chain that are likely holding you back. If we can strengthen the weakest link, we're\ngoing to make you strong all the way through. If you're looking for programs that address\nthese weak links and build them into everything we do, so we can minimize how often they appear,\nand how significant they are when they do appear, head to ATHLEANX.com and get our training\nprograms. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you haven't already done so, please click\n'subscribe' and turn on your notifications so you never miss a new video when I publish\none. All right, guys. I'll be back here again in just a few days. See ya."
}