{
    "id": "vlGZfIgc6Vk",
    "title": "Muscle Soreness Explained (IS IT GOOD?)",
    "description": "Build your body with science here - http://athleanx.com/x/athlete Subscribe to this channel here - http://bit.ly/2b0coMW Muscle ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re going to talk all about workout\nsoreness and tell you what you need to know about workout soreness. Whether you should be chasing it because you\nfeel like it’s a prerequisite for growth, or whether you maybe shouldn’t be focused\nso much on it. Or whether there’s even things that are\nmore important than it. You see, when it comes to workout soreness\n– and anything here on this channel – we’re trying to put the science back in strength,\nand we try to do in that ‘no BS way’ so you understand what it is you’re going after. When we talk about training and soreness,\nreally what we’re discovering is – and there’s a lot of research that goes back\nand forth on whether or not this is true. But what we see is workout soreness is generally\ncreated by eccentric training. There’s a reason for that. Concentrically, what we’re doing is – meaning\nwe’re shortening the muscle with tension. If I were to flex my bicep as hard as I possibly\ncan here, flex, flex, flex, flex hard; it really actually hurts. There’s tension in this muscle. I’m squeezing as hard as I can, but it’s\nshortened. There’s a shortening here. If I were to have tension in the opposite\ndirection, eccentrically, when I’m lowering and stretching – I’ll show you on an incline\ncurl in a second. What I’ve done here, if I look at this band\nin place of my muscle, instead of having this where I’m actually pulling, and pushing\nas hard as I can, there’s tension on the ends of the band. I’m pushing, pushing them toward each other. It looks like it’s fine; it’s intact. However, if I put tension with elongation\nthese little rips that were already in this band are getting worse, and worse, and worse. So what happens is, you’re getting these\nmicrotears and damage in your muscle fibers when you do eccentric training. Meaning, loaded elongation of the muscle itself. That’s actually what sparks muscle growth. So, if we look at it here – as an example,\nI can take a dumbbell and curl it here, and as I’m curling up I definitely have tension\nin the bicep. That’s why it’s flexing. And it’s shortening. In concentric only training, ironically, can\nbe done without producing much soreness, if any at all. So, when I elongate I’m getting a stretch\non the muscle, and tension. So that’s doing that band effect. It’s pulling it apart. It’s creating the microtears from the damage. The people that don’t focus on eccentric\ntraining, and they just drop the dumbbells without really allowing the tension – there’s\nno tension there. So, if you do your eccentrics and you don’t\nconcentrate on slow eccentrics, you’re actually missing a lot of the tension. You’re getting elongation here, but not\na lot of tension because you let it go. So, if you’re going to look for soreness,\nor chase after soreness you’ll get it only if you slow down the eccentrics, not just\nby doing eccentrics alone. As I’ve said, other forms of eccentric training,\nlike sled pushing, or many of the Olympic lifts like cleans, or snatches; there’s\nnot a real eccentric portion of that lift. A lot of times you can do those without producing\nsoreness. We even have a phase in one of our programs\nwhere we do back to back training, concentric focus on a muscle group on a certain day,\nthen we come back eccentrically the next day, realizing that we’re not going to be very\nsore from the day before. So – what the hell is my sleeve doing up\nhere? So, the fact is, if you’re going to chase\nsoreness you’re going to get it that way. Now, is it even necessary? Here’s the interesting part. It is necessary, I believe, because you’re\nlooking to have that adaptive strength. So, if you’re not creating stress on the\nmuscle, you’re not going to create the stimulus for growth. Keep that in mind. If you’re training for strength, soreness\nisn’t necessarily what you’re after. You don’t have to become sore to get stronger. If you’re looking for hypertrophy, knowing\nwhat we know about eccentric training and overload, and what it can do to muscle to\ncreate the stimulus for growth, you want to get that effect. However, here’s where people screw it up,\nand here’s where people won’t tell you the truth. I think a lot of times this is where the studies\nfall apart. If we’re training, you’re looking at about\n30, or 40, or 60 minutes in a day, of your day. Your full, 24 hour day. You might get everything right there. You might do everything I just showed you\nto create muscle soreness and the next day you wake up, or 48 hours later you wake up\nand you’re sore. But did you grow? If you didn’t do everything else right – the\nstuff you do in the other 23 hours – like eat right, supplement if you’re going to\nsupplement, sleep adequately, sleep right. In other words, sleep for recovery. If you don’t do any of that other stuff\nyou’re not going to grow. Just because you’re sore you didn’t support\nyour efforts in the gym. I always say here, it’s like I can do the\nbest I can to try to get you to do the right things in the gym, but I can’t walk you\nthrough the other 23 hours of your day, and have you do everything right. This is where people don’t have the commitment. It’s really, really difficult to do everything\nright – and you’ve got to do a lot of things right – to do everything right for\nthe other 23 hours in the day. It’s why dieting, and eating right is really\nso hard because we can all make it to the gym, but we can’t do the other portion of\nthis for all those hours. You can certainly be sore and not grow. So that’s where I think a lot of people\ncome to the conclusion that soreness doesn’t necessarily equate to muscle growth. I think it does if you’re doing everything\nthat you need to do in order to support your hard efforts in the gym. Now as far as those people who say “I never\nget sore when I train. Never, ever, ever.” If you want me to show you how to do that\nI will give you a workout, and I promise I’ll make you sore as shit. But I’m not going to kill you or do crazy\nthings. I’m just going to show you exactly how to\ndo that. let me know and I’ll make a video on that,\na separate video, and I’ll show you exactly a routine you can do to get sore all over. But today we’re discussing whether or not\nit’s even necessary for growth. That’s my two cents. I think it’s on the right track. Let me know what you want me to cover here\non this channel and I’ll do my best to bring the ideas, and things you want me to do. If you’re looking for a program that puts\nthe science back in strength, that won’t bullshit you along the way that is ATHLEANX. That’s what we try to do better than anybody. You can head to ATHLEANX.com right now and\nget our training program. All right, guys. I’ll see you back here again soon. See you."
}