{
    "id": "vthMCtgVtFw",
    "title": "The Official Bench Press Check List (AVOID MISTAKES!)",
    "description": "Train like an athlete step by step - http://athleanx.com/x/athlete Subscribe to this channel here - http://bit.ly/2b0coMW The bench ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going to talk about the bench\npress. Classic exercise. Now, it's probably one that you've done a\nmillion times, but you've got to make sure you're doing it right all the time because\none bad rep on a bench press could lead to a lot of problems. A lot of times, in your shoulders. Sometimes in your elbow. Sometimes in your wrists. Sometimes in your chest, with a torn pec. You've got to make sure you're doing it right. So I've put together a checklist, and we're\ngoing to go through it step by step and make it really, really simple so we're making sure\nyou nail each portion of this. The first thing, when you load the bar, ideally\nyou're doing it in a cage here. Secondly, you're putting a clip on the bar\nfor safety. However, I will point out – as someone that\nhas learned this from experience if you're training at home – you may not want to use\nthe clips. Why? Because if you get stuck and there's no one\naround to spot you, your only option to really get out from under that bar is to dump it\nand if the clips are on here, you're not going to be able to do that. So again, not something I advise. I would rather you setup in a rack to do it. Now, the next thing. This is stupid simple, but look over my shoulder\nhere. What is the placement of the bar in the rack\nitself? Is it centrally located? Because a lot of times you'll come up and\nfind them kind of like that. All of a sudden it's already throwing off\nyour alignment and it's really easy – again, stupid easy to do – but make sure you do\nit because it's important. So once we get that lined up, then we look\nfor the placement of the bench in relation to the middle knurling of the bar. You can see here that we're lined up perfectly. You want to make sure that you're doing the\nsame thing. Now I come in here, and I want to know how\nfar under the bar the bench should be. You have to understand that when we lay back\ndown here my eyes are going to want to be looking straight up at the bar. Which I'm going to cover in more depth in\na second. So in order to accommodate that, I have about\nthis much room between the top of my head and my eyes. So it should be at least that much room beyond\nthe bar with the bench that can accommodate my head. So I'm not leaning my head off the back – which\nI've already done. So now you lean back. Now we sit here, and we position ourselves\nnow under the bar. So come up on top and you can see. As far as the bar in relation to my body on\nthe bench, you literally want to be staring right up at the bar and you can see that my\neyes are literally lined up with the bar in this position so that it sets up my liftoff\nposition – which I can explain more from the side here. Take note now of what we're doing from here. As far as your grip, you want to know how\nwide your grip should be, and you want to know the type of grip you should be using. When you look at the width of the grip you\nhave to come down to the bottom to understand where it should be. Now you start down here – I will cover,\nagain, the fact that the elbow position is going to be key. You don’t want to bench with your elbows\nall the way up here in this guillotine position. If you're doing the guillotine press, that's\na different thing, but you want to make sure you're using a much lighter dumbbell, and\nnot trying to load up, as I'm showing here for the classic bench press. What happens is, in this top position you're\nleaving yourself no room for the rotator cuff to really operate. Of course, if the weight gets a little heavy\nand the bar path starts to go forward a little bit you're going to get internal rotation\nthat's going to really, really destroy the rotator cuff in this position because your\nelbows are too high. Your elbows should be more about 75 degrees\naway from your body here. So if you know that, you set this position\nup like this, you get your elbows at 90 degrees bent, and you have your forearm perpendicular\nto the ground, pointing straight up toward the ceiling. Wherever that is for you – because again,\narm length is going to vary between persons – you then reach straight up to the bar\nfrom here. You can see that mine kind of ends with my\nring finger on the non-knurled part of the bar. So that's what my width would be, so that\nwhen I'm on the bottom I have a fully supported bar with my forearm pointing, and supporting\nthe bar underneath. Which brings us to the next question: the\ngrip itself. What is the right grip? There's a thumbless grip that some people\nwill use because they want to look cool when they do it. That's all set, but what happens if the bar\nslips out of your hands forward? You're in trouble. So what you want to do is, you always want\nto have your thumb wrapped around the bar, but how you approach the bar is really important\nfor getting that right. If I come down – which a lot of times people\nwill do, they'll come this way. Okay, I just said my ring finger is where\nI need to be. I come this way and I grab the bar, and then\nI go and I grab around, or I grab this way. Around my thumb. Whichever is more comfortable for you. This is stronger, but if I come this way,\nthe issue is that the bar is too high on my fingers. So now when I lift off, automatically the\nbar is going to roll backward and look what I've done to my wrists. So now I don’t have the support of my forearm\nunder the hand anymore. The bar is about 2\"-3\" behind that and it\nweakens my pushing power. It also increases the likelihood that I'm\ngoing to screw up my wrists. So what I want to do is, I want to come from\nunderneath. So if I come from underneath, now the bar\nis lower on my hand, and I can wrap around to the right position. But now you can see when I lift off I have\na fully supported bar because my forearm is now directly underneath this and I'm using\nthe support and strength of my bones to actually allow that to happen. Now, when we get ready to lift off, where\nare we lifting from? These things better allow you to have bend\nin your elbow because – look at the position I'm trying to lift from. I'm trying to lift, again, with a bar that\nis placed over my eyes. So it's a little bit behind my body here. So if I try to lift from here – essentially\nit's like a pullover – I don’t have much strength here. So if I have a fully straightened out arm\nand I have the catches of the bar too high, I have no lifting power at all to get that\noff. None. So I need to have at least a little bit here\nthat I can actually push because my elbows can still have some straightening left in\nthem to actually push off of. Same note. If I were to lower it too low, now I'm also\nputting myself lower to the sticking point where I lose some strength as well. So for me, it's roughly about this amount\nof bend in my elbows that makes it really comfortable for me. So now, as I get ready to lift, the next thing\n– I promise you, I'm actually going to lift this bar. This is what I'm talking about. All the setup that's really important here. It's as I go to lift the bar, the bar path\nis now going to be my major concern, okay? Because I want to make sure that this thing\ncomes down, not over my eyes as I talked about, but it winds up over my chest. So that means that the bar path is going to\nhave to come forward a little bit. It's going to have to come down, and forward\na little bit. Again, if I have my elbows high and I hit\nthe bar path right, that's even worse because now I'm really internally rotating the shoulders. That's how you blow an AC joint. That's I hurt this shoulder on my other side\nhere. You can see that it's always sticking up for\nthe rest of my life because I actually popped my AC joint on my left shoulder. I got down to the bottom of a rep, my bar\npath was good, but my elbows were too high. The internal rotation popped down, and the\nAC joint was popped. So you want to make sure you've got elbow\npositioning and bar path properly lined up. Again, with the bar path we're targeting the\nchest. The lift off is going to be straight up, get\nit over your shoulders, and then move it down. Technique: there's only two things you need\nto focus on, guys. That's it. Number one: foot position, believe it or not. Start down at the feet. These feet should be under your knees so they\ncan actually push. If I were to push through my feet right now\nmy butt lifts off the bench, or at least I can contract my glutes and my butt lifts off\nthe bench. You're not going to want to actually lift,\nbut you're going to want to be able to push into the ground to give me that counterforce\nto be able to push the bar away from me. So you can see, if my feet were out here too\nfar I have no pushing power there. I can't do anything from that. I need to have them underneath. The next thing is the chest itself. You can't bench with a flat chest. You've got to get your chest up. So what we do is, we pull our shoulder blades\ndown and back, which again, creates a stable base that I can actually push off of. Same thing as I always talk about. You can't fire a cannon from a canoe. You don’t want to try and jump from a canoe,\nor jump from sand. You want to jump from a hard surface. You want to be able to press from a firm surface\non the other side. So we pull that together. Then lastly, we tighten the abs. Just make sure that you have a good tightening\nof your core because you don’t want to have any of these leaks – energy leaks – throughout\nthe entire body here. Press through the feet, press through the\nback, tighten the core, lift off, up, overhead, right here, grip is good, feels nice and simple,\nand it is simple. It's 135lbs, but the idea is, I'm right here. Now I'm going to lower it down to the chest. From here, and again from here I'm going to\njust push back up, and up strong, okay? Again. And again. I mean, super simple because I'm squeezing\nthe glutes, pushing through the floor, all the things I told you to do, and then when\nwe go back to rack it – again, don’t try to rack it in one fail swoop from here, and\nup, and try to rack it. Try to come up to the top. Once you're there, let your arms go back,\nengage the rack, and land it straight back down. All right? So guys, it's not that it's the most complicated\nlift that you're going to do. Again, you've probably done it a bunch of\ntimes, but it's the fact that it's one of the most dangerous exercises to do because\nthere's so many places that you can go wrong. And having injured my shoulder already doing\nit, and seeing other guys injure themselves doing this lift and god forbid, drop the bar\non themselves; you need to know what you're doing. If you have a routine and a checklist that\nyou follow each time, it can go really quick. Mentally you're going to blow through that\nand know exactly what to do, but at least you've mastered this. All right, guys. We've put the science back in strength because\nit's important. All these angles, and all these little details;\nthey do matter. They matter to not only your performance staying\nsafe in the gym, but more importantly to the gains that you see from doing the lift. If you do it right you're going to see that\nyour performance on this lift will go right through the roof. As a matter of fact, maybe you're missing\nsome of these points. When you do what I just said you might see\nsome of your bench presses increase by a lot of weight in just a short period of time. Guys, if you're looking for a complete step-by-step\ntraining program that doesn’t overlook the little things because they all matter, head\nto ATHLEANX.com and get our ATHLEANX training program. In the meantime, if you've found this video\nhelpful – I know it's comprehensive – but it's worth it. Leave your comments and thumbs up below, and\nI'll be back again in just a few days to do the videos that you want me to cover. Tell me what else you want me to cover. If you want me to break down another lift,\nI'll do that as well. All right, guys. See ya."
}