{
    "id": "VUt8ckGybWE",
    "title": "6 Pack Diet Plan Disaster (CALORIE CUTTING!)",
    "description": "Stop starving yourself and build ripped lean muscle here http://athleanx.com/x/meal-plan-for-abs-and-muscle The biggest mistake ...",
    "transcript": "What's up, guys? Jeff Cavaliere, AthleanX.com. Today I'm going to break out the Smart Board\nto discuss a dumb mistake that a lot of people make when it comes to dieting for a 6 pack. You see, if you rely on calorie restriction\nas your main and sole method of getting to a lower body fat level, you're going to run\ninto a brick wall a lot harder and faster than the one behind me. Here's the problem: we know that in order\nto create a body fat loss you have to create a caloric deficit. We talked about that a lot of times before. There's a thermodynamic law that states that\nwe need to do that. That's a given. It doesn't mean it has to come from calorie\nrestriction because the biggest mistake people make – let's say they're arbitrarily going\nto pick a 2000 calorie daily maintenance level; that's what yours is. You want to create a 500 calorie deficit because\nyou know you need to do that in order to lose some weight and lose body fat. A lot of people will do this completely through\na 500 calorie restriction on what they eat. That's the easy way to do it and it's the\nfastest way because a lot of people will find that they'll get results doing this, but then\nall of a sudden they hit that wall and they stop seeing results. It's extremely predictable because as you're\ndoing this, think about the calories that you're also restricting from your muscles. Your muscles are going to be your best friends;\nyour metabolically most active tissue to allow you to raise this set point. Not from 2000, but maybe to 3000 in a day. If you have the metabolically active tissue,\nlike muscle, to stick and allow you to burn more calories throughout the day just because\nof the muscle you have to maintain, you're going to allow yourself a lot more dietary\nflexibility in the long term. That is how you get this thing done 365 days\na year like I preach. So you don’t want to do it that way. What you want to do is if you're at 2000,\nmaybe what you do – and a lot of people may not like to hear this – they'll restrict\ntheir calories by a little bit. Take the obvious thing out of your diet. You're probably already pretty low as it is. This is probably not what you're eating in\na day, but again arbitrary numbers. Take something obvious out of your diet that\nyou know you probably shouldn’t have from calories and then go burn 400 extra calories\nto get yourself down here. That is going to create a much more effective\nplan because you're still supplying key calories to the muscle that you're trying to build. Maybe you're not even working out and if you're\nnot doing that, that's an even bigger disaster that we can talk about in a different video. You'd better be working out at the same time\nbecause otherwise you're going to become skinny fat. You're going to get thin, but you're not going\nto look very good. It's like getting abs, but having no muscle. It's like the old saying \"Having tits on a\nbull.\" There's no purpose for it. If you want to have a much more effective\nplan, unfortunately for some, maybe uplifting for others; you're going to have to get your\nass into the gym and you're going to have to work out and start burning some calories. Our burst training workouts that we have plenty\nof here at Athlean-X are geared to do exactly that; help you to burn a lot of calories quickly. You don’t have to spend all day to burn\n400 calories. You're not going for a slow jog here through\nthe park. As a matter of fact, if you've seen one of\nour videos here we actually did a 10 minute workout – I'll link it right here – where\nwe did nothing but burpees. 10 different variations of burpees in 10 minutes. You'll feel what a high expenditure of energy\nfeels like if you've never tried it before. My point is: you've got to stop looking at\nstrictly dietary restriction of calories to get down to this number. You're going to have to get lower, but don’t\nlook to diet alone. As a matter of fact, try to see if you can\ndo it as little as possible that way so what you're doing is sparing the calories to allow\nyou to support the muscle growth that's going to allow you to ultimately raise this number\nand make your nutrition plan a hell of a lot easier to follow. Guys, if you're looking for a way to have\nyour ass kicked I'm more than happy to do it for you. You could head to AthleanX.com right now and\nget one of our training systems. I coach you through every single workout and\nI also provide you with a diet plan that will allow you to make nutrition much simpler than\nit is and allow you to actually stick to a plan 365 days a year. That is what I try to preach here at this\nchannel year in and year out and that's what I'm trying to convey to everybody that watched\nus. It's not all that hard, it's just going to\ntake a little bit of dedication and effort here and then I'll help you to do all the\nrest from there. See me over at AthleanX.com and in the meantime\nlet me know how you felt about this video. Leave your comments and thumbs up and I will\nbe back here again in just a couple days with more stuff for you. See ya!"
}