{
    "id": "vWZlMraqWOc",
    "title": "World’s Fastest Burpees (BLOOPERS INCLUDED!)",
    "description": "Develop the ultimate physique - http://athleanx.com/x/make-everything-better Subscribe to this channel here ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So I know. I've heard it. \"Physio balls. They're out of date. They're out of style. They went out with functional training a long\ntime ago. There's no real valid use for them other than\nsome distorted ab exercises.\" That's not true. If you expand your horizons on how you use\none of these things you could become a lot more explosive. You see, we use these for reactive training. I could take a physio ball, bounce it on the\nground, and incorporate an exercise in between. So today, I want to show you how to force\nyourself to become a lot more explosive on a burpee. Now the burpees are a great, total body exercise,\nbut we don’t always attack them the way we should. You might need me to be there to tell you\n\"Faster! Faster! Faster!\" but if you don’t have me, unfortunately,\nthen you can use this. So let me show you three ways that you could\nuse this ball to force yourself to go faster. Okay, first up is a horizontal chest pass. So position yourself in front of a wall. Don’t worry. If you don’t have a wall I'll show you what\nto do instead. Position yourself in front of a wall. Chest pass the ball explosively away from\nyou. As soon as you release it, get down, get into\nthe burpee, pop back up, and catch it. There's two factors here that will determine\nhow fast you would have to be; how explosive. Number one: how far away you stand from the\nwall. The closer you are, the harder it's going\nto get, as you're going to see me progress to here in this video. The second thing is how hard you actually\nthrow the ball against the wall. Play around with both, but force yourself\nto become more explosive either way with this exercise. Next one, if you don’t have the ability\nto bounce the ball off the wall that's okay. You're going to lay on your back and throw\nit up in the air. If you need more head room, go outside. Throw it up in the air, and then try to pop\nup and catch the ball. Now, if you want to make this even more difficult,\nwe're going to turn this into a burpee as well. All I have to do is throw it up, roll to my\nside, and then try to pop up from here. So I'll cover both variations. The idea though, is you've got a lot of ground\nto cover to get from the ground back up to your feet, and also have the orientation and\ncoordination to find the ball and catch it. Last, but not least, the most challenging\nof them all: now you've got to bounce it, head down into your burpee, and come back\nup and find it. Now, it's a lot harder to create the time\nneeded to get back up to do this, but more importantly, as I mentioned in the last clip,\nthe coordination to be able to come down to the ground, reorient yourself and find the\nball, is going to be tough. You might wind up hitting yourself in the\nface once or twice. I think I did a few times in this video. The idea is, it demands the explosiveness\nthat you're probably not generating, or giving yourself, or you're cheating yourself in the\nprocess. Try all three of these variations. I promise you, you'll find a lot more use\nfor this physio ball than just laying on the back of it and doing some lame-ass crunches. So there you have it, guys. Another element of athletic training. Explosiveness and reactivity. If you're not incorporating these things into\nyour program I can promise you this: you're not as good as you should be. You can get much better results if you start\ntraining your body like an athlete, and that means incorporating all elements of athleticism\ninto one workout program. If you're looking for that, it's already done\nfor you over at ATHLEANX.com. Head over there and get our ATHLEANX training\nsystem and let me train you for the next 90 days and see just how athletic you really\nare. I always say \"Unleash the athlete inside of\nyou.\" All right, guys. I'll be back here again in just a few days. Make sure you leave your comments and thumbs\nup below. Whatever else you want to see me cover on\nthis channel, you leave them down below and I'll do my best to do that. All right, guys. I'll see you later."
}