{
    "id": "w4OUtEO27UM",
    "title": "Single Greatest Leg Exercise (NO MISTAKE!)",
    "description": "Get ripped and jacked in 90 days - http://athleanx.com/x/shreds Subscribe to this channel here - http://bit.ly/2b0coMW This is both ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're talking about leg training, and\nmore importantly single leg training. Maybe even more important than that, where\npeople tend to mess up single leg training because it has a place. It needs to be in every single workout program. Especially if you're trying to train athletically. We spend a lot of time on one leg. Two movements that really become staples of\nsingle leg training are lunging, and a Bulgarian split squat. A Bulgarian split squat is a great exercise. It's one of my absolute favorites. You've seen it before. You put one leg up on the bench right here,\nyou come down, you load up with dumbbells, or a barbell here, and you come up and out\nof it. Now, people screw this up all the time. The fact is, the way down you can screw it\nup, and more importantly on the way up you can screw it up. Doing so in either place will negate the real\nbenefits of this type for training and making you turn to only squatting double leg, or\nonly deadlifting, or whatever other double leg exercise you can do. That's a major mistake. So let's fix it. Let's show you how to do it the right way. So if I come up here, the first thing we've\ntalked about is the descent. The descent has to have two things in place. Number one: it's got to have the tracking\nof the knee in proper alignment. When you go down you want to hinge here at\nthe hip. This crease right here, I want to make that\ncrease more. If I put my hand right here into my hip I\nwant to be able to make it disappear. So I can make it disappear just by going like\nthat and dropping into my hip. What that does is, it sets my knee up on the\nright track to go straight down without driving forward and way over my knee, creating stress\nin my knee cap. My patellar tendon. Especially for someone like me that already\nhas pain there. It's a nightmare. So you want to make sure you're dropping gin\nhere when you drop straight down. The next thing you'll notice is the thoracic\nspine is nice and tight, and upright. You could do that here. If I lay this over my back, drop it straight\ndown, I can check right away to make sure that I'm doing just that. I'm right here, straight down, the dial stays\nwith me. If I at all start leaning forward, the dial\nis going to start riding away from my lower back. So we don’t want it at that. We want to be able to establish it here, stay\nupright, go straight down, drop it through the hip, and drop it through the quad. Okay, now the next part is on the way up. When we come up this is where I see people\ntotally nullify the effectiveness of the exercise, even if they've got the first part right,\nbecause what they do is, they push backward instead of up. So they come down here, and then they do that. They're driving away from the foot. What you're doing here is, you're really – first\nof all, you're missing half of the real kinetic chain and the function of the entire kinetic\nchain, which is triple extension in getting your hip into extension. If I come here while I'm extending the knee,\nI'm not extending the hip. I'm still bent here at the hip. So what I want to be able to do is, extend\nthrough the hip. As a physical therapist I can tell you that\nmost disorders and dysfunction of the lower body comes from a lack of full hip extensions. A posterior chain that's weak. Weak, or loose. We need to be able to incorporate that into\nthis motion by having the knee stay here, and then keeping it there. If you focus on where this knee is right here\nand you don’t move it away from that point at all on the way up you're going to do this\nright. So you stay right here, wherever the knee\nis you stay right in place. That automatically brings the hip through. So if you focus solely on your knee you should\nbe in good shape. We go straight down, we know the knee is not\ntoo far over the toes, we know the knee is not too far back. So the knee is guiding us. Then on the way back up, if we're looking\nat the knee, the knee stays right in contact. It never translates backward, at all, away\nfrom the point that was at the bottom. Now this is no 'wussy' exercise, as I said. This should become a staple of a complete\nleg training program. I mean, you can load up the weights. Here I am grabbing a 95lb dumbbell doing this\ntoward the tail-end of my work out after I already did my double leg work. The fact is, I'm never overlooking the importance\nof doing single leg training. Beyond that, it has a benefit to those people\nthat have lower back issues that can't actually load with a barbell on their back. But if you're training legs and trying to\noverload the legs the most important thing is, if you're going to use the barbell that's\nfine, but make sure you've got the mechanics of this exercise right so you don’t discount\nthe value of them before you even incorporate it into your program. All right, guys. I hope you've found the video helpful. We've got a lot of requests about this particular\nexercise because I tend to favor a lot in our programming. This is why. If you're looking for a complete training\nprogram that trains you like and athlete, never skips leg days, trains you like an athlete,\nhelps you to get strong, at the same time always applying the principles as a physical\ntherapist to avoid injury, stay healthy, and get you guys training for a long, long time;\nthat's at ATHLEANX.com right now. In the meantime, if you've found the video\nhelpful let me know what else I can help you with and I'll do that in a future video. All right, guys. I'll see ya!"
}