{
    "id": "W6h6xRPwfbk",
    "title": "Muscle Building Body Transformation (GAINED 12 LBS!)",
    "description": "If you watch this channel regularly, you've likely watched Jesse add muscle and get leaner over the last few months. In this video ...",
    "transcript": "JESSIE: Hey, guys! My name is Jessie. Newly employed at ATHLEANX.com. Yeah, I figured since I'm going to be working\nfor a fitness company it's time for me to get in shape, get bigger, really utilize the\nprogram. I'm 5'10\", 140. That's my starting point. I'm hoping to gain some muscle, get a little\nbit bigger, some more definition, and see where I go from here. JEFF: It's funny because people say all the\ntime \"Jessie's got a – he's so lucky. He's got it so easy. He's got Jeff as his trainer there all the\ntime. Jeff can write custom programs for him. He can spot him. He can make sure…\" – I'm actually not doing anything for Jessie\nand there's a reason for that. Because I can't want his success more than\nhe wants it. If he wants to do this he's going to have\nto figure out a way to do it. He's going to have to grow up. I get it. there's a lot of pressure and he's doing this\non the big stage, and has a lot of people that are watching him try to make these changes. But at the same time I tell him \"Jessie, those\nsame people, they're supporting what you do. They're watching you change. They're rooting for you. And that should be enough of a motivation\nto keep you on track, and to make sure that you don’t let them down. Most importantly, you don’t let yourself\ndown.\" JESSIE: For the longest time I was never really\nwilling to put in the work. I kind of just wished that it was given to\nme, but I realized that it's time to throw childish things aside, it's time to throw\nthe gummy bears away so that I can grow up and start eating like an adult. Start acting like an adult. Understanding that what I want is not going\nto be given to me. I have to work for it. JEFF: There was nothing holding Jessie back\nexcept himself. For me, it's been really awesome to watch\nas that disappears, as his confidence grows, and he starts to realize just what he's capable\nof. The only thing I told him was, I said \"Jessie,\nif you're going to start then make sure you don’t stop. Make sure you see this all the way through.\" JESSIE: It's been such a positive experience\nand I appreciate that. I have to thank Jeff for lighting a fire under\nmy ass, and guiding me that way. But in all honesty, I'm not doing it for him. I'm not doing it for his followers. I'm doing it for myself. While having them behind me is unbelievable,\nand it's great to have that support, the most important thing for me is to do it for myself,\nand for my own health, and for my own happiness. I've got to say: I'm not done yet."
}