{
    "id": "WE6IldfFtc4",
    "title": "Abs Genetic Test (GET YOUR RESULTS!)",
    "description": "Do you have what it takes to get a shredded set of 8 pack abs? Well, even if your enthusiasm is there I'm going to show you how to ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. You ready to find out today what your fate\nis? Do you have the potential to have an 8-pack? I'm going to show you, today, a simple test\nyou can do to determine it. I'm either going to make your day, or ruin\nyour day. Hold on for that, though. The test. All you have to do is take your hands – now\nI get it. I don’t have a lot that I'm pulling on here. If you have a big bunch of stuff here that\nyou can't even get your fingers around, this test may not be applicable to you. I'm going to say 20% body fat and less is\nwhere we're going to target when you should start doing this test. So what you do is, you're going to grab on\nhere with your fingers like this. Grab on and hold onto whatever you can grab,\nright about the level of your belly button. Then when you stand – because you want to\nstand here – if you're crunched down like this when you're sitting it's not going to\nbe effective. You stand up, now you tighten your abs. You're pulling away your hands that way, and\nyou're tightening with your abs, and you're just pulling them that way. When you do that you should feel the muscle\npull away from the skin, and the fat, and everything else. Then with your fingers being able to be pointed\ninward you should start to strum your fingers – believe me, this is going to work – strum\nyour fingers over the muscle that's underneath there and see if you feel, underneath the\nbelly button, at the level of the belly button, down below, see if you feel a ridge. See if you feel a bump. See if you feel some sort of ridge that runs\nleft to right across your body. If you don't, then you don’t have the potential\nto have an e8-pack. If you do, then you have the potential to\nhave an 8-pack. So what does this all mean? Well, in all honestly absolutely nothing because\nthe visible abs that you have, whether you have a 4-pack, or a 6-pack, or an 8-pack;\nit's not really the number that you have there. It's the fact that you have the ability to\nsee what you have there and you have a completely developed core. Meaning, not just the abs, but you have the\nobliques to frame it out, and you can get a visibly impressive core. So here's what we're going to do: we're going\nto look at what I have here with a muscle marker, okay? So start from the top down. As I said, you have the first two abs start\nunderneath the chest and there's a line that comes down here. Now me, interestingly, I actually had – my\nappearance of this changed a little bit after my second hernia. This got a little bit less deep. It got a little more shallow here. But this comes across here, then I have the\nnext row right here. Again, this got a little wide. This is called a diastasis recti, where you\nget a little bit of a spreading here. Again, due to herniation. But that's all right. Coming in here, like this, and then the last\nrow comes in down here and you can see that it runs to the level of the belly button,\nunderneath here, and here. Now, if I were to go and apply that test to\nmyself here, and rub my fingers across this area, underneath that last pack here, I could\npull this down as much as I want, and I could rub my finger here. There's no more line coming across that area. I don’t have any more ridges. There's no more connective tissue. So what is causing this? What's causing this is that connective band\nthat runs across that's diving the one muscle – the rectus abdominus – into which area\nis here; it's just not present here. Genetically I don’t have another band here. But guess who does? Jessie, why don’t you come on the other\nside of the camera? So now, here I am, Jeff, teaching Jessie,\ntrying to get him and he comes out, rips out with this. So the kid's got one, two, three, to the lower\nbelly button, and – oh, no! What's this?! Four, all the way down here. So Jessie gets an 8-pack when he goes out\nthrough here. Now, is Jessie some genetic specimen? He's becoming one, but more importantly he\nactually has this line. You can feel it. I hate to have to do this. I'm just feeling out this a little, but I\ncan feel this ridge. I could literally pluck it like a guitar string,\nright here. That ridge is what's allowing him to have\nhis abs pop out, develop, and make a visible 8-pack when he continues to get his body fat\nlevel down. Now what is the difference? Because his oblique development isn't necessarily\ncompletely there yet, it doesn't look like this, right? He's on the way, but as far as a midsection,\nthis will look more defined as a whole than what this would look like. So an obsession on four, verses six, versus\neight is ignoring the main point, that there's so much more you can do to develop whatever\nit is that you do have, and look really, really damn good in the process. So stop obsessing about that. And if you want further uplifting motivation,\nlook at some of these other guys that didn’t necessarily have 8-packs, okay? This guy, right here, you probably recognize. I think his name is Arnold. He actually – maybe he has, arguably, a\n5-pack. He had four, and then one that kind of led\ndown underneath the belly button there, but didn't really necessarily connect. He looks pretty damn good. Franco Colombo, his buddy. Again, we're not looking, or talking about\n8-packs, or even the guy that was known for being almost aesthetically perfect, Frank\nZane. Again, you're not talking about 8-packs. But the concept is this: they all looked good\nand you can look good too, if you don’t obsess about the number. Don’t start getting discouraged because\nI did this test and I couldn't feel that last, little band there. So what? Get your body fat level down and work on what\nyou do have here. Remember I showed you about the genetic test\nfor the biceps? If you can fit two fingers in here, supposedly,\nyou're doomed to have small biceps. Guys, forget all that nonsense. Genetics exist, but they will never place\nyou in a category that says 'you have no potential to look good'. That is completely false. If you develop what you have, believe in what\nyou have, and work hard you're going to be able to look great. Like Jessie. All right, get out of here you little son\nof a bitch. I can't believe he has an 8-pack and I don’t. The fact of the matter is this, guys: if you're\nlooking for a program that lays out a nutrition plan that will setup the stage for you to\nget your body fat level down low enough so you can see whatever you have here, head to\nATHLEANX.com. Get one of our programs. Use our program selector by clicking the link\nbelow this video and we'll get you the program best suited to your goals. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover here\nin future videos and I'll do my best to do that for you in the days and weeks ahead. All right, see you."
}