{
    "id": "WhTOuiuyGEE",
    "title": "Bodyweight Traps Workout (GET BIG TRAPS!)",
    "description": "Build muscle without weights here - http://athleanx.com/xero Subscribe and get every video here - http://bit.ly/2b0coMW Some ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Your traps are, by far, one of the most important\nmuscle groups in your entire back. As a matter of fact, they take up a large\narea of space. Almost a big diamond shape here with different\nfunctions. You see, it's not all about shrugging and\nseeing how much weight you can shrug. As a matter of fact, today I'm going to show\nyou a bodyweight trap workout that's going to hit all of the major functions of the traps\nbecause you probably aren't aware of all of them if you are just concentrating on lifting\nyour shoulders up and putting them down. So let me show you the actual exercises. I'm going to break out a little bit of animation\nhere as well to help you really see what's going on with these muscles. Okay, so the first exercise here is actually\nworking from the bottom up, opposite of what you would think. Instead of lifting the shoulders ups we're\nactually trying to depress them and pull them down. You can see here, that's the function of the\nlower trap. The fibers are oriented that way; to pull\ndown. Of course, the upper traps are working here\nto eccentrically control that. So you're actually still getting upper trap\nworking. You can see that happening in my upper back,\nbut we're hitting them both here. Next, we're working on another function of\nthe traps, and that is, again, eccentrically controlling the retraction of them. See, they pull them together, but we're actually\ntrying to control that with that first portion of this exercise. See, as you come up here, as I push out, I'm\nactually trying to eccentrically control that motion. Yeah, when they work they're going to pull\nin and retract the scapula, but we've got to actually control that. The next part, again, is to depress the scapula. Work those lower traps and just by sliding\nforward here you could see I'm pulling down, actively working those lower traps to try\nto initiate that movement. See, I can do that as I slide forward on my\ntoes. Next we have our power push weight. This is actually form our ATHLEAN0 program. Now we're getting to the more classic function\nof the traps, which is that elevation of the shoulders. So as I push away I'm using all I can in my\ntraps to squeeze and push my body away. You can see here, this is that elevation function\nof the traps. Contracting to push, now, the body away. Here you go, you can see I'm actually doing\nthat. we also have upwardly rotating scapula, which\nis another function of the upper traps. You can see here, as I push away we're rotating\nthe scapula up and to the side. There's my buddy, Raymond, sporting the new\nATHLEANRX shirt. Now we jump up to the pullup bar. Again, another thing to work the lower traps. Lower traps don’t get worked. Not often enough, at least. So we're going to do that here by working\non pulling down on the scapula. You can see gravity just wants to have my\nbody fall down, but I've got to actively engage those lower traps to pull my body back up. Next we move on to this exercise. This is a tough one. This is actually getting a whole lot of function\nhere of the traps. Different functions. You're just trying to anchor your feet on\nthe ground and slide forward. All the pull – it's like a reverse lever. All the pull is happening here, with the elevation\nof the scapula, and then the retraction trying to hold this against gravity. This one is a killer. Then finally, we kind of combine everything\ntogether. I've called this one before the Angel and\nthe Devil. Basically, this is the devil. It feels so easy. It looks so easy, but look at everything going\non here. We have scapular retraction right there. We have rotation, upwardly rotating there. We have the elevation of the scapula. Again, more upper traps. We have now, again, the retraction. We have the depression of the scapula. We're hitting lower traps, upper traps; we're\nliterally hitting everything with this exercise. So there you have it, guys. Putting the science back in strength and helping\nyou to see exactly what's going on so that you can understand what's going on, so that\nwhen you find those times when you have no equipment around you, but you don’t know\nwhat to do; you think you can't get a workout in, especially for your back. It's not true. As a matter of fact, our ATHLEAN0 program\nshows you how to put together a complete workout program over six weeks with no equipment at\nall. Not even a pullup bar, like I showed you in\nthis video. That's over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below and let me know what you want me to\ncover here on this channel and I'll do my best to do that. All right, guys. I'll be back here again really soon. See ya."
}