{
    "id": "wjiZaCJ6tCA",
    "title": "Neck Exercises that KILL Your Neck (DO THESE INSTEAD!!)",
    "description": "Get bigger faster by training smarter - http://athleanx.com/x/results-come-fast Subscribe to this channel here - http://bit.ly/2b0coMW ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're talking all about the neck and\nhow to build a bigger one, safely. See there's a lot of options out there when\nit comes to training your neck, but only a few of them are actually going to help you\ntrain them safely. See if you can spot – in these exercises\n– some of the things that you might have been doing in the past, because people have\ntold you to do these. Maybe they've been telling you to do this\nneck bridging on your back like this. Maybe even lean forward and do them like this. The idea is, this series will do two things\nfor you. Number one: it will help you to build a huge-ass,\nthick neck. Number two: it's going to help you build a\nhuge-ass pile of shit for vertebrae that's left over when you're done doing those. You see, it's not all about the muscles, guys. Especially if you're watching this channel. It's about doing what you do so that you can\nhave some longevity in the process. I'm going to break out Raymond here to show\nyou exactly why, because when you look at those exercises that I've showed you, we're\nnot just talking about being able to build strength in the neck. We're talking about the position you're putting\nyourself in, in the process of trying to do that and you are doing some major damage to\nthe structural integrity of your spine. Remember this, you only get one of these in\nyour lifetime. Only one. So you'd better protect it. What we're looking at is, we get a lot of\ncompression through all of those because this is a closed-chain exercise. Normally, closed-chain exercises are fantastic. They're exactly what you want to do. Exactly how you want to train. Especially if you want to train like an athlete,\nbut when it comes to the neck you do not want to train that way because you're introducing\nall this compression here through the spine. Now look at what's going on here. All these little yellow things here exiting\nthe sides of the vertebrae are your nerve roots and they exit between the level of the\ntwo vertebrae that they're named after. So if you're talking about a C5-6, it's between\nthe levels of C5 and C6. If you're looking at a C6-7 it's between the\nlevels of C6 and C7. Now each one of these nerve roots is going\nto control the actions down a specific distribution of your arm. So you can have a C6-7, which is being controlled\nmore by the tricep strength down that arm, motor wise. You're going to also have sensory commands\nas well, but you're going to have a C5-6 that's going to come down the deltoid into the bicep. The fact is, until you get compression on\none of these nerves, until this little nerve right here is compressed by a vertebrae, or\nsomething in the area you won't feel anything. You might feel a little bit of crunching in\nthe neck, but you're not going to feel pain, or weakness down the arm. It's the moment that you get this impingement\nin connection with one of these nerve roots. Just like that you can go from 0 to 60 in\nterms of discomfort, and weakness. Now, when you do those other exercises you're\ncompressing the spine down, pushing these bones into each other. Then I have to in and either rotate side to\nside, or I do the gapping side to side that way, or I'm pushing down and moving my neck\nforward and back. The idea is that these two bones are now pressing\ntogether and they're grinding. When we get bone on bone, the response to\nyour body, or by your body, to that is to try to fortify the area a little bit. What it does, unfortunately, is it usually\nlays down more bone called \"bone spurs\", or \"osteophytes\". Those bone spurs, all they're doing is making\nit a higher likelihood that it's going to impinge, or touch upon this nerve. You're leaving more – less room for the\nnerve to occupy itself. Meaning it's going to have a higher chance\nit's going to touch something. Again, you might be building a really great\nneck by doing these exercises on the bone, but the moment that new bone formation, or\nthat compression that's going on in here through the spine by doing them allows it to touch\nthe nerve, you're going to be in a lot of pain, my friend. It may be the situation where you're doing\nthis for a long period of time and never feel anything until the day you wake up and realize\n\"Holy shit! Jeff was right. I should have been doing something else.\" What that something else should be is something\nthat people talk about all the time, or you've probably seen it as well. It's a plate series. What you do is you wrap a plate in a towel,\nput it on your head and you go through the four major directions of movement here. Which would be flexion, extension, and side\nbending. Now as you see me here doing flexion, what\nI do is I lay so my head is rested at the back of the bench, and laying backward over\nthe end of the bench. So when I go through the motion here I have\nto flex my neck, bring it forward, in order to work the muscles on the front side. Then I flip over, I put the plate on the back\nof my head, and I do the same thing. Now what I'm going to do is I'm going to bend\nmy head backward. I'm going to work the muscles on the backside\nof the neck. When I turn on the side here and drop my head\ndown, and have to come up against the resistance of the plate, I'm actually now working one\nside of the neck. Then of course, when I go to the other side\nI'm working the other side of the neck. But that's not even enough if you want to\ndo this properly. What you need to do in order to do this really\nthe right way, is add one more significant tweak. That is, if you want to work the neck, you\nhave to realize that postularly we're usually all pretty messed up. We allow ourselves to have rounded shoulders\nthroughout the day, then our head follows our shoulders. The only way that our head will compensate\nso that we can actually still see straight ahead of us, is to move up that way. So when it moves up that way what we're doing\nis, we're stretching out the muscles on the front side of our neck here, and in the same\nprocess, weakening them. So if we want to get this nice and strong\nhere, we can't just train those four major directions. We have to do it in a way that we allow these\nde-flexors of the neck to become activated and strong while we're training our neck. S you need to be able to tuck your chin back,\nand in this way. Not out here. Pull it straight back. If you have to you take your index finger,\nyou put it right at the point of your chin, you push straight back in like that. Once you're strong in here, now I go through\nmy motion. If I want to go side bend, I go side bend. When I go flexion, I go flexion here. If I'm going to go extension, I go extension\nhere. So if you took a look at the plate series\nagain you can see that now, with this modification, pull the chin in, set it, and now do my reps. I don’t care if I have to decrease the number\nof reps I can do to do them effectively with this combination of de-flexion, or if I have\nto just lighten the weight. But for anybody that tells you \"Oh, you can't\nbuild a really big neck that way. You need to be getting on the ground doing\nthat bridging series\", that's complete bullshit. Because you can take any weight plate and\ncontinue to progress it. I don’t care if you want to throw 100lbs\non there, if you can handle it. The idea of progressive overload is firmly\nin place here and that is going to help you build bigger muscles regardless of whether\nit's in your neck, the biceps, your triceps, or your legs. So the idea is, allow yourself the chance\nto strengthen your neck safely because you really only get one. If you abuse it you're going to be in big\ntrouble down the line. As I've said before, those complications that\ncan happen from having all that compression, it's not a matter of \"Oh, I'm good. I've been doing it for a long period of time.\" You don’t know what's going on in here unless\nyou've had an MRI to show, or prove what damage you've done because the day you wake up you\nliterally will experience what I talk about here. That 0 to 60. No pain, to all of a sudden \"I can't really\nmove my arm. There's so much weakness. I have a lot of pain here. What do I do? I can't even move my neck.\" You might have though you even slept on it\nwrong. Maybe not. Maybe a lot more things are going on inside\nyour neck than you ever bargained for. So let's do this the right way, guys. This channel is all about training and training\nfor the right effect, but at the same time doing it safely. If you're looking for a workout program that\ndoes the exact thing, never compromising the gains you can make, but just trying to guide\nyou down the way to do it the most safe way, for the most longevity; then head to ATHLEANX.com\nto get our ATHLEANX training program. In the meantime, if you've found this video\nhelpful, leave your comments and thumbs up below. This came as a direct suggestion that you\nguys have made many times on this channel. That's why I'm making this video for you. So continue to make those suggestions, and\nI'll continue to do the videos you want to see. All right, guys. I'll be back here again soon. See ya."
}