{
    "id": "WLx5q7M741k",
    "title": "10 Minute Home Fat Burning Workout (NO EQUIPMENT KILLER!!)",
    "description": "Burn fat and build muscle in 6 weeks with no equipment at all… http://athleanx.com/x/ripped-and-jacked-with-no-equipment So ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. If you're looking for a fat-burning workout,\nthe length of the workout is simply not a requirement to make it a good workout. As a matter of fact, as I'm going to show\nyou here today the most important thing is that you're getting your body working hard\nfrom the first second until the last. And in this case, we'll have you working hard\nfor 10 minutes only. So, the cool thing about a 10-minute workout\nis you can see the finish line before you even start. That makes it all that much more motivating\nfor you to actually get down on the floor and do this. The second thing that makes this even better\nis that you can do this right here in a little bit of open space with no equipment at all. Ignore all the stuff against the wall, guys. All you're going to be able to concentrate\non is that floor because you're going to be staring face down on it quite a few times. We have here on tap escalating difficulty\nlevels of Burpees. That's all you've got to do. Twelve (12) reps within 1 minute. If you can complete all 12 reps of the increasingly\ncomplex version of the Burpee, then congratulations, you've made it to the next round. If you can make it all the way through 10\nrounds then you've done your job and you've had a helluvan accomplishment because this\nis no easy task. Guys, as I say all the time, you can either\nwork out hard or you can work out long. We're going to choose to work out hard here,\nbut we are going to help you burn fat in the process. I guarantee it. So, with that being said, I'm going to take\nyou through my version of this. You'll be able to watch every version of the\nBurpee. I'll name it down below as terribly as I always\ndo, but the key thing is you watch how I do it. And see if you can do 12 of those each minute\non the minute escalating up to a 10 minute total if possible. Let's give it a shot. SQUAT THRUSTS SQUAT THRUST JAX BURPEES SQUAT THRUST SQUAT BURPEES CLASSIC CHEST TO GROUND BURPEES SINGLE LEG MOUNTAIN CLIMBER BURPEES SIDE KICKTHROUGH BURPEES CHOP AND HOP SINGLE LEG BURPEES ANGRY MULE BURPEES TRIPLE SKYFALLS 1 ARM GET UP BURPEES So there you have it guys. One 10 Minute Workout that you can do anywhere. There's no excuses. This is bodyweight only and you can do this\nworkout any time you're looking for that quick kick in the ass. Now, we have a daily kick in the ass for you\nif you're looking for a completely bodyweight program only. The ATHLEAN XERO Program. We say it all the time. No Bands. No Bars. No Bench. No Bull. Literally nothing, nothing, not even a Pull\nUp Bar to work your entire body and build muscle while doing it. And most of those bodyweight workouts, guys,\nthey're nothing more than glorified aerobics workouts. They're going to get you to lose some weight,\nbut you're certainly not going to build any lean muscle in the process. ATHLEAN XERO does, and you can find it at\nATHLEANX.COM. In the meantime, if you found this one helpful,\nand if you're going to try some of these Burpees if not all of them, make sure you leave me your comments and your\nthumb's up below and tell me how far you made it. Did you make it all 10 minutes? Did you die halfway? If you did, let someone else type in for you,\nhow far you made it. I'll see you guys back here again real soon."
}