{
    "id": "wobNUfZGz9M",
    "title": "Military Workout (LEGS | UPPER BODY | CONDITIONING)",
    "description": "Train like a soldier and build an armored body… http://athleanx.com/x/train-like-a-soldier Military workouts need to prepare you to ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. It's Memorial Day and we're celebrating and\ncommemorating those that have served our country, by serving you up one hard ass workout. we're\ngoing with a heavy lower body calisthenics upper body and conditioning workout all rolled\ninto one, straight from our special tactics program. This program was designed to take military\nphysical readiness exam testing to a whole new level; to fill in the gaps of what I felt\nwas missing from current physical readiness exam prep testing. I hope you guys find this\nvaluable. Again, straight form the program. You'll be able to learn more about special\ntactics over at ATHLEANX.com, but in the meantime, give this one a shot. All right, let's kick\noff week two now. Let's bring up the energy. You're going to need to make sure that you\nbring it because this workout is going to be even a little bit tougher than the last\none. We're doing it again as a lower body strength\nfocus. So heavy weights here, four sets to failure, five to six rep mx. We've got our\nupper body calisthenics, a couple new exercises – or at least one new exercise in here for\neverybody – and then we've got to start with our gut check in. Today is a classic military endurance test\n– muscle endurance test. The flexed arm hang. We've got to do it for 1:10. Again,\nI told you, the numbers I'm picking here, those are good numbers. That is the top score\nthat they're looking for in the military test here. They're looking for a 1:10 flexed arm\nhang. So I'm going to set that as a standard here.\nWe've got to make sure that is what you're pushing toward. You may not get it, but at\nleast if it's in your head you have this goal you're going to be pushing to try to get there,\nand that's what we want. If you don’t make it we'll have some things for you to do at\nthe end. Now, the flexed arm hang first, let's just\ngo through it and demonstrate it. We have a way that we do it that's a little bit different\nthan military standards, okay? Military standard says that when you do the flexed arm hang\nyou can go either overhand, or underhand. We like to go overhand here for it and you're\ngoing to get your chin up over the bar. Again, it's okay if you go underhand. That's\nfine. You come up over the top, chin up over the bar. The key difference here is that the\nmilitary allows you to continue to count this test until your arm is straight. So this is\nstill okay, and this is still okay, and this is still okay. Even that's still okay. It's\nuntil your arms go all the way straight that they disqualify you. We disqualify you when your chin goes below\nthe bar. So if you're up here and then as soon as you start to get down here, maybe\nyour chin dips, that's okay. If it comes down to here you're out. We're no longer counting\nthat. But it's good because we're going to apply that when we get into the end of our\nwork out here in our punishment phase. We're going to apply the standards to what\nwe're doing. Let's get there in a second. So we have our lower body strength. Barbell\nsquats, alternate dumbbell reverse lunges, barbell head thrust. We're not recreating\nthe wheel here, guys. We're not reinventing anything. These are classic strength training\nexercises. Barbell squats we know. We don’t have to demonstrate those. Alternating\ndumbbell reverse lunges; I've covered the value of a reverse lunge, especially as it\nrelates to people that have knee discomfort when they do regular lunges. Why? Well, we've\ntalked about it on the video before – our YouTube video – that when you step out in\na regular lunge your knee is in an open chain position. Again, it's not a bad exercise, it's just\nfor people that have knee problems, and this could become troublesome. They step out in\nan open chain position, there's a little bit of stretch eccentrically on the quad as it\nis already. Then when they land there's a lot of force that goes into that anterior\nknee that could cause some problems. But if we keep our foot in a closed chain\nposition – so we're still looking at that front leg – it's already closed chain, meaning\nit's in contact with the ground. If I step back now it stays closed chain and I can come\nup. I'm also not directing all that force forward. I'm directing the force backwards\nand away from it. Then lastly, because I get a little bit more\nhip flexion here, ¼ of the quad muscles direct us and will actually be a little bit more\non slack when we're down in a more flexed hip position as we are here in a reverse lunge.\nSo we'll get a little less strain across the kneecap. So we just do a reverse lunge. We\nstep backward and we come back out of it, okay? Each leg here, taken through to five to six\nrep failure. Then we've got our barbell hip thrust and it's kind of going back to that\nwhole position we were in where I demonstrated how to do a forward press with a bench press.\nNow we're just doing the first part of it. Again, get back into this position here and\nthe key of this exercise is just finding the right placement. There's two real big keys. The placement should\nbe right in the crease of your hip. So how do you find that? Let's say the bar is too\nfar down. Just lift your knees up. If you lift your knees up off the floor it'll roll\nit right into that crease that it needs to be in. Secondly, once it's there take your\nhands and push away. Don’t let it just sit right down into your pelvis. That could become a little bit uncomfortable.\nPush it forward into your thighs. Now when I lift up it's not resting on my bones, it's\nresting on my muscles, but I don’t really feel any pain. So when we do the hip thrust\nwe push in that way and then we just push up, drive up through our hips. Okay, I also\nlike to dig my heels in when I press, not going flat footed because I can activate my\nhamstrings more, in addition to my glutes. So there's our heavy work. Now, for our light\nwork- upper body. So, we've got assisted chin ups – and I'll show you how to do those.\nLast time I just discussed them. Now I'll show you how. If you can fail between 15 and\n20 without then don't use the assistance, but if you're somebody that does 7 reps, 8\nreps, or 9 reps usually then you're going to need some help. Take a band out – this\nis one of our ATHLEAN-Xtreme bands here. You wrap it around the bar and then put it\nthrough itself. You take this side of it, put it through here, and pull, okay? Now,\nwhen it's here you're going to pull down, step into the band, come up, and now we just\nunweighted our body here by about 40lbs. So, now that allows you to get to 15 or 20 if\nyou were already struggling to get there in the first place. With this being the light\nfocus we're not looking to really, really tax your upper body. Secondly, we've got the new exercise: archers.\nArchers is a pushup hybrid exercise. You come down here, hands will go out wide to here,\nyou're going to slide to one side until your arm is straight, and then you're going to\npush yourself back to the other side until that arm is straight. You've got to get up\nto a pushup position though. So here, so you slide straight, straight, trying to pull your\nfingers at the end. Now, it looks like a tough exercise. It's definitely not easy, but it's a bodyweight\nmovement. It is a callisthenic. It's not going to overload you too much, but if it is – if\nyou can't even do the movement – do it on your knees. So if you look at it this way,\nyou drop down, you're here, and then slide out that way. Okay? Finally, we've got, lastly,\nour rear delt iron cross. This is one of the underappreciated exercises that really targets\none of the areas that we don’t tend to target enough. Not just the rear delts, but also rhomboids,\nupper-middle back. So you're working on that entire upper posterior chain beginning here.\nI say to bend knees as needed to reach your rep goal. So if you start out with your legs\nout straight you're going to be arms out and down, push up, push down and through the floor,\nand lift your upper back off the floor, okay? You can probably see here, the posterior delt\ndoes a lot of work to try to accomplish this. If you saw my upper back at the moment it\nwould be really under tension. Now, if I need to use my knees to help a little bit, then\nI could do that. I could walk them in and press right here. You want to hold about a\n2-3 second contraction to really make sure and establish that posterior delt activation.\nWhat do we have for conditioning? Well, I told you guys we're going to slowly increase\nthis as we go. Today, an additional one mile now, up from the half a mile last week. Now we're up to a total mile at the end of\nyour workout. As far as your grinder, or your punishment for the flexed arm hang, today\nwe're not going to change much at all except for the fact that we're going to still do\nthe same exercise, we're going to still scale the amount of punishment based on how far\naway you were for the original goal. But now we're going to allow you to stay in that exaggerated,\nflexed arm position. So before where it was chin over bar that\nwas the only thing that matters, now we're going to make you do it again and maybe even\nadd some time, depending on how far away you were form that goal. But you're going to be\nallowed to do it with some semblance of a flexed arm. So as long as you've still got\nsomething going you're allowed to continue to count your time. If you can make it through\nthat then, again, good job! The point is, again, not punishment, but improvement.\nDo it at the end of your workout. One more shot. Give it your best and then turn the\npage – however you do – and move on to the next workout tomorrow, which is yet another\nburst training workout. Another special tactics. We'll talk about it tomorrow – Air Raid\ncoming up. Good job, guys! See you back here in just a few hours. Welcome to ATHLEANX special\ntactics. If you're preparing for a physical readiness\nexam, be it for the military, the fire department, or the police department then this is the\ntraining that you want to use. If you're not and you're just trying to be a bigger, faster,\nstronger version of yourself, or a general bad ass; then ATHLEANX Special Tactics is\nfor you as well. Guys, get ready for some action."
}