{
    "id": "woHSVvfb71Q",
    "title": "The BEST Dumbbell Exercises - BICEPS EDITION!",
    "description": "In today's video we look at the best dumbbell exercises for biceps. We're going to focus on several areas of training: from strength, ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to show you the best exercises\nfor your biceps. As we’ve been doing in this entire series,\nI’m going to restrict my selections of these exercises to the use of just dumbbells. That doesn’t mean that I have to sacrifice\nanything. As a matter of fact, as you’re going to\nsee in this video, I’m going to show you some superior selections. Provided I get the opportunity to provide\ncontext to my selections. As we’ve been doing all along here, we’ve\nbeen taking exercises that fit different purposes and categories. We’re going to do the same thing here as\nwell. I’m going to show you the best options if\nyou’re training for power; for strength; for hypertrophy with an eccentric overload\nas your focus or method, or a metabolic stress as your method of hypertrophy. I’m going to cover them both. I’m going to show you a corrective exercise\nyou can do. I’m even going to show you a total body\nexercise. Yes, they do exist when it comes to biceps. Finally, that miscellaneous category, we’re\ngoing to cover an exercise that hits, not just the biceps, but more importantly, the\nmuscle underneath the biceps, the brachialis. That will help you get more rips on your upper\narm. The fact is, the selections are based on science\nand the selections are based around that context. Most of all, you’re going to be armed with\nthe best exercise selections, no matter the purpose or goal you have in your training. So, let’s get started. So, we kick it all off here with strength\nand if you haven’t already done so, you’re definitely going to want to watch the chest\nedition in this series because the selection process of how we got to these strength exercises\nwas very similar. It’s based on the lack of stability when\nwe move from a fixed hand position on a barbell to separate hands controlling dumbbells. Now, how does that play into this? Guys, again, if I had options for a barbell,\nI’d go right to the barbell curl, as you see me doing here. Whether I’m using a straight bar or an easy\nbar I love this variation of a curl. I think it allows us to add the most weight\nto the bar to get the most strength benefits. But I’ve also covered, in great depth, many\ntimes on this channel, how much I like the weighted chin-up. You can see me doing those here. I know I can overload the biceps, once again,\nbecause I not only have the additional weight around my waist, but I’ve got the weight\nof my own body that I’m using to overload those biceps. But that’s not the name of the game because\nwe’re using just dumbbells here. So, I have to make my selection. But what I do here is I use that same criteria\nas I did with the bench-press, moving to the dumbbell bench-press. We know that 300lb bench-pressers don’t\nautomatically become 150lb dumbbell bench-pressers. That’s because the stability required at\nthe shoulder becomes compromised and winds up undercutting your strength performance\non the exercise. So, the dumbbell variation is not always the\nbest choice. In the similar case of the dumbbell curl,\nwhen I go to move that weight up, I have to be able to counteract that weight coming up. I have to be able to stabilize that with my\ncore because of the posterior driven force of the dumbbells coming up and back, requiring\nmy core to be engaged to do that. So what happens is, if you’re a 130lb barbell\ncurler, you may not be a 65lb dumbbell curler for that very same reason. But you can do something different. You can lift one dumbbell at a time. What we’ve done is halved the requirements\nof our core for having to stabilize that much weight coming up and backward. Only 65lbs at a time. You’ll notice you can maximize your strength\nusing a dumbbell one at a time. Again, if I have my overall choice from athleticism,\ntrying to integrate as many areas as possible, I would go with the double handed version\nof this. The simultaneous curl. But we’re looking for just strength here,\nguys. That’s what leads me in the direction of\nthe unilateral curl. But I’m not going to abandon the weighted\nchin-up. I don’t have to. I have two winners here, guys. The beauty of this exercise is that I don’t\nhave to sacrifice the weight that I use. Instead of using plates as my form of resistance,\nall I have to do is take, in this case like I do here, wrap a dog leash around a single\ndumbbell, and then wrap it around my waist. I jump up on that bar and I’m good to go. I haven’t had to sacrifice the load that\nI’ve been using if I’ve been using plates in its place. The fact is, when we’re looking for strength\noverload is the key. And these two exercises give you the best\nopportunity to do just that. Next up, we move onto power. What that should automatically trigger in\nyour head by now is if you want to develop power you not only want to be able to move\nsome weight, but you want to be able to move that weight rather quickly. You want to have a speed component, or velocity\ncomponent, to the weight that you’re lifting. When it comes to developing your biceps there’s\none exercise I still choose. It’s going to look very similar to one we\njust covered. That is the weighted plyometric chin. Again, we don’t have to weight it as heavy\nas we did before because we know that velocity is still key. We need to be able to explode through the\nconcentric portion of the rep. Not only that, as I covered in our chest edition,\nyou want to be able to find an exercise that optimally does not restrict you, in terms\nof your ability to explode through that concentric. You don’t want to be slowing down dumbbells\nin the case of a dumbbell bench-press in order to come back down to the bottom and repeat\nthe rep. You’re decelerating at the moment you want\nto accelerate. Here, if you can get your body moving through\nthe bar on a weighted chin, you’re doing exactly what you need to do. Again, you don’t have to use that much weight\nhere. As a matter of fact, guys might find this\nso challenging that they use no weight at all. But guess what? The dumbbell still comes in handy because\nall you’ve got to do is turn it on its end and use it as a stepping stool to get up to\nthe bar and do these for bodyweight only. The fact is, the plyo-chin-up is one of the\nmost explosive and best ways to train for power when you’re trying to focus on your\nbiceps. Moving onto hypertrophy, we know there’s\nmore than one way to skin a cat. Progressive overload is an option, but we\nalso understand – if we have any training experience – that we wind up drying up on\nthat route because we know we can’t continually add weight to the exercise. Even the great ones that we’ve selected\nbefore. The fact is, we need more options. That comes in the form of the eccentric overload. Eccentric muscle damage. It’s a great stimulator for protein synthesis. But what we do is select the right exercise. Here, dumbbells come in handy. We do the dumbbell incline curl. But we’re not just doing the dumbbell incline\ncurl because you’ve probably done a lot of them in your lifetime. The fact is, we’re really trying to accentuate\nthe stretch on the biceps. The eccentric overload of the biceps. To achieve what we’re trying to achieve\nhere. We can do that in a better way by actively\ncontracting the muscle on the opposite side of the elbow and the biceps. That is the triceps. You can see me doing that in the bottom of\nevery rep. It accentuates the strength of contraction\nthat I’m going to get from the biceps to rebound from that bottomed out position. That’s great, but we also know something\nelse here. When I reach concentric failure I’m not\ndone because we know our muscles are setup in such a way that eccentrically we are stronger\nthan we are concentrically. So, even when we reach concentric failure\nwe’ve got some more to go. If you’re really trying to build muscle,\nif you’re trying to create hypertrophy, one of the best ways to do that is not just\nto take your exercises to failure, but through failure. I can do that with this drop set. I sit up, I’m mechanically changing the\nposition of my body to an upright position, I curl it, to cheat it up is going to be easier\nfrom this position. Then what I do is sink my body back to the\nbench, slowly lower back down again to accentuate that stretch, once again. That eccentric contraction of the biceps. This is a great combination, guys. It employs a couple additional techniques\nto the exercise you’ve probably already done, and it will amplify the results you\nsee from this dramatically. Let’s continue that theme we just built\non here because we’re now focused on a metabolic stress. Reveling in the burn, is what I say. When we get to the burn, that’s when the\nexercise starts. We can do that here. We can utilize something called a mechanical\ndrop set to keep that burn going long after we thought we’d have to quit. You’ve probably seen this before as it’s\nappeared in our Sore in Six Bicep workout. It’s so damn effective. You will not perform this and not burn like\nhell by the time you’re done. I promise you that. So, what we do is start in the inclined position\nhere. We do our curls to failure. Then what we do is sit up. We don’t have to drop the weight or change\nthe weight. We simply sit up. By changing our position of the dumbbells\nrelative to gravity, we’ve changed the strength curve a bit. Now we can complete a few more repetitions. What we do is take it to failure once again. With biceps, trust me, you’ll be burning\nlike hell at this point. Again, this is where you test yourself. How far can I go with the burn? Now I can lean forward and perform a drag\ncurl. The moment arm of the dumbbells is no longer\nso long away from my shoulder. Now I can get my elbows way back and keep\nthose dumbbells in close, which is going to make the exercise easier. Now, it’s not going to be easy because it’s\nstill in line here, and that burn has already been set in a long time ago, but it’s still\ngoing to allow you to crank out a few more reps, with the goal being to get every, single\nrep you can with that burn firmly in place. This is such a great option for doing that. Now it gets a little bit fun here because\nwe’re now going to cover a total body option for your biceps. Yeah, we’re going to use dumbbells and I\npromise, it’s going to be more than just the single joint focused bicep exercises that\nyou’re probably used to. Here we do a dumbbell underhand dead row. The exercise starts from the floor, it’s\nground based, it’s covering multiple joints, it’s demanding a synchronization of those\njoints from the ankles, to the knees, to the hips, even to the elbows, and the shoulders. You can see as we wrap around here it’s\nobviously working the back as we go into the row portion of it, and as we come back around\nthere’s no doubt the biceps are doing the heavy workload here. Especially because of the supinated grip. Sometimes you’re short on time. Sometimes you’re just doing a pull workout. Sometimes you’re looking for one of those\nbig ‘bang-for-your-buck’ exercises. This is the one you want to select. I promise you; your biceps are not going to\nsacrifice here. They're still going to benefit because this\nis a great exercise selection. Moving on now, we go to one of my favorite\nareas of these videos, and that is the corrective exercise selection because you can’t ignore\nthe correctives. Just because they seem to be the more rehab-based\nexercises, it doesn’t make them less important. As a pre-habilitative exercise selection they’re\ngoing to be super beneficial for you. The fact is, when it comes to the elbow and\nthe biceps, what are you really trying to focus on? While we have the option to target the shoulder\nbecause of its attachment up here, what I find more beneficial to those that are training\ntheir biceps is to target the strength of the forearms and the proper integration of\nthe muscles in the forearms when you’re doing your gripping and bicep exercises. Why is that? I’ve covered it before in great detail how\nthe medial elbow starts to take the brunt of the load when you improperly load or grab\na dumbbell or barbell in your hand because you grab it too far down. What winds up happening is it puts a whole\nhell of a lot of stress on the medial elbow and makes it almost impossible for you to\ndo bicep exercises. You might not even be able to do any pulling\nexercises at all. That can’t be. So, what we do here is – I have two choices. If you can’t handle a heavy load, then what\nI would have you do is this wrist curl variation. This is the medial elbow wrist curl because\nthat’s what we’re trying to focus on. All you have to do is do a normal forearm\nwrist curl, but you have to grab the dumbbell deep in your hand. Not distally in your fingers because the main\nroot of that problem that’s causing all this overload here at the medial elbow is\nthis overload of these distal finger tendons. When the dumbbell is held too far out in the\nfingers it creates a hell of a lot of stress on a tendon that’s way too weak to handle\nthat. So, what you want to do is slide that dumbbell\nback into the palm of your hand, grip there, and then perform those repetitions. But then we can do something even better. We can take the load and make it substantially\nheavier, which will probably have a better carryover when you go back to your strength\nexercises. That is to do this variation of a carry. Again, what you’re trying to do is, not\njust walk around the gym with the heaviest dumbbells you possibly can hold until they\ndrop out of your hands. Instead, you want to grip that dumbbell deep\nin your hand. You want to work on that forearm strength\nin the proper position without letting it start to fall. As you see here, when I get around the gym,\nif I’m fatiguing and I have to put the dumbbells down, so be it. Remember, this is a corrective exercise. What I don’t want to happen is this: I don’t\nwant to be walking and have the dumbbell start drifting down into those distal fingers because\nthat’s just going to create that stress and load on the inner elbow that you’re\nnot going to like. But either one of these things, depending\nupon which one you can load heavier, will be great options and things you definitely\nwant to integrate and not overlook because, overall, they’re going to help you with\nthe longevity of your bicep training. Finally, we saved this miscellaneous category\nto address an exercise that doesn’t necessarily fit into any of the others. In this case we’re going to target a different\nmuscle. But it’s no less important. That is the brachialis. Because it’s situated beneath the bicep\nand contributing to the overall upper arm size, but more importantly, the width of the\narm; we know there’s something we can do especially with dumbbells to target this are\nbetter. That is the crossbody hammer curl done with\na pronate forearm. Why? Because we know one of the functions of the\nbicep is to supinate the forearm. We know that we can take some of that away\nby pronating the forearm. If we pronate the forearm and let it ride\nup our body we’re going to get more of the activation of the brachialis, or the brachial\nradialis that runs down here in the forearm. But if we want to shift it a little higher\ninto that brachialis, research has shown that there’s a rate dependency on how fast you\nmove through the concentric portion of the lift. When we go slower, the brachialis has more\nactivation. It’s more likely to contribute to the concentric\nportion of that lift. Of course, you still want to load this as\nheavy as you can to try and get more of that size and development. But don’t allow the load to start allowing\nyou to swing the weight up because you’re going to defeat the purpose of what we’re\ntrying to do here. So, there you have it, guys. My best exercise selections for your biceps,\nregardless of whatever goal it is you’re training for. The fact is, you don’t have to make sacrifices\nin the results that you want to see from your training just because you might have to make\nsome sacrifices in the equipment that you have at your disposal. Guys, I will take you step by step through\nany workout and help you get the most out of it. We call it ‘putting the science back in\nstrength’. I do that in all my programs. They’re all available for you over at ATHLEANX.com. In the meantime, if you liked this video leave\nyour comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you. And if you haven’t already done so, make\nsure you click ‘subscribe’ and turn on your notifications, so you never miss any\nof the videos that we put out. Not only in this series, but all the videos\nwe put up on this channel for you guys. Again, I say it all the time, I make these\nvideos for you and I really appreciate you guys watching. All right, guys. I’ll be back here again soon, in just a\ncouple of days."
}