{
    "id": "wxyH1-B4Y7s",
    "title": "How to Get Bigger Biceps (TALLER &amp; WIDER!)",
    "description": "If you want to get bigger biceps but feel you have tried every biceps exercise without seeing the results you have been aiming for, ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I want to show you guys how to build\nbigger biceps because that's one of the areas I think I've got down pretty good. The fact is, it's because I did try to learn\nhow to train my biceps at a younger age. Yes, I admit it. I wanted to get bigger arms when I was a kid. Like everybody else did. But I learned some of the things I had to\ndo. More importantly, some of the things I was\ndoing wrong. When it comes to bicep training – really,\nwhen it comes to any muscle – when we're talking about trying to build the muscle bigger\nyou really have to look for ways to make the exercises you're doing more inefficient. Meaning, you need to make the muscle you're\ntrying to get bigger, do the work. Now, if we're talking about strength, it's\nthe direct opposite. We want to allow muscles that assist in the\naction – let's say, pulling – to assist so we can lift more weight. However, when it comes to bicep training,\ngoing for size, you need to make sure the bicep is doing the work and not the forearm. Because of its proximity – literally, just\na little more distal down the arm from the bicep – the forearm is also going to want\nto flex. It's going to want to pull. It's going to want to take whatever weight\nyou're holding in your hand and bring it closer. Therefore, taking away some of the activity\nof the bicep. That is going to prevent you from building\nbigger biceps, or at least as big as they could be. I've talked about this before. I called it the Master Tip. As a matter of fact, I made a whole video\non it, if you haven't seen that. I even talked about this particular tip way\nback when, in the early days of YouTube. You can see that video here, just give me\nsome slack because I could barely talk to the camera. But the fact is, we need to make sure we get\nthis out of it. So how do we do that? Well, I talked about making sure that your\nwrists are sort of bent back. There are a couple of ways to make sure you\ndo it and do it right. So, you don’t put undue stress on either\nyour wrist or your elbow. But you can try something that would show\nyou how to do this visually that's going to get this right every time. You take a single dumbbell; you're going to\nput your hands underneath it like this. The goal is, you want to make sure you're\nviewing the top of this dumbbell at all times. Meaning, it's going to be parallel to the\nceiling above you, and the bottom of it to the floor below you the entire time you curl. So, what we do is grab underneath like this\nand we're going to hold it up like that. You can see that makes the biceps pop out\npretty damn good because I've taken the forearm contribution and minimized it. All the elbow flexion is coming straight from\nthe biceps' activity. So here I am, at this point. Now I lower it down, I just keep it flat,\nall the way. Which means I'm going to address my wrist\nas I go. I come up, keeping that totally parallel. That means the wrists are going to bend back\nautomatically at the top. And down. And up. Just like that. Hold and squeeze. You will feel what I'm talking about when\nit comes to instituting this dead wrist. The Master Tip. So now, you feel that. How do you implement it? Once you get an idea for what it feels like\n– I don’t care if you're doing a curl right here with an easy curl bar. You grab it and then you set the wrist back\na bit. But you don’t get it down here in your fingers. Never do you want to execute any bicep exercises\ndown here, in your fingers. When you do, I've talked about it before,\nall that weight, distally in these fingers, places too much of an overload on the tendons\nthat meet right here at the medial elbow. That causes a lot of undue stress and strain\nthat can lead to golfer's elbow. Medial epicondylitis. Not fun. You grip it deep in your hands, but when you\ndo, you just bend them back. Now, as I lift and curl this up, I'm going\nto curl up and at the top it's there. But it's deep in the hands. It's not stressing my wrist. As a matter of fact, it's sitting over my\nwrist joint at the top. That bar is almost right through the wrist\njoint. Supported. And down. So, it looks like that. Down, up, keep those wrists out of it. Keep those forearms out of it. We can come over here – you guys know how\nmuch of a fan I am of chin-ups for building bigger biceps. You're going to do it, and you're going to\ndo it better if you implement the same idea when you're up here. You don’t just go this way. The tendency is, again, the body knows 'pull'. Especially if you're doing weighted chin-ups. You're going to want to really pull so everything\nis going to participate. You're going to be pulling like that and wrist\ncurling yourself up the bar in an attempt to try and get up there. Again, what you do is just try to initiate\nby getting those wrists bent backward. Deep into the hand. Not here. Deep in, wrap, and back. Deep in, wrap, and back. From here, come down, lift, keep the tension\non, I don't come up all the way over the bar and close down that angle too much. I keep it here, come down, up, and down. Up, and down. Finally, if I were to come over here, we talked\nabout other exercise options that create an addition of, not just supination and not just\nelbow flexion, but shoulder flexion. We know a complete bicep contraction happens\nwith elbow flexion, supination, and shoulder flexion. We've got that high cable curl up here. We do the same thing. When I'm here, in this position, the tendency\nif I go too heavy is to do this and then curl. And you'll find yourself doing that. You're going to curl. Like that. Curl. That is exactly, again, you can see the forearm\nmuscles here doing a lot of that work there, on the inside, to try and do that. As opposed to just letting that stay dead\nand letting the biceps do the work. So, for a high curl you get in this position\nhere, wrists back, and let all the work be done with the biceps in this position here. You'll really feel the difference when you\nimplement that. So, it's understanding the difference between\ntraining for strength on a movement, and training for hypertrophy. When you do, and you're trying to get your\nbiceps to be bigger, this is going to work every, single time. The reason why it works is because you're\ngetting rid of those compensations and substitutions, and you're making the biceps do the work. You're making the movement more inefficient\nfor the end goal being hypertrophy. Guys, I hope you've found the video helpful. Make sure you apply this. Again, if you haven't tried it yet, just start\nwith that dumbbell. Do that curl first to feel what I'm talking\nabout, and then you'll be able to institute the same thing, recreate that feeling on whatever\nbicep exercise you do. If you're looking for programs that build\nin next level training tips, techniques that take advantage of muscle science; we have\nthem over at ATHLEANX.com. Choose that program that's best suited to\nyour goals right now, and I promise it will get you to where you want to be. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I'll do my best to do that for you. If you haven't already done so, make sure\nyou click 'subscribe' and turn on your notifications, so you never miss a video when we put one\nout. All right, guys. See you again soon."
}