{
    "id": "x4CqMbWn2pM",
    "title": "You Can’t Be Lean, Strong AND Natural!",
    "description": "Have you ever been told that it is impossible to be lean, strong and natural at the same time? In other words, you can be two of ...",
    "transcript": "So, you can't be lean, strong and natural.\nI disagree with that.\n  Well we're going to find out today, \nactually. We're going to talk about this   in the form of Ax Jeff question.\nThis is coming from TimothyDubnick44.   Jeff, I watched a video on good, fast or cheap \nwhen it comes to nutrition. It was super helpful.   Would you say the same thing applies in the \ncase of lean, strong and natural? You can   only be two, but you can't be all three.\nWell, first of all, to go back to what he   was talking about with nutrition, there was a \nvideo I made talking about good, fast and cheap,   and you can only have two of the three. In \nother words, if you want to have good food,   then you can only get one of the other two \noptions. You could either make it fast by,   let's say what I do, ordering out at the catering \ndepartment in large quantities, but it's not   going to be cheap. Or it could be cheap and good, \nbut it's not going to be fast because you're going   have to prepare all that food for yourself. So, \nyou only get two of those choices ever. But is it   the same scenario when we're talking about being \nlean, strong, and natural? It's not the same   scenario here, guys, because I believe all three \nof these can be achieved at the same time. \n  Just like I said.\nJust like you said. You're always right,   Jesse. You re always right. \nAw, man.\n  But if you add a fourth element into this, \nthen I believe it's not achievable. \n  Okay, what s that. \nAnd that will be fast.\n  Okay.\nIf you want all three of those things and you   want them fast, then no, it's not in the cards. \nHowever, if you're willing to allow the time,   Jesse, as you have--\nYup.\n  --then of course you can have all three. But let's \ntalk about you as a perfect example here. \n  Okay.\nAll right. You certainly   have built your strength up. \nYeah, for sure. \n  You've gotten yourself to a what, 515.\n515 deadlift.\n  515-pound deadlift, good to go. \nThank you. \n  Now you've got yourself here also \nlooking pretty damn lean. \n  Yeah. \nNow I'm going to question the lighting there,   it looks a little bit a little favorable.\nI think my abs look good in any lighting.\n  It looks like you're on the set of Tron, for \ncrying out loud. I don't know what that's about.   But meanwhile, you haven't had to sacrifice your \nleanness to any appreciable degree in the pursuit   of that strength? \nNo.\n  Right. And certainly natural. \nRight.\n  I don't think anybody's going to \nargue that Jesse's not natural.   Although there are some people out there--\nYeah, if you can believe that. \n  --that claim--that it must make you feel good. So \nnow here we are we've got all three, even in the   example of Jesse himself. \nYup.\n  However, I do think that you're going to have \nto sacrifice time in order to do that.\n  Well, think about how long \nit took me to get there.\n  Right. So, Jesse, we've showcased here, it's been \nlike a five-year journey, although there's been   starts and stops. \nYes.\n  Jesse losing interest or picking up interest, \nbut he's been on a pretty consistent flow here   now for probably what, the last year or so.\nYeah, that's a year, year and a half maybe.\n  So, if you're willing to put in that time, \nthen I think these are all achievable. However,   we do know that if you wanted to, let's \nsay, pursue strength and maximum strength,   there's a lot of research out there that gaining \nmore body fat is going to allow you to start to   experience more of those strength levels. \nOkay.\n  Interestingly and ironically through \nincreased lean body mass that comes with   those increases in body fat levels. But \nif we look back at your scenario, again,   I have to question maybe the desire to pursue that \nroad at the expense of leanness in this case. \n  Right. \nBecause you're looking at--what?   What do you weigh in at 155?\nAbout 155, yeah.\n  So, this is about a 3.3 times body weight \ndeadlift. 3.3 times body weight deadlift   in any shape or form, that is a strong \nperson. That is a very strong deadlift.   And though Jesse could potentially max out even \nfurther, it's an indication like that if he   was willing to let go of his eight pack.\nYeah, I started to put on some body fat.\n  Right. Could he do more? I'm sure he could. \nBut to what end? Is that important to, you?\n  What, top end strength? No.\nWell, how strong do you want to be? I mean, what   if it's possible to be four times body weight?\nI mean, that'd be nice, but that's not my goal.\n  So, what is important to you at this \npoint? Why is lean, and this a very   individual question I'm asking you guys the \nsame thing, why is leanness matter to you?\n  I like looking good and I like feeling \ngood because at my body fat level,   I still feel really, really good.\nAll right. And your body fat level   is currently at, what, like 10%?\nI'd say about ten, 10 to 11%. Yeah.\n  So, I am going to qualify this because I think \nthat it's very important. Whenever you talk about   body fat levels, it is very subjective, right? \nWhat you see, my eyes see what I see. For example,   when I look at this picture of Arnold at 6 2 , \nyou know, my eye likes what I see. In other words,   that was the physique that when I was a kid I \nwanted to sort of build towards knowing that I   never was going to really get there, but at least \nI liked the esthetics of it. I can compare that to   a 6 2 Jim Carrey here, and it just doesn't do the \nsame thing for me. I don't want to look like that,   though I recognize that some people out there \nmight be perfectly fine with that and not put   in the extra work it would take to get to the \nlevel of Arnold. Or you can say that, look,   Arnold obviously was clearly not natural. So, I \ncould take a different example, just a stock photo   of somebody who is obviously on a leaner side \nand say, that is something more preferential to   me than, say, somebody who still works out but \nis carrying a higher level of body fat. Again,   your preferences might be different than \nmine. However, I believe that when you're   looking to sort of round out the package, if \nyou could appreciate high levels of strength,   not necessarily maximum levels of strength and \nstill have a certain esthetic that you desire.   Is that not a better scenario?\nOh, I definitely think it is. \n  Without having to go through sort of the ups and \ndowns of bulking and cutting. And I've mentioned   before potentially getting stuck in one of those \nbulks because some of the habits that are learned   in the bulking process are sometimes harder to \nbreak for some versus others. So now some will say   that I just favor this because of Athlean and I'm \nalways about being athletic and lean and ripped   and, you know, the athlete side of training. Guys \nit s a different scenario when we're talking about   athletics and athletes. And it's all over the \nmap, quite frankly, because it depends on even the   athlete you're trying to define. Certain athletes \nare required or even naturally selected by their   sport to be at a certain level of body fat.\nSumo wrestlers.\n  There's a perfect example. Sumo wrestlers, \nif you're going to be 5% body fat, you're   probably not going to do too well in that sport. \nOn the contrary, if you're a distance runner or a   marathon runner, you likely are going to see \nguys that are a lot leaner, even sprinters,   a lot leaner in their body fat levels than guys \nwho are going to carry a lot more body fat. So,   what happens is the level of body fat you carry \nas an athlete should always be determined by   whether or not it becomes detrimental to your \nperformance. So, if your sport requires more   strength and we know that higher body fat levels \ntend to help people to reach their maximum levels   of strength. Then by all means, you would \nwant to increase your levels of body fat,   but only to the degree that they don't become an \nimpediment to your ability to perform right. \n  Right. \nIf at some point they impaired your ability to   perform then they're no longer serving you, even \nif they're increasing one element of your overall   performance, which is strength.\nRight, because that can   hinder your athleticism.\nRight and we have so many examples of people   that sort of do things that all different levels \nof body fat. You take D.K. Metcalf excelling at   an incredibly lean body fat level. Or you've got \nguys that are heavier that are just as effective.   The same thing can be said about baseball. I \nsaw all kinds of body fat levels. Jose Reyes,   who is with me for three seasons with the New York \nMets and stayed healthy for all three seasons,   did so at a high single digit body fat percentage \nevery single year, very steady. And he performed   at a highest level that he possibly could.\nWhat about a guy like Bartolo Colon?\n  Well, there's your exception. You know, you've \ngot a guy like Bartolo Colon who was dominating   at his position, or even at David Wells is \na heavy guy who is dominating his position,   and they certainly weren't the prototypical \nlean athlete. So, you can't really define when   you're around athletes and you're training them \nlike I do, you don't really find a prototypical   body fat for an athlete or one that's required. \nYou just know that based on the position they   play or the sport that they play, there tends \nto be a certain guideline for where they   should be in to perform at that level without \nsacrificing some of the other elements. \n  Right.\nRight. Now, when we come back,   though, to your scenario here where you're \ntalking about the ability of strength that   you've been able to achieve. My biggest argument \nis before you start jumping to the fast route,   thinking that increasing your body fat levels \nis what's important here in order to experience   these better strength gains. And I'm not even \ntalking about max strength gains, but improve   strength gains, stick with where you're at \nright now and actually put in the work.\n  Yeah. \nBecause you never had   to sacrifice your abs in this process.\nNo, I never-I never increased my body fat   percentage from where it is consistently \nbeen for the last couple of years.\n  Right. So, you've been able to sort of continue \nto increase your deadlift strength substantially,   again, to a point where it's 3.3 times \nyour body weight. And again, admittedly,   maybe not even close to your top end strength. \nYou might be the biggest genetic freak going,   Jesse. Imagine that.\nCan you imagine?\n  Can you imagine that? But I'm saying like \nyou might be at elite level strength levels   but keeping yourself lean is holding you back \nfrom that. But you have to ask yourself that   question again, to what end? Isn't it worth the \nother part of it? For you it happens to be.\n  Yeah.\nCan you possibly be lean,   strong and natural? My answer is very clearly \nyes, you can. As long as you're willing to take   that time factor out of the equation, maximize \nyour capabilities and your capacity within the   comfortable level of body fat that you are. And \nthen sort of forgo potentially some of the maximum   levels of output in terms of strength because \nyou're more pleased with the total picture. \n  Right.\nAnd again, never sacrificing your natural status   in the first place, because that's something I \nthink that we always preach here is incredibly   important. And speaking of important, guys, if \nyou're looking for a video that's going to help   you to get lean, if that is what you desire, the \nno BS Way to get Lean is one of the most helpful   videos that you will find here on YouTube to do \nexactly that. Guys if you're looking for a step   by step plan, you can head to Athleanx.com and \nalso click Subscribe, turn on your Notifications   so you never miss a new video when we put \none out. All right, guys, see you soon."
}