{
    "id": "xaTEUAUUpjw",
    "title": "Get a “MONSTER” Bench Press (3 MOVES!)",
    "description": "If your goal is to increase your bench press then don't overlook the details specifically accessory lifts. In this video I'm going to ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Part two in our series on building up the\nbig lifts by using accessory lifts. Stuff that people ignore and overlook. Here with me, K.C. Mitchell, the one-legged monster. Hanging out here in the X-Box to go over these\nbig lifts, but more importantly, this is what you do. K.C.: That’s right. Yep. JEFF: And spend a lot of time doing it. K.C.: A lot more time on these than actual\nbig lifts. JEFF: That’s the thing, guys. Again, it’s either limitation on time, or\nbeing afraid that doing these lifts, in some way, takes away from the energy they could\ndevote to the big lifts? K.C.: Yeah. If that’s the case, then do the big lifts\nfirst. Then transfer over to the accessory and workout\nwhat you can do. JEFF: But ultimately, the thing is, if you’re\ntrying to build your big lifts, you’re trying to build your bench-press; if you’re going\nto take a little bit away from that so you will get a bigger lift there, then that’s\nthe goal, right? I think guys sometimes get a little off track\nin their training and they think – they become infatuated with either numbers- K.C.: Yep. JEFF: Or even strength that’s not even there. K.C.: Yeah, the one thing I’ve noticed people\ndo is “Okay, I want to build a big bench. So, I’m going to go down and bench, bench,\nbench, bench, bench. This is all I’m going to do.” That’s what you see. You see them just benching. Then they get to a point where they can’t\nget over 225lbs and they don’t understand why. There are a lot of muscles that need to get\nstronger, but the bench doesn’t actually – it turns them into secondaries instead\nof full on, actual, primary muscle. Bring yourself over to the accessory side. Let’s hit the secondary muscles that are\ngoing to transfer over into your bench-press, and your lift is going to get a lot bigger. JEFF: With that being said, the first one\nyou’re going to do here – that you do all the time – is a decline from vertical. K.C.: Yes. JEFF: Overhead shoulder press. K.C.: Yeah. I like that. The overhead press, slightly angled as you\ncan see. Strictly because it’s going to take a lot\nof pressure off the shoulders. The anatomy is not made to be bowed back like\nthis. I like hitting the front delts. To help the longevity of my training and competing,\nI need to take a lot of strain off my shoulders as much as I can. So, for me, putting a bit more of an incline,\nI take a little bit of that strain off the shoulders. And I’m able to push heavy amounts of weight\njust because of that little bit of an incline. JEFF: I can see here you’re just knocking\nout 100s. But meanwhile, I’ve seen you do a lot more\nthan that. K.C.: Yeah, I’ve done 130lb presses for\nreps before. JEFF: Right. So, for me, my standpoint, I think what K.C.\nsaid here is 100% right. When you talk about the scapular plane being\nangled a bit forward, it’s only natural for your arm to get a little forward by having\nthat slight decline from vertical. Your shoulders are going to come in, and your\nelbows are going to come in a bit more in front of your body. So, you’re pressing from that position. At the same time, you want to hit those delts\n– why? Why do you want to hit the delts to prepare\nyourself for that bench-press? K.C.: Well, my front delts come into play\non the bench-press. Bigger shoulders bring a bigger bench-press. JEFF: Especially out of that bottom portion. K.C.: Out of the bottom portion, especially. A lot of people, the thing they say about\nme is “How are you so explosive out of the hole?” That’s the chest up to about midway. It’s due to things like this. This lift, right here. There are times where, even with this lift,\nI’ll add small pause reps. JEFF: Right. K.C.: And things like that to incorporate\nmore of an explosive, off the chest, up to midway on the bench-press. JEFF: So, talking about pause reps actually\nleads in perfectly to that next exercise that we do here. K.C.: Yes. JEFF: The floor press. K.C.: Yes. Okay. JEFF: That’s it. Easy. Control. All the way down. Nice. So, guys, obviously he makes this shit look\neasy. The floor press is an incredible accessory\nlift. Almost for the exact opposite reasons of what\nwe’re talking about for the shoulder press. K.C.: Yeah. JEFF: So, the shoulder press is helping you\nget out of the hole at the bottom of the lift. You’ve got the shoulders primarily working\nthere, but when you get to the top, the points- K.C.: Yeah. JEFF: Tricep. K.C.: Yeah, the tricep. I would say, honestly, probably 70% to 80%\nof our bench-presses are failed at the top, where the triceps come into full engagement. JEFF: But you like to use the pause reps everywhere,\nor at least pausing at the bottom because – why? Because you want that explosion? K.C.: I want that explosion. I want explosion on – it’s adding strength. Anytime you can pause and hold weight for\na certain period of time you’re building strength. Why make things easy? I want to train to get stronger. So, if I can make a lift even a little bit\nharder it’s going to have its benefits. That benefit is strength. JEFF: I think too, the thing that happens\nis, guys overlook the fact that techniques actually become part of the accessory. K.C.: Yeah. JEFF: Using pause reps, and using deceleration\non that last rep there, really controlling the last one, even in a fatigued state – not\nnecessarily coming out of the box and doing the low rep, but doing it after doing four,\nor five explosive reps, and then do it. K.C.: Yeah. I don’t see a lot of people doing it. I feel like that’s something different that\nI add in. At the very end when I’m fatigued, I’ll\nalways add in some type of slow, controlled descent, some type of long pause. Because the muscles are fatigued and if I\ncan build some type of explosion on the fatigue, imagine what kind of explosion they’re going\nto have when they’re full on, ready to go. JEFF: In terms of loading on this exercise,\nwhat do you like to do? K.C.: As far as what? JEFF: Loading. K.C.: Weight-wise? JEFF: Yeah. That should be able to load up pretty good. K.C.: Yeah. I’ll go 400lbs on these. This is one of those things kind of like what\nwe talked about with the box squat. You can overload with this. You want to overload this because there is\ngoing to be a point when you need to get your top used to holding max loads. So, I would definitely do hypertrophy style\ntraining, which is high volume, but don’t be afraid to add those one-reppers, or three-rep\nheavy loads in there as well. You’re going to need them. JEFF: All right, cool. So, we’ve got one more, which actually hits\nthe back. Right? K.C.: Yep. JEFF: That’s an area no one ever thinks\nabout, a lot of times when it comes to the bench-press. K.C.: It’s one of those things – yeah. A lot of people think ‘chest, bench-press,\nokay’. Chest. Some people will thing “tris”. But the next one I’m about to show them,\na lot of people don’t realize it’s a big engagement, as far as bringing the bench-press\nand building a big explosion out of the hole. JEFF: Let’s go do it. All right. So, we talked about the back. It’s a lat pulldown variation where it becomes\none of those key accessory lifts of the bench-press. But as the case is, it’s how you do the\nexercise. There are so many ways to do the exercise\nhere. But when we’re talking about accessory to\nbuilding a bigger bench, there’s one good way. One ‘best’ way. K.C.: Right. JEFF: It’s how you do it here. You call it the laid-back pulldown. K.C.: Lay back pulldown. JEFF: Right. So, let’s see what it looks like. And we’ll talk it through, as you go through\nand rep it out. First thing, this level of recline here that\nhe’s got. It’s almost similarly to – as you move\nthe bar, go ahead. It’s almost a reverse bench-press, right? So, what he’s really trying to do here is,\nhe’s keeping his body locked in as the bar wants to pull his body up. He’s not allowing the body to go up. What’s doing that? What’s allowing that? Stability through here, right? Good. You can come up, K.C.. So that’s your key, right? When you’re doing that what are you focused\non the most? K.C.: My lats. I’m really – the thing is, with the bench-press,\nwhen I’m setting up for my big bench-press, tightness is a huge thing. Lats engaged. We have a nice arch. So, when I’m out, I’m locked in. If I’m sitting and squeezing the bar and\nthe lats are immediately engaged. The lats come into play on the bench-press. So, when I’m doing these, my key is to lean\nback, full extensions, and pull the bar, while squeezing the lats. Basically, controlling the bar coming down,\nand then allowing it, and controlling it as you’re coming up because as long as you\nhave weight it’s going to want to pull you. So full control both ways. That’s basically what you need to do on\na bench-press. Control all the way down, big explosion coming\nup, lats tight in both directions. JEFF: Right, and while on a bench-press the\nbar is certainly not going to pull you off the bench, at the same time your lats can\ndisengage. K.C.: Exactly. And if your lats disengage on a bench-press,\nyou’re going to end up – unless it’s just light. But if you’re going for that one-rep max\nin your bench-press and your lat disengages, you’re probably going to miss the lift. It’s happened to me many times. JEFF: Not only that, what usually happens\nis when the lats disengage the instability of the shoulder comes in. K.C.: It’s basically called “getting loose”. You get loose, the stability goes away, and\nyou’ll end up losing the lift. JEFF: So, even guys that have a problem with\nbench-pressing and shoulder pain itself, one of the first things you really need to check\nis how well you’re able to engage your lats. K.C.: Absolutely. JEFF: Because the stability of your shoulders\nis going to be compromised if you can’t. K.C.: Absolutely. JEFF: Instability of shoulders during a bench-press\nis one of the quickest ways to get pain. K.C.: Absolutely. JEFF: So again, one last thing, when guys\ndo this – you know I hate when people rock during a pulldown. Again, if you’re going to set this exercise\nup and do it this way you can’t let it pull you up. It’s not about this. Even though it looks right when you’re down\nhere, you’ve screwed up here. Plus, to get back in that position, now you’re\nusing all kinds of momentum to get it back. K.C.: You’re getting a little something\nout of it, but you’re not getting what you need to get. You’re not getting full contraction of the\nmuscle. JEFF: Right. So, guys, there are your big three accessory\nlifts when it comes to the big bench-press. I can’t underscore it enough. If you want to get a bigger bench-press, this\nguy’s got a big bench-press. He actually – it’s your best lift, right? K.C.: 473 is my best lift. My bench-press is my best lift, out of the\nthree. JEFF: Yeah. The fact is, I said it in the beginning, I’ll\nsay it 1000 times as we do this series; it’s because you don’t just bench-press. K.C.: Yeah. JEFF: And you don’t just spend all your\ntime doing it. You spend a lot of your time doing some of\nthe smaller things. K.C.: Yeah. I honestly can tell you right now, I do one\nbig bench-press movement, and then I have the accessory. In a whole week I’ll have it where I do\nbench-press, but then immediately after that it will be dumbbell work, overhead presses. Like, we did lat pulldowns, and then there\nwill be a day where it’s my secondary bench-press is close grip bench-press. Close grip floor press. Floor press like we showed. That’s an accessory day. That’s my secondary bench-press day of the\nweek. So, if you think about it, I’m really only\nbenching once a week. JEFF: One time a week. Yeah. K.C.: Then I’m probably getting 15 to 20\naccessories a week for the bench-press. JEFF: Yeah. So, guys, there you have it. Straight from the one-legged monster. You guys, let’s keep this thing going. We’ve got another lift to cover here. In the meantime, I always say it. If you’re looking for programs that don’t\noverlook the smaller things – these all matter. The small things always matter because there\nare no unimportant muscles. If there were, we wouldn’t have them. K.C.: Absolutely. JEFF: ATHLEANX.com, guys. Go over there, check out our programs. In the meantime, let me know if you’ve found\nthis video helpful. If you like this series, we’ll continue\nto make more. We’ll be back here again in just a couple\ndays to get another video. See you soon."
}