{
    "id": "XGIKSiQ0rTM",
    "title": "I Really Don’t Want to Lose! (BEARD vs. BEAR)",
    "description": "As we approach 4 million subscribers, I'm putting the power into your hands. You get a chance to decide what Jesse and I will ...",
    "transcript": "JEFF: Wow, big time! Almost closing in on 300, there. JESSIE: Yeah. You know what else we're closing in on? JEFF: What's that? JESSIE: 4 million. JEFF: You're right. You're right. 4 million subscribers. That's a big accomplishment. JESSIE: Yeah, dude. JEFF: Yeah. I've got to think of what I'm going to do\nfor a video, though. JESSIE: You got something big planned? JEFF: I'm thinking, yeah. We always do something. JESSIE: I've got an idea for you. JEFF: Go ahead. JESSIE: Throw me in there. JEFF: You want to be in the video? JESSIE: I mean, if it weren't for me you wouldn't\nhave 4 million. I practically got you your last million. JEFF: You think so? JESSIE: Yeah. JEFF: So, okay. Well hold on. Hold on. I'll put you in the video. I'll put you in the video, but you're not\njust going to stand there. JESSIE: I'm not just going to stand? That's why they love me. I stare at them. I stare at them, they stare at me, we stare\nback at each other; it's a great relationship. JEFF: It's creepy. Bro, it's creepy. JESSIE: It's the perfect relationship. JEFF: Okay. I've got an idea. If you're going to be in the video you're\ngoing to have to hang with me. JESSIE: What do you mean? JEFF: I mean, like, I want to have a hanging\ncontest with you. Who can hang for longer? JESSIE: A contest? JEFF: Yeah, we'll – yeah, dude. Okay. I'll tell you what. Let me save that for a second. The stakes are what matter. There will be a contest, and there will be\nstakes. And I already know what I want. JESSIE: Okay? JEFF: I know what I want. JESSIE: What's that? JEFF: If I win – I think half of them want\nit, too. If I win, this beard? Gone. JESSIE: No. JEFF: Shave it. I'm shaving it. I am shaving it. JESSIE: No way! JEFF: Yeah. That beard is gone if I win, okay? You good? JESSIE: What?! JEFF: Yeah, dude. It's gone. That scraggly – you look like Happy Gilmore's\ncat he found. You've got to get rid of the thing. It's gone. What do you think? Good? JESSIE: All right. What if I win? JEFF: You? JESSIE: Yeah. I can win! JEFF: All right, you're right. Fair. What do you want? JESSIE: Um…you know what? You've got to eat that right there. JEFF: Eat what? That? RX-1? I do that every day. JESSIE: No, no, no, no. you've got to eat\nthat. JEFF: Dude, that's RX-3. That's – I take it every night. JESSIE: Jeff. You have to eat that, right there. JEFF: That's bad. JESSIE: That's 5lbs and 6000 calories. You don’t have to eat it in a day. I'll give you two days, all right? Because we all know that Haribo gives you\nthe shits. Trust me, I know. JEFF: I'll tell you what; you're on. You're on. JESSIE: All right. JEFF: But I want to let them decide because\ndespite what you might think, it wasn't about you. 4 million subscribers, dude? They put us here because they watch our videos. JESSIE: That's true. JEFF: I want to let them decide what we're\ngoing to compete in. JESSIE: That's fair. JEFF: So if they leave in the comments below\nwhat it is we're going to compete in – not a beauty contest. That one I'd wipe you out in, right off the\nbat. JESSIE: Aw, okay. JEFF: Maybe if the beard were off, but whatever\nwe compete in, I want to take their suggestions down below, and then we'll make a follow up\nvideo, and we'll compete in it. And whoever loses is going to have to stick\nto whatever those stakes are. JESSIE: All right. JEFF: Deal? JESSIE: It's a deal. You're going down. JEFF: Guys, do me a favor. Make sure I win, okay? If you don’t want to see this beard anymore,\nmake sure I win. Give me something that I can crush him in. JESSIE: Guys, come on. Let's be fair here. Give me something I've got a chance in, all\nright? You love the beard. JEFF: Guys, leave your comments below. We'll be back here to settle this thing once\nand for all. In the meantime, we'll be back with another\nvideo for you, back in the gym this Saturday. See you."
}