{
    "id": "xQTMhydmWAM",
    "title": "5 Red Flags of a Weak Chest (FIX THESE!)",
    "description": "If you have a weak chest, it not only will show up when you take your shirt off and look in the mirror but it will also have a ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re talking about red flags for\nchest weakness. I’m going to try to help you identify whether\nyou have any of these red flags that will help you understand you need to do something\nto strengthen your chest. To start creating a better looking chest and\novercome any imbalances you may have developed over time. Now, I can tell you this: if your chest looks\nlike this – Jesse’s chest – it’s a major red flag, right there. JESSE: Whoa! Whoa! Whoa! Jeff! That’s what I used to look like. This is what I look like now. JEFF: I appreciate you being here because\nI have a muscle marker here. And…there you go. There’s your red flag. JESSE: That’s ridiculous. JEFF: Anyway, guys. Wear it like a scarlet letter, Jesse. Guys, I’m going to help you determine these. Now, one unique thing about the chest, unlike\nupper scapular muscles, back muscles; you’re not going to see these weaknesses from postural\nappearance alone. Rounded shoulders could mean, yes, a tight\nchest, but it doesn’t have to mean a weak chest. So I’m going to have you do some things\nwith me, play along, do some of the exercises, and you’ll reveal the weaknesses very quickly. I’m going to show you what to do to fix\nall of them once and for all. The first red flag you want to be careful\nof is, when you’re performing either a bench-press, or a dumbbell bench-press, or even a pushup,\nas you’ll see in a second. It’s what happens as you press the weight\naway from you. Now, when I’m down here what’s happening? We know that a properly executed bench-press\nshould have the shoulders pulled back and down. You’ve heard that tip many, many times before. That’s fine because you can do that, but\nif you start to notice that the shoulders start to get in front of the chest on every\nrep, especially as you start to fatigue. That would be a major red flag, on top of\na red flag that you have a weak chest. Why is that happening? Because we know that the shoulders are going\nto participate in pressing the dumbbells off your chest. Especially at the bottom. And we’re going to get to this in more detail\nin a second. But as I start to press, if my chest is weak\nit’s supposed to take the brunt of the load from here on the way up, until the triceps\nreally kick in. But if I don’t have good strength there\nthen the shoulders are going to continue to try and follow the weight up. Another interesting point is when the shoulders\nprotract, when I get from here up and they protract, and follow the weight, I’m effectively\nshortening the distance that I have to press the dumbbells. It’s an inherent cheat. The reason why that’s happening is because\nyou have that chest weakness. Now, you can do the same thing and see the\nsame thing here, as I mentioned on a pushup. As I press away what’s happening? Are my shoulders pushing me away, or is my\nchest actually doing the pushing? We can tell if the shoulders stay back behind\nthe chest. If your shoulders can stay back here and the\nchest can press away on both exercises, you’ve probably got adequate strength in your chest. If not, you find that it’s trailing behind\nthe dominant shoulder, you’re going to want to do something about it. The next major red flag we have to cover here\nis a comparison between your overhead press and your bench-press. The thing is, you’re looking for the discrepancy\nhere. If you are someone that’s getting close\nto hitting your bodyweight on an overhead press, but you fail to come close to a 1-1/2-times\nbodyweight on a bench-press then you need to look more into the weakness of your chest,\nbecause it’s there. Guys, your bench-press is using your shoulders,\nyour triceps, and your chest to perform the lift. An overhead press while using all three of\nthose muscle groups, of course, is more heavily reliant on the shoulders because of the angle\nof the press against gravity. If you’re excelling here, then you likely\ndon’t have a shoulder weakness. However, when you take that same shoulder\nstrength in your bench-press and you suffer dramatically to get to the strength standard\nof 1-1/2 times bodyweight that means that chest is lacking. I’m going to tell you what to do about it\nbut understand it’s a major red flag. Red flag number three is back here in the\nbench-press and it has to do with the contributing muscles to the press, like I mentioned. The shoulders, the chest, and the triceps. It’s ‘where in a bench-presses are you\nactually falling?’ Because it tells a lot about where you’re\nweakest. If I perform a bench-press rep, obviously\nI have to get the bar down to my chest. I have to press it back up to the top to lock\nout. If you are failing constantly in the middle\nof the rep, right about here, you get it off your chest, but you can’t really get it\nthrough the middle here, and you can’t get it to lock out – can’t even reach that\nportion – it’s most likely because your chest is the weakest point. It’s the weakest link. Why is that? Because when we’re at the bottom of a press,\nthe shoulders are in their most advantageous position to do the pushing. I did mention in the beginning how you want\nto try to get the chest to help out and recruit from down there by getting the proper position,\nbut it’s not to discredit the fact that the shoulders are going to be contributing\nthe most off the chest. At the very top, to get through lockout, your\ntriceps are going to be recruited maximally. However, getting though that midrange is where\nthe chest is going to be called upon the most and if you always fail in that middle portion\nof the rep then you need to start looking at your chest. Again, I’m going to tell you exactly what\nto do to fix this. Just be aware that’s a major red flag that\nyour chest is not contributing enough. Moving onto red flag number four is dealing\nwith the pushup again. You want to do the pushup as I’ve showed\nyou in step 1; with that chest sticking out in front of the shoulders. But the first thing is, can you do 25 of them? Yes, 25. More importantly, it’s not just about overall\nstrength when we’re talking about red flags for weakness. We also want to know what the quality of your\nmuscle endurance is. Can you continue to produce a movement over,\nand over again, especially pushups where we can measure that? Here’s an interesting twist, though. What you want to do is take what I just told\nyou about the bench-press, put the chest into its most vulnerable position, and be able\nto still execute the reps. Here is your task. You want to be able to get down to the ground\nand complete 25 repetitions with 5 second intervals spaced in between, holding in that\nhardest position. So, you come down to the ground. You do 1 pushup, 2, 3, 4, 5, down in that\nmidrange, and hold. 2, 3, 4, 5. Come up, five more. 1, 2, 3, 4, 5. In the middle. 1, 2, 3, 4, 5. Go again. 1, 2, 3, 4, 5. Down for five. So, this is now 15 repetitions with 15 seconds\nof holding. Now I come up. 1, 2, 3, 4, 5. A five second hold here. That would be my 20 reps with 20 seconds of\nholding. Then finally, 1, 2, 3, 4, 5, and hold. 1, 2, 3, 4, and 5. Not easy. Burning, but burning right where we want it\nto be. I want to see if you can do that all the way\nthrough the duration. Again, if you can’t it’s an indication\nthat you may not be lacking overall strength, but you’re certainly lacking some muscle\nendurance. That’s a key factor as well. You’ve got to address it all. Last, but not least, another red flag, and\nit has to do with a comparison strength. That is how you perform on a dip. If you perform better on an upright dip than\nyou do on a properly performed chest dip with your torso leaning forward, you’ve got a\nchest weakness. It’s something you want to address. Let me demonstrate. If you’re able to do more up here upright\ndips keeping your torso up straight than you are when you get your body leaning forward\nhere – like that – then what you’ve done is put the chest in a better position\nto help out in the exercise. As you’ve angled your body forward you’ve\ntaken the triceps away as the main mover of the exercise, but you’ve also exposed the\nfact that being able to do less in that position means you’re weaker there. So most importantly, those are your red flags. But what do you do about it? We want to start right here in the dip. One thing you don’t want to do is always\ntreat this as a bodyweight exercise that you continue to rack up rep, after rep, after\nrep. Introduce some weight. Introduce a weight belt with an added weight\nplate so you can start to overload this exercise. I don’t care if it brings down the number\nof reps you can perform. It’s going to help bring up the strength\nin this exercise, which will help carry over to all the other things and address this chest\nweakness. So, we want to make sure we do that. Again, we talked about the initial exercise. Where you’re pressing from. If you’re performing your bench-press, if\nyou’re performing your pushups the tendency is to allow the shoulders to start to drift\nin front of the chest. Don’t do that. Become consciously aware, because of this\nvideo, that you don’t want that to happen and allow the chest to initiate the movement\nand stay out in front of the shoulder. The next thing, when we’re talking about\nthe bench-press itself, that midrange, that’s where you’re weakest. So why don’t you work on that? You can do partial repetitions, in addition\nto your full range of motion repetitions, but do some additional partials as some extra\nwork to address your weakness. Also, introduce some pause reps. They don’t always have to be on your chest\nwhen you initiate the pause. You can do that in the midrange of a rep and\nthen continue the rep from there. Finally, you want to make sure you’re introducing,\nnot just those three big exercises. As much as we love dips, bench-press, and\npushups, you want to make sure you’re strengthening the chest because that’s where your weakness\nis. A great way to do that is to introduce some\nexercises that take the chest through full adduction, crossing midline – like a crossover\n– that’s going to allow you to load up the weight as well. This doesn’t have to be done as a weak and\nlight exercise. You can add up some weight here. Just make sure you’re doing them through\nthe full range of motion because that’s one of the things that’s lacking. Guys, when it comes to training your chest\nyou’ve got to make sure you’re overcoming the weaknesses that you have. But it first comes by identifying what those\nweaknesses are. Hopefully this video has allowed you to find\nout where you’re weakest, and however many red flags you have. The more you have, the more you have to address\nthis. If you’re looking for a program that builds\nin ways to overcome all these red flags, we make sure to overlook nothing in our training. When you train like an athlete everything\nmatters. All of our programs are available at ATHLEANX.com. In the meantime, if you’ve found this video\nhelpful leave your comments and thumbs up below. Let me know what else you want me to cover\nand I’ll do my best to do that for you. If you haven’t already, please subscribe\nand turn on your notifications. You don’t want to miss any of the new videos,\nincluding the other ones we’ve put together in this very series of red flags. All right, guys. I’ll see you again soon."
}