{
    "id": "xSdWog85Esw",
    "title": "The “Skinny Fat” Solution (FAST FIX!)",
    "description": "The “skinny fat” body is instantly recognizable. It is characterized by having a skinny body with no appreciable amount of muscle ...",
    "transcript": "And so, if you find yourself skinny fat, the \ngood news is it's not only a fixable solution,   but it's one you can fix fast, just like Jesse.\nWhoa, whoa, whoa, whoa who you calling   skinny fat?\nI mean, do you have a short memory?\n  No, but I have a bad memory.\nToo much head trauma. \n  What s up guys, Jeff Cavaliere, Athleanx.com. \nJesse Laico, Athleanx.com. \n  By the way, skinny fat. Here you \nare. This is a picture because   pictures tend to help people with bad memories.\nWell, I thought we deleted those a long time.\n  No, we keep them around for just these \npurposes like this. Guys, if you're looking for   a solution to your skinny fat problem, the \ngood news is, as I mentioned in the open,   it is fixable and it's fixable quite fast if \nyou do the right things. All right. So, when   we're talking about skinny fat we're looking at \na situation where you sort of look like this. \n  You're skinny and you're fat. \nI mean, let's look at a little bit differently.   You lack muscle and you still maintain some \nfat around your waistline, especially for men,   particularly around their waistline. \nYou've got skinny arms, maybe skinny legs,   you got no chest, maybe not even any \nabs, but you got some midsection fat.\n  Well, that looks a lot like \nme in those pictures. \n  There you go. So now how do we fix that? We've got \ntwo choices, right? You can either opt to attack   your fat problem and try to get skinnier. However, \nI wouldn't advise that because when you do,   you end up looking like this.\nThat doesn't look so good.\n  No. What this is, is this is just a very \nskinny person. See, the base of what's   happening in a skinny fat person is a lack of \nmuscularity. They have no muscular development.   So, what you're going to want to do is make \nsure that you build muscle to start fixing   this problem. However, we do have to consider \nnutrition, too. And there's actually two things   that I know about every skinny fat person \nwatching this video right now, two facts. \n  What's that? \nThe first thing is they're not   following a training plan. \nOkay.\n  Sort of like you work following \na training plan, Jesse.\n  All right. Why do you have to call me out?\nWhich is why you were skinny fat.   We'll get into that in a second. The other thing \nthat I know is that you are not hypocaloric.   You know what that means?\nThat means less calories   than your maintenance level.\nMaintenance level. That's right. You are   not there because if you were, you lose the body \nfat that still remains around your midsection. \n  Yeah.\nIn the case of Jesse, his hypercaloric   state wasn't there because he was eating too \nmany gummy bears and some other things. Right?\n  Still calling me out. \nBut you're still accumulating too many calories   from all those sugary foods. So, let's start \nthere. What is the game plan for you and what   you're going to have to do to fix this problem \nonce and for all? From a nutrition standpoint,   the fact that I know you're not hypercaloric \nmeans at least you're at maintenance. \n  Yeah.\nIf not, you're in some sort of calorie surplus.   Well, guess what? You're in a good enough state \nto build muscle. Because we actually know that   you can build muscle at the same time that you're \nlosing fat in a caloric deficit as long as your   protein content is high enough.\nRight.\n  The recommendation there is about .8 grams \nper pound of body weight. If you're in that   range and you're slightly hypercaloric, \nnot very hypercaloric, but let's say 200,   300 calories below your maintenance levels, \nyou're still going to be able to add muscle mass,   albeit at a much slower rate. But you can still do \nit if your protein levels are up. But we know that   you're at least at maintenance, if not above. \nYeah. \n  My recommendation from a nutrition standpoint, \njust to ensure that you've got the building blocks   to build muscle, it's just to take out some of \nyour carbohydrates and swap in some protein. So   do me a favor, just count your protein content \nand grams for one or two days. We generally like   to eat around the same things almost every single \nday, so just do it for two days. Though I don't   ever really advise becoming a mathematician \nwhen it comes to counting your calories and   measuring out things every single day. Just for \nyour own awareness it might help you to see how   much you're taking in.\nYeah.\n  Because if you're not at that .8 grams per pound \nof body weight right now, you might be surprised   at how below that level you are. Simply taking \nout some carbohydrates on a gram per gram basis,   they have the same amount of calories, that's four \nyou can make that easy swap. We don't have to play   around with increasing or decreasing calories.\nRight.\n  Now, nutritionally that's good enough. But we have \nto focus on that other thing. I remember I said   you're not training.\nNo, you're exercising.\n  You're exercising. Look, if you're not on some \nsort of a committed plan, you're not going to   build muscle. If you exercise and think that \nthat's a committed plan, it's not. And it's   the reason why you haven't built any muscle. You \ncan't look like this and be a skinny fat person   and have any real training history under your \nbelt. And what I mean by training is having a   progressive plan that is followed consistently. \nBecause I'm sorry, even a bad plan--\n  Not dangerous plan.\nNot a dangerous plan, but a bad plan,   and a lot of them out there by the way. But a bad \nplan follow consistently is still going to help   you to build muscle. \nYeah. \n  So, you need to get on a training plan \nand these are the things that have to be   part of that plan. Number one, you have to \nhave a focus, as we always talk about here,   on building your base strength around a strong \nfoundation in the bigger compound lifts. \n  Right. \nJust like Jesse has. \n  Yup in the squat, bench and deadlift. I've been \nprogressing the weight that I've been using over   a long period of time, but short increments \nof that amount of weight and the weight has   gone up actually pretty significantly.\nSo then in two-or three-time body weight.\n  Three times, yeah.\nSo, then your squat is going up as well. \n  Yeah.\nSo, building around this foundation.   But let's talk about reality here. Reality is \nyou might have something called extra phobia.\n  Which I definitely had.\nAnd you're not alone. A lot of people,   when they first start out of the plan, again, \nno muscle on your body, which means you've   probably never even hit the gym. Because we \nknow even as a newbie, you're going to gain   muscle sometimes just by looking at the weights, \nbut you have to look at the weights consistently   in order for that to happen. You need to \nunderstand that some of those exercises are   going to feel a little daunting to you and you \nmay avoid them altogether. And that's a mistake,   right? I talked about and in many videos before, \nyou need to start somewhere on them, realize   that just because these are basic exercises, \ndon't assume that they're so simple to do. \n  Right. \nThe more compound the exercise is, the   more complex it actually is to perform it. You've \ngot a lot of different muscles working together   in sync. You've got to move an uncoordinated body, \noftentimes through space, through these multiple   joints, which can become challenging. And you have \nmany different areas up and down the kinetic chain   for these weaknesses to actually rather ugly head \nand cause that lift to go the wrong direction. \n  Yeah.\nRight? You could have tight ankles,   you could have a lack of mobility in your hips, \nyou could have a lack of thoracic extension. All   these things would inhibit your ability to perform \nthe squat, let's say, safely and also maximally by   adding as much weight as possible because you're \nnot moving through space in the most efficient   way. So, you would actually just look up some \nof the Athlean-X videos when you identify what   some of your postural and biomechanical \nflaws are and work on fixing those.\n  Yeah.\nAs you continue to attack those weights and as   you continue to build upon that solid foundation. \nBut in no instance are you supposed to avoid the   exercises altogether. We need to focus on those. \nYeah.\n  The next thing you have to do, and this \nmight come as a shock to some of those   on the skinny fat spectrum here, and that \nis, should they be following any of the   other exercises? Is the minimalist approach \nenough or should you be doing more? \n  You should definitely be doing more \nbecause the isolation exercises or   the smaller exercise will not only help to \nbuild hypertrophy and build larger muscles   and improve your physique, but it will also carry \nover into your bigger lifts and compound lifts.\n  You're learning something here \nJesse, after all these years. \n  Hey, I ve been listening to you a lot. \nThe head trauma hasn t completely shot your   brain there. But the fact is, yes, when you \nfollow these other exercises and supplement   them into your routine, there's three things \nthat actually happen. Number one, you might   actually have some fun, right? Because though \nthe compound is maybe a little bit scary to you   at the beginning of your journey, these are the \nexercises that you tend to look forward to. \n  Yeah.\nRight? Because you   just get to feel a little bit better and perform \nthem where you like the pump that you get from   doing that. So, guess what? I do them because \nit'll increase your attraction to the gym and   keep you on that consistent training plan.\nAt speaking of the pump, just like Arnold talked   about how great the pump is--\nOh Jesus, here we go.\n  You know, I get the feeling of coming. \nComing all the time with this pump.   You know, I feel like I'm coming in the gym. I'm \ncoming at home. I'm coming, you know, backstage   before a show. I'm coming all the time.\nAnd we know we heard about pump story with Arnold.   Secondly, as you learn that not only do you have \nfun doing these, but you get a better my muscle   connection from doing these smaller exercises. \nGuess what that does? That actually helps you   to create a larger sum of the parts so that when \nyou go back to the compound lift, the output is   overall better. \nYeah. \n  So, it helps you to actually increase your overall \noutput. The third thing that doing these lifts   actually does is it increases some of the overall \ntraining volume to assist in the hypertrophied   that you're talking about. So, you want to make \nsure that you add those to your training routine.   If you were doing these things, guys, the only \nother thing that you can sort of screw up here   is the consistency with what you're \ndoing and the training frequency. So,   what I would say is even again, a plan \nthat got you in the gym three times a week.   Like our perfect total body workout, that \nwill be enough if done in a progressive manner   to start to help you to build the muscle that we \nwere talking about in the beginning. Remember,   the muscle growth is going to be the solution \nto your skinny fat problems. Now, if you want   to go back at the end and start looking \nat how you're going to address the overall   excess fat that you have, well, then you \ncan start fine tuning it from there. \n  Yeah. \nAnd again, that's   where I oftentimes say continue to try to pursue \nboth, albeit at a little bit of a slower pace,   by allowing yourself to manipulate your protein \ncontent, getting a slightly hypercaloric state to   get rid of the fat and keep the muscle going. That \nis an option. You still have the option to do the   alternative and go in a slightly hypercaloric \nstate to try to make that happen a little bit   faster. The point is, starting with the muscle \ngrowth, is how you're going to solve your skinny   fat problems. And making the few but important \nchanges to nutrition is going to have all the   difference in helping you to get to your goal. \nNow, I talked about it being fast. Here's the   reason why. If you have no appreciable muscle \nmass in your body right now, because you're   never have followed a training plan, guess what? \nThose new gains come in handy here. They allow   you to start adding weight and muscle weight at a \nmuch faster rate than any other time in your life.   If you do this right, guys, I promise you, you're \ngoing to start to like what you see at a much   faster pace than you may have even expected.\nIf you like, the video found it helpful make sure   you leave your comments and thumbs up below. \nIf you like, skinny fat Jessie or not skinny   fat Jessie better.\nBigger Jesse. \n  Bigger Jesse. The only thing that \ns getting bigger is your head. \n  Okay, that s mean. \nAnd your deadlift, but that s fine. Guys if you re   looking for a training plan, progressive and built \naround sound training principles as well as a   step by step nutrition plan you can find them all \nover at athleanx.com. And if you haven't done so,   make sure you click, subscribe and turn on your \nnotifications so you never missing a video when   we put one out. All right guys see you soon. \nThat s for calling me skinny fat."
}