{
    "id": "Xx_RyuA4DzU",
    "title": "AB WHEEL AB WORKOUT (home workout for your entire body!)",
    "description": "Crazy ab wheel workout for more than just your abs... http://athleanx.com/x/howtogetripped If you are into fitness at all, either you ...",
    "transcript": "You got one of these? Well, before you throw it away, make sure\nyou watch this video because I'm going to show you how you can do a lot more than your\nabs with this AbRoller. What's up guys? Jeff Cavaliere, ATHLEANX.COM. Thoroughly decompressed from last week's supplement\nvideo. I appreciate your feedback, guys, and understanding\nwhere the passion comes from. But it doesn't just end when it comes to supplements. As you guys know from week after week after\nweek we bring you the same kind of passion down here in the gym. This time, I wanted to address something that\nI think...a reason that a lot of guys don't work out, or from what I'm told, is they don't\nhave proper equipment. They don't have everything they need to work\nout, and as you guys who already have the AthleanX program know, I'm a big believer\nin bringing the workout to you. Alright? There's no instance where you can't perform\na workout, and I'm talking top-level workouts, with just what you have at your disposal. So, sometimes you have to get a little bit\nmore creative, and I think that's what we do here at AthleanX all the time. Today's going to be another example because\nwhat I have with me is something that a lot of you may have, you might have picked it\nup somewhere along the way, whether through an infomercial or just a stop at a WalMart\nand you felt tempted to want to buy one, after all they're only about 10 bucks...this is\nthe AbRoller. Now, it's misnamed as far as I'm concerned\nbecause what you think is that it just does ab exercises when in actuality, if you put\na little AthleanX touch to it, this can be a lot more. So, what I want to do is show you just a few\nof the ways that you can turn this AbRoller into a total body workout. As promised always, I will give you some awesome\nnew ab exercises in this workout, too, for those of you that have already mastered the\nab roller for what it is used for. SETTING UP YOUR HOME 'GYM'\nOk, so here's all you need to do to this entire workout. This is the set up here. You got your ab roller, you've got 1 Athlean\nElast-X band. Right here on the axle, you put the band right\naround the middle and that's it. Whether or not you have this thing anchored\nup here to a pull-up bar first or that you have it anchored down below, as you're going\nto see with all the exercises here, it all works the same. Once you have it anchored, take the loose\nend, put it around the axle, you're good to go. THE EXERCISES ABS (AND MORE) TRICEPS PUSHDOWNS 'CABLE' CURLS\n'CABLE' REVERSE CURLS OVERHEAD TRICEPS EXTENSIONS REVERSE PENDULUMS RESISTED ROLL OUT PUSHUPS RESISTED DIAGONAL ROLLOUTS SINGLE LEG SQUAT ROLLOUTS RESISTED ROLL-INS! So, there you have it, another excuse down\nthe drain, the no equipment excuse just doesn't hold up. Why is that? Because, as I said, with the right workout\nprogram, you should be able to do your workouts anywhere. As you guys know who have been following me\nfor any length of time, or for those guys who already have AthleanX, you know that I\nwent to great lengths to make sure that you could do the workout where you wanted to do\nit. Ok? In a gym, or at home, and if I had to bring\nthe creativity to you to allow you to do that, then that's my job as a coach to do it, and\nI think we have. With that being said, anybody that buys the\nAthleanX program or already has it, you'll find in your package there something we call\n'The Replacements\" where I take things that you probably long ago have thrown out, things\nlike maybe the AbRoller, or SlidingDiscs, or replacement for a TRX, I show you how to\nmake them at home very very inexpensively. Or just take things that are being used for\nsomething else like a Tupperware container, and I show you how you can do all your workouts\nwith these things. So, don't ever let that equipment excuse become\nan excuse. Alright? We want to make sure that you're doing your\nworkout so that you can look your best especially now with summer just\naround the corner. If you guys found this video helpful, make\nsure you thumb it up, and make sure you share as well with other people. Again, I'm sure you know somebody who has\none of those or you might have one yourself. Or, after this video, you might be running\nto the store to go get one. I'll see you guys back here in 7 days."
}