{
    "id": "y0yuP7I3D2s",
    "title": "DK Metcalf 1.6% Body Fat - THE TRUTH!",
    "description": "NFL Prospect Wide Receiver D.K. Metcalf is the talk of the combines after registering a 1.6 percent body fat level and showcasing ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re going to do one of those popular\nby demand videos. People requesting “Jeff, you have to talk\nabout DK Metcalf”. You might be thinking to yourself “I don’t\nknow how DK Metcalf is”. If you haven’t already heard, this is DK\nMetcalf. A receiver out of Ol’ Miss who just participated\nin NFL Combines and did some pretty impressive things. His statistics were pretty much off the charts\nand everyone is talking about him. It’s not the fact that he’s obviously\njacked, he’s a receiver, he’s a big guy. He’s 6’3”, 228lbs, 34-7/8” length\narms. That’s a foot longer than my arms. He’s got hands that can catch pretty much\nany football. No problem. But what we’re focusing on, what everybody\nis focusing on, and the subject of this video is that his bodyfat percentage was reported\nat 1.6%. Now, you’re probably saying “Is that even\npossible?” Hopefully you’re saying “Is that even\ngood? Is that even healthy for an athlete?” I wanted to delve into that because the one\nthing we do know right off the bat is, this is probably not accurate. There are a few reasons why I believe that\nto be the case. The first one is sort of an observation because\nthis is someone else who was reported to be just under 2% body fat for a competition. This is the late Andres Moser. Catch the word ‘late’ because he’s not\nhere anymore. It’s not necessarily a good thing to be\nthis shredded. We’ll get to that in a second, but this,\nyou could probably agree, looks a little bit different than what Metcalf looked like. There are a lot more striations in here, there’s\na lot more muscle definition going on here, there’s a lot more unhealthy look to this\nbody than what you saw on DK. Muscular? Yes, but this is a lot more extreme. This was reported to be 2% bodyfat. I would much more likely agree with this than\nI would with DK. Now, there are a couple of other things that\nare more important. This is where we talk about the data collection\nside of it. What’s going on at the combines? There are two methods of collection for the\nbodyfat percentages. One is utilizing the Bod Pod, which has been\ngoing on for over 12 years, I believe. 13 years. Then we have the Dexa Scan. The Dexa Scan is something that’s been included\ninto the testing process, just of late. Actually, this year was the first year that\nthey included it. It was introduced this year. So, what’s the main difference? First of all, with the Bod Pod, it’s a volume\nmetric measurement. It’s relying on the displacement of air\ninside the Bod Pod when the athlete is outside of it, and then when they step inside of it. It’s very similar to how they used to measure\nbodyfat by water displacement, with underwater testing. So, it’s a volume measurement and there’s\na margin of error to this of up to 2.5%-5%. Not off on the number, but literally bodyfat\npercentage points, up to 2.5%-5%. Which means even something that’s registering\nat 2% could come in as high as 7% off a Bod Pod measurement. So that’s a problem. Some research even suggests this margin is\neven greater than that. The reason why is because this assessment\nis based off calculations. We’re basically calculating, utilizing the\ninformation of the displacement of the volume. So, it’s subject to some drastic error. The benefit here is that it’s pretty easy\nto understand results. You get a little printout, there’s your\nresults, and a lot of the scouts prefer the easy to report method. A lot of the media outlets prefer the easy\nto report method here. That’s where we’re probably getting this\ninformation from because we know that the Dexa Scan, again, something new, is only privy\nto the scouting departments of these teams that haven’t been publicly disclosed. Therefore, we can guess with confidence that\nthese results are not what we’re going off of. We’re really going off these. But even though we’re here, guys, though\nthe method is a lot more accurate, we’re using X-rays to pass through the body to come\nup with the measurements, it’s still not perfect. It’s using actual measurements to gather\nthe data, which is better than using calculations, but there are still some limitations to even\nthese numbers here. And we know that the data output here is very,\nvery complicated. They use an outside, third party to present\nthese statistics to these scouting departments and they’re so long in detail I still don’t\nthink they’ve gone through and determined how they’re going to utilize this information. So once again, they relied on this. But I think the question is: is that healthy? Is it even good? Should we be happy that DK Metcalf is at 1.6%,\nif it was even true? The answer is, no. Especially when it comes to the athletes. When it comes to the guys that watch this\nchannel, I hope. That is, there’s a sliding scale here. If we were to look at a rough estimate of\nbodyfat percentage on the bottom from 0% all the way up to 45%, and then we looked at the\ninjury risk – injury risk meaning any of the dangers that come along with having an\nextremely low level of bodyfat percentage, which I’ll cover here in a second. You’re going to see a dramatic shift that\nwhen you’re at these super low levels, in the 0%-5% range, you have an incredibly high\nrisk of injury. It could be something extremely serious, like\nfatality, or it could be something more along the lines of career threatening, just in terms\nof your ability to stay healthy. Because your joints are severely under lubricated. Let’s look at some of those things. We’re talking about what some of these concerns\nare. Temperature regulation. Being tough to regulate your own temperature. I hope he doesn’t get drafted by Green Bay. That would be a bad place to try and play\nfootball if you can’t regulate your own temperature. Vision. You could have vision problems. I talked about myself in the past where my\nextreme avoidance of fat in my diet led me to have some photosensitivity. I couldn’t go out in the sunlight without\nhaving to squint. That’s because we know that the reliance\non the photoreceptors of the eye require fat to operate at full function. Reduced immune system. That’s not a good thing for any athlete. Increased risk of injury. A lot of times, relating to joint dysfunction\nbecause of the low levels of bodyfat. Fatigue. Brain fog. Nothing good about this, guys. Again, even if you’re not an athlete, but\nyou’re trying to compete in the sport of life, it’s never going to be good. A desk job. Anything where you’ve got to think. Thyroid dysfunction. All this stuff is bad. So, we don’t want to be that low. That sliding scale, we saw the sweet spot\nwould be more up in that 8%-12% bodyfat range. There are reasons we can aesthetically be\nwhere we want to be, but performance-wise we wouldn’t be sacrificing where we want\nto be. That’s going to change with age, and I’ll\ncover this in a future video, where there’s a bit of a sliding scale there, too. And of course, men versus women. I’ll go into that in depth. But the fact is, that’s what we want to\ndo. So, what else should we focus on? Because the truth here is not just about the\nbodyfat, but what about the numbers in general? Look back at his numbers. Again, I mentioned impressive statistics. A 40-yard dash of 4.33. That is going to be very difficult to cover. A bench-press of 27 reps of 225lbs. A vertical jump of 40.5\". Broad jump, 134”. The three-cone drill, 7, 3, 8. And then a 20-yard shuttle, which is the 5-10-5,\n4.5 seconds. I want to underscore something very important\nwhen it comes to these numbers because I feel like I’ve been harping on this a lot, as\nof late. That is that numbers alone don’t tell you\nanything. Numbers in isolation are never good. Being one-dimensional, which is something\nI’ve talked about a lot, focusing on only strength in your workouts is an extremely\nlimited, improper way to focus on training. Especially if you want to be an athlete. You can’t talk about training like an athlete\nif you’re solely focused on strength. Is strength an important component? It’s one of the most important, but in isolation\nit could be pretty limiting. How do I know that? Well, we can look at bench-press alone; the\nperformance of the bench-press. Did you know, since 2012 the guys who logged\nthe four highest scores in the bench-press – with the highest being 46 reps or 44 reps\nof 225lbs. Did you know that of the top four guys, only\none guy is still playing in the league? Of those top guys, two of them were out of\nthe league after just a single year or single season. It’s not enough. I’ve talked about it. You can be a big guy, a big meathead, big,\nstrong guy. But if you have no other skills, you’re\nnot going to be a great athlete. Same thing here. You could be as fast as this guy. 4.33– 40. But if you have no route running abilities\nhow are you going to separate from the defenders? It’s a problem. You have to have agility. Maybe your three-cone drill is great. You’ve got some agility, but you have no\nspeed. That’s a problem. Maybe your vertical jump is incredible. 40.5”, great. Off the charts. But you have no strength. So, when you’re up against other guys in\na physical situation trying to compete to get up for that ball, you’re going to get\nsquashed. Not good. So, any number in isolation is no good. But I will say this, predicated on these numbers\nhere, things look pretty good for DK Metcalf. Why? He’s got some good company here. Julio Jones, one of the top receivers in the\nentire league. He’s got him outweighed by 8lbs, he’s\na little bit taller than him, 10 more reps on the bench-press, faster on the 40, and\nhigher vertical. If he stays healthy, if he’s not actually\na true 1.6% bodyfat he’s got a higher chance of staying healthy and staying on the field,\nand he could do some amazing things. One last thing, guys. We get the chance to play General Manager\nhere. You and me. I want to ask you, based on numbers – because\nthere’s another caution to numbers here – you’ve got to be careful with numbers. I want to ask if you would draft this guy\nright here. This athlete. Would you draft a guy who ran a 40-yard dash\nin 5.3? Not 4.33, 5.3. One second slower. How about a guy who couldn’t get a single\nrep of bench-press of 225lbs? Number three: 24.5” vertical. Almost 15” less than DK. A broad jump of 99”, not 134”. God, this isn’t looking so good so far. 3-cone drills, actually not so bad. 7.2 in the 5-10-5. That’s pretty decent. 4.38. Would you draft this guy? Most of you out there would say ‘no’,\nbut you probably know where I’m going with this. I would. I would draft him. He’s a pretty good player and sometimes\nyou have to consider the intangibles, guys. It’s not always just about the numbers. It’s about the makeup. So, guys, I hope you’ve found this video\nhelpful. Remember, bodyfat alone – I’m a guy who\ncarries a low bodyfat percentage. I’m aware of that. But I’m even above 5%. I could never walk around at 2%, 3% bodyfat\nand think that I was healthy, or call myself healthy. I think there’s an incredible importance\non staying at the right bodyfat levels and setting the right goals for yourself and realizing\nthat there’s more to it than that. Even all the numbers, at 1.6% should not be\nall we’re focusing on. Guys, if you’ve found the video helpful\nleave your comments and thumbs up below. Let me know what else you want me to cover\nin future videos and I’ll do that for you. If you haven’t already done so, please subscribe\nand click on your notifications so you never miss a video when it’s published. If you’re looking for programs that take\ninto consideration all the elements of training like an athlete, not just one of them, all\nof them, realizing how important it is to integrate them all together; we do that for\nyou in a setp by step plan over at ATHLEANX.com. All right, guys. I’ll be back again soon. See you."
}