{
    "id": "y1r9toPQNkM",
    "title": "8 Best Dumbbell Exercises Ever (HIT EVERY MUSCLE!)",
    "description": "Build a ripped athletic body with just a few dumbbells http://athleanx.com/x/perfect-home-workout-program Dumbbells are ...",
    "transcript": "What's up guys, Jeff Cavaliere, ATHLEANX.COM. Let's take a look today at the best Dumbbell\nexercises that you can be doing, and we have to qualify first that these exercises were\nchosen because I feel like you can get the best bang\nfor your buck if you're going to do just a few exercises with a Dumbbell exercises. And why Dumbbells? We love them here at ATHLEANX because they\nallow you to train like an athlete. You have that three dimensional freedom that\nyou just aren't afforded with a bar, and you also have that compact space that you can\nbe using to train at home. A lot of guys don't have room for a full Barbell\nset but they can clearly fit some Dumbbells in their house and therefore get a great workout\nin. So let's take them and break them down one\nby one and point out the benefits of each as we go. Alright first up is the Dumbbell Curl and\nPress. And yes, this is a compound exercise. Most of the exercises in this video will be\ncompound exercises. Because again, we have to get the most bang\nfor our buck, get that work done, get the muscles working quickly. Well with the Dumbbell Curl and Press we have\na Bicep movement and a Shoulder movement. And what's great is we actually get them to\nblend themselves together, a pull and a push, because of the function\nof the Biceps. We know that the full function of the Biceps,\nto fully contract, has to include some sort of elevation or flexion here of the Shoulder. Well we get that, we get the Curl, we get\nto continue it right up and through into a flex Shoulder which completes the Shoulder\nPress. So we have antagonistic muscles that normally\ndon't like to work together that are actually working together for the common good here\nto create a great exercise. Next up is an exercise I like to call the\nCrush Grip Goblet Squat. Yes it's a Goblet Squat, we know that a Goblet\nSquat is a great way to train our lower body. Everything, our Glutes, our Quads, our Hamstrings,\nand what's great about the Goblet Squat is it actually drops us right down into our natural\ncenter of gravity. So for those people that have a difficult\ntime figuring out where they should be squatting or how wide their feet should be, if you attempt the Goblet Squat normally,\nyou'll squat right into the position that's most comfortable and biomechanically correct\nfor you. Beyond that, with the Crush Grip we're actually\ngetting a chance to incorporate some upper body activity into what would normally be\na passive movement for our upper body. If you grab a Dumbbell, on the normal Goblet\nSquat position which is just holding underneath, you're not really doing anything actively\nto hold that Dumbbell, other than supporting it with your hands. But with the Crush Grip, you're actually squeezing\nthe Dumbbell between your hands. You're getting an activation of the Chest. You're getting an activation of the Delts. You're getting an activation of your Traps. You're getting an activation of your Core. Everything now is working, from top to bottom. This makes a superior version of a Goblet\nSquat, which was already a great exercise. Next up what some people call the Upper Body\nSquat, the Dumbbell Pullover. I've covered the Dumbbell Pullover now in\ntwo references. One as a back exercise and one as an upper\nchest exercise. You know what, I don't care how you do it,\nit's all in the technique. Either way, this is one of the best exercises\nyou can do, especially if all you've got is one Dumbbell. You see, if you take the Dumbbell and your\nsqueeze your hands together, as I've shown you in the past. You try to pull your hands up against each\nother as you pull over your chest, it's going to work more of your upper chest. If you let your elbows flare out a little\nbit and you drive with your elbows, lead with your elbows and not with your hands, then you start to get a lot more Lat activation. But as I said, it doesn't really matter which\none you choose, mix them up back and forth between sets. Work both areas, why not? This is still one of the best exercises you\ncan do for your upper body and certainly one that I would include in my 8 best. Back to the two Dumbbell exercises, and this\nis one that a lot of guys still haven't caught on to the value and benefits of it and it's a traditional Farmers Carry. With a Farmers Carry you simply load up that\nweight as heavy as you can and do exactly what I'm showing you here, you walk. And if you don't have a lot of place to walk,\nthen walk back and forth in whatever space you have. The fact of the matter is, that trying to\nhold onto these Dumbbells becomes infinitely more challenging when you add movement with\nyour lower body. You can try to just stand here and hold Dumbbells,\nit will be that much easier but it's when you have that weight shift going on and the fact that your Core hasn't been stabilized\nfrom right to left when you're in a single leg stance, it just makes it that much more demanding\nand your grip tends to give out a lot faster. Now it's not just a grip and form exercise. It's also a very demanding upper back, mid\nback exercise. If you're going to hold these things and hold\nthem for very long, you're going to have to learn how to hold with the bigger muscles and let them help you in your upper back. And you can see here, as I walk away, my Triceps,\neverything is kicking in to try to hold these Dumbbells up. And of course by having the locomotion component\nhere, we're actually walking too. So we need to make sure that our lower body\ngets involved too. This is a total body exercise, literally from\nyour fingertips all the way down to your feet. Speaking of those feet to fingertip movements,\nthe Dumbbell Thruster. This is one of those ugly ones. Yeah, these are the ones that just kill you\nbecause you're basically working everything in your body. You start all the way down here in a Squat\nposition and as you come up, you let that momentum continue. But the momentum is only going to get you\nso far. The only way you're going to get those Dumbbells\nup and over your head is if you Press them, and if you have some pretty good strength\nto do so. You can load this weight up as heavy as you\npossibly can because likely, you're going to be able to handle the Front Squat weight\nthat you are using. It's a matter of how much you're going to\nbe able to Press up and over your head that's going to be the limiting factor of this exercise. But it doesn't matter, this can quickly become\na great Metabolic exercise as well, depending upon what you're working for. Go a little bit lighter, go for higher reps,\nmake it a great Metabolic booster. If you want to go heavy, you know what to\ndo. Load those Dumbbells up a little bit more\nand turn this into a Classic Builder for your shoulders and your legs. At ATHLEANX I always say we like to put the\nCore at the Core of everything we do. Well this is a perfect example of it. Yes, we can do a regular Dumbbell Incline\nBench Press. And we do, do regular Dumbbell Incline Bench\nPresses. However, this is a 1 Arm Dumbbell Incline\nBench and by making this one little tweak, we made the exercise that much more demanding\non our Core. You can see that as I lower the Dumbbell all\nthat weight wants to pull me to one side. The only thing I have to stabilize and prevent\nme from rolling off the bench in the direction of the heavy Dumbbell, is my Core and my Obliques. And I have to make sure that I can contract\neverything together to keep my low back flat on the bench and then initiate that momentum that I need\nto push that Dumbbell back up in the opposite direction. You see we don't have to just overcome the\nforce of gravity here but really the mechanical disadvantage that our Core is put in, here\nas we weight up and lower down that Dumbbell. So yeah, this is a great exercise to actually\nteach us how to overcome the weaknesses we might have in our Core, and generate enough force to get that Dumbbell\nback up for yet another rep. Not much to debate here when it comes to this\nexercise, especially as a Metabolically demanding exercise, this is a Dumbbell Swing. All we're doing here is grabbing a Dumbbell\non end with both hands underneath one of the Dumbbell and basically mimicking a Kettlebell Swing. And we know that with a Kettlebell Swing we\nare getting a great exercise for Glute and Hip Extension. One of the weakest areas of our body, for\nsure. This though can be done, for lots of reps\nor not so many reps, again depending upon how much you load this up, but if you go fairly heavy and challenging\nhere, this will quickly not only become a great way to develop the strength in your\nposterior chain, but you'll be huffing and puffing for sure,\nafter just a few reps. Last but not least, we have our Dumbbell Tripod\nRow. And yeah it looks very similar in motion to\na Dumbbell 1 Arm Row but it's not. Because what we've done here is we've changed\nour base of support, and by doing so, we've changed the challenge on our Core. With a regular Dumbbell 1 Arm Row, we have\none arm and one knee on the bench and the Dumbbell's held fairly close to our center\nof gravity. But when we go back to the version I'm showing\nyou here, the Tripod setup, we've got a wider base of support, our center of gravity is still towards the\ncenter here and we have one Dumbbell that's held more out to the side, a little further\naway from our center of gravity. You'll feel it, even on your very first rep\nif you try this variation, that you have more of a challenge actually holding your body\nstill and straight as you move the Dumbbell, than you would on a traditional one arm, one\nleg up because your body is much more in balance that way. However it's more athletically inclined here\nbecause both feet are on the ground. We're in a more athletic position here, on\nour feet, knees bent, butt out. I like this version better. So there you have it guys, there's my 8 favorite\nDumbbell exercises. Each one with a justification of why it's\non this list and some even new to Team ATHLEAN. But that's just where it starts guys. These are just Dumbbells, it's just a tool\nof the trade. I want to know is, are you going to bring\nthe intensity and motivation to your workouts to execute these exercises properly to get\nthe most out of them. You see, that's where this all the beginning. I'm here as a coach not just to put up my\nyouTube video here for you, but to guide you through each one of my workouts. In the ATHLEANX Training System my role is,\nas a Coach to try to not just show you the best Dumbbell exercises and the best workouts\nand things to do, but how to pull you guys through it with that\nproper motivation. We had a video the other day that I covered,\nyes I was a little bit in a rant but I showed you guys that THIS matters to me. This is my passion. I care mostly about getting you guys, the\nbest workouts you can possibly get. I also take my role seriously as a Coach,\nto make sure that you get the most out of it. If you're looking to have me Coach you, for\nthe next 90 days, then head to ATHLEANX.COM right now and let me do just that. In the meantime, take a look again at these\nexercises, start trying them out for yourself and when you're ready for me to take you through\neach and every workout, you know where to do that. Alright guys, if you found this video helpful\nmake sure you leave a comment and a thumbs up below and I will make sure I continue to\nbring you everything you want to see. Alright guys, I'll talk to you again real\nsoon."
}