{
    "id": "Y3PL7Eyg7og",
    "title": "WWE Jinder Mahal Workout | Assessment (PART 2)",
    "description": "When WWE superstar Jinder Mahal visited the ATHLEAN-X gym the other day for an injury assessment and workout, we captured ...",
    "transcript": "JEFF: I love when my athletes come through\nhere and train. It's actually, probably my favorite part of\nwhat I do. But, Jesse, he's not really that used to it. So he can make things really uncomfortable. JESSE: So listen, man. If you really want to get big, this is what\nyou've got to do. You've got to really, really focus on the\ncontraction. Trust me. I know this better than anyone. I put on 12lbs in a year. It's been huge, all right? I'm telling you, if you want to get big, you\nwant to get huge, you've got to listen to me, bro. You've got to listen. So listen, the contraction- JEFF: What the hell are you doing, man? JESSE: What? JEFF: Will you leave him alone? JESSE: I mean… JINDER: You know what? He actually had some pretty good points. The man did put on 12lbs of muscle in one\nyear. ou know what? I think you're onto something. JEFF: All right. JESSE: That's what I thought, Jeff. JINDER: Keep telling me, man. Give some advice. JESSE: All right. So here, this is where we're going to start. We're going to grab the 5lb dumbbells over\nhere and- JEFF: And by uncomfortable I mean, uncomfortable\nfor me. JEFF: Right there. Right there, right there, right there. See the difference? JINDER: Yeah. JEFF: You're going – you're here- JINDER: It's coming from the knees. JEFF: And you're going here. This move is hip hinge. Hip hinge. The way I teach that is, you try it from right\nin here. This little line. If you bring that, that's where the tension\nhappens. Right in there. Where those lines are. Here and here. So make those – that crease. There you go. That's a hip hinge. And straight back right there. You feel it? So everything needs to start, whenever you're\ngoing to do any kind of explosive exercise from – boom. From here. Here. Yep. Everything I do. Like, \"Oh, I'm going to go down\". You think that just because the knees are\ngiving, your body is lowering so it thinks it's doing the right thing, but really, the\nlowering should come from the hips first. So any power exercise. You can push press – if you weren't doing\nthat, until now – you've push pressed 20% more just by doing that. So I'm in here, and then – boom. In here. Then, boom. Now I'm a lot more powerful. The main point was, when you press from any\npoint or position, you put your arms in front of your body. You don’t feel anything from there, right? GURV: Oh, yeah. JEFF: Right. You're not going to get any pain. It's once you start to go in this direction. You've got to be going in this direction. I'm just not a believer in going back. One of the best ways to hit the delts – I\nhate upright rows. I fucking hate them with a passion. I think they're one of the worst exercises\nyou could ever do for your shoulder because if you came to me and said \"I think I've got\na problem. I might have impingement\", I might say to\nyou \"All right, hold on. Let me test.\" So I go like this, and I go like this and\nI say \"All right. Now push up on my hands.\" And I'll be doing that and you'll be like\n\"Ow that hurts.\" JINDER: Yeah. JEFF: That's exactly what the upright row\nis doing. It's taking your arm into an internal rotation,\nputting weight on it so it's going down, and you're trying to pull up. The biggest issue with that is where your\nelbows are traveling. If the elbows are in line with your body,\nor the frame of your body like in an upright row, I don’t care if you stop at the nipple. Sometimes people say \"Stop at the nipple.\" It's the fact that the elbows are in this\nposition and the weights are out, in front this way that creates that internal rotation. JINDER: Many, for some reason, love that exercise. JEFF: I know. JINDER: [inaudible 0:03:12]. JEFF: That's why, right? So I'm going to show you a better way to do\nit. So, what it should feel like instead is, if\nyour arms are back bending your body into extension, what does it already do? It already sets up, posturally, the things\nwe're working on. What I'm saying is, failure – for most people\n– is just a really good, solid effort. JINDER: Yeah. JEFF: Because even if you stop – I say \"Train\nas hard as you can\", yeah. But if someone came and put a gun to your\nhead you'd probably be able to do two, or three more at that point. It's funny because when I did train when I\nwas 16, I am not quitting with this guy. JINDER: Yeah. JEFF: The funny thing is, he tells me – so\nyou did the gauntlet, right? JINDER: The gauntlet, yeah. JEFF: So I've never personally done 45 on\na tricep extension. Never. I always do – because I treat that more\nlike I'm doing it with 30s, 35s. So he starts to go up and he starts me on\n45lbs. I said to these guys \"I haven't even lifted\nit.\" So you've got to do 20 of these, and then\n20 of these, and I was like \"I never lift.\" But I didn't want to. JINDER: Yeah. JEFF: So I go and I knock out 20 of the 45s,\nand then I'm like \"Holy shit!\" Then you've still got to do 20 more of that. I was convinced that there was no way I was\ngoing to be able to do 20 of them. JINDER: Yeah. JEFF: Because I could barely do them on the\nfirst one. Somehow, some way he's sitting there- JINDER: Something you've got to, man. JEFF: I was like \"What is your every set,\never level?\" if you're going through – and this is one\nof the biggest things that happens with Jessie. He'll go through doing curls and then on the\n11th and 12th – that's not – I want 12. That's what I want. I want that on the last curl. I want something hard. Otherwise you really didn't do anything. JINDER: Yeah. JEFF: Nothing that causes changes. If you're just doing it to get a workout in\nthen that's fine, but not to cause a change, or hypertrophy. JINDER: Yeah. JEFF: The traps also interfere with your bench. JINDER: Yeah. JEFF: So what happens is, from here – no\ndepress your shoulder blades. There. Now when you come down, already your delts\nare almost in front of your chest. So you want to roll them back. Like that. JINDER: Yep. JEFF: Now keep them here, initiate from there. You feel that? It started here, right? JINDER: Yep. JEFF: And I always think about bringing the\nbiceps closer together than I do the dumbbells. JINDER: I see. Yeah. Squeeze the chest. JEFF: Don't worry about the dumbbells. The dumbbells are whatever. They're just following alone. Now go down. JINDER: Shoulders bent. JEFF: Open it up. Keep all that here. JINDER: Yep. JEFF: Then here. And then biceps together. You feel that? It's like [inaudible 0:05:42]. JINDER: It's like my first day back. JEFF: Now I'm going to show you – now go\nahead and let your shoulders do a regular press here. So go down. Now, as you come up, if they come in front,\nif they start to lead the way – right now they're already- GURV: They're on the bottom. JEFF: Press. They're already fucked. He's got them pushed out here. So they're already here. They're already – they're the first line\nof defense. They're the ones that are going to jump in\nfirst because they're already out in front. What you want to do is just make sure they're\nback, behind the chest. The chest stays out in front, and now – yeah. Initiate from there. Hold it. It's a whole other exercise. GURV: Yep. JEFF: So now it's here. Now, when you get down to the bottom you can\nalmost set it that way because the shoulders stay back. Now just initiate right from here. Ready? Go ahead. Feel the difference. GURV: Oh, yeah. JEFF: Now, this is what is doing the work. Now when you come down it almost works automatically. JINDER: Yep. JEFF: Because the dumbbells take you back,\nand out. Now watch right here. Here, put your hand on there. Okay, go ahead. See? He pushes right from there first. JINDER: Yeah. JEFF: Then when he's squeezing this – you're\nsophisticated enough about it to care enough about it that when you're doing it you're\nlike \"Oh, fuck! I didn't do that one right.\" JINDER: Yeah JEFF: Okay, there it is. Now you've got it. And you'll feel the difference. Then you're also experienced enough to seek\nout the discomfort that comes from doing it right because a lot of times beginners will\nbe like – they'll do it right, and they'll think 'that was actually too hard'. So then they'll just back off. That's what I call 3 sets of 12 mentality. They're so focused on getting 12 that they\nthink it's a bad thing if they were to do it right and get a great contraction, and\nfive reps in go \"This is awesome, but I'm never going to get to 12.\" JINDER: Yeah. JEFF: So then they're like \"Let me just cheat\nit back a little bit. So I can go six, seven, eight, nine, ten,\neleven…okay, now I'll give another good one.\" Well, that's bullshit. You did five good reps and seven bad reps. JINDER: Yeah. JEFF: Instead, if you do every one of them\nright it doesn't matter what the number is. This is how the pushup goes. If you get here, again, the same things is,\nlook at the natural pushup position here. My shoulder is definitely in front of your\nchest. JINDER: Yeah. JEFF: Definitely the front. You're doing the best, so far. Your chest is in front of your shoulders. You see the difference? JINDER: Yeah. JEFF: So now, you want to get it so that's\nthe case. The chest is out in front of your shoulders. Not that, but out front. So you can collapse a little bit through the\nback to do that. Now, go narrower. Get down to the bottom position here, and\nput your hands just to the outside of your chest. Your thumbs should be in to the lower part\nof your chest. From there. Now your elbows will be a little bit more\nout form the side. Yep. Like that. Okay. So not tucked in this case, they're out. So now you're thinking \"biceps\", you're thinking\n'chest out', that means your back squeezed together- JINDER: Yep. JEFF: And then squeeze off the ground. Don’t push up. So I mean squeeze. Like, try to do this. Your hands aren't going to move. JINDER: Yep. JEFF: But try that here, squeeze off the ground. Really stick your chest out as far as you\ncan. So from there, stick it out. Keep it out, keep it out. There you go. Feel that? JINDER: Yeah. JEFF: That's the difference. So stick it out, keep it out. Stick it out, keep it out. There. See that? JINDER: Yeah. I can see it, too. JEFF: Yep. So it's that. It's that. You did it. JINDER: I tried. JEFF: Because as soon as you get down, by\nnature of the position, it's out. This is in front. My chest went back in here. It's like it's hiding up in here now. JINDER: Yeah. Totally. JEFF: Where instead, I want it back. I want it in front of my shoulder. My shoulder point is right here. Here, now it's in front of the chest. Put that back. It's right here. JINDER: Yeah. JEFF: And I want the chest in front of the\nshoulder. So then- JINDER: Yeah. Definitely. I've never felt a pushup like that. JEFF: Yeah. So the key is just activating those muscles\nthat are not being activated right now. You're pressing out in that plane. JINDER: Yep. JEFF: And the reason is because your shoulder\ndoesn't even – if you look on the skeleton – it doesn't even setup that way. It doesn't face this way. The thing ab out the glenoid that holds the\nhumerus, it doesn't face that way. It faces like this. This is 45 degrees forward. So the arm sits naturally at this angle. This is called the scapular plane, here. JINDER: Yep. JEFF: It's this angle. It's never out here. You go out to the side you're literally backward\ninside the joint. JINDER: Yeah. JEFF: So you don’t want to press from here. So what you want to do is get up in here,\nand just by grabbing something in front of your body – you see how the arm travels\nout in that plane? JINDER: Yeah. JEFF: It travels in this 45 degree angle. Not all the way back here. So things you could do from here; you could\nload it up, go two up, and then one down. Two sets will be loaded up – boom. Here, boom. Here, or you can go – which I like to do\nsometimes, the plyometric ally if you want to be more explosive – go up, and then down. Eccentrically load it. But look what \nI  do \nwhen I accept it. I hip hinge. I don’t just go here, and do that. I come from here, and do that. Here, and that. So you can do the plyo explosive stuff. There you go. It's right at the hip first. That's it. It's funny because if you get into the habit\nof doing that your legs will be way stronger. Because you're kind of doing it all on the\nfly's. You're not using – JINDER: Yeah. JEFF: You're not using the glutes. JINDER: Yeah. On the hip hinge you squeeze your glute? JEFF: Well, yeah. Stretch it first, and then when you come out\nof it, yeah. You can allow it to drive you out of it. That's good. That's a good hinge. So now what you do if you're going to do explosive\nis, you're just releasing it and then catching it, and then boom. Just trying to get it to a more athletic move. Yep. There you go. Now obviously, you'd load it up. Even a single plate's a lot, you know? GURV: Yeah. JEFF: The other thing that's nice about this\nis you control your core. Don’t let it over-rotate you. Don’t let it take you all the way over here. Stay in tight. Stay in tight because it wants to rotate. GURV: Yeah. JEFF: Like that. So, ass goes out first. There you go. Yep. Then drive it from there. GURV: That's good cardio, too. JEFF: Yeah. You can turn it into a shoulder/conditioning\nworkout. MARV: I feel like I'm using my knees a lot\nmore. JEFF: Yeah. Lateral raises/front raises with this thing\n– this is probably where the bar alone could be enough weight. JINDER: Yep. JEFF: So you're from here, and then you're\nup to there. So the beauty here again is, I'm able to do\nexactly what I told you before, keeping it in that scapular plane. I'm still holding at this angle. I'm not here. JINDER: Yep. On this one, you still want to focus on keeping\nthat shoulder-? JEFF: Yep. Everything here, back, and down. Yeah. So it's just up, just like that. There are other, more explosive things you\ncould do where you can keep it from here, and be down, and get a little more of a snatch,\ntype movement. But again, that's- JINDER: Goes with that. JEFF: Yeah. So this is, again, a middle raise. It's not here, and it's not there; it's in\nthe middle of the scap raise. JINDER: That's cool, yeah. [inaudible 0:12:55]. JEFF: Just think long. Think long. Instead of that, don't bend all the way. Try to get nice and long, as long as you can. You've got long arms. There you go. Yep. Yep. Good. JINDER: Eight minutes over. JEFF: Huh? Eight minutes over? [crosstalk 0:13:18-0:13:20]. JEFF: That's funny. GURV: Now you can [inaudible 0:13:22]. JEFF: Really? GURV: Yeah. JEFF: When did you start wrestling? JINDER: Oh, shit. [inaudible 0:13:28]. JEFF: Who'd you learn from? JINDER: Uh, [inaudible 0:13:32-0:13:34]. Yeah. My uncle used to be a wrestler except he wrestled\nin [inaudible 0:13:38]. JEFF: Yeah? JINDER: Yeah. [inaudible 0:13:40]. I used to wrestle for [inaudible 0:13:41]\nand Blue Star. JEFF: This is where it's meant to be like\na tight movement. So now you hold it in here, you drop it down\nwith a hip turn, and out to the side, and then from here you pop it up, then press down. But I'm not trying to go way out here. JINDER: Not too high up. JEFF: No. I'm trying to let it go down with a turn,\npivot, just to my thigh. Then the key is, pop it, up. JINDER: That makes it look easy. JEFF: So the key is to make it athletic, make\nthe core stay tight. So go slow. The point is, you drop it there, boom, there\nyou go. Boom. Try to spin. Just try to spin that back foot. There you go. Stay nice – you could put 245. You could put whatever you want on here. Beast it. And it's a safe position. I love to land my core shoulder training period\nbecause it's always going to be a safe position up front. MARV: You can do cleans on this, right? JEFF: Yeah, you could do cleans. I do that – when I had it wide, that's why\nit was a little more snatch. But if I kept it narrower I could get into\na clean. Got it? JINDER: I've got 15 minutes. JEFF: All right. Let's do something quick. Let's do a plate series. JINDER: Okay. JEFF: So we're all going to do it. So walk around a plate. We're going to do plate press outs. Not this is a great series if you were just\nlike \"Hey, I've got to blast through something for my shoulders\", or a good finisher. I like to do finishers at the end of some\nof the things we do, just to make sure that we've killed ourselves in the workout. But you do the plate press outs, and then\nfrom here, now we're going to do bus drivers. So we're going to drive them out here, and\nthen from there we're going to go plate-eights. So I make a figure eight on the side. Then a trap raise. Up, and then the trap raise like I said before. All the way up. Face it, and then we finish it out, put it\nup on your collar bone, lean back, and bang them out. JINDER: Yep. JEFF: For a press. GURV: It's a circuit. JEFF: It's a circuit. All right? So, Jinder; grab a 45 with me. You good? JINDER: Yeah. GURV: We're cruising with these. JEFF: All right. We going 45? All right. So the first thing is you put it out here. Ready? Go. One. 9, 10. Keep going. 11, 12, 13, 14, 15, 16, 17, 18, 19, 20. You ready? Now you face it, out, down, and up. One more. Up. One more. Down slow. There we go. It will feel like 1000lbs. One, two, three, four, five, six, seven, eight. JINDER: That's no joke. JEFF: So, one more circuit. I'll walk you through real fast. Just to show it to you because I want to show\nit to you. You – especially for your shoulders for\nthe agility rider. JINDER: Yep. JEFF: Closed chains good, right? Getting that chest out, setting it back; all\nthat's reinforcing the strength of your shoulders. So you get into a box. You don’t just do this. JINDER: Yep. JEFF: Because that's just doing all the things\nwe don't want to do. You get in that position there, and then you\nwork on your closed chain agility down, and up the ladder. Where this is back. JINDER: Yeah. JEFF: Then what we do is, we kind of gamify\nit by having you do something. If I took a plate here, dumbbell, and then\nwhat you do is you start down here, outside. You start 'with what I call a 'mule kick'. JINDER: Yep. JEFF: Another awesome – a little bit more\nof a plyometric exercise. You guys should all try these, but what you\ndo is, again, closed chain. So you're here, you lean forward, kick, kick. JINDER: Yeah. JEFF: So this, sort of, closed chain right\nthere on my shoulders? Awesome. It feels actually stabilizing. You do five, and then you're in. Come all the way down. All the way down. JINDER: All the way. JEFF: Then you grab the first thing – in\nthis case, a dumbbell – you just go up, and back. So here, clean it up, here, up, press over,\nand down. Up, press over, down. Do about eight of them. Four on each shoulder. Walk yourself back down, and then out. If you do it with somebody else they come\nin, they go up, they come down, you get back in. Next time you go down you do anything you\nwant. The things I showed you there. JINDER: Yeah. JEFF: The press downs, the figure eights,\nplate raises. Do 10 of them. Come back down. Come back in again, mule kicks, five, come\ndown, and this one you do for front delt. It's just a catch. You throw it, catch it at 90. JINDER: Okay. JEFF: Up. Catch at 90. Power, because you're actually releasing the\nball. JINDER: So let's all three do it. JEFF: You want to try it? JINDER: I'll go first, do one, and then I\ncome back, and then- JEFF: All right, let's go. Who's starting? Lead the pack. JEFF: Every box. Leave your butt low. Keep the butt low. Okay, now drop it. Back, go down in. That's it. Hands over wrist. Good. Next one. MARV: Five? JEFF: Yep. All you – there you go. Three, four. Now clean it. Up, over, good, down in front. Up, that shoulder. Up, down. There you go. Clean it. Up. You've got it. We're going for five. Up. Over. Up. There you go. Leaning all the way forward. There you go. That's it. Get the ball now, grab the ball. There you go. Grab it right – there. You start it. You've got it. Nice and long. All right. In, five more. Lean forward. There you go. Hold on. You've got it. That's it. You feel it? MARV: Yep. JEFF: There you go. You've got it. Perfect. Good. Down. Nice. Back down. Slide down. Last one. Last round. That's it, that's it! That's it! Let's go down. Keep that butt low. Three – I want 20 of those. Five, six, seven, eight, nine, ten, 11, 12,\n13, 14, 15 – come on! 16, 17, 18, 19 – good! JINDER: One for good luck. JEFF: There you go. Slide down. Stay right over your wrists. Shoulders over your wrists. Agility. Nice. Go. Then the mule. Stay up front. Oh, shit. Oh, shit! He's going [inaudible 0:22:29]. MARV: I'm feeling the whole workout. JEFF: Come on! All right, go! Slide down. You've got it. You know what sucks about being last? Keep going. GURV: You've got to break everyone's record. JEFF: You've got [inaudible 0:22:49]. Let's go. 10 more. One, two, three, four, five, six, seven, eight,\nnine, ten. Eleven! Keep going! Show them up. Show them up. Nice. Down. Nice job, man. Good job. GURV: Thanks, man. JEFF: Good job. MARV: Thank you. JEFF: Thank you. Thank you. Good work, bud. Good work. JINDER: Thank you. JEFF: This is still – I would call this\nrehab. JINDER: Yeah, yeah. JEFF: A lot of guys bail on rehab. They don’t want to do this all day. JINDER: Yeah. JEFF: This is good shoulder stabilization\nfor you. It makes it fun, it makes it challenging. If you are working out together it gives you\nsomething to beat. You could up the ante on how many you're doing. You can up the ante on the exercises you're\ndoing down here. You could put a fucking barbell down here\nif you want. You can do whatever you want, but it's something\nyou do at the end of your circuit. That's it. MARV: That helps a lot. JINDER: Yeah, yeah. You're the master. Jeff, here! ATHLEANX. Made me look like a child in this first day\nin the gym, man. This guy knows his stuff. Follow him on YouTube: ATHLEANX, Instagram. Twitter? JEFF: Twitter. JINDER: Twitter also. GURV: Facebook, Myspace. JEFF: Myspace. JEFF: Pique-You. Alta Vista. JINDER: Hey, he kept his shirt on today. He had to keep it on."
}