{
    "id": "YAUGMT0_PiE",
    "title": "Fix Bad Posture in 5 Minutes (FOREVER!)",
    "description": "If you are looking for a posture routine to help you fix bad posture in 5 minutes and all the things that come with it like rounded ...",
    "transcript": "your feet along a straight line and then just \nturn your toes out ever so slightly. And then   from there, I want you to lock your knees out. In \nother words, extend them fully by contracting your   quads at the same time, squeeze those glutes \ntogether. If you've done this right with your   foot positioning on the ground, you should feel \na really good contraction here. And then finally,   what I want you to do is make a fist with your \nthumb just like this, and then put that thumb   alongside your sternum. And all I want you to \ndo is take the knuckles that are now facing   somewhat at an angle downward and point them \nup by lifting your sternum. Think that you   have a glass of water attached to your sternum \nand just lift it so that none of it is falling   out the front of the glass. In this position, \nyou're going to feel exactly what it's supposed   to feel like to be in this better posture. And \nironically, we fixed the thoracic extension loss   by starting from the ground up. But that's how \nthe kinetic chain works. But of course, you're   not going to walk around like this all the time \nbecause we really haven't fixed anything yet.\n  But if I could give you a quick \nroutine to reinforce these things,   well, that's where the real benefits occur. And \nby a quick I mean literally just 5 minutes. So,   you've got five exercises, two here for the \nthoracic area and two for the glutes and then we   have one combo exercise. And the way we structure \nit, is basically taking those first two A and B   perform them for 30 seconds apiece. Thoracic for \n30, glutes for 30, you go back, thoracic for 30,   includes for 30. That's two minutes, you do 30 \nseconds of the combo exercise. Now if you don't   have a lot of time, you can stop right there. But \nif you've got two and a half extra minutes, it'll   be well worth your time to do exercises C and D \nin the same manner. Thoracic for 30 seconds and   glutes, you go back again and repeat that one more \ntime and you finish one more time with that combo   exercise. That's a total of just five minutes. \nAnd the first thoracic exercise is one that's   actually going to help us to attack the weakness \nin the upper back that oftentimes contributes to   that poor posture. We call this one the Superman, \nand it's very easily performed here down on the   floor. You take your fists, you put them right \nhere on that sternum again. And this time we're   going to try to reveal our S, that's where the \nSuperman comes from, by spreading across the chest   and digging your elbows down into the floor.\nAnd if you do this properly, you're going to   feel those muscles between the shoulder blades \nengage to allow you to lift that sternum up.   And think about the test we just did. Take your \nhand and think about raising it as high as you   can by lifting the sternum and tilting backwards \nat the same time. You perform this as repetitions,   as many as you can get that are high quality that \nyou can perform within that 30 second time period.   And then you move on to exercise number two. \nAnd this too, can be performed right down here   on the floor. But this time we're shifting \nour focus to the glutes. So, when we talk   about glute weakness, it's not the absolute \nlevel of strength that you're missing here,   but more importantly, your strength endurance. \nBecause when we're talking about posture flaws,   you need to be able to have the ability to \ncontrol it for a long period of time. So,   the glute march is a great way to do this. \nYou get into this bridge position here,   trying to create a straight line from \nthe thighs all the way down to the torso,   and now you're just going to alternate your foot \nlift about five or six inches on the left and five   or six inches on the right. But most importantly, \nwithout allowing a drop of the pelvis when you   do lift the leg. So not dropping this way and not \ndropping to one side when you lift the foot up.\n  The idea, as always, is to make sure you perform \nquality repetitions for those 30 seconds and when   you're done, you move on to the combo exercise. \nNow, with 30 seconds of each of those exercises   performed, you're now one minute into the \nroutine. You repeat that combination one   more time and you're two minutes in total. Now, \nwe've performed the 30 seconds, however, of that   combination exercises. This is one of my all-time \nfavorites is a Bridge of Reach Over. So now we're   going to go back to that bridge, but this time \nreach across and back with the opposite arm. \n  So, we're getting that thoracic rotation and \nextension at the same time. We're getting that   lift in activation through the glutes so we \ncan tie in both of these deficits and work on   them all at one time and kind of bring it all \ntogether with just this final 30 seconds. \n  So, the second thoracic exercise actually just \nrequires a chair. You come down here on the   floor and you take your elbows and you put them on \ntop of the chair and your hands are going to go on   the top of your upper back. Now, at this point, \nyour goal is to just sink yourself down, really   trying to lead with your chest. In other words, \ntry to touch your chest to the ground, obviously   being limited by the fact that your elbows \nare preventing you from going too, too low.\n  But this is great because it focuses in right \non that area that we spoke about earlier. The   key here is to perform these as repetitions as \nwell by lifting up and then again resetting and   dropping the chest down as best you can. The \nadditional benefit that comes from this is   that we're getting a good lat stretch and \nwe know that the lats are also internal   rotators of the shoulder contributing to \nmore of that rounded, hunched posture,   so we're getting a double bang for our buck. \nRemember, perform high quality repetitions for 30   seconds and move on to the next glute exercise.\nAnd that exercise is actually called a Wall DL,   which is utilizing an RDL pattern, but it's \nhelping to strengthen those glutes once again   and establish full hip extension while also \nreinforcing that thoracic extension that   we're looking for. So, you put your hands up \nagainst the wall like this and you drive your   knee up into the wall as well. Now what we're \nreally focusing on is actually this down leg,   because what I want to do at this point is kick \nmy foot backwards to hinge but establish this flex   hip position and then drive off of that utilizing \nthe glute to get through full hip extension. The   only way I'm getting my knee back to the wall \nis to fully extend through the hip. And again,   full hip extension is good glute activation and \nby doing that we're fixing the pelvis from below   and helping to reinforce that upper back.\nAnd oh, by the way, the upper back is being   reinforced in this position by keeping the hands \nin contact with the wall, which establishes   the same dip that we had on that chair exercise \nto keep that extension that we're looking for.   The first time through you go 30 seconds on the \nright leg and the second time you perform this,   you go 30 seconds on the left leg. \nNow, remember, after performing these C and   D exercises twice, you've got one 30 second time \nperiod left over and that's going to be reserved   once again for that E exercise, the combo bridge \nand reach over that you're going to do for one   final period of 30 seconds. Guys remember, when \nit comes to creating meaningful change, the only   way we can get there is through consistency. And \nthe only way I believe we can get consistency is   when the tasks that you're being asked to do is \nnot that daunting. This is short, this is quick,   but I promise you it will be effective.\nIf you're looking for a complete workout   guys that are equally effective and not \ntime consuming. You can find them over   at Athleanx.com. If you find this routine helpful, \nmake sure you leave your comments below. And also,   if you haven't done so, click Subscribe \nand turn on your Notifications so you never   miss a video when we put one out. All right, \nguys, I hope this helps you. See you soon."
}