{
    "id": "ydT74SAts7M",
    "title": "How to Get a Stronger Lower Back (WITHOUT WEIGHTS!)",
    "description": "Build strength and muscle here - http://athleanx.com/x/strength-muscle Subscribe to this channel here - http://bit.ly/2b0coMW If you ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Let's face it. The last time you probably thought about your\nlow back was when it was hurting you. So today what I want to do is give you four\nexercises that you can do in your own home, without any weights at all to help fortify\nyour back against all future injuries. You see, your low back has to be strong. But not just that. It will never be strong enough unless it gets\nthe help from your glutes. The glutes are a muscle that will work in\nconcert to extend your body. One from below and one from up top. But if they're not working together then you're\ngoing to be in that situation where you find yourself hurting at some point down the line\nwhen you go to do your big lifts. Somewhere along the way it's going to betray\nyou. Let's cover these four exercises though, because\nthese are going to be four, quick things that you can do that will help to prevent any of\nthat from happening in the future. Okay, let's kick this one off with one that\nlooks – I get it – a little bit funny, but I promise you it will really, really work. What you want to do here is you want to get\nyourself down on the ground and then turn your feet out. This is a frog glute bridge. What we're doing by turning our feet out is\nwe're actually activating the glute medias, an external rotator of the hip. But we want to try to, again, tie all these\nmuscles together that will influence that extension and influence and tie into the low\nback and the glutes itself. So when we get in this position now we lift\nup, off the ground. The key here is we're getting full clearance\nof our butt off the ground and you're not just getting off the ground if you're squeezing\nit as hard as you possibly can at the same time that you're squeezing the muscles in\nyour low back. You hold each one of these for five seconds. You're doing 10 reps for five seconds and\nthen you move right on to the next exercise here. So now we're going to stay in this position. We're still targeting the lower back and the\nglutes tougher, but now we're tying in from – instead of below with the glute medias\n– now we're going to tie in a little from the top down. We're going to get the lats involved. So you're going to take your elbows and drive\nthem really close to your sides, but into the ground. We know that the lats feed down, and in toward\nthe muscles of the low back into the pelvis. So we can activate them by trying to almost\ndo a row into the floor. Again, drive yourself up. Contract the low back, contract the glutes,\nand then to put that nail in the coffin you want to try to extend one leg out. So again, you focus on not allowing your hips\nto drop here and you do it for five seconds on each leg. When you transition between the right leg\nand the left leg it's super important not to allow your pelvis to move, or tip. You go to the other leg, you go five seconds,\nyou go back and forth 10 times on each leg and then we're going to turn over on our stomach\nto hit the next two exercise. The first one here is actually one of my favorites. It's called the angel of death because you're\ngoing to be making nice, little snow angels, but you're going to be doing them on your\nstomach and you're going to wish that you died about five, or six reps in. What you're going to do is get flat on your\nstomach and a lot of us will do exercises where we lift just the top part up because\nwe think we're working our low back. But that is not enough if you've been listening\nto what I've been saying in this video. You need to make sure that the glutes are\ninvolved, too. So those feet and legs have to get off the\nground, too. Not just your toes, but I'm talking about\nyour toes, your knees, and your thighs. As high up as you can to get that extension\nin through the hips, in through your glutes. Now you're going to take a five second cadence\nto move your hands from this overhead position all the way down to your sides. You're going to go and rotate your hands as\nyou come up, then you're going to rotate your hands as you go down, but five seconds to\ngo from the top to the bottom, and then five seconds to back up to the top. You can see, literally, every muscle in my\nback is contracting here to allow me to do this, but most of all we've got this really\nstrong, lengthened contraction in our low back and glutes forcing them to work over\nthe duration of the exercise, which is what we need to keep this low back nice and strong. Not just here, but when we're actually doing\nour bigger lifts that we tend to focus a lot more on. Finally we end with our pulsed I. With the\npulse eye you're going to stay in this position where your body looks like and \"I\". Your arms are held close to your body, nice\nand tight. You're still in that same position where your\nlegs are lifted off the ground, your upper torso and chest is lifted off the ground activating\nfrom both the top and the bottom. Now you want to challenge yourself with these\npulses. The pulses are basically done as fast as you\ncan handle for five seconds. Obviously, the more pulses you get in the\nfive seconds the more potential it is for your body to fall down to the ground. The more work your body is going to have to\ndo to prevent that from happening. So for five seconds at a time you pulse your\narms as hard as you can, and then you rest in the contracted position. Then you start over again. Pulse it for five seconds and you rest in\nthe contracted position. Remember, we're trying to accumulate time\nhere. Your low back is going to function much more\nas an endurance muscle than it is to function as an overall one rep power muscle. So we need to be able to have, in our training,\nthe elements that address the longer duration here. So when you do all of these, that's your routine. How often would you do it? You do it frequently because we want to make\nsure that we're attending to these weaknesses that have built up over a long period of time. You can do this little routine here, it literally\ntakes five to six minutes. You can do this every single day and you'll\nbuild up the tolerance to be able to do this for even a little bit longer. The key is this: stop avoiding and ignoring\nyour lower back. I know it doesn’t get all the attention\nof all the beautiful muscles around it, but it is so important to developing all those\nmuscles in the first place. Guys, if you don’t want to overlook any\nimportant element of your training and you want to start training like and athlete where\neverything matters; head to ATHLEANX.com right now and get our ATHLEANX training system. In the meantime, if you've found this video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover here\nin a future video and I'll do my best to do that. All right, guys. See you soon."
}