{
    "id": "yNltjUVf5Y0",
    "title": "Crazy Arms Workout (16 TONS LIFTED!!)",
    "description": "Build up to an inch or more on your arms in 6 weeks here http://athleanx.com/x/build-monstrous-arms-here If you are trying to build ...",
    "transcript": "What's up, guys? Jeff Cavaliere, AthleanX.com. Today we're going to hit the biceps and the\ntriceps and I'm going to give you a very simple way to quantify your effort to insure progress\nfrom one workout to the next. Guys, if you don’t push yourself you're\nnot going to see the changes that you need to see if you're trying to build bigger arms. That being said, let's say we took two of\nyour last arm workouts and we put them side by side and we put the same exercise in each\nworkout. You move the weight with the same intensity\nas you did from one workout to the next and you use the same full range of motion on all\nthe exercises that you did. There would be two ways that we can ensure\nthat you do more work this time than the last time. I'm talking about mechanical work, not metabolic\nwork, but mechanical work. That would be that you either completed the\nsame number of sets for those exercises in a shorter period of time, or you did it in\nthe same amount of time, but you lifted more weight on the exercises that you chose. Today I'm going to put that concept into practice\nas I try to push myself to lifting more weight than I did the last time in a 30 minute workout. I'm going to start it right here on my phone,\nstart to finish. I'm going to try to exceed 30,000lbs lifted\nin that time. Let's get this thing done. So there you have it. Mission accomplished. Now I'm laying the challenge at your feet. I want to know how you're going to make your\nnext workout harder than it was for you the last time you did it. Are you going to change up the rep tempo? Are you going to try to lift more weight? Are you going to try to do it in a shorter\nperiod of time? Are you going to cluster the exercises together\ndifferently, or train the muscles differently? There are so many ways that you can do this,\nbut please do one thing for me: make sure that you are challenging yourself at every,\nsingle opportunity. Maybe you don’t lift the weights that I\nlifted here. That's irrelevant. Lift the weights that are challenging for\nyou and that is how you're going to change. If you're looking for a program that puts\ntogether workouts in unique ways and shows you many, many ways to start changing the\ntraining variables – many of which you've never even thought of – into your workout\nso you can get more out of it, then head to AthleanX.com right now. Let me be your coach to take you through our\nAthlean-X training system. In the meantime, if you've found this video\nhelpful and you want to give it a try, leave your thumbs up below and let me see how you\ndo. Let me know how you do and I'll make sure\nI'll make more videos like this in the coming weeks ahead. All right, guys. I'll see you back here real soon."
}