{
    "id": "Ys-JyytCu2s",
    "title": "Get a Bigger Chest in 22 Days! (HOME CHEST WORKOUT)",
    "description": "If you want to get a bigger chest at home, this one pushup workout will help you to build a big chest in just 22 days. The key to this ...",
    "transcript": "What's up guys, Jeff Cavaliere, athleanx.com. So, \nwhat are you doing for the next 22 days? Well,   hopefully after watching this video you'll be \ndoing this 22-day pushup workout. You see in   just three weeks, and an extra day, you're \ngoing to see some pretty significant gains   here. As a matter of fact, I guarantee \nyou're going to see better chess gains,   you're going to get some carryover effect \nas well into the rest of your upper body   with bigger triceps and shoulders. And more \nimportantly, we're going to increase the   number of pushups you can do in a set right now, \nI mean by up to 50% guaranteed. And beyond that,   everybody can do this. It doesn't matter where \nyou're starting from and how many pushups you   can do right now, this thing is designed to work \nfor every single person is not going to take you   a long time. This is not one of those thousand \nrep a day pushup workouts. We're going to start   trading in some of that quantity for quality \nso you can start doing reps that look like this   and not those good old Oregon Duck pushups that \nlook like this. Now we're talking good quality   pushups that can deliver big gains. So that \nbeing said, guys, let's start breaking down   exactly what we can do here step by step. \nAll right, so what do these 22 days look like?   Well, there's actually two types of days repeated \nthroughout this program. There's a testing day   and then non-testing day and on the testing day, \nyou're simply going to be doing standard pushups   in a specific way that I'm going to cover \nin a second. And then the non-testing days,   in addition to your standard pushups, we're going \nto include some type of pushup variation to favor   more either the triceps or the shoulders. Remember \nwe talked about building your entire upper body.   So now these testing and non-testing days actually \nfit together like a block, there's a testing day   followed by three non-testing days. You come back \nand you do it again and you do this five times as   you can see throughout the first 21 days of the \nprogram. On that last day, day 22, we've saved   an additional test here, and that's where I get to \nput my money, where my mouth is, because that is   where you prove that you've increased the number \nof pushups you could do in a single set by 50%.\n  So, speaking of the max number of pushups you can \ndo in a single set, it actually starts all the way   back on day one on your first testing day and then \nwe get a chance to do as many reps as you can in   good form to failure. And that number becomes \ncritically important to everything else you're   going to do over the course of these 22 days. So, \nyou do that and then you rest two minutes. And at   that point you now have to re-attack those pushups \nagain and attempt to do one and a half times that   number. So, let's say you did 50 as your max \nnumber of reps the first time out, now you're   trying to do 75. You're probably thinking, how \ncan I do that if I just went to failure at 50?   Well you get to do them in something we call \ngrinder style, and that is you grind your way   through here, you can semi rest by raising your \nbody up into a pipe position by shaking one arm   out. The rules are, though, you cannot lift \nmore than one hand off the ground at any one   time. You cannot stand up and you certainly \ncannot put your knees down on the ground.   When you're done with that, congratulations, \nyou're done with your first test day. \n  From here, we move on to our first of many \nnon-testing days and this one day too, what   we're attempting to do is we're going to introduce \nthat first non-pushup variation and we're going to   try to complete the same number of repetitions on \nit that we did on the most recent testing day. But   the difference is here, you get to do these in \nrest pause fashion and we're not trying to take   these sets to failure. Remember, we're trying \nto be cognizant of the fact that we're going to   accumulate a lot of pushup volume over the course \nof these 22 days and we want to be sure that we're   not incurring any additional stress on our joints \nand muscles then we have to. You rest pause your   way until you've completed that max number of \npushups. But we're not done. From here we include   a second part of the workout and that is we still \nhave our standard pushups to do. How many? Well,   you go back again to that most recent test again, \nin this case, day one, and we complete that number   of pushups, that max number plus 10%. We don't \nhave to do them, though, unbroken. We do the   same style we just did the previous exercise \nand that is rest pause, saving two or three   reps in the tank. On the next non-testing day, \nthe goal is to increase that number to 20% over   the original number. So, if we did 50 to start \nthe first day, 10% would be 55, the second day   20% would be 60 and day three would be 65. \nThis all brings us back to yet another testing   day where we get to establish a new max \nnumber of pushups that's going to set   the stage for all those non-testing days \nto follow. We continue to do this, guys,   until we're done with all 21 days and on that last \nfinal day there, day 22, that's where you get a   chance to put the 22 day pushup work out to the \ntest. That is, you're going to take that original   number of pushups you did back on day one add \n50% and now you're going to do them broken. Guys,   I promise you if you put the work in here it's \ngoing to work. So that being said, let's take a   look at all the exercises and how this thing plays \nout and progresses from day one today. 22. \n  And so now you know what you're going to do \nfor the next 22 days. And remember, it doesn't   matter where you start, what matters is where \nyou finish. And if you do this work out here,   guys, I promise you're going to finish in a place \nfurther ahead than you are right now, guaranteed.   And speaking of finishing further ahead, all of \nour programs help you to do that step by step,   guys. We leave no stone unturned to get you \ntraining like an athlete, feeling better and   looking better than ever before. You can find them \nall over at athleanx.com. If you have already done   so guys, make sure you click subscribe and turn on \nyour notifications. And please leave your comments   and thumbs up and let me know what else you want \nme to cover and I'll do my best to do that for   you. Challenge a friend. I can't wait to see how \nyou do on this. All right, guys. See you soon."
}