{
    "id": "yTAVUqs0_m0",
    "title": "Top 5 Ab Rollout Mistakes (FIXED!)",
    "description": "The ab rollout wheel is an incredibly useful tool to help build strong abdominal muscles, IF you perform the exercise correctly!",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're covering the Ab Roller. As a matter of fact, the five biggest mistakes\nthat people make when they use this thing. I've gone on record as saying, \"I love this\". I actually do. For $10 you can get one at Wal-Mart and do\nwonders for your abs if you're doing it right. You’ve got to cover the five mistakes. To do that, we're going to do what we always\ndo. We're going to show the mistakes. For that, we bring in the biggest mistake\nat ATHLEANX: Jesse. Welcome to the video. JESSE: You want me doing things wrong again? JEFF: You're going to be doing the things\nwrong, once again. JESSE: Okay. One condition. I want my new, new, new intro. JEFF: You've got another 'new' intro? JESSE: Uh, one word. Laser beams. Roll it. All right, cool. So, what do you need me to do to this? JEFF: I'll tell you what you should do with\nthis. Honestly. JESSE: That's harsh. JEFF: Can we cut the intros finally? JESSE: No. I can't. JEFF: All right. Guys, let's show the mistakes here. I will tell you one more thing. If you're someone that's knocking out 100\nab rollouts, you're not doing them right. I promise you. You can do them well, and correctly, and do\nthat many. If you do them well, you're going to see your\nnumber coming way down, but the effectiveness is going to go way up. Let's hit the first mistake. So, the first one here is very easy to spot. More importantly, to fix. It has to do with the position of our elbows. You can look at Jesse and me doing them side\nby side here. One of them – hint – is doing it wrong. Jesse. And one of them is doing it right. The fact is, you want to have your elbows\nlocked out straight because as soon as you have even the slightest bit of bend in your\nelbows, you're transferring the workload away from the core and toward your triceps. We don’t want that. If you're trying to develop your abs by doing\nthis exercise – it's called an 'ab rollout' – we don’t want to turn it into a tricep\nrollout. You have to focus on making sure your elbows\naren't even this bent, but completely straight. A lot of us will start to fatigue as we start\nto perform the rep and have that breakdown. Don’t. If you have to stop or reset for a second,\ndo so. Make sure the arms are out there. You'll also benefit your straight-arm scapular\nstrength we've talked about so many times on this channel by doing that. Once you get your arms in this locked out\nposition, the leverage will favorably lend itself to creating more force and stability\nthrough the shoulder girdle, which will transfer right into putting all the work being done\nwhere it's supposed to be; by your abs. Speaking of using your arms, it gets even\nworse than that. What happens is, as we get out to the end\nof the ab rollout, how are you pulling yourself back in? I'm going to tell you, if you're someone who's\ndoing the 100 reps I talked about before, I know how you're doing it. I already have an idea because I can see you\ndoing it right now. You're initiating the pull back with your\narms, instead of letting your arms stay out there initiating the pull from your torso. Look at Jesse and me side by side, once again. You can see that once we get out of there,\nnow the initiation of the return is where this all goes wrong. At least for Jesse, because he starts to pull\nback in. He's literally trying to change the physics\nof the exercise in his favor by pulling that ab wheel closer to his body, and then trying\nto initiate the trunk curl. That's not what you want to do. Look, if you don’t have the strength to\ndo this properly, just don’t go out as far. But don’t bastardize the movement by pulling\nit in halfway and then initiating the trunk curl. You can see here, for me, when I get out there\nthe first move is not with the ab wheel. The first move is with the curl of the trunk. I'm initiating with the abs and pulling back. You can feel this, guys. Just focus on once you come out there, go\nto a dead stop if you have to. Once you start to move again, you start from\nhere, not at all moving the wheel back toward you. I promise you, you're going to get this right. As a matter of fact, it's going to feed directly\ninto the third, and probably largest, mistake people make that I'm going to cover right\nnow. The third one here is a big one. As a matter of fact, it's the most popular\nmistake people make with the ab wheel. It's the position of the hips when you're\ndoing the exercise. Guys, you want to setup an imaginary line\nright at your knees. When you rollout and come back in you never\nwant to cross it again with your ass. If your ass crosses that imaginary line, your\nass is in trouble because the exercise is being done improperly. I covered this in depth in a video before\nand I just recently reposted it here on Instagram. This was picked up by Men's Health and talked\nabout in depth in a recent article. Why? Because it matters. It's very, very important. When you look at Jesse and I doing the exercise\nside by side you can instantly see that somebody is doing more work with their abs than the\nother. I can give you a hint. It ain't Jesse. The point is, once you do what he's doing\nyou're taking all the load off the abs and you're throwing it right on the hip flexors. Our hip flexors certainly don’t need the\nextra work. What we're doing is, you want to make sure\nthat when the ab wheel gets closer, it gets closer because you're pulling in with the\nflexion of the trunk. Which is one of the functions of the abs. We don’t want to sit ourselves back by bending\nthrough the hips and getting hip flexion. Which is what he's doing. Once again, the people who claim to do 100s\nof reps of this exercise, it's simply because they're doing this. They're breaking that imaginary line at their\nknees, with their asses. Don’t do that anymore, guys. Get out of there and come back and keep it\nup. Almost like there's a wall right behind you\nand you can't touch it. Make sure all the work is being done by your\nabs by staying in front of that imaginary line, not touching that wall with your backside. While we're talking about the hips, let's\nstick there. Let's talk about the pelvis itself and what\nwe want to do with it because it's very important. Whenever you're doing any kind of ab training\nthe position of the pelvis is key. Are you allowing your pelvis to go into anterior\ntilt, or are you going into posterior tilt? We should see, just by the action here, when\nI go into anterior tilt, I don’t work my abs. I'm stretching them out. When I go into a posterior tilt, I'm trunk\ncurling from the bottom up, as opposed to the top down, but we're still creating spinal\nflexion. So that means my abs are working. Anytime you do an ab rollout, particularly\nif you want to protect your low back – because a lot of people can screw up their low back\nif they get this wrong. What you want to do is get into a posterior\ntilt and maintain that from beginning to end. You can see Jesse and I doing something quite\ndifferent here. Jesse is getting that alternating positioning\nfrom the posterior tilt when he's up at the top. Then when he reaches out, mostly because he\nprobably lacks proper ab strength in the first place to support that position when he's fully\nelongated, he drops down into a pretty severe anterior tilt. That shifting back and forth between anterior\nand posterior tilt is placing a lot of excess strain and stress on your lumbar spine. Instead, you can see me doing it here where\nI'm going to setup that posterior tilt at the top and as I roll myself out, I'm still\nmaintaining a tight pelvis. I'm trying to keep that pelvis rotated under. I'm not allowing myself to drop down into\nthat anterior pelvic tilt. Neither should you. Finally, number five. Why are you always only going straight out? I know you've probably learned the exercise\nthat way, but have you ever tried it differently? Because if you did, you'd feel something quite\ndifferent in your abs, and for the benefit of your abs. Remember that our abs, though they do work\nin the sagittal plane, and though I do tell you to 'follow the fibers', we've also discussed\nhow heavily used they are when it comes to controlling and preventing rotation. So why don’t you challenge yourself with\na little bit of rotation? It's very simple to do with an ab wheel. Just don’t go straight out. Go in a little bit of an angle here, go in\na little bit of an angle there. Again, Jesse and I are doing the exercise. Here, he's doing it correctly. He's learned from the mistakes we've already\ncorrected in the video, but he's just going straight out. As opposed to me, where I'm taking a couple\nof little turns. A little bit left, a little bit right, a little\nbit left, a little bit right. Every time I head off in one direction, I'm\ncreating a little bit of a rotational challenge for my core. That's a great thing, as we've just discussed. So I'm not telling you to start making these\nreally huge turns – which I've seen people do, and they've shortened the exercise and\nmade it a lot easier because their travel or elongation of their core is much shorter\nthan it would be if they went out straight. I'm saying, continue to go out straight and\nchallenge yourself, but make the turns pretty gradually. A little bit left, a little bit right and\nyou'll get far more out of the exercise. There you have it, guys. Five things that you want to make sure you'd\nnever do when you're doing your ab rollouts. Even though I know you're going to do a few\nless repetitions, I promise the ones you do are going to be that much more effective. That's what matters at the end of the day. As I talk about all the time here, it's not\njust the exercises you do. It's how you do them that matters. If we put the science back in strength, everything\nwe do will have much more of an impact when we do them. If you're looking for programs where we put\nthat all together, you can find them over at ATHLEANX.com. In the meantime, if you haven't already done\nso, click 'subscribe' and turn on your notifications so you never miss a video when we do one. And you can always let me know what you want\nme to cover. I'll do my best to do that for you in the\ndays and weeks ahead. With that being said, we're going to see you\nback here in – why are you back here again? JESSE: How f***ing cool were those laser beams? JEFF: Guys, you are encouraging the hell out\nof him. Look at what you're creating here. Please. No more laser beams. JESSE: What about in the outro? JEFF: I'm done. JESSE: Are you sure you don’t want laser\nbeams in the outro?"
}