{
    "id": "YwFmEsa_lIk",
    "title": "Best Way to do Pushups (FOR A BIGGER CHEST!)",
    "description": "Over 25 pushup variations included in our bodyweight program here… http://athleanx.com/x/zero-equipment-needed The pushup ...",
    "transcript": "What's up guys? Jeff Cavaliere, ATHLEANX.COM. So today I'm going to show you how to do a\npushup the right way. Especially because we know how important this\nexercise is, if you're training at home and you're doing a bodyweight exercise program. It becomes the staple chest exercise. The problem is a lot of people will say 'Jeff,\nI don't feel it really working my chest when I do it, I feel it more in my arms and shoulders,\nwhat can I do to make sure I get more out of it?' So I want to show you a couple variations\nand some key points when you're doing this to make sure that that happens. First and foremost, you have to understand\nwhat it is that the chest does. And one of the main functions of the chest\nis to horizontally adduct, or bring your arm across your body. So yes we're going to have our arms push out\nin front of us, we know that the chest does that, but at the same time it brings us across\nour body, Which is why we do Cable Crossovers and things\nlike that. However, that being said when we do a pushup\nor even when we do a Bench Press, we don't have that ability, we don't have that luxury\nin the normal setup. We're just doing it using a floor. So we kind of lose the ability to adduct our\narms across our body. When we do Bench Press I always recommend\nto start using a narrower grip because that narrower grip will give you the opportunity\nto at least put your arms in a pre adducted position. If you go way out here, try it yourself right\nnow and press, that compared to that, you get a much stronger contraction. So for the pushup we can actually replicate\nthe same transition. If I'm down on the floor doing a regular pushup,\nmy hands are usually right about here and I'm pushing up and out that same way. But what am I lacking? I'm lacking that kind of ability to activate\nthe chest fully by having the ability to horizontally adduct. So first, watch this first variation that\nI do. If you take your arms and you focus on trying\nto pull your hands together, even though they're not going to move. As you see here the floor is going to hold\nthem in position. We immediately have to ability to at least\nignite a stronger contraction and that by itself will help you to get much more out\nof the exercise. But we can actually even turn our arms in,\nalmost turn our elbows forward as we go down. I explained a few weeks back, how when we\ndo Barbell Curls when we're trying to cheat, what do we do? We kind of pull our elbows up and together\nand underneath as we lean back because we're trying to recruit some extra help here from\nthe chest, because of this horizontal adduction. So let's do that here on our pushups. Get down in the position and you can see as\nI come up, I don't just try to pull my hands together but I also try to turn my elbows forward,\nso I'm getting the strongest contraction that I can. Almost like a Cable Crossover done from below. Right away you'll get more out of it, you\nmight do less reps but guys remember, this is not about how many reps you can do\nin a pushup, it's how many quality reps you can get if you're trying to build your chest. Especially if you've got no other option when\ntraining at home. Finally if you do have a couple of Dumbbells\naround another way you can do this is to actually allow the Dumbbells to help you move a little\nbit more into that horizontal adduction. You can do that simply by going down into\nthat push up, again start a little bit narrower. I think that starting a little bit narrower\non your push ups is a good idea. It gives you the opportunity to be a little\nbit closer to peak contraction even when you start the exercise. Now as I come up I'm able to just kind of\nuse my hands and my fingers to push the Dumbbells a little bit closer to each other, get a little bit more adduction to intensify\nthat contraction. So regardless of what you're doing, what training\nenvironment you find yourself in, I know there's a lot of guys following this\nchannel that prefer to workout at home or have to workout at home because they have\nno other option. You've got to start figuring out ways to make\nyour workouts more productive. Guys, we have a whole program that does that. It's called ATHLEAN XERO. And it requires nothing at all. Doesn't require any Dumbbells, it literally\nrequires just you and your own Bodyweight. And I get you, from anybody that's done this\nprogram can tell you, the absolute hardest but the most results producing workouts that\nyou've ever done. And we group them all together in 6 weeks\nto give you the best Bodyweight Training Program that's out there. You can get that at ATHLEANX.COM. In the meantime, if you found this video helpful,\neven if you're a seasoned veteran, this little tweak can really help you on activating your\nchest a little bit more, make sure you leave your comments and let\nme know below. And also let me know what you want to see. Remember guys, 4 times a week I will keep\nbringing these videos to you as best I can. Alright I'll see you guys back here soon."
}