{
    "id": "Z0id0POSOkA",
    "title": "4 Pushup Variations WAY BETTER Than the Original!",
    "description": "The pushup is one of the most classic bodyweight exercises, but also one of the most easily outgrown as you build up your ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. I've got a little bad news, and good news\ntoday. The bad news is, I kind of sound like a troll\nbecause I'm a little bit under the weather, but the good news is, I'm not going to make\nyou listen to me that long, and I am going to deliver you four pushup variations that\nare going to be better, and more effective than the original. I'm going to show you how to do each one,\nand why each one is better. All right, let's get right to it. So as you can see, while the pushup is a very,\nvery popular exercise it does have its detriments. As a matter of fact, because your hands are\nfixed on the ground you do not get the opportunity to get one of the most important functions\nof the chest involved, and that is adduction of the chest. So what we can do is add this banded crossover,\nwhich is one of my favorite ways to do this. By actually pulling a band in from the side,\nand having to cross my hand all the way over on each, and every pushup I'm now getting\nactive adduction of the chest. I'm making it do more work. In addition, it's still doing a pushup. So you're getting an added effect here that's\nfar better than the regular pushup. Of course, you have to make sure you do the\nband on both sides to balance this all out. We can stick with that same theme here, too. We don’t actually even have to use any other\nequipment here. This is where we can do the rotational pushup. By actually changing the position of our body,\nin relation to our hands, we can actually still complete that relative adduction at\nthe chest. You can see here, again, every time I come\nup and rotate, I'm getting that adducted position, ultimately, here of this shoulder that's going\nto activate the chest more. We do it on both sides so we can, again, make\nsure we're hitting both sides of the chest. But the key point here is doing a regular\npushup is not providing you with the opportunity to incorporate all the functions of the chest. When we do these slight variations here we\nmake the exercise better because we're not getting more of a complete chest contraction. Moving on, even if you don’t want to get\na concentric shortening of the chest, or if we don’t have the opportunity to do that\nwe can still include an isometric contraction of the chest here. We can do that with the use of a physio ball. Don’t think that physio balls are easy,\nor that they're out of style. They provide some really unique opportunities\nhere to get a better pushup. So what we do is, we put our hands on the\nside of the ball, and we go into an active isometric chest contraction, trying to adduct\nby squeezing into both sides of the ball. The cool thing here is, we can actually apply\nthis force the entire time we're doing the exercise. Rep, after rep, after rep. The reason why my arms are shaking here is\nnot because it's so much more difficult than a pushup, but because I'm actually applying\nthat much force, and effort into the ball to try to get as hard of an isometric contraction\nas possible. Finally, we don’t necessarily have to change\nthe pushup very much by adding additional contractions that don’t necessarily exist\nin the base form. We can just make the exercise better by making\nit do more. So look at this knee drag pushup here. What we're doing is, first of all, igniting\nthe abs in a way that a regular pushup does not. By requiring that the knee comes up, and slides\nup the forearm, and then back down we're getting that crossover crunch lower ab effect here. But at the same time, we're also prolonging\nthe time that every rep takes. We're actually including two pushups, or at\nleast one and a half, for every, single rep that we complete. This makes this exercise a better bang for\nyour buck version, and in the long run, if you start doing these you're going to get\nmore from them. Adding to the fact that we're now in this\ndecline position and this is just a much harder position to push from. So for all these reasons, this exercise variation\nis far better than the original. So there you have it, guys. We made it, both you and I. You, by listening\nto me, and me, by actually having a voice to get through to the end of the video. The fact is this: I look at the pushup the\nsame way I look at the plank. It's a base version exercise. It's for people that are just getting started. But I think as soon as you get any kind of\nexperience in the gym you want to quickly try to find ways to make it better. Make it have a greater impact on your training\nbecause there are so many more ways, and there are greater possibilities for making this\nexercise more effective. So you're going to get more from the reps\nthat you're doing, as opposed to just continuing to do the same. I would say, guys, if you keep doing what\nyou're doing you're going to keep getting what you're getting. It's time to change it up. It's time to challenge yourself to get better\nresults. If you're looking for a program that will\ndo that for you day by day, step by step; head to ATHLEANX.com right now and get our\nATHLEANX training program. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. I'll make sure to drink my tea, have lemon,\nwhatever it is, whatever home remedy you guys might have for me, and I'll get myself better. I promise. All right, guys. I'll see you soon."
}