{
    "id": "Zi6c09DRGxk",
    "title": "PUSHUPS - Perfect Form Every Single Time!!",
    "description": "The pushup exercise is one of the most simple, common yet butchered chest exercises when it comes to form. The issue is that ...",
    "transcript": "[“Arms of the Angel” by Sarah McLachlan\nplays] NARRATOR: Every day, in gyms around the world,\na pushup is abused. In fact, every 60 seconds, 1,042,376 reps\nof pushups are performed. But sadly, only 76 of them actually count. JEFF: Jesse?! JESSE: What?! JEFF: What’s with the floor f**kers? JESSE: What are you talking about?! These are perfect reps! JEFF: Oh my God. NARRATOR: Don’t be a floor f**ker. Perform your pushups the right way. JEFF: Can we cut the music at this point? Enough tugging at my heartstrings. What's up, guys? Jeff Cavaliere, ATHLEANX.com. The abuse is rampant, and we have to stop\nit. Today we’re going to stop pushup abuse,\nright here, right now. As a matter of fact, I’m going to show you\na way to make sure you do every, single rep, of every pushup you do from here on out perfectly. We’re going to use a phone to do it. I promise you, this is going to work. Now look, I know you’re not trying to have\n‘carnal relations’ with the floor. I get it. But it’s what happens when we cheat the\nexercise. Let me show you why, really quick. The reason why that variation Jesse was doing\nis kind of common is because as the arms start to fatigue in a pushup, we know we’ve got\nto get the body down to the floor. So, what we do is trick ourselves. We go, “All right. Well, I’m going to get the body down by\nmoving the pelvis about five or six inches, but then the arms are only going to have to\ndo a little bit of the work. Plus, I don’t have to push the whole weight\nof my body at this point because my knees are down.” And then we kind of reverse the process. So here, don’t have to push that much weight,\nand then I lift up at the last minute. Obviously, that’s incorrect. But we do it as a natural cheat. The other thing we do as a natural cheat is,\nas we get tired and our chest starts to fatigue we want to shift the focus away. So, we get the butt up higher, and higher. So now we make the shoulders do more of the\nwork. Neither one of them are correct, guys. Obviously, if you want to do a pushup you’ve\ngot to do it with your body moving as one unit. That’s the key. Are you doing that, or are you thinking about\nthat? Here’s the best tip you’re ever going\nto get: you get down into position to do the pushup, you want to think two areas, and two\nareas only. Forget about your arms. All you want to think about is your chest\n– the whole chest here – and your pelvis. If you move them together and lock them up\nas one unit and move them together; you’ll never do a rep wrong. There’s a side benefit to this. If I can get in here and I think ‘chest\nand pelvis’, chest and pelvis move down together, chest and pelvis move up together. Down together, up together. Down together, up together. I’ve made myself stronger on the pushup. Why? Because I’ve gotten rid of a lot of the\ninefficiency. If we move in segments like this, we’re\nlosing a lot of effort and energy in the pushup. We call it ‘plugging the energy leaks’. I come down, and I come up as one unit. It’s a lot easier and more efficient to\ndo the exercise. So how does the phone come in? That’s really easy. You take your phone, put it right here on\nyour back, right between your shoulder blades. Now, if I try to pull any of that nonsense,\nand I move the chest up first; it slides right down my back. We don’t want that. Next thing. If I take it here, put it back between the\nshoulder blades and I try to – “oh, I’m getting tired” and I go this way; now it\nfalls off that way. We can use this as a feedback mechanism to\nmake sure we’re moving everything in unison by putting it here, locking it up, move everything\ntogether. One, two, three, up. Straight up. Straight down. Straight up. Straight down. Straight up. Straight down. Pelvis and chest moving together. It’s really simple, guys. But I promise you, do it for a few sets, or\na few reps, just to get into the mindset of what it feels like to move together, and as\nI’ve said, that side benefit of more pushups, and making you stronger on the exercise is\ngoing to help you keep there, and stay there from here on out. Guys, let’s end the abuse. Remember, even one friend you can help is\ngoing to make a big, big difference here. One pushup, one world, guys. If we can do this right every, single time\nwe can make a powerful impact starting right here, today. All right, guys. In the meantime, if you’ve found the video\nhelpful, leave your comments and thumbs up below. Let me know what else you want me to cover. If you haven’t already done so, subscribe\nand make sure you turn on your notifications. In the meantime, if you’re looking for a\nprogram that puts the science back in strength – does pushups right every, single time\nwe do them – head to ATHLEANX.com right now and get one of our ATHLEANX training programs. All right, guys. See you soon. [“Arms of the Angel” by Sarah McLachlan\nplays]"
}