{
    "id": "ziK69Q26CdA",
    "title": "Bench Press “BOOSTING” Exercise (YOU’RE NOT DOING!)",
    "description": "If you are looking to boost your bench press, then you need to start doing this back exercise. In this video, I am going to show you ...",
    "transcript": "What s up guys, Jeff Cavaliere, athleanx.com. \nSo today I want to talk to you about an exercise   that you're not doing right now or maybe not \ndoing that can boost your bench press. And   guess what? It's a back exercise. So, right off \nthe bat, you might be thinking a back exercise   to boost your bench. Well, yes, it's actually \nvery common knowledge that the back and the chest   obviously opposing muscle groups. But what is not \nnecessarily common knowledge is that they assist   each other in the performance of the bench press \ninto giving you a better, safer bench press. \n  So, a while back, I had the one-legged monster, \nmy friend Casey Mitchell in here and we covered   his best three accessory exercises for creating a \nmonster bench. And then those exercises, the last   one was something he called a lean back pull down, \nclearly a back exercise. And the reason for doing   it was to create tightness in the back, both on \nthe ascent and descent of the bar during the bench   press. But not all of us have necessarily a lap \npull down machine, but we do have one exercise we   almost all can do, especially here with just our \nown body weight, that's going to have a lot of   carryover if you do it right. And when I'm talking \nabout here is the setup here for an inverted row.   So, we program this exercise basically into \nevery single Athlete-X program or almost every   single one of them. And it has a lot of benefits: \nnumber one, we're going to strengthen our back   and our posterior chain in our upper back, which \nis important just to create better shoulder   positioning and shoulder health long term.\nBut more importantly, if you do this right,   it reinforces something important that's \ngoing to carry over to the bench press. So,   see if you can spot necessarily what I'm \nnot doing when I do this the first time.   All right, you've probably done the exercise \nbefore you get up onto the bar like this,   you get up into this bridge position or you \nelevate your legs up onto something. But   this demonstration here, you just \nsimply like this and you pull up.   Can you spot what I'm doing wrong here? Because \nthis is the big difference when you want it to   have a big carryover to the bench press? \nAll right, the issue is hollowing out versus   getting in that type position because if I hollow \nout, I might be able to do more repetitions here.   But that's not really what I'm focused on \nif I want to get this to carry over. \n  What I want to do is I want to get the chest out. \nAnd not just that, we have a stationary bar here   in a moving body and want to have my body be \nas active as I can to get up towards the bar.   In other words, reach for the bar with my chest. \nOkay. Don't stay in this hollowed out position and   get to there but reach for the bar. So, if I take \nthis into more real speed, it looks like this.   And reaching. Reaching. Reaching all the while \nkeeping my upper back tight and locked in. Let   me show you what happens here on the bench \npress. When we perform a bench, obviously,   shoulder pain can become an issue for some, \nand when it happens is in the lower half of   the bench press, right? From having shoulder \ninstability, scapula instability, AC joint issues,   rotator cuff tendonitis, biceps tendinitis. \nA lot of things can become inflamed or bothersome   in the bottom half of the bench \npress because you're lacking   a lot of times the stability in the shoulder to \ndo the exercise and the tightness of the back   during the exercise. So, when we do the bench \npress, in this case, there's a stable body   operating with a moving bar. But the \nbody doesn't have to necessarily remain   completely stable, it can become an active \nparticipant in the exercise, just like it was on   inverted row by trying to meet the bar as opposed \nto just having the bar come down and meet you. \n  So, here's I'm talking about in this position \nhere, if I just let the bar come down to meet me,   there's going to be a little bit more travel \nin terms of the range of motion of the bar,   which can become problematic for the people that \nhave that shoulder issues in the bottom here. Or I   can actually actively continue to try to meet the \nbar. So as the bar comes down, I try to bring the   chest up like that, which is actively basically \nrowing the bar down. Okay. Again, bring the bar   down, actively reached for the bar, essentially \nrowing myself up. So, down in real speed, up.   See that subtle reach.   And what happens is, again, you're establishing \nthe tight back from the beginning, you're getting   the chest up from the beginning. But as the bar \ncomes down, you're actively trying to expand   the rib cage and get yourself a little bit \nhigher, decreasing the range of motion even   by just a half an inch, which can help alleviate \nsome of the problems there. But more importantly,   as the chest comes up, the shoulders go back. \nWhen the shoulders are back, the shoulder blades   are down, you have a safer position in the \nshoulders. Making it not just beneficial for   people that have issues or pain during the bench \npress, but ultimately leading to a bigger bench   press because you can remain tight. You're not \nallowing yourself to get loose at the bottom of   the bench like Casey and I were talking about in \nthat video. If you haven't seen it, you know, make   sure you want to check out that video. \nIn the meantime, found this one helpful.   Leave your comments and thumbs up below. Let me \nknow so I can cover for you, and I will do that   in future video. And also make sure you click, \nSubscribe and turn on your Notifications so you   never miss a new video when we put one out. \nLastly, for the science back in strength   and all of our programs, including exercises \njust like that for the right reasons. Make   sure you head to athleanx.com and check out our \nprograms. All right guys I ll see you soon.  "
}