{
    "id": "ZJGuZvY_Vak",
    "title": "Big Chest Workout Mistakes (SKINNY GUYS!)",
    "description": "When it comes to building a big chest, there are a few mistakes and disadvantages that are common occurrence for skinny guys in ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we’re going to talk about the chest\nand we’re going to talk about those mistakes in your chest workout that every skinny guy\nmakes. JESSE: Who you callin’ skinny? JEFF: I’m just saying, you’re in the video\nfor a reason. Listen, guys; I’m also a skinny guy. I grew up a skinny guy. I know the challenges we have when it comes\nto building a bigger chest. I don’t have the most stupendous chest out\nthere. But I will tell you this: there are things\nwe can do in our training that will have an immediate impact and we have to realize that,\nanatomically, we’re at a bit of a disadvantage. The skinnier you are, the longer and lankier\n– you can demonstrate that, can’t you? The longer and lankier you are, the more of\na disadvantage you’re at. Even from a fitness standpoint of the exercise,\nsuch as a bench-press, that make it more challenging for you to use it to your advantage to build\na bigger chest. JESSE: Right. JEFF: We’re going to talk about those things\nand what you can do for that. Then there are compensations that come along\nwith having these anatomical differences. JESSE: Yep. JEFF: So, if we’re going to do this, we\nhave to do it right. Let’s start with some of those challenges\nso we can all relate to what it is that’s holding us back. I mentioned the arms in the first place. We’re talking about the difference between\nthe longer, lankier guy. The skinnier guy and the shorter, stockier\nguy. JESSE: Right. JEFF: When it comes to the bench-press in\nparticular, the mechanics of the exercise are in your favor, the shorter your arms are. The less the bar has to travel, the less work\nyou have to do. Along with that is this evil side effect. That is: the lengthier you are, and the skinnier\nyou are, the less chest muscle you have, which additionally helps to shorten the distance\nthe bar has to travel. So, when you don’t have the chest in the\nfirst place and you have to do more work, it becomes more challenging to build a bigger\nchest to shorten that distance. JESSE: We’re at a big disadvantage, guys. A very big disadvantage. JEFF: We’re in a big cycle here. JESSE: Big disadvantage. JEFF: So, what can we do? Well, we can’t change those long, lanky\narms. JESSE: Right. JEFF: But what we can do is change them relatively. We can do that by changing the position of\nour body when we lay down to do a bench-press. Here we’ve got to create this arch. All the skinny guys I see forget to do this. They don’t realize how important this is\nin changing the entire mechanics of the exercise. By creating the arch you’re essentially\ndoing this. You’re creating more of a decline bench-press. We know if we’re going to evaluate our strength\nlevels on a flat and incline, or decline bench, we’re likely going to be able to perform\nmuch better on a decline bench-press because we’re shortening the distance that bar has\nto travel. We’re doing the same thing when we create\nthe arch. So as you see Jesse do here, he’s working\non getting those shoulders back – which will come in big time here in a second – get\nthose shoulders back, get the chest up as high as you can, keep the shoulders pinned\ndown and back on the bench. Keep the ass down on the bench but get the\nlower back off. You’re creating this arch. You’re expanding the ribcage and shortening\nthe distance. You can see the pecs are much more engaged\nby doing this because they’re at a better advantage to push. We’re going to come back to that in a second,\nin relation to letting the shoulders do the work. This will carryover very well. Not just to the dumbbell variation, but to\na barbell as well. The same things apply in how you want to do\nthis. What happens as a consequence of forgetting\nto do this is the very first, huge mistake you’re making. You’ll find ways to compensate and get yourself\nto do the bench-press. This is where we see all the major problems. This is where the shoulders will start to\ndo the work because they have to. If you have a long way to travel the shoulders\nhave to keep pushing and pushing to get that weight off. As a matter of fact, Jesse, let’s show what\nthis looks like. If you’re in this position here, if the\nshoulders are going – you can evaluate and have somebody evaluate from the side. Jesse, I’m going to manhandle you here in\nthis video. JESSE: If you’re going to man-handle me,\nthe next video, I get to give you my brand-new intro that I’ve been working on for a lifetime. JEFF: Guys, I told you that you’ve created\na monster. Fine. I’m going to manhandle you, okay? JESSE: Okay. JEFF: So, let’s see. The chest is – that’s going to leave a\nred mark. The chest, when you put it up here, if you\nhave somebody evaluate you from the side you want to be able to see – let’s go to this\narm over here. You want to be able to see the chest, and\nthe chest only. Not the shoulder peeking out from the side. If the shoulder is peeking out and if leading\nfrom the chest is doing the work as a consequence of that, it’s going to take a lot of the\neffort and focus off the chest. I’ll show it to you in action. Get back and set yourself up properly. If he arched, if he had his shoulders back,\nhe gets into an arch. The other arm is up. He’s going to bench. That’s his outward position. Go back. Come up. You don’t see the shoulder. All you see here is the chest and if you look\nat it, you can see good activation of the chest here as he pushes. That’s what you want. That’s how you’re going to build a bigger\nchest. Now, if you do this the wrong way and you\nlet the arms go past because the shoulders are trying to dominate because you have too\nlong of a distance to go, look what happens. This takes all the tension off the pecs. You don’t want that. Back again and lead with the chest. Now push. Now, again, you’ll be able to feel this\nyourself. This is much more firm. This is doing the work. This is how you build the bigger chest with\nthe right tension. The second thing that comes from skinny guys\nis they have the reluctance to use heavier weights. JESSE: Right. JEFF: Even if you use a dumbbell, the tendency\nis to push – if they have a heavier weight – they want to push it- JESSE: Just get it up. JEFF: Get it up. So, then they might use a lighter weight because\neven though they’ve heard on this channel how the lighter weights will help with that\nmind-muscle connection – this is a bit of a mind-muscle connection issue. But in doing that, then they just go too light\nso they’re letting everything go with it. JESSE: Do not accelerate and get your shoulders\nin front. JEFF: Right. What you want to do is, you don’t want to\nshy away from the heavy weights. The heavy weights will allow you to stay back\nbecause you’re going to want to push back as you push up, which will allow you to do\nexactly what we’re talking about. Keep the shoulders out of it and let the chest\ninitiate. You can see Jesse doing that here. But here’s the big thing I want you to do. Skinny guys, any dumbbell bench-press, do\nwhat I’m telling you here and you’re going to make immediate differences in gains and\nin the way, you do the exercise and the results you see from it. That’s what Jesse’s been doing here. JESSE: Yeah. JEFF: One of the bigger tips I gave him is\nto start doing alternating dumbbell bench-press. JESSE: Yep. JEFF: Why? It’s not just the alternation of the reps\nthat’s helping here, but it’s the flipping of the recruitment pattern that’s helping\nthe most. If I have you start in the down position,\nas you can see Jesse doing here, I’m getting the chest loaded already. JESSE: Yeah. A lot of tension. JEFF: Opening up the chest, getting the chest\nloaded, and initiating from there is going to be a hell of a lot easier than if you were\nto start your reps at the top, come down, and then go back. You’re almost ingraining the pattern of\ngetting the dumbbell back to the starting position, allowing the shoulders to follow. Instead, get them down. Start down here. Let one come up and come down. Not only are you getting some additional tension\nin place on the opposite side in the non-working rep, but you’re getting that to be ready\nto go and perform to recruit from there first and stay as the leading driver of the movement\nwhile the shoulder stays back. Alternating reps are going to be a tremendous\nway for you to feel this, ingrain this, and get better at this. You can take that back with you to a bench-press. You can even take that back to a two-handed\nversion of a traditional dumbbell bench-press. Your ability to see gains from your pressing\nwill go up astronomically if you do that. In recap here, you can’t change your lanky\narms. You can make them relatively shorter by getting\nyour chest in the right position, by arching the low back, setting it up, and not forgetting\nto do that. Then, avoiding the compensations that come\nfrom having those two things – those anatomical differences that us skinny guys tend to have\n– and making sure we know what’s supposed to drive the movement. Not letting the other muscles take over and\ndo the thing we’re trying not to do. JESSE: Let the chest take over, not the shoulders. JEFF: There you go. This is a chest video, right? JESSE: Also, incorporate alternating dumbbell\nmovement. JEFF: Exactly. Thanks for reiterating everything I just said. JESSE: You’re welcome. JEFF: You can sit there and work on that intro\nfor a while if you want. Guys, I hope you’ve found the video helpful. If you leave your comments and thumbs up below,\nlet us know what you want us to cover and we’ll do our best to do that for you. If you haven’t already done so, click ‘subscribe’\nand turn on your notifications. And all our programs incorporate that “how”\nof what we’re doing. The ‘how’ matters, but also the ‘why’\nmatters. So, when you go back to your workouts you\nhave the freedom to bring these things into your training and benefit from them, rather\nthan saying “Hey, Jeff told me to do a bench-press. So that’s all I’m going to do.” I don’t think that’s enough. All our programs have that built into every,\nsingle workout we have. If you’re looking for those, they’re over\nat ATHLEANX.com. In the meantime, stay tuned for this idiot’s\nintro and I’ll see you in a few days. JESSE: It’s going to be glorious. JEFF: See ya."
}