{
    "id": "zJp2k5b_jk0",
    "title": "Are YOU Fitter Than Jesse? (SURPRISE!)",
    "description": "Everyone's favorite athlean every man Jesse is back at it, partaking in the revised military combat fitness test to showcase his ...",
    "transcript": "JEFF: What's up, guys? Jeff Cavaliere, ATHLEANX.com. Jesse, you ready? JESSE: Yep. JEFF: One, two, three, go! So, what are we doing here? Today, we’re testing how fit Jesse is. More importantly, you’re going to be able\nto use his scores to determine how fit you are, compared to Jesse. Now, look; I’m going to run him through\nthe revised, Army combat fitness test. I’m not saying this is the ultimate, end-all,\nbe-all test of overall fitness, but what it does is, they’ve made some important changes\nto determine how ready a soldier is for combat. So, some of the drills that are now being\ntested more accurately represent the rigors of combat to see if your body is prepared\nfor that. So, they test strength, they test stamina,\nthey test different aspects of your overall fitness conditioning. We can do that, but of course, I want to throw\nin my own two cents here. The first thing I have Jesse doing is hanging\nfrom a bar. How you feeling up there? JESSE: This sucks. JEFF: Yeah. So, what we do is, we test this right here\nbecause I want people to understand a few things. First of all, what’s your grip and forearm\nstrength? More importantly, what’s your mental toughness? If you hang on here when your forearms are\nburning, when your hands are starting to feel numb, how long can you last? Jesse’s actually been up there for a minute. Pretty good job, right? So, the average score on this test is 1 minute\nand 40 seconds. Believe it or not, a lot of guys can’t even\nhang from the bar for a minute. So, if you want to test it, it’s really\neasy. All you’ve got to do is jump up there and\nhang straight up there like that and see if you can last for 1:40. Jesse, you’re at a 1:20 right now. Now, the thing is, we’re going to test some\nother things I’ve mentioned. We’re going to test the hex bar deadlift. That’s part of the military fitness test. We’re going to test that. We’re going to test the power throw. We’re going to test release pushups – how\nmany you can do in two minutes. Leg tucks, a 2-mile run. We’re not going to show you that, but I’ll\ntell you a little bit about Jesse and his capabilities. How you doing over there, Jesse? JESSE: Uh, I’m all right. JEFF: Then we’re going to do a sprint-drag\ncarry, and we’re also going to finish with pullups because I feel like it’s a great\noverall test of your overall upper body strength and endurance. Now, 1:46. 1:47. Did you know you had already reached 1:40? JESSE: No. JEFF: Oh. So, you just jumped down. I’ve actually seen Jesse pass 2 minutes. Here’s the thing though, guys: that’s\nyour first test. One by one I want to knock these out, see\nhow you are. Again, not that Jesse is the epitome of strength\nand fitness. JESSE: I mean, I thought I was pretty good. JEFF: Yeah, right. The fact is, he is representing the ‘every\nman’, and I want you to see how well you compare to him, test by test. Let’s go. Now let’s do the first test here on the\nofficial revised Army combat test. This is the hex bar deadlift. The way they score it is, they’re going\nfor the number – you have to do three repetitions and the weight you’re using is what determines\nyour score. So, the minimum side of this is 180lbs to\nlog a score. The maximum side of this is actually 340lbs. Jesse, you’re going to show off a little\nbit. It’s actually 365 on here, that he assures\nme he can do. So, if he can get three clean reps here, he’s\ngot a maximum score. Making it look easy. There’s one. Two. Good job. Down. So obviously, guys, with the hex bar – nicely\ndone. With the hex bar the issue is that it’s\ngoing to be a little easier than a bar in front of your body because you’ve shortened\nthe moment arm on all the posterior chain muscles that are really responsible for executing\nthe deadlift. So, you’ll probably find that your scores\nwill improve with this. However, it’s a standard and he just aced\nit. Next one we’ve got to move onto now is the\npower throw. For the power throw what you’re looking\nto see is how far you can throw backward, over your head, a 10lb medicine ball. You’re trying to simulate – as we walk\nout to the middle of the max – trying to simulate your ability to assist a soldier\nup, and above your head, to a higher level. Here, we hit the minute mark right here or\nabout 9 yards. 13.5 meters right here is our maximum. So, what we’re looking for is Jesse’s\nability o throw that thing with explosively, vertically. But more importantly, horizontally to get\nthat distance. Let’s see what you’ve got. That’s a long way. Looks like you landed right about midway between\nminimum and maximum. Right about 11 yards, or so. Wait a second. Jesse said he wants another attempt. He said the ball slipped. So, I gave him a towel, so he could wipe his\nballs. JESSE: It’s important to wipe your balls. JEFF: Are you good? JESSE: Yeah, I’m good. JEFF: Think you can get it further? You’d better after all that. All right, here we go. One important key: you’re not allowed to\nleave your feet during this test. You have to stay grounded. Looks to me like your ball wiping didn’t\ndo too much more. But you still landed about here. Which is, again, putting him in between min\nand max. JESSE: Pretty average, I guess. JEFF: In a lot of ways. Next up is the sprint-drag-carry. This is actually going to be a multi-part\ntest here. The low score that you’re shooting for,\nto max out, is 1:40. Your cutoff is going to be 2:09. I’m going to have Jesse start and I’ll\nexplain exactly what he’s doing. He’s basically got to go down, and back\n50 meters a few times, doing a few different things, once again, to simulate some battle\nactivities. So here you go. I’m going to get you started. Jesse, are you getting ready? JESSE: Yeah, I’m ready. JEFF: Three, two, one, go. Now, the first part is this 50-meter sprint\nall the way down and back. The next thing is going to be the sled carry. 90lbs total weight of the sled, reverse carry,\nreverse walk, all the way back, choppy steps there. Watch out for the kids’ toys. We’re doing this in the yard. There you go. Turn it. Chop, chop, chop. The next part of this is actually a movement\ndrill. The one that they usually do is a side shuffle. Jesse, you’re going to do a side shuffle\nhere. Keep going. Bring it all the way through. All the way through, all the way through,\nall the way through. Good. Side shuffle. Go. So now, he side-shuffles all the way down. You go down and come back. Go. Now he’s going to pick up the kettle bells,\nhe’s going to walk them down. These are 40lb kettle bells in each hand. Go. Grab them. Squats down to get them. Go, Jesse. Go. You’ve got 1:10. Make up some time. Now it’s supposed to simulate carrying an\ninjured soldier. Good. Go. 1:35, Jesse. Go. Come on. Go. 1:40. 1:45. So almost getting it in extreme time. Come here, Jesse. Nicely done. JESSE: Thank you. JEFF: How do you feel? JESSE: I’m fantastic. JEFF: All right, good. Now, guys, we’ve got to go back inside. We have more to come in the tests. In addition, I still have those pullups we’re\ngoing to force him to do in the end as well. Next, we have our pushups. What we have is our hand-release pushups. The key to the hand-release pushup, Jesse\n– give them the demonstration – is when you release your hands it resets your body. So, it helps to make sure you’re not cheating. So as long as you release your hands on every\nrep, that’s what they’re looking for. The maximum here is 70 pushups in 2 minutes,\nwhich of course I’ll be taking the time, and the minimum here is 30. Let’s see how you do, Jesse. You ready? On your mark, get set, go. Two, three, four, five, six. Pacing is important here. Eight, nine. One-seventh of the way there. 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,\n23. Remember, you’ve got 2 minutes. 24 and you’re only at 37 seconds. 25, 26, 27, 28, 29, 30. JESSE: Quick break? JEFF: All right. You can do whatever you want with your 2 minutes. What do you have, 30? JESSE: Yep. JEFF: So, you’ve got the minimum. Come on, let’s go. 31, 32, 33, 34. Come on. You’re almost halfway to 70. Do you want me to pinch hit? 35, 36, 37, 38, 39. This hand release stuff makes it harder, huh? JESSE: Yeah. Way harder. JEFF: Come on, let’s go. You’ve got 30 seconds to go. You’ve got 39 down. Let’s go. 40, 41, 42. I’m glad you’re not protecting our country. That’s all I can say. JESSE: Oh, thanks. JEFF: How many have we got. No, let’s go. 15 seconds. 43, right? 44. Come on. Keep going. Keep going. 45. Not yet. And time. 45 hand release pushups in 2 minutes. Need a little work there. JESSE: Yeah. Definitely need a lot of work there. JEFF: All right, we move on now, guys. We’ve got another drill. Next up on the board is actually the leg tuck. Now we move onto the 2-minute leg tuck. How many times, hanging from a bar, can you\npull your body up and touch your knees to your elbows in a 2-minute period? Maximum here is 20. The minimum is 5. You need to redeem yourself, Jesse. Let’s go. Hold on, let me get my stopwatch going. Ready? JESSE: Yeah. JEFF: Three, two, one, go. One, two, three, four, five, six, seven, eight,\nnine. You’re flying. Come on. Pull. 10. Give yourself a break. Shake it out. Plenty of time. So, it’s a total body pulling movement here,\nguys. Involving abs as well because of the knee\ntuck. 12, 13, 14, 15. Come on. You’ve got plenty of time. Just about a minute. Five more. Max it out. Let’s go. Come on. Bang them out. Quickly. One. Up. Two. Three more. Three. Four – I’m not giving it to you. Come on. Two more. Let’s go. Pull them up. One more. Touch the knees to the elbows. Let’s go. Drive it, drive it. I didn’t see it. I didn’t see it. I didn’t see it. Okay. Good. Nice job. With time to spare. So, he maxed out 20 of the leg tucks. Now, let’s discuss, while you’re sitting\nhere out of breath – the two-mile run. I’m not going to make you watch him do a\ntwo-mile run. One thing people don’t know about Jesse\nis, he’s got inordinate abilities to be able to run. Probably from playing lacrosse, right? JESSE: Yeah. Well, I played for 14 or 15 years. JEFF: So, a two-mile run, your best time. Be honest. JESSE: Last time I tested it was 11:40. JEFF: Which is amazing. So, 11:40. He clearly was at – what’s the max here? 12:45 minimum and 18:09 is – sorry. 12:45 is the high score, 18:09 the low side. Clearly, he’s maxed that out as well. I like it. It’s important because people talk about\nbeing one-dimensional. You can’t just be strong. If you’re strong and you can’t run a mile,\nyou’ve really negated the value of that strength, in my opinion. As a matter of fact, people are out there\nwho actually have YouTube channels that wouldn’t be able to run a mile, and we know that. JESSE: That’s absurd. JEFF: Right. You know that in the same – on the other\nside of the coin too, you’re can be able to run a mile in four minutes, but if you\ncan’t lift any substantial weight, you’ve greatly minimized the benefit. At least you’d better be able to run away\nfrom somebody because if you ever get into a fight you’re going to lose. JESSE: Yeah. JEFF: So, you need to have everything. Everything is well-rounded, you need to be\nable to have all that. That’s what we’re testing here constantly\nat ATHLEANX. Again, in this test here, today, we’re in\nthe military combat fitness test. All right, guys. We have one last test here. We have the pullup. JESSE: No. No, we’re not doing pullups. It’s not part of the test. I did your little, dead arm hang to begin\nwith. If they want to be a judge of my pullups,\nI did it when we went to RAW. JEFF: That’s right. JESSE: And the Navy was out there. JEFF: All right, so we went to RAW Summer\nSlam and they had a Navy recruiter out there. Jesse, fresh out of the gate was able to go\nout there and do pullups. But they can be the judge of your pullups. JESSE: Yeah, that’s fine. JEFF: All right. I’m going to post that video here, coming\nup at the end of this video. The idea, though, is this: you did a good\njob. JESSE: Thank you. JEFF: You didn’t max out of everything,\nbut you were showing a nice, well-rounded fitness that I think we should all attain. JESSE: That’s what it’s all about, right? JEFF: Right. You don’t want to be unidimensional, and\nbasically have one element that you can thrive in, but then suffer in everything else. That’s not what ATHLEANX is all about. It’s certainly not what well-rounded fitness\nis about. Certainly not what the military is trying\nto instill in its soldiers. So, guys, if you’ve found it helpful, if\nyou want to compare yourself to Jesse, feel free. Go ahead and start trying some of these tests. In the meantime – what is that about? JESSE: Oh, are they fitter than me? JEFF: Is that what you – you think it’s\nabout biceps? JESSE: Uh, it could be. JEFF: Okay. Well, it’s not, guys. It’s about well-rounded fitness, as I’ve\njust said. If you’re looking for a well-rounded fitness\nprogram, that’s ATHLEANX. You can get them over at the ATHLEANX.com\nwebsite. In the meantime, tell me what else you want\nme to cover, anything else you want me to do to him torture-wise. We’ve put him through the tests. JESSE: It sucks. JEFF: But in the meantime, leave your comments\nand thumbs up. Make sure you subscribe and don’t forget\nto turn on your notifications. We’ll be back here again with another video\nsoon. See you."
}