{
    "id": "ZQ2anAlfY1g",
    "title": "Shoulder Mobility Balancing Act (CAREFUL!!)",
    "description": "Build muscle while keeping your shoulders healthy http://athleanx.com/x/big-muscles-safe-shoulders Shoulder mobility is an often ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today we're going to take a look inside your\nshoulder to see just how important it is that you're focusing on those things that you might\nthink are unimportant. Especially the small things when you're trying\nto focus on the bigger things and the bigger lifts in the gym. Right here, this represents your shoulder. We're breaking out a muscle marker, or at\nleast half of one, to show you that your shoulder actually looks something like this. What I'm representing here is the ball and\nthe socket. The first thing you need to realize is that\nsocket ain't so big. The ball is much bigger than it, and that\nmeans two things. Number one: lots of ability to move the ball\nof the upper arm around. So you can do lots of things. You can move your arms in all crazy planes. Much more motion than you'd have in, let's\nsay, a finger that does this, and maybe a little bit of twisting. That said, you're sacrificing the stability\nof your shoulder because of this. We only have three things that we can focus\non in order to arm ourselves the best way to have a much more stable shoulder and stay\ninjury free when we're focusing on those big lifts. So the firs thing you want to make sure that\nyou're focusing on is the labrum. That is, keeping the health of your labrum\nas a high priority. Now, dumb me was in baseball, as you guys\nknow, and I got bet by one off our players that I couldn't throw the ball from right\nfield to third base on the fly. Now, I should have known better, but it just\nlooked so damn close to me from out there that I tried. I'm not equipped to be throwing a baseball\nlike that, especially when I'm not warmed up at all, and I took my hardest throw I possibly\ncould. It certainly didn't make it all the way there\nand as soon as I did I felt the big tear right through my shoulder. I could feel a burning sensation. I tore my labrum and I've been dealing with\nit ever since. Why does that matter? Because the labrum actually deepness this\nsocket. So what it's doing is, it's job is to try\nto create some more depth and stability inside this shoulder joint. So while it was sitting on top of that little\npen cap, realizing that surface here is much smaller than the ball itself, let's just take\nthe plate out to illustrate a second point. That is, if there was no labrum there the\nball would have to do this balancing act on a very shallow surface. But with the labrum intact we're actually\ncreating more depth and we're creating much more stability here for the head to stay inside\nthe socket while it moves. So you want to do everything you can to not\ndo stupid shit like me and tear you labrum. That's something that can happen traumatically,\nor can happen over time, but the things that happen over time are generally because you\nhave bad mechanics in the other two areas I'm going to cover. The first one there is going to be your rotator\ncuff. So we talk about the rotator cuff all the\ntime and those are the muscles that wrap around and interplay with each other. There's four muscles here. Three of them are really, really important\nto interplay with this humerus to keep it centered as you move your arm up and down. So if as you were moving your arm up, over\nyour body it also wanted to move up and migrate up, you'd have problems because you'd be getting\npinching here with the supraspinatus tendon inside the shoulder joint itself, causing\ninflammation, bursitis; all these bad things that lead you to go \"Ow!\" Every time you try to lift a bar, or a dumbbell\noverhead. So it's trying to keep it centered and we\nwant to make sure to do is train those muscles. Now I've put a whole video together on specific\nexercises you can do with your rotator cuff, but here's just a couple. I'm going to link there, too. But here's a couple you want to focus on as\nwell. Mostly external rotation. When we talk about external rotation it can\nhappen in many different planes of motion. It can be with my elbow right here at my side,\nthat way. It can be more of a diagonal cross-pattern\nwhere I reach down this way, and then come up, and overhead. That's going to look more like a throwing\nathlete. But we want to make sure that we're strengthening\nthe external rotation because that does allow us to keep this humerus centered in here on\nthis very shallow, slightly deepened surface because of the labrum. The next thing you want to do is focus on\nthe third component. That is the capsular element to this. The capsule is a series of structures that\nwrap around the head of the humerus that tighten and loosen, depending on the position that\nyou move your arm in. one of the things that we find ourselves constantly,\nand chronically in is this forward, rounded position. A lot of times what's happened here is we\nget capsular tightness because of the fact that we posturally are sitting in these positions\nall the time. That could be coming from muscle imbalance\nthat could be coming from a lack of attention to the external rotators; whatever it might\nbe. If you're finding that you're rounded this\nway then you'd better probably surmise that you also have a real bad capsular tightness,\ntoo. So if you have rounded shoulders what you\nmight want to start doing is stretching out the posterior capsule of your shoulder. Now why is that? Because as you get anterior you get weakened\nanteriorly. This muscle, the head of the humerus sits\nforward and is stretching out this part of the shoulder capsule. That's not good. Then the one in the back gets tighter and\ntighter, which is even further pushing this forward this way. So we want to be able to stretch that out\nback. You can do that by doing this sleeper stretch\nhere. You lay down on the ground, put your elbow\nin the position I'm showing you here. Make sure that you're stabilizing up against\nthe ground – you're pushing against your forearm – and you're trying to go down into\ninternal rotation, which is going to push this head of the humerus backwards into that\ncapsule and stretch it out. You're actually using the bone itself to push\nback into that capsule and stretch it out. You should feel a pretty big stretch by doing\nthat. As a matter of fact, from an anterior side\nwe get chronically loose and weak because all we do is have this thing pushing forward\nand we could even aggravate that, as I've shown in the past, by doing pec stretches\nlike this that people always tend to do. We've covered that in a video as well. I can link that here, why you don’t want\nto do that. The idea is that you quickly want to realize\nthat the interplay of keeping a healthy labrum, of keeping good balance between all the muscles\nof the rotator cuff, and by keeping this attention to the posture that you're in, and what it\ncould be doing to the shoulder capsule, and the ligaments, and what the balance between\nthose are is ultimately going to say \"this shoulder feels good\", or \"this shoulder does\nnot feel good\". When you go to the big lifts like a bench\npress, like an overhead shoulder press the things that are going to help you add muscle\nin the gym; if you can't do them because every time you move your shoulder around there's\ntoo much instability, or you're just in too much pain then you're going to be in for a\nwhole hell of a lot of disappointment. And that shouldn't be the case. You focus on the little things and the big\nthings will become much easier. That's what ATHLEANX is all about. We put the science back in strength here to\nhelp you understand why these things matter and not just tell you to go do them because\nonce you have an appreciation for why it matters it makes it a lot easier for you to want to\nactually do them. We actually incorporate them into our ATHLEANX\ntraining programs in the right balance so that you know that you're doing things right. That's over at ATHLEANX.com. In the meantime, if you've found this video\nhelpful, if you always like when Raymond makes an appearance make sure you leave your comments\nand thumbs up. That's not Jessie, by the way. I know they look alike, but this is Raymond. Leave your comments and thumbs up below and\nI will make sure that I do my best to cover what you want to see in the days and weeks\nahead. All right, guys. See you soon."
}