{
    "id": "ZqwwV2GIoO0",
    "title": "How to Get a Bigger Back (LIGHT WEIGHTS!)",
    "description": "If you want to get a bigger back you have to use light weights. That's right. Heavy weights alone will not be enough to build your ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. So I want to show you today why it's not just\na good thing to use lighter weights, but why it's a very important thing to use lighter\nweights if you want to develop your best back. It all comes down to the fact that I'm going\nto guarantee that when you do your back exercises, you never, ever fully contract your back. There's a big reason for it. When you're doing your pushing exercises think\nabout what's on the other end of most every, single rep of a pushing exercise you do. You can see me doing a dip right here. When I get to the top there's a moment of\nactual relief here. I could actually hold the top position of\na dip better than I could any other position of that exercise. Same thing goes here for the bench-press. The bench-press, if we can get to the end,\nI can lock out my arms, and I could actually hold it there. The same thing happens here on the shoulder\npress. When I get to the end of that rep I can actually\nhold it there. There's a moment of relief. There's a light at the end of the tunnel. But now, when you look at an exercise like\nthe lat pulldown, or we look at a one-armed row – like I'm going to show you here also. What is at the end of that? More pain, more discomfort, more struggle\nbecause what we're trying to do is fight this contraction. I've got to pull down, and when I'm down here\nmy body wants to get out of here as fast as possible. What I'm telling you is, forgoing that is\ncosting you an opportunity to get better development in your back. So lighten the weight a little bit. Not for all of your work. It's okay to use some of the heavier sets,\nobviously, to increase the tension and the overload, but you have to include lighter\nweights. I'm going to enforce that by doing two techniques\nhere I'm going to show you. Now, when I come down I don’t just want\nto bring it to here, which a lot of guys will do. I want to get it down, all the way as far\nas I possibly could. Get the strongest contraction I possibly could\nin my back, squeezing my elbows down, and to my sides. You can see those lats activated. Well, what we can do is, the first technique\nis one and a half reps. I've used it before, especially with our shoulder\ntraining, with the side delt exercise. We come up half way, I reinforce it, and then\nI've got to do it again, and then I come up. So down, squeeze, up, and bring it right back\ndown again. And up. Down, up halfway, right back down again. Do a few sets of these – I'm using light\nweight and it feels a hell of a lot heavier because I'm just not used to A) getting that\ncontraction; and B) having to reinforce and do it again. The next technique we can use is a fiber blast,\nwhich is basically a pulse rep at the end of a contraction. So what it looks like again now is, we don’t\ncome back halfway. What we do is, we go down to the back, here,\nand then we go in with pulse contraction. Down, down, and down again. And I'm hoping to – if I haven't got there\nin the first one – here, one, two, three. It gives me the opportunity to reinforce,\nand get a better contraction with the pulse at the end. One, two, three, and up. Remember, I said I could do it here on a one-armed\nrow, too. Same thing applies. You do a one-armed row and your body is doing\neverything it can to keep this dumbbell back down on the ground because the end position\nof the rep is difficult. There is no relief. There is no break at the end of every rep. So what you want to do is lighten the weight,\nget up there, really focus on getting your elbow back behind your body, get a good, strong\ncontraction. And we can use the same thing. Squeeze, squeeze, squeeze if you're using\nthe fiber blast, or up, down halfway, and back up again. Up, halfway, and drive it up again. So remember, it's not just about always using\nheavy weights. I'm a big believer in using heavy weights\nto create the overload and tension necessary, but you have to use lighter weights if you\nwant maximum development. This is exactly the reason why, especially,\nwhen it comes to back training because of the nature of how the exercises stack up,\nand what happens with our bodies against gravity when we finish every exercise. Guys, if you're looking for a program that\nputs the science back in strength, allows you to train with these types of tips so you\nget more out of every workout you do; head to ATHLEANX.com right now and get our ATHLEANX\ntraining program. In the meantime, if you've found the video\nhelpful leave your comments and thumbs up below. Let me know what you want me to cover in a\nfuture video and I'll do my best to do that. All right, guys. See you soon."
}