{
    "id": "ZyNoQxdsLhw",
    "title": "Intense 3 Minute Shoulder Workout!",
    "description": "A shoulder workout does not have to be long in order to be effective. Here, I'm going to show you a 3 minute shoulder workout that ...",
    "transcript": "What's up, guys? Jeff Cavaliere, ATHLEANX.com. Today I’m going to light up your shoulders\nlike a Christmas tree. We’re going to use just a couple of dumbbells\nto do it. Probably, here’s the irony: some exercises\nthat you’ve done many, many times before but not in this way. Look, you’ve probably done a lot of front\nshoulder raises, side shoulder raises, and rear delt raises in your life. The idea was that you were going to hit your\nfront delts, your middle delts, and your rear delts. But have you ever thought about changing the\nposition of your body? Because if you did, you’d work a hell of\na lot more than just your delts in isolation, and you’d change the entire impact those\nexercises have on your delts in the process. Why is that? Well, I’m down on the ground for a reason,\nguys. We call this the kneeling lateral series. All you have to do is alternate these movements\nfor three minutes straight and see if you can last. My bet is, you may not. It’s because the muscles around these bigger\nmuscles – the delts – are actually probably pretty weak and not used to working alongside\nthose muscles. We need to make sure they are. When we get down in this position here, this\nis a closed chain position. Meaning, we have some biofeedback. We have our arm in contact with the ground. Closed chain, meaning just like our feet couple\nbe on the ground in a closed chain exercise of a squat. But what’s interesting about this is, this\nis where we evolved from. We used to get around on four limbs with our\narms in contact with the ground. So, the muscles of our scapula have always\nbeen wired to work better with our delts as we move our arms around when they’re in\ncontact with the ground. So how does it play out in real life? Well, if we get down in this position and\nstart with this first exercises, it’s a front shoulder raise – a little bit of a\nwide raise because we’re not going straight out in front, but a little bit of an angle. Why is it so interesting? Well, take a look. If I’m in this position here and I raise\nmy arm up in front of me, at the top here I have gravity acting fully down on my arm\n– on a lever arm – making my front shoulder and front delt work a lot. I haven’t sacrificed that. What have I done? Relative motion. If I have my arm up here like this, now if\nI sit up where’s the position of the arm? It’s higher than it was, just because I\nhad that lean forward. Well, if it’s higher we have elevation. The thing that instantly likes to kick in\nare the lower traps, to assist in that. That’s what they’re meant to do. They’re meant to assist in stabilizing the\nshoulder as it gets up in front of your body, and elevated. So, we get that extra benefit by doing it\ndown here on the ground that we don’t get by just raising them out to here. Next movement, you can see me here doing the\nside lateral raises. Alternating right and left. We’ll get into how you do the exact series\nhere in a second. What’s the benefit doing it kneeling? Once again, we’re in this closed chain position\nhere. When I lift one arm up I have all my weight\ngoing through one arm, which is a better position for stability through this arm and the shoulder\njoint. But now when I raise up to the side, once\nagain I haven’t compromised the effect that this has on the middle delt. What have I done? I’ve incorporated the rhomboids. You can see them firing up here. You can see all the muscles on the back firing\nup. Again, the way they’re meant to. All these muscles attach to the shoulder blade. You can’t move your arm without moving your\nshoulder blade. Your shoulder blade has a lot of different\nmuscles attaching to it that are influencing its movement. So, if we can incorporate more of them together\nto do the job together, we’ve got a better exercise. All we had to do was alter the position of\nour body when we performed that exercise. Next, we move onto the rear delt raise. Now here, you guys know that we normally do\nthis bent over. So, there’s really not anything beneficial\nbeing added here, other than the fact that you don’t need to transition. There’s no transition time. You don’t have to rest. You can go right into the exercise. Of course, I’m doing it the way I always\nshow you how to do it, and that is to get the arm into extension behind the body and\nget external rotation. Finally, we throw an additional exercise in\nhere because we know how important the rotator cuff is in activation into external rotation. We do that just by doing the W raise. Which is where we’re trying to actively\nthrow the dumbbell back behind us, form a “W” here with our arm, which will instantly\nactivate those muscles really, really well. So now here’s the sequence. What you want to do is see if you can go from\nalternating front shoulder raises done down here, kneeling on the ground, to alternating\nside lateral raises, to the alternating rear delt raises, and then finally to the alternating\nW raise. Then you go back and repeat it and go through\nthe entire circuit. And you go back and repeat it. Try to let a running clock of three minutes\ngo by and see if you can complete the entire sequence, however many times you do, in three\nminutes. Now, it’s brutal, and there’s a reason\nfor it. Because your muscles are not used to firing\nin this way. But they should be. Guys, you have to allow your bodies to work\nthe way they’re supposed to or you’re leaving gains on the table. I promise you. Once you start to get more stability here\nyou’re going to improve performance in other exercises. Look, I love the overhead shoulder press. In order to perform an overhead shoulder press\nyou need upward scapular rotation. You do. However, that exercise does not train upward\nshoulder rotation. What do I mean by that? It means you can perform upward rotation but\nget it in a lot of unhealthy ways. You can compromise the hell out of your shoulder\nto get upward rotation, but are you getting co-stabilization and activation of the lower\ntraps in order to do that? If you’re not, you’re in trouble. When you do exercises like this, they help\nyou build that necessary strength, so you perform better when you go back to that raise,\nand go back to any of the other exercises you perform. Guys, try this out. I know it’s going to be helpful for you. If you’ve found this video helpful leave\nyour comments and thumbs up below. If you haven’t already, guys, subscribe\nto the channel and turn on those notifications. Finally, if you’re looking for a program,\nstep by step that puts the science back in strength, that cares about all these little\nthings because they matter – it doesn’t always require the heaviest weights in the\nworld. Just doing these things is what counts the\nmost. We have them all step by step in our ATHLEANX\nprogram over at ATHLEANX.com. All right, guys. I’ll be back here again in just a few days\nwith another video. See you."
}