{
    "id": "zzD80vCLq0Y",
    "title": "Best Home Ab Workout | 10 Minutes (GUARANTEED!)",
    "description": "This is the best home ab workout you will find if you are looking for one you can do without any equipment and whether you are a ...",
    "transcript": "What's up guys, Jeff Cavaliere, Athleanx.com. \nToday, I have a 10-minute hold at work out for   you based off of a recent appearance I made \non Kelly and Ryan, where I was asked to name   the worst ab exercises. Well, you see guys, \nthe problem with these exercises is that they   actually overwork your hip flexors. So, they're \ngiving you abs, they also give you back pain, too.   I'm not going to do that to you. I'm going to \ngive you a step by step follow along workout   that you can do. And I mean, everyone can do this \nbecause all you need is a mat and a hardwood floor   and some space in your apartment or your home, \nand you won't be able to get this done. Remember,   beginners, you can do this. You go for \nas long as you can. Each of the exercises   scripted for one minute, you go for as long as \nyou can. The entire set rest period. I'm going   to explain with the next exercise is and how to \ndo it. You ready? Let's knock this one out. \n  The first five exercises are starting down \nhere on the mat. And the goal, again, is to   get those hip flexors out of it and make your \nabs do more of the work. And we start here for   something called the Halo. And unlike that Lying \nLeg Raise where you actually use too much of your   legs to just simply lift your legs up and down, \nwe don't care about the legs as much as we care   about the pelvis. Your goal is to simply get your \npelvis up off the mat, every single repetition.   Now, your feet, they actually do the work. They're \ncreating clockwise circles for 30 seconds at the   top and then counterclockwise circles for \nthe other 30 seconds of this minute. \n  Good job on that one, guys, the next one here \nis a variation of a standard sit up. Instead of   anchoring your feet under something which only \npromotes the hip flexors to do the work to pull   your body off the ground, we can do this \nis called a Frog Crunch. You put your feet   together and you press them together as \nhard as you can. You should instantly   feel your hamstrings light up. With your \nhamstrings activated your hip flexors are   going to take a little bit of a nap here \nand make your abs do all the work.\n  Next, I'm going to shift the focus a little bit \nnow to the obliques. And to do that, we know   we have to rotate, not just tap your hands back \nand forth, like in a traditional Russian Twist,   I mean, rotate. So, to take those hip lectures \nout of this, guys, remember, keep your heels   down. There's no need to have to lift them up \non this. Instead, focus on what really matters,   and that is creating that rotation. And that's \ngoing to come through pulling your elbow back,   actually rowing it back to each side when \nyou twist it to each side. You'll feel   the difference immediately and when you do, \nyou'll know you're doing it the right way.\n  Keeping the focus here on the obliques, we don't \never have to do another dumbbell side bend. As a   matter of fact, as I said, you don't need to \nuse any equipment to get a good ab workout   as you're finding out. This one is called the Side \nPlank Thread the Needle. That's what we're doing,   is mimicking that side bend without having to \nactually ever do that, because we build the   lateral pillar strength from the bottom up. Lift \nup, keep your arm up into the air. But then we   add that third dimension by reaching through and \ncreating some rotation that our body in core has   to control before 30 seconds on each side. You're \nmore than halfway home through this workout.\n  If you see my ab workouts you probably know I'm \nnot a big fan of the plank. Only because I think   it's a little bit too remedial and again, it tends \nto work the hip flexors more than it does the   posterior chain or the muscles on the back side of \nour body. But we can kill two birds with one stone   here and this is what the Black Widow Knee Slide. \nYou simply drive one knee towards the elbow,   pull up into a posterior tilt to really activate \nthe abs. And then don't forget that posterior   chain, you kick that leg back and extend the \nhip all the way up to the ceiling, come back   down and alternate. Continue to perform this \nfor one minute or as long as you can hang in.\n  Now it's time to kick that mat out to the side and \nput those socks on the hardwood floor or anything   that your feet will slide on. Guys, this is how \nwe can work the bottom-up ab movements without   having to lift the weight of our legs, like \nin a hanging leg raise. To do this. instead of   pulling your knees straight in, which is going \nto promote more of that hip flexor dominance,   you bring them out to the side. We call this the \nFrog Circle. You can see the position of the legs   looks a bit like a frog, but what it's really \ndoing is activating hip external rotators instead   of hip flexors and still allowing you to pull from \nthe bottom up to really work those lower abs. \n  You're almost there, guys, one \nleft. This is the Sliding Ab   Tuck. Once again using that slick \nfloor, do not bend your knees here,   guys. All you're doing is lifting your pelvis \nas high as you possibly can towards the ceiling   by simply hinging at the waist. If you do this \nright, you'll feel your abs driving the movement.   And the only thing that can potentially cause \nyour knees to bend even a little bit is just   the flexibility of your hamstrings. Don't \nworry. We'll get to that in another video.   The key is finish strong, keep those legs \nstraight, make your abs do the work. \n  So   there you have it guys, your ab workout \nthat's quickly going to become one of   your favorites because at the same time \nis going to help you to get those abs,   it's not going to ruin your back in the process. \nGuys, if you're looking for programs where we   break everything down step by step, including a \nmeal plan, that will help those ads of yours to   show you can find them over at Athleanx.com. \nIf you found the video helpful make sure you   leave your comments and thumbs up. Share \nit with someone else you want to challenge   to do the same workouts and also make sure you \nclick Subscribe to turn on your notifications,   so you never miss a new video when we put one \nout. All right guys, see you soon. Good luck."
}